[{"word": "abstract", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to ideas and not real things", "level": "B2", "dict_examp": "abstract ideas", "lear_examp": "Reading improves your ability to imagine and your abstract thinking skills."}, {"sense": "Abstract art involves shapes and colors and not images of real things or people.", "level": "B2", "dict_examp": "abstract paintings/sculpture", "lear_examp": "What kind of material will you use for this painting? Will it be a realistic picture or an abstract one?"}]}]}, {"word": "aboard", "poses": [{"pos": "adverb", "senses": [{"sense": "on or onto a plane, ship, bus, or train", "level": "C1", "dict_examp": "Once everyone was aboard the plane, the doors were closed and the crew prepared for takeoff.", "lear_examp": "While the food aboard your aircraft was regarded as excellent in 2004, its quality has dropped significantly this year."}]}]}, {"word": "absorb", "poses": [{"pos": "verb", "senses": [{"sense": "to take something in, especially gradually", "level": "B2", "dict_examp": "Plants absorb carbon dioxide.", "lear_examp": "Everything is getting intermingled and absorbed into the system, making life terribly efficient, quick and easy."}, {"sense": "to give all your attention to something that you are doing", "level": "B2", "dict_examp": "Simon was so absorbed in his computer game that he didn't notice me come in.", "lear_examp": "We hadn't noticed them at first because we were absorbed in listening to the birds singing."}, {"sense": "to understand and remember facts that you read or hear", "level": "C1", "dict_examp": "It's hard to absorb so much information.", "lear_examp": "You will have only three school subjects and that'll make it easier to absorb the new knowledge."}]}]}, {"word": "abroad", "poses": [{"pos": "adverb", "senses": [{"sense": "in or to a foreign country", "level": "B1", "dict_examp": "He's gone abroad on business.", "lear_examp": "I have never been abroad."}]}]}, {"word": "abrupt", "poses": [{"pos": "adjective", "senses": [{"sense": "sudden and not expected", "level": "C2", "dict_examp": "Our conversation came to an abrupt end/halt.", "lear_examp": "Their income came from the revenues obtained by selling milk, fruit, jelly and other perishable goods, but they had to pay John, or their happy lifestyle would come to an abrupt end."}, {"sense": "dealing with people in a quick, direct way that is unfriendly or rude", "level": "C2", "dict_examp": "She can be rather abrupt.", "lear_examp": "I was poorly received and the general tone of the person assisting me was rude and abrupt."}]}]}, {"word": "above", "poses": [{"pos": "adverb", "senses": [{"sense": "in or to a higher position than something else", "level": "A1", "dict_examp": "There's a mirror above the sink.", "lear_examp": "I think I have put  it above the bookshelf."}, {"sense": "more than an amount or level", "level": "A2", "dict_examp": "It says on the box it's for children age three and above.", "lear_examp": "The weather is too hot in Beijing. Every day it is above 30 degrees."}, {"sense": "most importantly", "level": "B1", "dict_examp": "Above all, I'd like to thank my family.", "lear_examp": "She is a very nice person and above all, she is really cheerful."}, {"sense": "too good or important for something", "level": "C2", "dict_examp": "No one is above suspicion in this matter.", "lear_examp": ""}]}, {"pos": "adverb", "senses": [{"sense": "higher on the page", "level": "B1", "dict_examp": "the above diagram", "lear_examp": "I can be contacted at the above address and I would be free to attend an interview at any time from Monday to Saturday."}]}]}, {"word": "absolute", "poses": [{"pos": "adjective", "senses": [{"sense": "complete and definite", "level": "B2", "dict_examp": "absolute power/control", "lear_examp": "I have no experience in surfing - I am an absolute beginner with high motivation."}]}]}, {"word": "ability", "poses": [{"pos": "noun", "senses": [{"sense": "the physical or mental skill or qualities that you need to do something", "level": "B1", "dict_examp": "She had the ability to explain things clearly.", "lear_examp": "The protagonist had been bitten by a strange spider and some days later, he noticed he had some strange powers, such as the ability to create spiders' webs."}]}]}, {"word": "absurd", "poses": [{"pos": "adjective", "senses": [{"sense": "very silly", "level": "B2", "dict_examp": "What an absurd explanation!", "lear_examp": "It is not a big city and I think it's absurd that people that live and work in it use the car to go to school or to work."}]}]}, {"word": "abnormal", "poses": [{"pos": "adjective", "senses": [{"sense": "different from what is normal or usual, in a way which is strange or dangerous", "level": "C1", "dict_examp": "abnormal behavior/conditions", "lear_examp": "You are all obliged to inform other workers about the danger if you should notice anything that is abnormal."}]}]}, {"word": "abortion", "poses": [{"pos": "noun", "senses": [{"sense": "a medical method to end a pregnancy", "level": "C1", "dict_examp": "to have an abortion", "lear_examp": "Some of these problems are serious and should be eliminated, such as abortion and domestic violence."}]}]}, {"word": "abruptly", "poses": [{"pos": "adverb", "senses": [{"sense": "suddenly and quickly", "level": "C2", "dict_examp": "They abruptly left the party.", "lear_examp": "When she became an adolescent, her perspective changed abruptly."}]}]}, {"word": "abandoned", "poses": [{"pos": "adjective", "senses": [{"sense": "left empty or not working", "level": "B2", "dict_examp": "an abandoned house/building/mine", "lear_examp": "Arriving at an altitude of 2000m, people can visit the abandoned salt-mines."}, {"sense": "having been left somewhere, intentionally", "level": "B2", "dict_examp": "An abandoned baby was left at the hospital.", "lear_examp": "Please, just have a look at your wife Margaret and her eyes will tell you that she is this abandoned princess of your childhood fairy-tale."}]}]}, {"word": "able", "poses": [{"pos": "adjective", "senses": [{"sense": "to have the ability to do something or the possibility of doing something", "level": "A2", "dict_examp": "He'll be able to help you.", "lear_examp": "I will be able to go to your house next Friday."}, {"sense": "smart or good at doing something", "level": "C2", "dict_examp": "She's a very able student.", "lear_examp": "They contend that this will lead to better grades, better results in key stage tests, and a more able work force."}]}]}, {"word": "absence", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is not where they are usually expected to be", "level": "B2", "dict_examp": "A new manager was appointed during/in her absence.", "lear_examp": "Anyway, during your absence, the T.V. repair man never appeared and I had to insist by phone on your behalf."}, {"sense": "when something does not exist", "level": "B2", "dict_examp": "He drew attention to the absence of concrete evidence against the defendant.", "lear_examp": "The biggest difference the absence of TV made in my life was that I actually started living."}]}]}, {"word": "about", "poses": [{"pos": "preposition", "senses": [{"sense": "relating to a particular subject or person", "level": "A1", "dict_examp": "What's she talking about?", "lear_examp": "I like my IT course because I want to learn about computers."}, {"sense": "used when suggesting or offering something to someone", "level": "A2", "dict_examp": "How about a trip to the zoo this afternoon?", "lear_examp": "What about going on Saturday?"}, {"sense": "used to ask for someone's opinion on a particular subject", "level": "B1", "dict_examp": "What  about Ava - is she nice?", "lear_examp": "I also enjoy shopping for shoes, what about you?"}]}, {"pos": "adverb", "senses": [{"sense": "a little more or less than the stated number or amount", "level": "A1", "dict_examp": "It happened about two months ago.", "lear_examp": "It's not far from  my home, about 20 minutes' walk, or 5 minutes by bus."}]}, {"pos": "adjective", "senses": [{"sense": "to be going to do something very soon", "level": "B2", "dict_examp": "I was about to leave when Mark arrived.", "lear_examp": "I'm in a hurry, my class is about to begin."}]}]}, {"word": "abandon", "poses": [{"pos": "verb", "senses": [{"sense": "to leave someone or something somewhere, sometimes not returning to get them", "level": "B2", "dict_examp": "They were forced to abandon the car.", "lear_examp": "All at once, they abandoned their sacks of stolen property and ran for their lives!"}, {"sense": "to stop doing something before it is finished, or to stop following a plan, idea, etc.", "level": "C1", "dict_examp": "The weather was so bad, we abandoned our plans for a picnic.", "lear_examp": "How would you feel if you established a long-time plan for your career and then you had to abandon it?"}]}]}, {"word": "a", "poses": [{"pos": "determiner", "senses": [{"sense": "used before a noun to refer to a single thing or person but not a particular thing or person or not one that you have referred to before", "level": "A1", "dict_examp": "She's got a boyfriend.", "lear_examp": "You can make a quick snack, for example a sandwich."}, {"sense": "used to mean any or every thing or person of the type you are referring to", "level": "A1", "dict_examp": "Can you ride a bike?", "lear_examp": "I don't need it because I'm too old to have a doll."}, {"sense": "one", "level": "A1", "dict_examp": "a hundred dollars", "lear_examp": "Dear Ally, All my friends from school were here, more than a hundred people."}, {"sense": "used to state what type of thing or person something or someone is", "level": "A1", "dict_examp": "Sally's an engineer.", "lear_examp": "She's a teacher."}, {"sense": "used before some phrases saying how much of something there is", "level": "A2", "dict_examp": "a few days", "lear_examp": "Usually people in Poland are very busy so we do not have a lot of time for cooking."}, {"sense": "used before some action nouns when referring to one example of the action", "level": "A2", "dict_examp": "Take a look at this, Jez.", "lear_examp": "I took a shower and ate my breakfast."}, {"sense": "used before the first but not the second of two nouns that are often used together", "level": "A2", "dict_examp": "a cup and saucer", "lear_examp": "I like a clean fork and knife."}, {"sense": "used when referring to a unit of something, especially something you eat or drink", "level": "A2", "dict_examp": "I'd love a coffee.", "lear_examp": "We both had a coke and a hot dog."}, {"sense": "used between a fraction and a unit of measurement", "level": "A2", "dict_examp": "half a mile", "lear_examp": "The lesson is half an hour but you have to be there 10 minutes before."}, {"sense": "used when referring to a certain period of time", "level": "A2", "dict_examp": "Take one tablet three times a day.", "lear_examp": "I can write to him or her twice a week."}]}]}, {"word": "abuse", "poses": [{"pos": "noun", "senses": [{"sense": "bad or cruel treatment of people or animals", "level": "B2", "dict_examp": "sexual/psychological/mental abuse", "lear_examp": "The one side opposes this treatment as an abuse of living creatures while the other side denies any suffering and points at the values of zoos for people."}, {"sense": "the  use of a substance in an unsuitable and harmful way or for the wrong purpose", "level": "B2", "dict_examp": "Drug and alcohol abuse  contributed to his early death.", "lear_examp": "Get information about the effects of drug abuse and make your generation a better one."}, {"sense": "an action or activity that is morally wrong or not allowed", "level": "C1", "dict_examp": "The mayor was suspected of corruption and other abuses.", "lear_examp": "It is a vast resource of information, but the abuse of it may have detrimental consequences."}, {"sense": "rude and offensive words said to another person", "level": "C2", "dict_examp": "He found it difficult to tolerate the verbal abuse.", "lear_examp": "I went all the way back cycling on the wrong side of the road, and anyone who said something about it could expect a stream of abuse."}]}]}, {"word": "abolish", "poses": [{"pos": "verb", "senses": [{"sense": "to officially end something, especially a law or system", "level": "B2", "dict_examp": "I think bullfighting should be abolished.", "lear_examp": "Therefore, I suggest you should not change or abolish any event for any reason."}]}]}, {"word": "absolutely", "poses": [{"pos": "adverb", "senses": [{"sense": "completely", "level": "B1", "dict_examp": "The food was absolutely delicious.", "lear_examp": "I've heard the film is absolutely fantastic."}, {"sense": "used to strongly agree with someone", "level": "B2", "dict_examp": "\"Do you think it helped his career?\" \"Absolutely.\"", "lear_examp": "So don't you think it was unfair and little rude to say that in your newspaper? Absolutely."}, {"sense": "used to strongly disagree with someone or to agree with something negative", "level": "C2", "dict_examp": "\"Are you suggesting that we should just ignore the problem?\" \"No, absolutely not.\"", "lear_examp": "Does it mean the parents will allow them to eat anything they please? Absolutely not. You have to give the children some options, instead of imposing things on them."}]}]}, {"word": "absent", "poses": [{"pos": "adjective", "senses": [{"sense": "not in the place where you are expected to be, especially at school or work", "level": "B1", "dict_examp": "John has been absent from school/work for three days now.", "lear_examp": "I'm going to be absent because my grandmother is ill and I have to take care of her."}]}]}, {"word": "acceptance", "poses": [{"pos": "noun", "senses": [{"sense": "when you accept something", "level": "C1", "dict_examp": "His acceptance of the award was controversial.", "lear_examp": "The main reason for the \"fast-food\" groceries winning acceptance in Swedish culture is lack of time."}]}]}, {"word": "academic", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to schools, colleges, and universities, or to subjects that involve thinking and studying and not technical or practical skills", "level": "B2", "dict_examp": "academic subjects/programs/institutions", "lear_examp": "As a member of our academic community,  I'm very glad to hear that our college will have a surplus in its annual budget."}]}]}, {"word": "accent", "poses": [{"pos": "noun", "senses": [{"sense": "the way in which people in a particular area, country or social group pronounce words", "level": "B1", "dict_examp": "a Boston/Southern accent", "lear_examp": "Our teacher is a middle-aged lady with a kind smile and a British accent."}, {"sense": "a mark written or printed over a letter to show you how to pronounce it", "level": "B2", "dict_examp": "There's an acute accent on the \"e\" of \"café.\"", "lear_examp": ""}]}]}, {"word": "accompany", "poses": [{"pos": "verb", "senses": [{"sense": "to go somewhere with someone", "level": "B1", "dict_examp": "We accompanied her back to her hotel.", "lear_examp": "I asked my cousin to accompany me because she knew the way to the temple."}, {"sense": "to happen  or exist at the same time as something else", "level": "B1", "dict_examp": "The course books are accompanied by four CDs.", "lear_examp": "The weather was very hot and a shining sun accompanied us during our trip."}, {"sense": "to play music to support someone else who is playing or singing", "level": "C2", "dict_examp": "He accompanied me on the piano.", "lear_examp": "Last year, for instance, the concert became a recital: two singers performed Lieder by Schubert accompanied by the piano and by the sweet sound of Arimany's golden flute."}]}]}, {"word": "accountant", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to keep or examine the financial records of a person or organization", "level": "B1", "dict_examp": "a tax accountant", "lear_examp": "I am working as an accountant at Deloitte & Touche."}]}]}, {"word": "accept", "poses": [{"pos": "verb", "senses": [{"sense": "to agree to take something that is offered to you", "level": "B1", "dict_examp": "to accept an apology/invitation/offer", "lear_examp": "I hope that you accept my apology."}, {"sense": "to admit that something is true, often something unpleasant", "level": "B2", "dict_examp": "He refuses to accept that he's made a mistake.", "lear_examp": "David told her that the reason for his failure was her, because she used to press him  a lot and she couldn't accept that he wanted to be an actor."}, {"sense": "to allow someone to join an organization or become part of a group", "level": "B2", "dict_examp": "She was accepted to two of the universities she applied to.", "lear_examp": "When I returned home I checked my mail and I had a new message from my uncle, saying that the university have accepted me."}, {"sense": "to admit that you caused something bad that happened", "level": "B2", "dict_examp": "I accept full responsibility for the failure of the plan.", "lear_examp": ""}]}]}, {"word": "accomplish", "poses": [{"pos": "verb", "senses": [{"sense": "to succeed in doing or finishing something", "level": "C1", "dict_examp": "I feel like I didn't accomplish anything today.", "lear_examp": "To accomplish this, schools should try to respect the individuality of each child, give them chances to think more freely."}]}]}, {"word": "accidental", "poses": [{"pos": "adjective", "senses": [{"sense": "happening by chance", "level": "B2", "dict_examp": "accidental damage", "lear_examp": ""}]}]}, {"word": "abusive", "poses": [{"pos": "adjective", "senses": [{"sense": "saying rude and offensive words to someone", "level": "C2", "dict_examp": "an abusive phone call", "lear_examp": "This is partly true, because even a slightly abusive expression might result in discord or rupture between seemingly close friends."}]}]}, {"word": "accident", "poses": [{"pos": "noun", "senses": [{"sense": "something bad which happens that is not expected or intended, and which causes injury or damage", "level": "A2", "dict_examp": "Josh had an accident and spilled water all over the floor.", "lear_examp": "I had an accident two weeks ago and now I can't do sport."}, {"sense": "without being intended", "level": "B1", "dict_examp": "I deleted the file by accident.", "lear_examp": "I was dancing and someone kicked me by accident and my glasses fell off."}]}]}, {"word": "accordance", "poses": [{"pos": "noun", "senses": [{"sense": "in the way described by a rule, law, or wish", "level": "C1", "dict_examp": "Both companies have insisted that they were acting in accordance with the law.", "lear_examp": "Although they do not earn much money in this profession, they try to do their best and judge in accordance with the law which they also have to interpret."}]}]}, {"word": "accommodations", "poses": [{"pos": "noun", "senses": [{"sense": "a place to stay such as a hotel room", "level": "B2", "dict_examp": "Tour operators are advertising accommodations as low as $79 per night in first-class hotels.", "lear_examp": "Concerning the accommodations, I prefer a cabin rather than to sleep in a tent."}]}]}, {"word": "accord", "poses": [{"pos": "noun", "senses": [{"sense": "If you do something of your own accord, you choose to do it and no one else forces you.", "level": "C2", "dict_examp": "She left of her own accord.", "lear_examp": "She would go alone, but it was something that was chosen of her own accord."}]}]}, {"word": "accelerate", "poses": [{"pos": "verb", "senses": [{"sense": "to start to happen more quickly, or to make something start to happen more quickly", "level": "C1", "dict_examp": "Inflation is likely to accelerate this year.", "lear_examp": "Fashion has always been changing but I think this process accelerated after the Second World War."}, {"sense": "to move or cause yourself or a vehicle to move faster", "level": "C2", "dict_examp": "The car in front accelerated and left us behind.", "lear_examp": "When I ride my bike and start accelerating, I feel that I move with the speed of the wind."}]}]}, {"word": "accumulate", "poses": [{"pos": "verb", "senses": [{"sense": "to increase in amount over a period of time, or to make something increase over a period of time", "level": "C1", "dict_examp": "The chemicals accumulate in your body.", "lear_examp": "There's nothing you can do with the waste, and that piled-up litter begins to unpleasantly smell as it accumulates in enormous quantities, but what's worse it can be really dangerous as the weather is really hot."}]}]}, {"word": "accurate", "poses": [{"pos": "adjective", "senses": [{"sense": "correct, exact and without any mistakes", "level": "B2", "dict_examp": "accurate information/measurements", "lear_examp": "Some information in the Guidebook was not very accurate."}]}]}, {"word": "according to", "poses": [{"pos": "preposition", "senses": [{"sense": "as said by someone or shown by something", "level": "B1", "dict_examp": "According to Sarah, they're not getting along lately.", "lear_examp": "According to the guide, it was a famous culture in ancient times."}, {"sense": "in a way that agrees with", "level": "B2", "dict_examp": "Students are all put in different groups according to their ability.", "lear_examp": "The job included organizing suitable activities according to their age, capability and wishes."}]}]}, {"word": "access", "poses": [{"pos": "noun", "senses": [{"sense": "the right or opportunity to use or look at something", "level": "B1", "dict_examp": "Internet access", "lear_examp": "I would suggest free Internet access as an extra facility in our library."}, {"sense": "the way in which you can enter a place or get to a place", "level": "B1", "dict_examp": "disabled access", "lear_examp": "It will be tempting for the companies in town to move out where there is more space for expansion and easier access by trucks and cars."}]}, {"pos": "verb", "senses": [{"sense": "to find or see information, especially using a computer", "level": "B2", "dict_examp": "You can access the files over the Internet.", "lear_examp": "We have more time to stay together at home,  because we can access the internet at home."}]}]}, {"word": "accepted", "poses": [{"pos": "adjective", "senses": [{"sense": "agreed with or approved of by most people", "level": "C1", "dict_examp": "an accepted spelling", "lear_examp": "Competition can also be an accepted form of expression of one's aggression."}]}]}, {"word": "accessible", "poses": [{"pos": "adjective", "senses": [{"sense": "able to be reached or easily gotten", "level": "B2", "dict_examp": "The island resort is accessible by plane or ferry.", "lear_examp": "The museum is near the city center and is accessible by bus or walking."}, {"sense": "easy to understand", "level": "C2", "dict_examp": "They are attempting to make opera accessible to a wider audience.", "lear_examp": "Jacques Prevert, the French poet, changed our way of seeing the world by making poetry accessible to everyone."}]}]}, {"word": "accidentally", "poses": [{"pos": "adverb", "senses": [{"sense": "by chance or by mistake", "level": "B1", "dict_examp": "She accidentally knocked over a glass of water.", "lear_examp": "I accidentally broke one of your vases - the most beautiful one."}]}]}, {"word": "acclaimed", "poses": [{"pos": "adjective", "senses": [{"sense": "praised by a lot of people", "level": "C1", "dict_examp": "the acclaimed singer and songwriter", "lear_examp": "In order to avoid such an embarrassing inconsistency in the next meeting, I suggest inviting Colin Briggs, the acclaimed footballer, to talk to his fans."}]}]}, {"word": "abuse", "poses": [{"pos": "noun", "senses": [{"sense": "bad or cruel treatment of people or animals", "level": "B2", "dict_examp": "sexual/psychological/mental abuse", "lear_examp": "The one side opposes this treatment as an abuse of living creatures while the other side denies any suffering and points at the values of zoos for people."}, {"sense": "the  use of a substance in an unsuitable and harmful way or for the wrong purpose", "level": "B2", "dict_examp": "Drug and alcohol abuse  contributed to his early death.", "lear_examp": "Get information about the effects of drug abuse and make your generation a better one."}, {"sense": "an action or activity that is morally wrong or not allowed", "level": "C1", "dict_examp": "The mayor was suspected of corruption and other abuses.", "lear_examp": "It is a vast resource of information, but the abuse of it may have detrimental consequences."}, {"sense": "rude and offensive words said to another person", "level": "C2", "dict_examp": "He found it difficult to tolerate the verbal abuse.", "lear_examp": "I went all the way back cycling on the wrong side of the road, and anyone who said something about it could expect a stream of abuse."}]}]}, {"word": "accessory", "poses": [{"pos": "noun", "senses": [{"sense": "something extra that is not necessary but is attractive or useful", "level": "C1", "dict_examp": "home/desk accessories", "lear_examp": "They find pleasure in looking at different clothes, shoes, accessories, gadgets and home furnishings."}]}]}, {"word": "account", "poses": [{"pos": "noun", "senses": [{"sense": "an arrangement with a bank to keep your money there and to allow you to take it out when you need to", "level": "B1", "dict_examp": "a checking/savings account", "lear_examp": "The man, whose name I can't remember, wrote a serious looking message in which he talked about a money transfer to a Swiss bank account."}, {"sense": "a written or spoken description of something that has happened", "level": "B2", "dict_examp": "She gave a thrilling account  of her life in the jungle.", "lear_examp": "I would be very interested in participating and writing the accounts of our journeys."}, {"sense": "to consider something when judging a situation", "level": "B2", "dict_examp": "A good architect takes account of the building's surroundings.", "lear_examp": "I hope you will take account of our request."}, {"sense": "to consider something when judging a situation", "level": "B2", "dict_examp": "I think you have to take into account the fact that he's a good deal younger than the rest of us.", "lear_examp": "Taking into account all these arguments, I also think, like many people, that keeping animals in zoos is cruel and unnecessary."}, {"sense": "because of something", "level": "B2", "dict_examp": "He doesn't eat any dairy products on account of the diet he is following.", "lear_examp": "On account of its location, it is always busy."}, {"sense": "as said by a lot of people", "level": "C1", "dict_examp": "The party was, by all accounts, a great success.", "lear_examp": "I have known Michael Van Cleef for over two decades now, and he is, by all accounts, an exemplary worker."}]}, {"pos": "verb", "senses": [{"sense": "to be the reason for something, or to explain the reason for something", "level": "C2", "dict_examp": "Can you account for your absence last Friday?", "lear_examp": "I could not account for what had happened."}, {"sense": "to form part of a total amount or number of something", "level": "C1", "dict_examp": "Senior citizens account for more than 25 percent of the state's population.", "lear_examp": "If you look carefully at the attached pie-chart, you will easily see that the administration costs and the cost of entertainment account for a mere 15% of the total amount raised."}]}]}, {"word": "acceptable", "poses": [{"pos": "adjective", "senses": [{"sense": "good enough", "level": "B1", "dict_examp": "This kind of behavior is not acceptable.", "lear_examp": "I am sure that finally I will succeed in using English in an acceptable way!"}, {"sense": "allowed or approved of", "level": "C1", "dict_examp": "It's not socially acceptable to wear jeans and a T-shirt to a wedding.", "lear_examp": "They should teach them what is right and wrong, and what is morally and socially acceptable."}]}]}, {"word": "accountable", "poses": [{"pos": "adjective", "senses": [{"sense": "responsible for what you do and having to be able to explain your actions", "level": "C2", "dict_examp": "Hospitals must be held accountable for their mistakes.", "lear_examp": "Finally, there should be a person who should be held accountable and is accessible to our complaints."}]}]}, {"word": "accuracy", "poses": [{"pos": "noun", "senses": [{"sense": "how correct or  exact something is", "level": "B2", "dict_examp": "We can predict changes with a surprising degree of accuracy.", "lear_examp": "I was very disappointed to observe your lack of accuracy in the description of this wonderful event."}]}]}, {"word": "accumulation", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of something that has been collected", "level": "C2", "dict_examp": "Despite this accumulation of evidence, the government did nothing.", "lear_examp": "What is success? For some it is the accumulation of possessions, for others it's fame, health, love."}]}]}, {"word": "actor", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to perform in plays, movies, etc.", "level": "A2", "dict_examp": "\"Who's your favorite actor?\" \"Robert de Niro.\"", "lear_examp": "We watched a DVD called \"Minority Report\" with the actor Tom Cruise."}]}]}, {"word": "achievement", "poses": [{"pos": "noun", "senses": [{"sense": "something very good and difficult that you have succeeded in doing", "level": "B1", "dict_examp": "An Olympic silver medal is a remarkable achievement for such a young athlete.", "lear_examp": "I think this is an achievement because he is now a lawyer."}]}]}, {"word": "across", "poses": [{"pos": "adverb", "senses": [{"sense": "from one side of something to the other", "level": "A2", "dict_examp": "She walked across the field/road.", "lear_examp": "My new phone is great. It is black with white lines going across it."}, {"sense": "happening or having an effect on everyone or everything in every area", "level": "C2", "dict_examp": "The improvement has been across the board, with all divisions reporting increased profits.", "lear_examp": "Children in separate schools get on with things regardless of it being work for boys or girls, which can be quite positive especially in today's lifestyles where chores are done across the board."}]}, {"pos": "preposition", "senses": [{"sense": "on the opposite side of", "level": "A2", "dict_examp": "The library is just across the street.", "lear_examp": "Tomorrow, if the weather is good I'll sail across the lake."}]}]}, {"word": "activity", "poses": [{"pos": "noun", "senses": [{"sense": "something that is done for enjoyment, especially an organized event", "level": "A2", "dict_examp": "The center offers a range of activities, such as basketball, swimming and tennis.", "lear_examp": "We did many activities: playing games, singing and watching a magic show."}, {"sense": "the work of a group or organization to achieve an aim", "level": "B2", "dict_examp": "Energy companies have concentrated their business activity in Houston.", "lear_examp": "But Rollo was also a good man, so when a policeman, called Calloway, informed him about Harry's illegal activity, he turned against him."}, {"sense": "when a lot of things are happening or people are moving around", "level": "B2", "dict_examp": "Officials are concerned by the low level of economic activity.", "lear_examp": "Technical progress and industrial activity are causing a lot of problems."}]}]}, {"word": "active", "poses": [{"pos": "adjective", "senses": [{"sense": "doing a lot of things, or moving around a lot", "level": "B1", "dict_examp": "physically/socially active", "lear_examp": "Nico is a very active guy and I enjoyed going out with him very much."}, {"sense": "An active verb or sentence is one in which the subject is the person or thing doing the action.", "level": "B1", "dict_examp": "\"Anna told me\" is an active sentence, and \"I was told by Anna\" is passive.", "lear_examp": ""}, {"sense": "very involved in an organization or planned activity", "level": "B2", "dict_examp": "She remains active in local arts organizations.", "lear_examp": "I have always been very active in different organizations, sports as well as charity."}, {"sense": "An active volcano could throw out hot gas, melting rock, thick dust, etc., at any time.", "level": "C1", "dict_examp": "Kilauea in Hawaii is one of the world's most active volcanoes.", "lear_examp": "The beautiful, crystal blue sea and the small white houses, the bright orange of the sky during the evening and the unidentified color of the volcanic rocks around the great, active volcano are just a few of the colors that paint the natural beauty of Thera."}]}]}, {"word": "acquaintance", "poses": [{"pos": "noun", "senses": [{"sense": "someone who you know but do not know well", "level": "C1", "dict_examp": "He's an acquaintance of ours.", "lear_examp": "She has many friends and acquaintances and spends a lot of time with them."}]}]}, {"word": "achieve", "poses": [{"pos": "verb", "senses": [{"sense": "to succeed in doing something good, usually by working hard", "level": "B1", "dict_examp": "She finally achieved her goal to visit South America.", "lear_examp": "My father is a person who has achieved a lot of great things in his life."}]}]}, {"word": "actively", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that involves positive action", "level": "B2", "dict_examp": "He's very actively involved in  the local politics.", "lear_examp": "There are several Non-Governmental Organizations supporting their claim, and they work actively to prevent any further pollution."}]}]}, {"word": "acre", "poses": [{"pos": "noun", "senses": [{"sense": "a unit for measuring area, equal to 4047 square meters or 4840 square yards", "level": "C2", "dict_examp": "He owns 400 acres of land in California.", "lear_examp": "We have to admit that, not only because of the financial weakness but also because of the badly organized plans, we failed to achieve  the planting of 10,000 trees per acre."}]}]}, {"word": "adaptation", "poses": [{"pos": "noun", "senses": [{"sense": "the process or act of changing to suit a new situation", "level": "C1", "dict_examp": "Evolution occurs as a result of adaptation to new environments.", "lear_examp": "This varies from one person to another, it depends on everyone's priorities and degree of adaptation to their new communities."}]}]}, {"word": "accuse", "poses": [{"pos": "verb", "senses": [{"sense": "to say that someone has done something bad", "level": "B2", "dict_examp": "He's been accused of robbery/murder.", "lear_examp": "They were accused of vandalism."}]}]}, {"word": "adapt", "poses": [{"pos": "verb", "senses": [{"sense": "to change your behavior so that it is suitable for a new situation", "level": "B2", "dict_examp": "It takes time to adapt to a new environment.", "lear_examp": "I and my parents easily adapted to London, and to English people."}, {"sense": "to change something so that it is suitable for a different use or situation", "level": "B2", "dict_examp": "Many companies have adapted popular applications to the smartphones and tablets.", "lear_examp": "In my opinion, as the town is not so big it will be enough to adapt the two areas outside the town walls and to use them for car parking."}]}]}, {"word": "ache", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of pain over an area of your body which continues for a long time", "level": "B1", "dict_examp": "As you get older, you have all sorts of aches and pains.", "lear_examp": "Since then, I have had an ache in my left leg."}]}, {"pos": "verb", "senses": [{"sense": "to have a continuous pain that is unpleasant but not strong", "level": "B2", "dict_examp": "My head/tooth/back aches.", "lear_examp": "After an hour of horseback riding your muscles can really ache."}]}]}, {"word": "acid", "poses": [{"pos": "noun", "senses": [{"sense": "a liquid substance that can react chemically with and sometimes dissolve other materials", "level": "B2", "dict_examp": "hydrochloric/fatty acid", "lear_examp": "We saw a little black dragon with scales like iron charging at us and spitting acid."}]}]}, {"word": "accustomed", "poses": [{"pos": "adjective", "senses": [{"sense": "If you are accustomed to something, you have experienced it often enough for it to seem normal to you.", "level": "C1", "dict_examp": "I've worked nights for years now and become/grown accustomed to it.", "lear_examp": "I am quite accustomed to being with many kinds of people of different ages."}]}]}, {"word": "acknowledge", "poses": [{"pos": "verb", "senses": [{"sense": "to accept that something is true or exists", "level": "C1", "dict_examp": "He acknowledged that there was a problem.", "lear_examp": "Therefore, the most important lesson to learn is to acknowledge the necessity of education and to strive to make it happen."}, {"sense": "to say, usually in writing, that you have received something that someone sent you", "level": "C1", "dict_examp": "He sent a letter acknowledging receipt of her application.", "lear_examp": "Please could you acknowledge the receipt of this letter."}]}]}, {"word": "actually", "poses": [{"pos": "adverb", "senses": [{"sense": "used when you are emphasizing what is really true or what really happened", "level": "A2", "dict_examp": "I don't actually like seafood.", "lear_examp": "Last night I was at your house and I think I have left my purse there. It's actually quite important because my Identity Card is inside."}, {"sense": "used when you are emphasizing  something surprising", "level": "B1", "dict_examp": "An old friend of mine from college was actually at the same concert - I hadn't seen her for years!", "lear_examp": "It was so cool, man! They had actually built a good skate park with a pool, a halfpipe, a funbox, several rails and of course many ramps."}, {"sense": "used when you are correcting someone, disagreeing with someone, or saying no to a request", "level": "B2", "dict_examp": "Actually, it was Tuesday of last week, not Wednesday.", "lear_examp": "Actually, TORRENTS was the second group at the festival. I think you probably missed the first performance in which KING CUP sang."}]}]}, {"word": "accusation", "poses": [{"pos": "noun", "senses": [{"sense": "when you say that someone has done something bad", "level": "C1", "dict_examp": "He made a number of accusations against his former colleagues.", "lear_examp": "I have enclosed the Distribution Chart in order to prevent you from making further accusations."}]}]}, {"word": "act", "poses": [{"pos": "verb", "senses": [{"sense": "to perform in a movie, play, etc.", "level": "B1", "dict_examp": "Have you ever acted in a play before?", "lear_examp": "We are taught how to act in both comic and serious parts."}, {"sense": "to behave in a particular way", "level": "B1", "dict_examp": "He acted as if he'd never met me before.", "lear_examp": "I always care about how much money I have and I always act sensibly."}, {"sense": "to do something, especially in order to solve a problem", "level": "B2", "dict_examp": "She acted without thinking.", "lear_examp": "We can make the village much more attractive than it has ever been. If we act together as a group, things will be easier."}, {"sense": "to do a particular job, especially one that you do not normally do", "level": "B2", "dict_examp": "He was asked to act as an advisor on the project.", "lear_examp": "In the last race held by Nostred Motor Klub, I saw that you were short of officials. Now I think I can act as an official in your club."}]}, {"pos": "noun", "senses": [{"sense": "one of the parts a play is divided into", "level": "B1", "dict_examp": "Her character doesn't appear until Act 2.", "lear_examp": "Everything was going all right, until we reached the \"balcony act\"."}, {"sense": "something that someone does", "level": "B2", "dict_examp": "an act of aggression/kindness/terrorism", "lear_examp": "I think that reading is an act of intelligence because animals can't read, while watching T.V. is only an act of having fun!!!"}, {"sense": "behavior that hides your real feelings or intentions", "level": "C2", "dict_examp": "Was she really upset or was that just an act?", "lear_examp": "Sometimes what is put on display for the tourists is all an act and gives you a different impression and opinion of the country and people, so it would be advisable to meet some local people like the butcher or baker and have a talk with them."}, {"sense": "to become better organized so that you can make progress", "level": "C2", "dict_examp": "I wish she'd get her act together.", "lear_examp": "He was determined to get his act together and try to find a solution to his problem."}]}]}, {"word": "add", "poses": [{"pos": "verb", "senses": [{"sense": "to put something with something else", "level": "A2", "dict_examp": "Beat the butter and sugar together and slowly add the eggs.", "lear_examp": "When we have a special day we also cook manto, which is made from meat, vegetables and bread. You must pour some mint juice on top and to be more delicious, you must add chili."}, {"sense": "to put two or more numbers or amounts together to get a total", "level": "A2", "dict_examp": "If you add three and four you get seven.", "lear_examp": "My math teacher is going to give me 5 marks which will be added to my exam grade."}, {"sense": "to say another thing", "level": "B1", "dict_examp": "She was sad, she said, but added  that she felt she had made the right decision.", "lear_examp": "The guide told us they called it Swan Lake because there are lots of swans and added that the swans come from all over the country."}, {"sense": "to make someone's bad situation worse by doing something else to upset them", "level": "C2", "dict_examp": "To add insult to injury, we had to pay for the damage!", "lear_examp": "To add insult to injury, such an approach often turns out to be counterproductive."}, {"sense": "to make a feeling or quality more extreme", "level": "B2", "dict_examp": "Her colleagues' laughter only added to  her embarrassment.", "lear_examp": "To add to the bitterness, I had my right hand broken."}, {"sense": "to calculate the total of two or more numbers", "level": "B1", "dict_examp": "I added everything up and it comes to $45.80.", "lear_examp": ""}]}]}, {"word": "actual", "poses": [{"pos": "adjective", "senses": [{"sense": "real, not guessed or imagined", "level": "B2", "dict_examp": "We estimated about 300 visitors, but the actual number was much higher.", "lear_examp": "In my opinion, Burgers' Bush, Safari & Zoo in Arnhem has found the perfect solution.  The actual zoo is rather small but each animal has a lot of space for running or wandering around."}]}]}, {"word": "action", "poses": [{"pos": "noun", "senses": [{"sense": "things which are happening, especially exciting or important things", "level": "B1", "dict_examp": "I like movies with a lot of action. / I like action movies.", "lear_examp": "We’re planning to see \"King Arthur.\" Everyone said it's a nice movie with some action and some mystery."}, {"sense": "something that you do", "level": "B2", "dict_examp": "We must take action before the problem gets worse.", "lear_examp": "I decided to take action on my own."}, {"sense": "a process in a law court when a person claims to  have been harmed", "level": "C1", "dict_examp": "They are considering taking legal action against the company.", "lear_examp": "If this matter does not receive your prompt attention, I will be forced to take legal action. (760644; Certificate in Advanced English; Poland; C1 EFFECTIVE OPERATIONAL PROFICIENCY; 2000; Polish; Fail"}, {"sense": "something that you can do in a particular situation", "level": "C1", "dict_examp": "I think the best course of action would be to write to him.", "lear_examp": "However, I believe that the best course of action in this case is to give our student a refund."}, {"sense": "fighting in a war", "level": "C2", "dict_examp": "He was killed in action.", "lear_examp": "It was a shock when she got to know that her husband had been killed in action."}, {"sense": "a movement or natural process", "level": "C2", "dict_examp": "The rocks are smoothed by the action of water.", "lear_examp": "The area of Sayago - in the Spanish province of Zamora - and Tras-os-Montes, in Portugal, are joined by a natural border: the river Duero and the rocky canyon that has been eroded for millions of years by the action of the water."}]}]}, {"word": "ad", "poses": [{"pos": "noun", "senses": [{"sense": "an advertisement", "level": "A1", "dict_examp": "TV/newspaper ads", "lear_examp": "I'm Georgia from class 8. I've seen your ad for the concert at school."}]}]}, {"word": "acquire", "poses": [{"pos": "verb", "senses": [{"sense": "to get something", "level": "B2", "dict_examp": "He acquired the company in 1978.", "lear_examp": "I would like to join the club because  I will be able to acquire more stamps for my collection."}, {"sense": "to learn something", "level": "B2", "dict_examp": "to acquire knowledge/skills", "lear_examp": "I have already acquired experience in the Tourism Field, working as a guard in a summer camp in Florida in 1997."}]}]}, {"word": "accurately", "poses": [{"pos": "adverb", "senses": [{"sense": "in an accurate way", "level": "B2", "dict_examp": "The plans should be drawn as accurately as possible, showing all the measurements.", "lear_examp": "It's necessary to consider a lot of aspects to answer this question accurately, but in general I would prefer to go to work by bicycle."}]}]}, {"word": "admittedly", "poses": [{"pos": "adverb", "senses": [{"sense": "used when you are agreeing that something is true although you do not want to", "level": "B2", "dict_examp": "Admittedly, I could have tried harder but I still don't think all this criticism is fair.", "lear_examp": "Admittedly, using your car is more convenient and easier than using public transport but in my opinion, the advantages of using public transport outweigh the disadvantages it can cause."}]}]}, {"word": "addition", "poses": [{"pos": "noun", "senses": [{"sense": "as well (as)", "level": "B1", "dict_examp": "In addition to their home in Florida, they have a summer place in Maine.", "lear_examp": "If it is cold I'll probably wear, in addition, a jacket or a sweater."}, {"sense": "a new or extra thing which is added to something", "level": "B2", "dict_examp": "Matt is the latest addition to the team.", "lear_examp": "There is only one more thing missing: it would be great if there was popcorn provided. I am sure that would be a good addition for everyone."}, {"sense": "the process of adding numbers or amounts together in order to get a total", "level": "B2", "dict_examp": "Twice a week the children are tested in basic math skills such as addition  and subtraction.", "lear_examp": ""}]}]}, {"word": "adjacent", "poses": [{"pos": "adjective", "senses": [{"sense": "If two things are adjacent, they are next to each other.", "level": "C2", "dict_examp": "The fire started in an adjacent building.", "lear_examp": "I assume better infrastructure and a parking lot adjacent to the library would make a huge difference."}]}]}, {"word": "administration", "poses": [{"pos": "noun", "senses": [{"sense": "the work of organizing and arranging the operation of something, such as a company", "level": "C1", "dict_examp": "The job involves a lot of administration.", "lear_examp": "For schools, it is much easier in terms of administration."}, {"sense": "the people in an organization who manage its business and operations", "level": "C2", "dict_examp": "The decision to cancel the trip was made by the school administration.", "lear_examp": "As far as I have been informed, the administration of the hospital has already talked to you about this issue, but as nothing has changed since, I feel that is my obligation to mention it in this letter."}, {"sense": "the  politicians who govern a town, city, country, etc., or the period a  particular elected government is in charge", "level": "C2", "dict_examp": "The current administration faces serious economic issues.", "lear_examp": "The opening of the Alpha Ville Shopping Centre at Santa Maria High Street is a remarkable achievement from the current administration of Mr. Paul Hawley, Mayor of our town."}]}]}, {"word": "admit", "poses": [{"pos": "verb", "senses": [{"sense": "to agree that something is true, especially unwillingly", "level": "B1", "dict_examp": "He admitted his mistake.", "lear_examp": "I read very often, especially after (and, I admit, sometimes during) meals and before sleeping."}]}]}, {"word": "advanced", "poses": [{"pos": "adjective", "senses": [{"sense": "at a higher, more difficult level", "level": "A2", "dict_examp": "an advanced English course", "lear_examp": "I just couldn't stay with my old classmates because they were too slow and I needed a more advanced group."}, {"sense": "modern and well developed", "level": "B1", "dict_examp": "advanced technology", "lear_examp": "We are living in the 21st century where everybody is surrounded by advanced technological methods."}]}]}, {"word": "adjust", "poses": [{"pos": "verb", "senses": [{"sense": "to change something slightly so that it works better, fits better, or is more suitable", "level": "B2", "dict_examp": "If the chair is too high you can adjust it to suit you.", "lear_examp": "I had to clean the lenses, prepare the tapes, and adjust the sound."}, {"sense": "to change the way you behave or think in order to suit a new situation", "level": "B2", "dict_examp": "They found it hard to adjust to life in a new country.", "lear_examp": "People will be able to adjust and change with the times."}]}]}, {"word": "adopted", "poses": [{"pos": "adjective", "senses": [{"sense": "legally taken by another family to be looked after as their own child", "level": "B2", "dict_examp": "They adopted two of their four children.", "lear_examp": ""}]}]}, {"word": "admission", "poses": [{"pos": "noun", "senses": [{"sense": "the money that you pay to enter a place or an event", "level": "B1", "dict_examp": "Art exhibition - free admission.", "lear_examp": "We believe that this is a great opportunity because it is one of the best shows of the year, and the best part is that the admission is free for students."}, {"sense": "when someone is given permission to enter somewhere or to become a member of a club, university, etc.", "level": "B2", "dict_examp": "She's applied for admission to law school.", "lear_examp": "I was wondering whether you could send me some information about the rules of admission to the club."}]}]}, {"word": "advance", "poses": [{"pos": "noun", "senses": [{"sense": "before a particular time, or before doing a particular thing", "level": "B1", "dict_examp": "If you're going to come, please let me know in advance.", "lear_examp": "I can help you if you want to book your room in advance."}, {"sense": "new discoveries and inventions", "level": "B2", "dict_examp": "technological/scientific advances", "lear_examp": "I guess science is about solving our daily problems with technological advances."}]}]}, {"word": "adequate", "poses": [{"pos": "adjective", "senses": [{"sense": "enough", "level": "B2", "dict_examp": "I didn't have adequate time to prepare.", "lear_examp": "I hope the information I gave is adequate."}, {"sense": "good enough, but not very good", "level": "B2", "dict_examp": "The sound quality isn't great, but it's adequate for everyday use.", "lear_examp": "In my opinion, animals should only be kept in a zoo that provides adequate living conditions and sufficient room."}]}]}, {"word": "adequately", "poses": [{"pos": "adverb", "senses": [{"sense": "in an adequate way", "level": "B2", "dict_examp": "While some patients can be adequately cared for at home, others are best served by care in a                         hospital.", "lear_examp": ""}]}]}, {"word": "adoption", "poses": [{"pos": "noun", "senses": [{"sense": "the process of legally becoming the parents of someone else's child", "level": "B2", "dict_examp": "She couldn't have children, so they were considering adoption.", "lear_examp": ""}]}]}, {"word": "admire", "poses": [{"pos": "verb", "senses": [{"sense": "to find someone or something attractive and pleasant to look at", "level": "B1", "dict_examp": "I was just admiring your jacket, Delia.", "lear_examp": "It was a sunny day, luckily, so I was able to admire the lake and the Marmolada, the highest mountain in the Dolomites."}, {"sense": "to respect or approve of someone or something", "level": "B2", "dict_examp": "I admired him for his determination.", "lear_examp": "The person I admire most, however, is my father."}]}]}, {"word": "addictive", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is addictive, it makes you want more of it.", "level": "C1", "dict_examp": "Some prescription pain-killers are addictive.", "lear_examp": "Lastly, we cannot overlook the fact that modern technology can be really addictive for such people as teenagers, who are not mature enough to appreciate the value of face-to-face contact."}]}]}, {"word": "adopt", "poses": [{"pos": "verb", "senses": [{"sense": "to legally become the parents of someone else's child", "level": "B2", "dict_examp": "They've adopted a baby girl.", "lear_examp": "She isn't my biological mother, she adopted me when I was a baby."}, {"sense": "to accept or start to use something new", "level": "B2", "dict_examp": "We've adopted a new approach to the problem.", "lear_examp": "I believe that we must continue to adopt his ideas."}]}]}, {"word": "adjective", "poses": [{"pos": "noun", "senses": [{"sense": "a word that describes a noun or pronoun", "level": "A2", "dict_examp": "\"Big,\" \"boring,\" \"purple,\" \"quick\" and \"obvious\" are all adjectives.", "lear_examp": ""}]}]}, {"word": "additional", "poses": [{"pos": "adjective", "senses": [{"sense": "extra", "level": "B2", "dict_examp": "additional costs/problems", "lear_examp": "I do have some additional questions for you."}]}]}, {"word": "admiration", "poses": [{"pos": "noun", "senses": [{"sense": "when you admire someone or something", "level": "B2", "dict_examp": "My admiration for that woman grows daily.", "lear_examp": "All over the world there are so many people who deserve admiration."}]}]}, {"word": "address", "poses": [{"pos": "noun", "senses": [{"sense": "the details of where a building is, including the building number, street name, city or town, etc.", "level": "A1", "dict_examp": "her business/home address", "lear_examp": "Please tell me your address."}, {"sense": "a series of letters, numbers or punctuation marks referring to a Web site or e-mail destination", "level": "A1", "dict_examp": "Do you have their Web address?", "lear_examp": "P.S This is my new e-mail address: xxxxxxxxx"}]}, {"pos": "verb", "senses": [{"sense": "to deal with a problem", "level": "C1", "dict_examp": "We have to address the issue/problem before it gets worse.", "lear_examp": "You will have to admit the lack of any monthly publications addressing this issue."}, {"sense": "to speak to someone, or to give a speech to an audience", "level": "C2", "dict_examp": "He addressed the crowd after receiving the award.", "lear_examp": "He inhaled deeply before addressing the group again."}, {"sense": "to write a name and address on an envelope or package", "level": "C2", "dict_examp": "I spent the morning addressing wedding invitations.", "lear_examp": "The envelope was addressed to Kathleen."}]}]}, {"word": "adjustment", "poses": [{"pos": "noun", "senses": [{"sense": "a small change that you make to something so that it works better, fits better, or is more suitable", "level": "B2", "dict_examp": "We've made a few adjustments to the schedule.", "lear_examp": "I have some questions and a minor adjustment to make."}]}]}, {"word": "administrator", "poses": [{"pos": "noun", "senses": [{"sense": "someone who helps to manage an organization", "level": "C1", "dict_examp": "She is an administrator at the hospital.", "lear_examp": "As an ex-army officer and an administrator in an international firm, I am learning to work as a member of a team."}]}]}, {"word": "addict", "poses": [{"pos": "noun", "senses": [{"sense": "a person who cannot stop doing or using something, especially something harmful", "level": "B2", "dict_examp": "a drug/heroin addict", "lear_examp": "I like TV, I watch it but luckily I haven't become a TV addict yet."}]}]}, {"word": "add", "poses": [{"pos": "verb", "senses": [{"sense": "to put something with something else", "level": "A2", "dict_examp": "Beat the butter and sugar together and slowly add the eggs.", "lear_examp": "When we have a special day we also cook manto, which is made from meat, vegetables and bread. You must pour some mint juice on top and to be more delicious, you must add chili."}, {"sense": "to put two or more numbers or amounts together to get a total", "level": "A2", "dict_examp": "If you add three and four you get seven.", "lear_examp": "My math teacher is going to give me 5 marks which will be added to my exam grade."}, {"sense": "to say another thing", "level": "B1", "dict_examp": "She was sad, she said, but added  that she felt she had made the right decision.", "lear_examp": "The guide told us they called it Swan Lake because there are lots of swans and added that the swans come from all over the country."}, {"sense": "to make someone's bad situation worse by doing something else to upset them", "level": "C2", "dict_examp": "To add insult to injury, we had to pay for the damage!", "lear_examp": "To add insult to injury, such an approach often turns out to be counterproductive."}, {"sense": "to make a feeling or quality more extreme", "level": "B2", "dict_examp": "Her colleagues' laughter only added to  her embarrassment.", "lear_examp": "To add to the bitterness, I had my right hand broken."}, {"sense": "to calculate the total of two or more numbers", "level": "B1", "dict_examp": "I added everything up and it comes to $45.80.", "lear_examp": ""}]}]}, {"word": "adult", "poses": [{"pos": "noun", "senses": [{"sense": "a person or animal that has grown to full size and strength", "level": "A1", "dict_examp": "Adults pay an admission charge but children get in free.", "lear_examp": "Dear Jo, The class day is Wednesday for children (8-16s) and Tuesday for adults."}]}, {"pos": "adjective", "senses": [{"sense": "for or relating to adults", "level": "A2", "dict_examp": "adult education", "lear_examp": "After the wedding, we go to a restaurant to celebrate. There are two types of menu, the adult one, and the one for the children."}, {"sense": "having finished growing", "level": "C1", "dict_examp": "an adult male rat", "lear_examp": "Tony Soprano is the bad kid in every adult male."}]}]}, {"word": "administrative", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the organization and management of something", "level": "C1", "dict_examp": "The work is largely administrative.", "lear_examp": "The engineers and administrative staff must be able to work in both English and French whereas German would be an asset."}]}]}, {"word": "addiction", "poses": [{"pos": "noun", "senses": [{"sense": "when you cannot stop doing or taking something because you are addicted to it", "level": "B2", "dict_examp": "drug addiction", "lear_examp": "Sending text messages is an addiction which every teenager is obsessed with."}]}]}, {"word": "addicted", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to stop taking a drug", "level": "B2", "dict_examp": "He later became addicted to heroin.", "lear_examp": "One day my uncle called and told me a story of a boy who was addicted to drugs."}, {"sense": "liking something very much", "level": "B2", "dict_examp": "He's addicted to chocolate/football.", "lear_examp": "However, I believe that some people are addicted to computer games and that is not good."}]}]}, {"word": "adolescent", "poses": [{"pos": "noun", "senses": [{"sense": "a young person who is between being a child and an adult", "level": "C2", "dict_examp": "Many adolescents are secretive.", "lear_examp": "Children become adolescents with more freedom and yet more responsibilities."}]}]}, {"word": "advice", "poses": [{"pos": "noun", "senses": [{"sense": "suggestions about what you think someone should do or how they should do something", "level": "A2", "dict_examp": "Steven gave me some good advice.", "lear_examp": "I have to send in the application form soon, so if you can give me some advice, it would be great!"}]}]}, {"word": "adventurous", "poses": [{"pos": "adjective", "senses": [{"sense": "willing to try new and often difficult or dangerous things", "level": "B2", "dict_examp": "I'm trying to be more adventurous with my cooking.", "lear_examp": "I think it's better for us to sleep in tents because it'll be more adventurous than staying in rooms."}]}]}, {"word": "advanced", "poses": [{"pos": "adjective", "senses": [{"sense": "at a higher, more difficult level", "level": "A2", "dict_examp": "an advanced English course", "lear_examp": "I just couldn't stay with my old classmates because they were too slow and I needed a more advanced group."}, {"sense": "modern and well developed", "level": "B1", "dict_examp": "advanced technology", "lear_examp": "We are living in the 21st century where everybody is surrounded by advanced technological methods."}]}]}, {"word": "adverb", "poses": [{"pos": "noun", "senses": [{"sense": "a word which describes or gives more information about a verb, adjective, another adverb or a phrase", "level": "A2", "dict_examp": "In the phrase \"she smiled cheerfully,\" the word \"cheerfully\" is an adverb.", "lear_examp": ""}]}]}, {"word": "adviser", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to give advice about a subject", "level": "C1", "dict_examp": "a financial adviser", "lear_examp": "Some of our financial advisers could provide your students with the latest methods used in Accounting and in developing new business projects."}]}]}, {"word": "adverse", "poses": [{"pos": "adjective", "senses": [{"sense": "causing problems, danger, or a bad effect", "level": "C2", "dict_examp": "Her policies may have adverse effects on the economy.", "lear_examp": "However, we should bear in mind that tourism could have an adverse effect on the local environment."}]}]}, {"word": "after", "poses": [{"pos": "preposition", "senses": [{"sense": "when a time or event has happened", "level": "A1", "dict_examp": "Do you want to go for a walk after breakfast?", "lear_examp": "You can go shopping, eat a tasty meal and after that you can go to the disco and dance all night."}, {"sense": "when you have gone past a particular place", "level": "A2", "dict_examp": "Turn left after the hotel.", "lear_examp": "You can go to a wonderful place near here, The Great Falls. This is a very good place because you can do extreme sports. It is just after the town, on Main Road."}, {"sense": "following in order", "level": "A2", "dict_examp": "H comes after G in the alphabet.", "lear_examp": ""}, {"sense": "following someone or something", "level": "B1", "dict_examp": "We ran after him but he got away.", "lear_examp": "I ran after the bus and shouted to her 'hurry up!'"}, {"sense": "used to add information that shows that what you have just said is true", "level": "B1", "dict_examp": "You can't expect to be perfect - after all, it was only your first lesson.", "lear_examp": "I stopped talking with my friends, but not for long -  after all, we are friends. Anyway, I'm planning nice things for the next April 1st."}, {"sense": "happening every day/year, etc. over a long period", "level": "B1", "dict_examp": "We rented the same house in Maine for our vacation year after year.", "lear_examp": "And there she was, day after day, walking in the rain..."}, {"sense": "because of something that happened", "level": "B2", "dict_examp": "I'll never trust her again after what she did to me.", "lear_examp": "I really needed those days after what I've been through this spring."}, {"sense": "despite", "level": "C1", "dict_examp": "I can't believe he was so rude to you after all the help you've given him!", "lear_examp": "But, even after earning more in 2001, the women still do not earn as much as men on average earned (£20,363) in 1997."}, {"sense": "used to say that something happened or was true although you did not expect it to happen or be true", "level": "C1", "dict_examp": "Helen couldn't come to the party after all.", "lear_examp": "Cars still enter the city so there will be pollution after all."}, {"sense": "used when giving someone or something the same name as another person or thing", "level": "C2", "dict_examp": "She’s named after her aunt.", "lear_examp": "I called her Lena after my sister."}]}, {"pos": "adverb", "senses": [{"sense": "later than someone or something else", "level": "A2", "dict_examp": "Hilary got here at noon and Nicholas arrived soon after.", "lear_examp": "Hi Joe, I would love to see the film with you. We must have dinner after."}]}, {"pos": "conjunction", "senses": [{"sense": "at a later time than something else happens", "level": "B1", "dict_examp": "Soon/shortly after we got on the highway, the car started to make a strange noise.", "lear_examp": "I hope we will meet soon after I come back home."}]}]}, {"word": "affluent", "poses": [{"pos": "adjective", "senses": [{"sense": "having a lot of money", "level": "C1", "dict_examp": "affluent suburbs/neighborhoods/families", "lear_examp": "Children who come from poor families are more mature and responsible than those children coming from affluent families."}]}]}, {"word": "afford", "poses": [{"pos": "verb", "senses": [{"sense": "to be able to buy or do something because you have enough money or time", "level": "B1", "dict_examp": "I don't know how he can afford a new car on his salary.", "lear_examp": "Unfortunately, I can't afford it now, but Christmas is coming, so I can ask my parents for a stereo for Christmas, but I'm not sure if they will agree or not."}, {"sense": "If you cannot afford to do something, it is impossible for you to do it without causing problems.", "level": "C2", "dict_examp": "We can't afford to take that risk.", "lear_examp": "We cannot afford to lose our national and global identity."}]}]}, {"word": "advertisement", "poses": [{"pos": "noun", "senses": [{"sense": "a picture, short film, song, etc. which tries to persuade people to buy a product or service", "level": "A2", "dict_examp": "a television/newspaper advertisement", "lear_examp": "Hi Jo, I've seen an advertisement for a job that might interest you at the music shop near the park."}]}]}, {"word": "again", "poses": [{"pos": "adverb", "senses": [{"sense": "once more", "level": "A1", "dict_examp": "Could you spell your name again, please?", "lear_examp": "Thank you again."}, {"sense": "as before", "level": "A2", "dict_examp": "Get some rest and you'll soon be well again.", "lear_examp": "Unfortunately, it started to rain when we were leaving the town, but five minutes later the weather became warm again."}, {"sense": "many times", "level": "B1", "dict_examp": "He played the same song again and again.", "lear_examp": "I read it again and again and was more and more surprised."}, {"sense": "again", "level": "B1", "dict_examp": "Once again I'm left with all the dirty dishes!", "lear_examp": "Once again I'm sorry."}, {"sense": "repeated from the beginning", "level": "B2", "dict_examp": "We had to start all over again.", "lear_examp": "After that I went back to my home in Ribeirao Preto to begin my routine all over again."}, {"sense": "again after something has happened or been done many times before", "level": "B2", "dict_examp": "The bus was late yet again.", "lear_examp": "Tom, thank you so much yet again for your interest, this talk is very important to me and to count on you is an honour for our college."}, {"sense": "used when adding a fact to something you have just said", "level": "C2", "dict_examp": "I failed my history test - but then again, I didn't do much studying for it.", "lear_examp": "The fact that people live longer nowadays does have some advantages, but then again it also causes a lot of problems."}]}]}, {"word": "affect", "poses": [{"pos": "verb", "senses": [{"sense": "to have an influence on someone or something, or to cause them to change", "level": "B2", "dict_examp": "The divorce affected every aspect of her life.", "lear_examp": "The telephone is a very important invention, which has affected our lives."}, {"sense": "to cause a strong emotion, especially sadness", "level": "B2", "dict_examp": "I was deeply affected by the film.", "lear_examp": "When the fourth song, 'Rebellion' started, I was deeply affected by the rhythm."}]}]}, {"word": "affectionate", "poses": [{"pos": "adjective", "senses": [{"sense": "showing that you like or love someone", "level": "C2", "dict_examp": "an affectionate child", "lear_examp": "She is attentive and affectionate, but most of all she is a sweet mother."}]}]}, {"word": "afraid", "poses": [{"pos": "adjective", "senses": [{"sense": "used to politely introduce bad news or to politely disagree with someone", "level": "A2", "dict_examp": "I'm afraid (that) we can't come this evening after all.", "lear_examp": "Hi! I'm afraid that last night I left my phone in your home."}, {"sense": "frightened", "level": "A2", "dict_examp": "He was/felt suddenly afraid.", "lear_examp": "I'm afraid of heights."}, {"sense": "worried that something bad might happen", "level": "B1", "dict_examp": "Many people are afraid (that) they might lose their jobs.", "lear_examp": "If I go shopping for clothes as a gift for children, I'm usually afraid of buying the wrong size."}]}]}, {"word": "affordable", "poses": [{"pos": "adjective", "senses": [{"sense": "cheap enough for most people to be able to buy", "level": "C1", "dict_examp": "We need more affordable housing in this area.", "lear_examp": "They are very pleased with the affordable fares, however they are more inclined to comfort."}]}]}, {"word": "advise", "poses": [{"pos": "verb", "senses": [{"sense": "to make a suggestion about what you think someone should do or how they should do something", "level": "B1", "dict_examp": "I think I'd advise him to leave the company.", "lear_examp": "I advise you to go there and have a good time."}]}]}, {"word": "affection", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of liking or loving a person or place", "level": "B2", "dict_examp": "He had a  deep affection for his aunt.", "lear_examp": "In addition she loves me very much and she offers a lot of affection to me when I face a difficult situation with my job."}]}]}, {"word": "advertising", "poses": [{"pos": "noun", "senses": [{"sense": "the business of trying to persuade people to buy products or services", "level": "B2", "dict_examp": "Fiona works in advertising.", "lear_examp": "Some weeks ago, she was hired by a famous advertising company, widely known for its ironic ads."}]}]}, {"word": "advocate", "poses": [{"pos": "verb", "senses": [{"sense": "to express support for a particular idea or way of doing things", "level": "C2", "dict_examp": "I certainly wouldn't advocate the use of violence.", "lear_examp": "Just like Mahatma Gandhi, who advocated non-violent methods of struggle, Picasso struggled against fascism by peaceful means, namely with his art."}]}, {"pos": "noun", "senses": [{"sense": "someone who supports a particular idea or way of doing things", "level": "C2", "dict_examp": "He has always been an advocate of space exploration.", "lear_examp": "Advocates of international tourism subscribe to the view that mass tourism offers benefits to the whole community."}]}]}, {"word": "advertise", "poses": [{"pos": "verb", "senses": [{"sense": "to tell people about a product or service in newspapers, on television, on the Internet, etc.", "level": "B1", "dict_examp": "Companies are not allowed to advertise cigarettes on television any more.", "lear_examp": "On this bus we can advertise the village's best products."}, {"sense": "to put information in a newspaper, on the Internet, etc. asking for someone or something that you need", "level": "B1", "dict_examp": "The university is advertising for catering staff.", "lear_examp": "Dear Sir/Madam, I wish to apply for the post of helper which was advertised on the college notice board last Monday."}]}]}, {"word": "advantage", "poses": [{"pos": "noun", "senses": [{"sense": "something good about a situation that helps you", "level": "B1", "dict_examp": "One of the advantages of booking a flight in advance is that you get better seats.", "lear_examp": "Surely it would be an advantage that you speak English and German, because of all the foreign tourists."}, {"sense": "to use something good in a situation to help you", "level": "B1", "dict_examp": "I thought I'd take advantage of the exercise facility while I'm here.", "lear_examp": "When I bought my ticket I expected to be able to take advantage of those discounts you announced in the newspaper advertisement but I had to pay the most expensive price."}, {"sense": "to treat someone or something badly in order to get what you want", "level": "B2", "dict_examp": "I think she takes advantage of his good nature.", "lear_examp": "There will always be the threat of those men who take advantage of animals' inferior status."}, {"sense": "something that will help you to succeed", "level": "B2", "dict_examp": "These new routes will give the airline an  advantage over its competitors.", "lear_examp": ""}]}]}, {"word": "afterward", "poses": [{"pos": "adverb", "senses": [{"sense": "at a later time, after something else has happened", "level": "A2", "dict_examp": "We had lunch, and afterward we sat on the deck and watched the kids play in the pool.", "lear_examp": "After that we have a Disco, and Buffet of food afterward."}]}]}, {"word": "afternoon", "poses": [{"pos": "noun", "senses": [{"sense": "the time between the middle of the day and the evening", "level": "A1", "dict_examp": "It was a sunny afternoon.", "lear_examp": "She cooks every afternoon."}]}]}, {"word": "affair", "poses": [{"pos": "noun", "senses": [{"sense": "a situation, matter, or set of related events that is being dealt with or considered", "level": "B2", "dict_examp": "The meeting was addressed by an expert in South American affairs.", "lear_examp": "To make matters worse, people gossiped about me and tried to find out more and more about my private affairs, which made me feel embarrassed."}, {"sense": "a sexual relationship, especially a secret one", "level": "B2", "dict_examp": "Do you think he's having an affair with someone?", "lear_examp": "I am that kind of individual that loves stories, they can be either love affairs or fantastic adventures but I really enjoy getting involved in some kind of story."}]}]}, {"word": "adventure", "poses": [{"pos": "noun", "senses": [{"sense": "an exciting and sometimes dangerous experience", "level": "A2", "dict_examp": "It's a movie about the adventures of two friends traveling through Africa.", "lear_examp": "My favorite present was a trip to Egypt. I like it because I will have adventures and be able to explore other countries."}]}]}, {"word": "aggression", "poses": [{"pos": "noun", "senses": [{"sense": "angry or violent behavior toward someone", "level": "C1", "dict_examp": "an act of aggression", "lear_examp": "However, it can turn into a terrible form of violence and aggression, where the very sense of competition is forgotten and only wild instincts prevail."}]}]}, {"word": "again", "poses": [{"pos": "adverb", "senses": [{"sense": "once more", "level": "A1", "dict_examp": "Could you spell your name again, please?", "lear_examp": "Thank you again."}, {"sense": "as before", "level": "A2", "dict_examp": "Get some rest and you'll soon be well again.", "lear_examp": "Unfortunately, it started to rain when we were leaving the town, but five minutes later the weather became warm again."}, {"sense": "many times", "level": "B1", "dict_examp": "He played the same song again and again.", "lear_examp": "I read it again and again and was more and more surprised."}, {"sense": "again", "level": "B1", "dict_examp": "Once again I'm left with all the dirty dishes!", "lear_examp": "Once again I'm sorry."}, {"sense": "repeated from the beginning", "level": "B2", "dict_examp": "We had to start all over again.", "lear_examp": "After that I went back to my home in Ribeirao Preto to begin my routine all over again."}, {"sense": "again after something has happened or been done many times before", "level": "B2", "dict_examp": "The bus was late yet again.", "lear_examp": "Tom, thank you so much yet again for your interest, this talk is very important to me and to count on you is an honour for our college."}, {"sense": "used when adding a fact to something you have just said", "level": "C2", "dict_examp": "I failed my history test - but then again, I didn't do much studying for it.", "lear_examp": "The fact that people live longer nowadays does have some advantages, but then again it also causes a lot of problems."}]}]}, {"word": "ages", "poses": [{"pos": "noun", "senses": [{"sense": "a very long time", "level": "B1", "dict_examp": "I've been waiting here for ages.", "lear_examp": "I feel like I've been here for ages."}]}]}, {"word": "age", "poses": [{"pos": "noun", "senses": [{"sense": "the number of years that someone has lived, or that something has existed", "level": "A1", "dict_examp": "I'd guess she's about my age.", "lear_examp": "She is the same age as me."}, {"sense": "a particular period of history", "level": "B2", "dict_examp": "the modern/information age", "lear_examp": "You can begin by visiting its castle, which goes back to the middle ages."}, {"sense": "the state of being old or becoming old", "level": "C2", "dict_examp": "He is starting to show his age.", "lear_examp": "Usually, as the saying goes, we grow wiser with age."}, {"sense": "at the young age of 8/17/25, etc.", "level": "C2", "dict_examp": "She first appeared on stage at the tender age of 12.", "lear_examp": "She met my father at the tender age of 14, and she soon knew that this was the man she wanted to stay with for the rest of her life."}]}]}, {"word": "against", "poses": [{"pos": "preposition", "senses": [{"sense": "competing with or opposing someone or something", "level": "A2", "dict_examp": "Germany are playing against Brazil in the final tonight.", "lear_examp": "I like it very much because I can play it on the Internet with all of my friends and I can also form a team to play against other teams in tournaments."}, {"sense": "next to and touching something", "level": "A2", "dict_examp": "Why don't we put the bed against the wall?", "lear_examp": "On your left there is a large window and on the right there is a desk between the two cupboards, they are against the wall."}, {"sense": "in the opposite direction to", "level": "B1", "dict_examp": "Commuting is not so bad when you are traveling against the traffic.", "lear_examp": "We had to fight against the wind and the rain."}, {"sense": "disagreeing with a plan or activity", "level": "B2", "dict_examp": "She spoke against the decision to close the school.", "lear_examp": "I intend to examine the facts for and against this problem."}, {"sense": "forbidden by a law", "level": "B2", "dict_examp": "It's against the law to leave a young child alone in the house.", "lear_examp": "Until that moment, Mary thought her uncle and his friends were smugglers and were doing things against the law."}, {"sense": "to have a reason not to like someone or something", "level": "C1", "dict_examp": "Ellen doesn't have anything against bowling either, so let's go!", "lear_examp": "If you have nothing against taking public transport, I suggest taking a bus."}, {"sense": "If you do something against someone's advice, wishes, etc., you do it although they have said you should not or must not.", "level": "C2", "dict_examp": "He flew there against his doctor's advice.", "lear_examp": "He was a very ambitious student who wasn't afraid to develop ideas in unconventional ways and pursue his research even against the advice of his supervisors."}, {"sense": "If you do or achieve something against all the odds, you succeed although you were not likely to.", "level": "C2", "dict_examp": "We won the game against all odds.", "lear_examp": "The stormy waters and heavy winds were a great challenge, and almost deemed it impossible for me to succeed, but against all odds I managed to defeat my fears."}]}]}, {"word": "aged", "poses": [{"pos": "adjective", "senses": [{"sense": "of the age of", "level": "A2", "dict_examp": "They've got one daughter, Isabel, aged 3.", "lear_examp": "It's a club for pupils aged between twelve and eighteen."}]}]}, {"word": "aggressively", "poses": [{"pos": "adverb", "senses": [{"sense": "in an aggressive way", "level": "B2", "dict_examp": "Small children often behave aggressively.", "lear_examp": ""}]}]}, {"word": "agreement", "poses": [{"pos": "noun", "senses": [{"sense": "a promise or decision made between two or more groups or people", "level": "B2", "dict_examp": "an agreement with the company", "lear_examp": "There was an attempt to cut down on using and producing sprays which destroy the ozone layer and an international agreement was signed."}, {"sense": "when people have the same opinion or make the same decision", "level": "B2", "dict_examp": "Are we all in agreement?", "lear_examp": "The decision of not taking that tour has already been made by general agreement."}]}]}, {"word": "ago", "poses": [{"pos": "adverb", "senses": [{"sense": "used to refer to a time in the past", "level": "A2", "dict_examp": "He left the house over an hour ago.", "lear_examp": "Two months ago I booked a trip to Malta."}, {"sense": "If something happened long ago, it happened a great amount of time ago.", "level": "C1", "dict_examp": "I think we met once, long ago.", "lear_examp": "Not so long ago, you could ring each Dutch doorbell of your choice at 6 pm and you'd find the whole family gathered around the kitchen table, having their supper."}]}]}, {"word": "aim", "poses": [{"pos": "noun", "senses": [{"sense": "the purpose of doing something, and what you hope to achieve", "level": "B1", "dict_examp": "He went to Paris with the aim of improving his French.", "lear_examp": "The aim was to get a picture of each person."}]}, {"pos": "verb", "senses": [{"sense": "to intend to achieve something", "level": "B1", "dict_examp": "I aim to be a millionaire by the time I'm 35.", "lear_examp": "Our English Club aims to help students with their English."}, {"sense": "to be intended to influence or affect a particular person or group", "level": "B2", "dict_examp": "These advertisements are specifically aimed at young people.", "lear_examp": "PIAZZA is too modern and is aimed at the young."}, {"sense": "to be intended to achieve a particular thing", "level": "C2", "dict_examp": "a plan aimed at reducing traffic", "lear_examp": "Working within projects aimed at improving local agricultural output, I stayed 3 years in South America."}]}]}, {"word": "agriculture", "poses": [{"pos": "noun", "senses": [{"sense": "farming", "level": "B2", "dict_examp": "Agriculture is still largely based on traditional methods in some countries.", "lear_examp": "People who live in big cities suffer from air pollution and noise, and villagers suffer from chemicals used for agriculture."}]}]}, {"word": "agent", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to deal with business for someone else", "level": "B2", "dict_examp": "Please contact our agent in Spain for further information.", "lear_examp": "I hope the agent will sell it soon."}, {"sense": "someone who tries to find out secret information, especially about another country", "level": "B2", "dict_examp": "a secret agent", "lear_examp": "She interrupted and told the man that she was a secret agent."}]}]}, {"word": "aggressive", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving in an angry and violent way toward another person", "level": "B2", "dict_examp": "aggressive behavior", "lear_examp": "At such moments he became angry and aggressive."}, {"sense": "using forceful methods and determined to succeed", "level": "C1", "dict_examp": "The company mounted an aggressive marketing campaign.", "lear_examp": "Our competitors pursue a more aggressive marketing strategy, despite the fact that they offer inferior products."}]}]}, {"word": "agenda", "poses": [{"pos": "noun", "senses": [{"sense": "a list of subjects that people will discuss at a meeting", "level": "C1", "dict_examp": "There are several items on the agenda.", "lear_examp": "Your memo was one of the points on the agenda for last week's meeting."}, {"sense": "important subjects that have to be dealt with", "level": "C2", "dict_examp": "Finding a job is at the top of my agenda.", "lear_examp": "Of course, the Temple de la Sagrada Familia was at the top of my agenda, but I could never imagine its beauty and its gigantic size by which I was really taken aback."}]}]}, {"word": "ahead", "poses": [{"pos": "adverb", "senses": [{"sense": "in front", "level": "B1", "dict_examp": "Turn left at the traffic light, and you'll see the hospital straight ahead.", "lear_examp": "Behind our school there was a beautiful forest and if you walked 200 meters straight ahead you would reach a clearing."}, {"sense": "in the future", "level": "B1", "dict_examp": "She has a difficult time ahead of her.", "lear_examp": "Even if you're satisfied with your life now, take a look 10 or 20 years ahead."}, {"sense": "having more points than someone else in a competition", "level": "B2", "dict_examp": "Barcelona was ahead after ten minutes.", "lear_examp": ""}]}, {"pos": "adjective", "senses": [{"sense": "before the time that was planned", "level": "C1", "dict_examp": "We finished the project ahead of schedule.", "lear_examp": "However, a bonus will be given if the project finishes ahead of schedule."}, {"sense": "making more progress than someone or something else", "level": "C2", "dict_examp": "Sue is ahead of everyone else in French.", "lear_examp": "I have always been a couple of steps ahead of my schoolmates and peers, not only in terms of scholastic pursuits, but in my opinions and desires as well."}]}]}, {"word": "aid", "poses": [{"pos": "noun", "senses": [{"sense": "help or support", "level": "C1", "dict_examp": "She went to the aid of a man trapped in his car.", "lear_examp": "If you have any trouble with something do not hesitate in requesting my aid."}, {"sense": "money, food, or equipment that is given to help a country or group of people", "level": "C1", "dict_examp": "Emergency aid was sent to the flood victims.", "lear_examp": "Another thing which they say is that in the past they gave aid to poorer countries for different projects."}, {"sense": "using something to help you", "level": "C1", "dict_examp": "She walks with the aid of a cane.", "lear_examp": "The newest computer can handle data that human brains cannot and therefore all scientific research is carried out with the aid of computers."}, {"sense": "a piece of equipment that helps you to do something", "level": "C1", "dict_examp": "teaching aids such as books and videos", "lear_examp": "In particular, the magazine could be considered as a rather good additional aid for someone studying the Greek language and culture."}]}, {"pos": "verb", "senses": [{"sense": "to help someone", "level": "C1", "dict_examp": "The project is designed to aid the homeless.", "lear_examp": "This kind of bad publicity will not aid the hospital in any way, but will instead keep people away from future events."}]}]}, {"word": "agency", "poses": [{"pos": "noun", "senses": [{"sense": "a business that provides a service", "level": "B1", "dict_examp": "an advertising/employment/real estate/travel agency", "lear_examp": "As you know I am employed in a travel agency and last week I started my new English class."}, {"sense": "an international or government organization", "level": "C1", "dict_examp": "the Environmental Protection Agency", "lear_examp": "Television conveys the weather forecasts and any warnings issued by the government agencies, such as flood alerts."}]}]}, {"word": "agree", "poses": [{"pos": "verb", "senses": [{"sense": "to have the same opinion as someone", "level": "A2", "dict_examp": "I agree with you.", "lear_examp": "Do you agree with me?"}, {"sense": "to decide something with someone", "level": "B1", "dict_examp": "We agreed to meet on Sunday.", "lear_examp": "We were not so sure which film we wanted to see but we agreed to see \"Blade 3\" at seven o'clock."}, {"sense": "to say you will do something that someone asks you to", "level": "B2", "dict_examp": "She agreed to help him.", "lear_examp": "When I came home, I told my mother everything and she agreed to put him up."}, {"sense": "If two descriptions, statements, etc., agree, they are the same.", "level": "C1", "dict_examp": "Her notes do not agree with what I remember happening.", "lear_examp": "This does not agree with the intentions of our Program."}, {"sense": "to think that something is correct or acceptable", "level": "B2", "dict_examp": "I don't agree with hunting.", "lear_examp": "I don't agree with keeping animals in zoos; I think that it's cruel and unnecessary."}]}]}, {"word": "air", "poses": [{"pos": "noun", "senses": [{"sense": "travel in an aircraft", "level": "A2", "dict_examp": "I don't travel much by air.", "lear_examp": "I will travel there by air."}, {"sense": "the mixture of gases that surrounds the earth and that we breathe", "level": "A2", "dict_examp": "I went outside to get some fresh air.", "lear_examp": "There are lots of different kinds of animals, lakes, fresh air and trees."}, {"sense": "the space above and around things", "level": "B2", "dict_examp": "He kicked the ball high in the air.", "lear_examp": "It was an old painting. In it, a man was holding his axe up in the air and was ready to hit a tree."}, {"sense": "played on television or radio", "level": "C1", "dict_examp": "His show is on the air from 11:00 to 11:30 Monday through Thursday.", "lear_examp": "As you can see, it’s probably the first chance to learn good English on T.V. Another surprising thing is that it's not on the air too late, so you can watch it without oversleeping in the morning."}, {"sense": "a particular appearance or quality", "level": "C2", "dict_examp": "He has an air of confidence.", "lear_examp": "The service is excellent and the atmosphere is quite nice, with an air of elegance."}, {"sense": "to get rid of bad feelings between two people or groups", "level": "C2", "dict_examp": "We had a big argument, but I think it helped clear the air.", "lear_examp": "I rushed into the room to cheer them up and clear the air, although I knew it was too late."}, {"sense": "to suddenly disappear in a mysterious way", "level": "C2", "dict_examp": "He was on the path ahead of me and then vanished into thin air.", "lear_examp": "Sitting on a couch and squeezed between my elderly aunts, I sincerely wished I could vanish into thin air."}, {"sense": "someone or something that is new, different, and exciting", "level": "C2", "dict_examp": "Having Eve around has been a breath of fresh air.", "lear_examp": "Should this be everything the Town Council has promised, it will bring a breath of fresh air for our local youth."}]}]}, {"word": "airport", "poses": [{"pos": "noun", "senses": [{"sense": "a place where aircraft regularly take off and land, with buildings for passengers to wait in", "level": "A2", "dict_examp": "an international airport", "lear_examp": "The lake is not far from the airport."}]}]}, {"word": "albeit", "poses": [{"pos": "conjunction", "senses": [{"sense": "although", "level": "C2", "dict_examp": "He tried, albeit without success.", "lear_examp": "If and when homework, household chores and social duties had been dealt with, we were free to pursue our own designs, albeit usually hampered by a younger child tagging along."}]}]}, {"word": "alcohol", "poses": [{"pos": "noun", "senses": [{"sense": "drinks such as wine and beer which can make you drunk", "level": "A2", "dict_examp": "Most wines contain between 10% and 15% alcohol.", "lear_examp": "The party was excellent. We danced, ate, drank alcohol and..."}]}]}, {"word": "alarming", "poses": [{"pos": "adjective", "senses": [{"sense": "causing worry or fear", "level": "C1", "dict_examp": "alarming news", "lear_examp": "Moreover, the alarming frequency of heart attacks in Poland has made people stop eating too much fat."}]}]}, {"word": "album", "poses": [{"pos": "noun", "senses": [{"sense": "a book in which you keep photographs, stamps, etc.", "level": "A2", "dict_examp": "We looked through his photo albums together.", "lear_examp": "He gave me a photo album."}, {"sense": "several songs or pieces of music on a CD, a record, etc.", "level": "B1", "dict_examp": "They've just make/recorded a new album.", "lear_examp": "I got a CD-player and a new album by U2 and a new book by Jeanette Winterson."}]}]}, {"word": "alert", "poses": [{"pos": "adjective", "senses": [{"sense": "quick to notice and react to things around you", "level": "C1", "dict_examp": "A young dog should be alert and playful.", "lear_examp": "A little bit of tension is alright - I guess it keeps you alert while driving."}]}, {"pos": "verb", "senses": [{"sense": "to warn someone of a possibly dangerous situation", "level": "C2", "dict_examp": "The auto manufacturer alerted owners to a problem with the  window and asked that they bring the car in to be checked.", "lear_examp": "Karl Marx alerted us all to the fact that work can cause alienation, and that repetitive tasks, or tasks which do not involve a great deal of interaction with other human beings, can make us feel estranged."}]}, {"pos": "noun", "senses": [{"sense": "a warning about a possibly dangerous situation", "level": "C1", "dict_examp": "a traffic alert", "lear_examp": "Moreover, the Television conveys the most needed day-to-day weather forecasts and any warnings issued by the government agencies, such as flood alerts."}]}]}, {"word": "alike", "poses": [{"pos": "adjective", "senses": [{"sense": "similar", "level": "B1", "dict_examp": "The children all look very alike.", "lear_examp": "First of all, Jem and Joss Merlyn look alike physically."}]}, {"pos": "adverb", "senses": [{"sense": "in a similar way", "level": "B2", "dict_examp": "We think alike.", "lear_examp": ""}, {"sense": "used after referring to two groups of people or things to show that both groups are included", "level": "B2", "dict_examp": "Friends and family alike were shocked by the news of her death.", "lear_examp": "It was indeed a great treat for old and young alike."}]}]}, {"word": "aircraft", "poses": [{"pos": "noun", "senses": [{"sense": "any vehicle, with or without an engine, which can fly, such as a plane or helicopter", "level": "B2", "dict_examp": "military/commercial aircraft", "lear_examp": "They have all the Swedish aircraft that have ever been built."}]}]}, {"word": "air force", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a country's military organization that uses aircraft to fight wars", "level": "B1", "dict_examp": "an air force pilot", "lear_examp": "During the day you can visit all of our museums or schools or even the air force base, which is open from 9:00 until 6:00."}]}]}, {"word": "all", "poses": [{"pos": "determiner", "senses": [{"sense": "every person or thing in a group", "level": "A1", "dict_examp": "I've seen all of his movies.", "lear_examp": "I hope you are all well."}, {"sense": "the whole of a period of time", "level": "A1", "dict_examp": "I've been studying all day.", "lear_examp": "I spent all day at the beach."}, {"sense": "the whole amount of something", "level": "A2", "dict_examp": "I've spent all my money.", "lear_examp": "I have left my purse at your home. I have all my money in it."}, {"sense": "many different types of something", "level": "A2", "dict_examp": "They had all sorts of jewelry for sale.", "lear_examp": "I like all sorts of music but I prefer urban music!"}, {"sense": "used to say that you hope someone will be happy, healthy, successful, etc., often when saying goodbye", "level": "A2", "dict_examp": "Well, all the best - it was nice meeting you.", "lear_examp": "I want to wish you all the best!"}, {"sense": "continuously", "level": "A2", "dict_examp": "I wish you'd stop criticizing me all the time.", "lear_examp": "He laughs all the time."}, {"sense": "the only thing", "level": "B1", "dict_examp": "All I remember is waking up in the hospital.", "lear_examp": "Actually, I lost my job last week. All I can do is buy a computer and get on the internet to find another job."}, {"sense": "used for emphasis in questions or negative statements, to mean in any way or of any type", "level": "B1", "dict_examp": "Can I help at all?", "lear_examp": "The sun was shining and there were no clouds at all, so we could see the light blue sky."}, {"sense": "most importantly", "level": "B1", "dict_examp": "Above all, I'd like to thank my family.", "lear_examp": "She is a very nice person and above all, she is really cheerful."}, {"sense": "used to add information that shows that what you have just said is true", "level": "B1", "dict_examp": "You can't expect to be perfect - after all, it was only your first lesson.", "lear_examp": "I stopped talking with my friends, but not for long -  after all, we are friends. Anyway, I'm planning nice things for the next April 1st."}, {"sense": "everything is in a good or acceptable state", "level": "B1", "dict_examp": "I hope all is well with Jack.", "lear_examp": "I hope all's well."}, {"sense": "used for saying that other similar things are included or that the whole of a situation is considered", "level": "B1", "dict_examp": "He told us about his school and all.", "lear_examp": "I really enjoy shopping for clothes, but not only for clothes, also for things like earrings and all that!"}, {"sense": "used to show the total amount of something", "level": "B2", "dict_examp": "Some of the children came, so there were 15 of us in all.", "lear_examp": "Secondly, even though most people liked the group RADIANT, they only played for 35 minutes in all."}, {"sense": "suddenly", "level": "B2", "dict_examp": "All of a sudden, he came running in.", "lear_examp": "All of a sudden, a weird creature popped into his dream."}, {"sense": "repeated from the beginning", "level": "B2", "dict_examp": "We had to start all over again.", "lear_examp": "After that I went back to my home in Ribeirao Preto to begin my routine all over again."}, {"sense": "used to say that something happened or was true although you did not expect it to happen or be true", "level": "C1", "dict_examp": "Helen couldn't come to the party after all.", "lear_examp": "Cars still enter the city so there will be pollution after all."}, {"sense": "very late at night, until early morning, or almost all the time", "level": "C1", "dict_examp": "Our neighbors play loud music at all hours of the day and night.", "lear_examp": "This causes traffic jams at all hours of the day."}, {"sense": "suddenly", "level": "C1", "dict_examp": "All at once he stood up and walked out of the room.", "lear_examp": "All at once, everything started to work again."}, {"sense": "used for saying that something is true in general if you think about all its aspects", "level": "C1", "dict_examp": "The show was a great success, all things considered.", "lear_examp": "All things considered, it seems like \"Kavanagh Catering Services\" would be most suitable for the students."}, {"sense": "despite", "level": "C2", "dict_examp": "For all her qualifications, she's useless at the job.", "lear_examp": "For all of his desire to be strong, Okonkwo is haunted by fear."}]}, {"pos": "adverb", "senses": [{"sense": "completely or very", "level": "A2", "dict_examp": "The cake was all eaten last night.", "lear_examp": "I'm going to tell you all about it."}, {"sense": "in every place", "level": "A2", "dict_examp": "He's traveled all over the world.", "lear_examp": "The people in the class are from all over the world."}, {"sense": "from the beginning of a period of time", "level": "B2", "dict_examp": "I knew all along that it was a mistake.", "lear_examp": "In the future the key word for fashion will be comfort as this is basically what everyone has been wanting all along."}, {"sense": "considering everything", "level": "B2", "dict_examp": "All in all, it was a great vacation.", "lear_examp": "All in all, nobody cares about air pollution and the environment in general."}, {"sense": "in or to many different places", "level": "B2", "dict_examp": "There were dirty dishes all over the place.", "lear_examp": "There was plenty of food and drinks, and there were about 180 guests dancing and chatting all over the place."}, {"sense": "used to show that you do not agree with something or that you are annoyed about something", "level": "C1", "dict_examp": "It's all very well for her to say everything's fine, she doesn't have to live here.", "lear_examp": "That's all very well for most of the people but according to my desires it's not enough."}, {"sense": "to be ready", "level": "C1", "dict_examp": "We were all set to go when the phone rang.", "lear_examp": "So, there you go. I'm all set!"}, {"sense": "much better, easier, more exciting, etc.", "level": "C2", "dict_examp": "The journey was all the more dangerous because of the bad weather.", "lear_examp": "He had to overcome great obstacles in his professional and private lives, which makes his achievements all the more remarkable."}, {"sense": "almost", "level": "C2", "dict_examp": "The movie was all but over by the time we got there.", "lear_examp": "He could all but hear their stomachs rumble."}]}]}, {"word": "air conditioning", "poses": [{"pos": "noun", "senses": [{"sense": "the system used for keeping the air in a building or vehicle cool", "level": "B1", "dict_examp": "I wish my car had air conditioning.", "lear_examp": "The rooms are big and there's cable TV and air conditioning."}]}]}, {"word": "airline", "poses": [{"pos": "noun", "senses": [{"sense": "a company that provides regular flights to places", "level": "B1", "dict_examp": "What airline did you fly?", "lear_examp": "She explained the situation to the authorities and because there was no flight back to London, the airline had no choice but to pay for her stay."}]}]}, {"word": "alive", "poses": [{"pos": "adjective", "senses": [{"sense": "living, not dead", "level": "B1", "dict_examp": "All of my grandparents are still alive.", "lear_examp": "I was very happy that my father was still alive."}, {"sense": "to continue to live or exist and be full of energy, or to be popular or successful", "level": "C2", "dict_examp": "Jennifer is alive and well and living in New Zealand.", "lear_examp": "Little did they know that Patrik was alive and well and planning to return to the village next spring."}, {"sense": "full of activity and excitement", "level": "C2", "dict_examp": "The park was alive with the sound of laughter.", "lear_examp": "Normally you would pass by without noticing it, but once a year Roskilde comes alive."}, {"sense": "continuing to exist", "level": "C2", "dict_examp": "Local people are fighting to keep the language alive.", "lear_examp": "Thirdly, it keeps the village alive, since many people from other villages come to celebrate with them, and our national heritage (traditional songs, dances, costumes) is kept alive too."}]}]}, {"word": "alcoholic", "poses": [{"pos": "adjective", "senses": [{"sense": "containing alcohol", "level": "B1", "dict_examp": "alcoholic beverages", "lear_examp": "I'm only 15 years old and not allowed to drink alcoholic drinks."}, {"sense": "regularly drinking too much alcohol and unable to stop the habit", "level": "C2", "dict_examp": "an alcoholic friend/brother", "lear_examp": "Numerous examples of divorced couples, alcoholic parents, orphans, and children without principles, should stay in our minds."}]}, {"pos": "noun", "senses": [{"sense": "someone who regularly drinks too much alcohol and cannot stop the habit", "level": "C2", "dict_examp": "He became an alcoholic when his wife left him.", "lear_examp": "The quality of the orchestra was poor - it only consisted of amateurs - and the conductor was drunk - he was an alcoholic."}]}]}, {"word": "alarm", "poses": [{"pos": "noun", "senses": [{"sense": "a loud noise or flashing light that warns you of danger", "level": "B1", "dict_examp": "a burglar/car/fire/smoke alarm", "lear_examp": "It turned out that the fire alarm had gone off and they had to evacuate the building."}, {"sense": "a clock or a device in a watch, cell phone, etc. that makes a noise to wake you", "level": "B1", "dict_examp": "The alarm went off at 5:30 and she got up immediately.", "lear_examp": "Suddenly the alarm started to ring and I woke up to go to school."}, {"sense": "a sudden feeling of fear or worry that something bad might happen", "level": "C2", "dict_examp": "There's no need for alarm - everything is fine.", "lear_examp": "Fortunately, her soothing voice damped down any sense of alarm."}]}, {"pos": "verb", "senses": [{"sense": "to make someone worried or frightened", "level": "C1", "dict_examp": "I don't want to alarm you but he really should be here by now.", "lear_examp": "What alarmed us the most was the daring use of speculation by the author."}]}]}, {"word": "alarm clock", "poses": [{"pos": "noun", "senses": [{"sense": "a clock that you can set to wake you up at a particular time with a loud noise", "level": "A2", "dict_examp": "My  alarm clock went off at 5:00.", "lear_examp": "He gave me an alarm clock so I won't be late for school any more."}]}]}, {"word": "airplane", "poses": [{"pos": "noun", "senses": [{"sense": "a vehicle that flies and has at least one engine and wings", "level": "A2", "dict_examp": "She has her own private airplane.", "lear_examp": "I will travel by airplane and I will arrive at half past three."}]}]}, {"word": "allege", "poses": [{"pos": "verb", "senses": [{"sense": "to say that something is true or state something as a fact without giving proof", "level": "C2", "dict_examp": "Administration of the program is alleged to have cost $15,000 last month.", "lear_examp": "Advocates of perpetual economic growth allege that the world in which we live is a better place compared to what it was a long time ago."}]}]}, {"word": "allied", "poses": [{"pos": "adjective", "senses": [{"sense": "joined by a formal agreement", "level": "C2", "dict_examp": "the allied powers", "lear_examp": "During the Second World War, he joined the US Navy and was then sent on a mission to Brazil with the aim of patrolling the coasts to avoid a German bombing of allied ships."}]}]}, {"word": "allow", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone permission for something", "level": "B1", "dict_examp": "You're not allowed to talk during the exam.", "lear_examp": "I have very strict teachers and they won't allow me to enter the classroom if I'm late."}, {"sense": "to plan to use a particular amount of money, time, etc., for something", "level": "C1", "dict_examp": "Allow three hours for the whole trip.", "lear_examp": "You must be prepared to allow for an extra quarter of an hour."}, {"sense": "to make it possible for someone to do something", "level": "C1", "dict_examp": "The extra money will allow me to upgrade my computer.", "lear_examp": "These activities allow people to forget about their problems, to enjoy themselves and also to communicate with others."}, {"sense": "to not prevent something from happening", "level": "C2", "dict_examp": "They have allowed the problem to get worse.", "lear_examp": "A unanimous effort has to be made in order to improve the situation in education instead of allowing it to deteriorate."}]}]}, {"word": "almost", "poses": [{"pos": "adverb", "senses": [{"sense": "nearly but not quite", "level": "A2", "dict_examp": "I almost missed the bus.", "lear_examp": "Did you know that almost the whole class came to my party?"}]}]}, {"word": "allowance", "poses": [{"pos": "noun", "senses": [{"sense": "money that you are given regularly", "level": "C1", "dict_examp": "a clothing allowance", "lear_examp": "She spends most of her allowance quickly and is then without money for the rest of the month."}, {"sense": "to remember that someone has a disadvantage which is not their fault when you are judging their behavior or work", "level": "C2", "dict_examp": "They made allowances for the fact that he was ill.", "lear_examp": "I would say Mr. Stevens is a victim of his sense of duty, which makes him think of marriage as a traitor's act, but I don't know to what extent we should make allowances for his strong convictions."}]}]}, {"word": "ally", "poses": [{"pos": "noun", "senses": [{"sense": "someone who supports you, especially when other people are against you", "level": "C1", "dict_examp": "He is generally considered to be the Prime Minister's closest political ally.", "lear_examp": "The participants are under pressure and they have to find allies and make decisions."}, {"sense": "a country that has agreed to help another country, especially in a war", "level": "C2", "dict_examp": "During World War One, Turkey and Germany were allies.", "lear_examp": "So the allies didn't exclude the Germanies from the world community, including organizations like NATO, the Warsaw Pact or the UN."}]}]}, {"word": "allegation", "poses": [{"pos": "noun", "senses": [{"sense": "when you say that someone has done something wrong or illegal, without proof that this is true", "level": "C1", "dict_examp": "The  allegations of corruption were not true.", "lear_examp": "In contrast to your allegations, our study shows that a vast majority (78%) use Greendale Park for recreation as often as once a week."}]}]}, {"word": "along", "poses": [{"pos": "preposition", "senses": [{"sense": "from one part of a road, river, etc. to another", "level": "A2", "dict_examp": "a romantic walk along the beach/river", "lear_examp": "Last night, we walked along the Thames."}, {"sense": "in a line next to or beside something long", "level": "B1", "dict_examp": "a row of houses along the river", "lear_examp": "The Norwich river is wonderful and I enjoyed myself seeing all the white houses with their gardens along it."}, {"sense": "based on and similar to something", "level": "C2", "dict_examp": "He gave a talk along the lines of the one he gave in Oxford.", "lear_examp": "Imagine one is encouraged by friends and institutions for their 'different' artistic or other activities, even if their works are not along the lines of 'acceptable' norms and tradition."}]}, {"pos": "adverb", "senses": [{"sense": "moving forward", "level": "B1", "dict_examp": "We were just walking along, chatting.", "lear_examp": ""}, {"sense": "with you", "level": "B1", "dict_examp": "Why don't you take him along with you when you go?", "lear_examp": "My boyfriend came along with me."}, {"sense": "at a particular place on a road, river, etc.", "level": "B2", "dict_examp": "Somewhere along this road there's a garage.", "lear_examp": "She told me that along the road there are several places to visit, like a castle which is open to the public."}, {"sense": "from the beginning of a period of time", "level": "B2", "dict_examp": "I knew all along that it was a mistake.", "lear_examp": "In the future the key word for fashion will be comfort as this is basically what everyone has been wanting all along."}, {"sense": "in addition to someone or something else", "level": "B2", "dict_examp": "Now we’ve got hospital bills along with our usual expenses.", "lear_examp": "However, along with the good times, there also came the bad, terrible, awful ones."}]}]}, {"word": "allocate", "poses": [{"pos": "verb", "senses": [{"sense": "to give some time, money, space, etc., to be used for a particular purpose", "level": "C1", "dict_examp": "We are discussing how to allocate use of the sports fields to the various teams.", "lear_examp": "We all know about globalization, which means producing, allocating resources, and distributing the products everywhere in the world."}]}]}, {"word": "all right", "poses": [{"pos": "adjective", "senses": [{"sense": "happening successfully or without problems", "level": "A1", "dict_examp": "Did the interview go all right?", "lear_examp": "Tomorrow I have the day off, so everything is all right!"}, {"sense": "not hurt or sick", "level": "A2", "dict_examp": "\"Harry just slipped on the ice.\" \"Oh! Is he all right?\"", "lear_examp": "Hi Jo How are you? I hope you are all right."}, {"sense": "used as an answer when someone thanks you, or something you say when someone says they are sorry, to show that you are not angry", "level": "A2", "dict_examp": "\"Thanks for getting the tickets.\" \"That's all right.\"", "lear_examp": "That's all right. Don't worry about it."}, {"sense": "used to ask if you can do something or to say that someone can do something", "level": "A2", "dict_examp": "Is it  all right if I put some music on?", "lear_examp": "I asked him if it was all right if I stayed in his house and Mike answered: \"Of course\"."}, {"sense": "good enough, although not very good", "level": "B1", "dict_examp": "\"What did you think of the movie?\" \"It was all right. Nothing special.\"", "lear_examp": "We arrived by ship and the trip was all right except my friend Tim was ill."}]}, {"pos": "exclamation", "senses": [{"sense": "used to agree to a suggestion or request", "level": "A1", "dict_examp": "\"How about going out for dinner?\" \"All right.\"", "lear_examp": "All right, tomorrow you get my jacket and wait for me at the bus stop."}]}]}, {"word": "alleged", "poses": [{"pos": "adjective", "senses": [{"sense": "believed to be true, but not proved", "level": "C1", "dict_examp": "an alleged attack", "lear_examp": "Besides, as far as the alleged \"downpour of rain\" is concerned, there was, in reality, only a small April shower which lasted not more than 10 minutes."}]}]}, {"word": "all", "poses": [{"pos": "determiner", "senses": [{"sense": "every person or thing in a group", "level": "A1", "dict_examp": "I've seen all of his movies.", "lear_examp": "I hope you are all well."}, {"sense": "the whole of a period of time", "level": "A1", "dict_examp": "I've been studying all day.", "lear_examp": "I spent all day at the beach."}, {"sense": "the whole amount of something", "level": "A2", "dict_examp": "I've spent all my money.", "lear_examp": "I have left my purse at your home. I have all my money in it."}, {"sense": "many different types of something", "level": "A2", "dict_examp": "They had all sorts of jewelry for sale.", "lear_examp": "I like all sorts of music but I prefer urban music!"}, {"sense": "used to say that you hope someone will be happy, healthy, successful, etc., often when saying goodbye", "level": "A2", "dict_examp": "Well, all the best - it was nice meeting you.", "lear_examp": "I want to wish you all the best!"}, {"sense": "continuously", "level": "A2", "dict_examp": "I wish you'd stop criticizing me all the time.", "lear_examp": "He laughs all the time."}, {"sense": "the only thing", "level": "B1", "dict_examp": "All I remember is waking up in the hospital.", "lear_examp": "Actually, I lost my job last week. All I can do is buy a computer and get on the internet to find another job."}, {"sense": "used for emphasis in questions or negative statements, to mean in any way or of any type", "level": "B1", "dict_examp": "Can I help at all?", "lear_examp": "The sun was shining and there were no clouds at all, so we could see the light blue sky."}, {"sense": "most importantly", "level": "B1", "dict_examp": "Above all, I'd like to thank my family.", "lear_examp": "She is a very nice person and above all, she is really cheerful."}, {"sense": "used to add information that shows that what you have just said is true", "level": "B1", "dict_examp": "You can't expect to be perfect - after all, it was only your first lesson.", "lear_examp": "I stopped talking with my friends, but not for long -  after all, we are friends. Anyway, I'm planning nice things for the next April 1st."}, {"sense": "everything is in a good or acceptable state", "level": "B1", "dict_examp": "I hope all is well with Jack.", "lear_examp": "I hope all's well."}, {"sense": "used for saying that other similar things are included or that the whole of a situation is considered", "level": "B1", "dict_examp": "He told us about his school and all.", "lear_examp": "I really enjoy shopping for clothes, but not only for clothes, also for things like earrings and all that!"}, {"sense": "used to show the total amount of something", "level": "B2", "dict_examp": "Some of the children came, so there were 15 of us in all.", "lear_examp": "Secondly, even though most people liked the group RADIANT, they only played for 35 minutes in all."}, {"sense": "suddenly", "level": "B2", "dict_examp": "All of a sudden, he came running in.", "lear_examp": "All of a sudden, a weird creature popped into his dream."}, {"sense": "repeated from the beginning", "level": "B2", "dict_examp": "We had to start all over again.", "lear_examp": "After that I went back to my home in Ribeirao Preto to begin my routine all over again."}, {"sense": "used to say that something happened or was true although you did not expect it to happen or be true", "level": "C1", "dict_examp": "Helen couldn't come to the party after all.", "lear_examp": "Cars still enter the city so there will be pollution after all."}, {"sense": "very late at night, until early morning, or almost all the time", "level": "C1", "dict_examp": "Our neighbors play loud music at all hours of the day and night.", "lear_examp": "This causes traffic jams at all hours of the day."}, {"sense": "suddenly", "level": "C1", "dict_examp": "All at once he stood up and walked out of the room.", "lear_examp": "All at once, everything started to work again."}, {"sense": "used for saying that something is true in general if you think about all its aspects", "level": "C1", "dict_examp": "The show was a great success, all things considered.", "lear_examp": "All things considered, it seems like \"Kavanagh Catering Services\" would be most suitable for the students."}, {"sense": "despite", "level": "C2", "dict_examp": "For all her qualifications, she's useless at the job.", "lear_examp": "For all of his desire to be strong, Okonkwo is haunted by fear."}]}, {"pos": "adverb", "senses": [{"sense": "completely or very", "level": "A2", "dict_examp": "The cake was all eaten last night.", "lear_examp": "I'm going to tell you all about it."}, {"sense": "in every place", "level": "A2", "dict_examp": "He's traveled all over the world.", "lear_examp": "The people in the class are from all over the world."}, {"sense": "from the beginning of a period of time", "level": "B2", "dict_examp": "I knew all along that it was a mistake.", "lear_examp": "In the future the key word for fashion will be comfort as this is basically what everyone has been wanting all along."}, {"sense": "considering everything", "level": "B2", "dict_examp": "All in all, it was a great vacation.", "lear_examp": "All in all, nobody cares about air pollution and the environment in general."}, {"sense": "in or to many different places", "level": "B2", "dict_examp": "There were dirty dishes all over the place.", "lear_examp": "There was plenty of food and drinks, and there were about 180 guests dancing and chatting all over the place."}, {"sense": "used to show that you do not agree with something or that you are annoyed about something", "level": "C1", "dict_examp": "It's all very well for her to say everything's fine, she doesn't have to live here.", "lear_examp": "That's all very well for most of the people but according to my desires it's not enough."}, {"sense": "to be ready", "level": "C1", "dict_examp": "We were all set to go when the phone rang.", "lear_examp": "So, there you go. I'm all set!"}, {"sense": "much better, easier, more exciting, etc.", "level": "C2", "dict_examp": "The journey was all the more dangerous because of the bad weather.", "lear_examp": "He had to overcome great obstacles in his professional and private lives, which makes his achievements all the more remarkable."}, {"sense": "almost", "level": "C2", "dict_examp": "The movie was all but over by the time we got there.", "lear_examp": "He could all but hear their stomachs rumble."}]}]}, {"word": "alliance", "poses": [{"pos": "noun", "senses": [{"sense": "an agreement between people, countries, political parties, etc., to work together to achieve something", "level": "C2", "dict_examp": "The mayor wants to form an alliance with local business leaders.", "lear_examp": "They took the opportunity and made an alliance with all the cities in Southern Greece under their command."}]}]}, {"word": "allocation", "poses": [{"pos": "noun", "senses": [{"sense": "the providing of some money, time, space, etc., for a particular purpose", "level": "C2", "dict_examp": "the allocation of funds/resources", "lear_examp": "However, the latter countries do differ in their allocation of money to services, with the US spending 0.3 per cent of the GDP and Spain spending only 0.1 per cent."}, {"sense": "a part of the money, time, space, etc., which can be used for a particular purpose", "level": "C2", "dict_examp": "The budget includes an allocation for flood control along the river.", "lear_examp": "It is approximately equal to the US in government allocations to child support, but it is still behind Germany (0.25% vs. 2%)."}]}]}, {"word": "alone", "poses": [{"pos": "adjective", "senses": [{"sense": "without other people", "level": "A2", "dict_examp": "He likes being alone in the house.", "lear_examp": "She doesn't want to go alone."}, {"sense": "to stop talking to or annoying someone", "level": "B2", "dict_examp": "Leave him alone, he's tired.", "lear_examp": "\"Leave me alone, you monster,\" I said in panic."}, {"sense": "used to emphasize that something is more impossible than another thing", "level": "C1", "dict_examp": "You couldn't trust her to look after your dog, let alone your child.", "lear_examp": "We are surrounded by amazing pieces of technology which we do not fully understand, let alone use to their full capacity."}, {"sense": "used to emphasize that only one person or thing is involved", "level": "C2", "dict_examp": "Last year alone the company made a million dollars.", "lear_examp": "The decision was hers and hers alone."}]}]}, {"word": "allegedly", "poses": [{"pos": "adverb", "senses": [{"sense": "used to say something is thought to be true but is not proved", "level": "C2", "dict_examp": "Someone at the company allegedly had lost the records.", "lear_examp": "Nevertheless, nowadays, people allegedly live longer than they did in the past."}]}]}, {"word": "alphabet", "poses": [{"pos": "noun", "senses": [{"sense": "a set of letters arranged in a fixed order which is used for writing a language", "level": "B1", "dict_examp": "the Cyrillic alphabet", "lear_examp": "They should learn the normal alphabet and handwriting because it is more friendly to write a letter to a friend."}]}]}, {"word": "a.m.", "poses": [{"pos": "adverb", "senses": [{"sense": "used to refer to a time between twelve o'clock at night and twelve o'clock in the middle of the day", "level": "A1", "dict_examp": "We're open between 9 a.m. and 5 p.m. daily.", "lear_examp": "The class starts at 10:00 a.m. and it finishs at 11:00 a.m. It's one hour."}]}]}, {"word": "amateur", "poses": [{"pos": "adjective", "senses": [{"sense": "doing something as a hobby and not as your job", "level": "C1", "dict_examp": "an amateur photographer", "lear_examp": "Finally I would like to mention that I feel very confident in front of cameras, since I am an amateur actor."}]}, {"pos": "noun", "senses": [{"sense": "someone who does something as a hobby and not as their job", "level": "C1", "dict_examp": "This tennis tournament is open to both amateurs and professionals.", "lear_examp": "What I want to explain is that if an amateur sees a professional swimmer winning while wearing our equipment, he is surely going to think that our products helped him succeed, so the amateur is going to buy our equipment too."}, {"sense": "someone who is not good at what they do", "level": "C1", "dict_examp": "I won't be giving them any more work - they're a bunch of amateurs.", "lear_examp": "I admit that I was an amateur, which is why I did not try to do any special \"tricks\" to impress all those who were watching me."}]}]}, {"word": "amazing", "poses": [{"pos": "adjective", "senses": [{"sense": "very good or impressive in some way", "level": "A2", "dict_examp": "This wine is really amazing.", "lear_examp": "I bought a new cell phone and it is amazing."}, {"sense": "extremely surprising", "level": "B1", "dict_examp": "It's amazing to think that the managing director is only 23.", "lear_examp": "Dear Richard, It's amazing you didn't forget my birthday."}]}]}, {"word": "alteration", "poses": [{"pos": "noun", "senses": [{"sense": "a change, or the process of changing something", "level": "C1", "dict_examp": "We've made a few alterations to the kitchen.", "lear_examp": "I hope that my alterations don't give you too much trouble, but I really think that these changes are necessary for full satisfaction among our members."}]}]}, {"word": "amazement", "poses": [{"pos": "noun", "senses": [{"sense": "extreme surprise", "level": "B2", "dict_examp": "She stared in amazement.", "lear_examp": "Then, to her amazement, she saw him with another girl."}]}]}, {"word": "aloud", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that other people can hear", "level": "B1", "dict_examp": "He read her letter aloud to the rest of the family.", "lear_examp": "Thinking aloud is an old habit of mine."}]}]}, {"word": "ambulance", "poses": [{"pos": "noun", "senses": [{"sense": "a special vehicle used to take ill or injured people to the hospital", "level": "B1", "dict_examp": "I called for an ambulance.", "lear_examp": "She called for an ambulance which came at once."}]}]}, {"word": "alternatively", "poses": [{"pos": "adverb", "senses": [{"sense": "used to suggest another possibility", "level": "B2", "dict_examp": "We could go to the Indian restaurant, or alternatively, we could try that new Italian place.", "lear_examp": "Alternatively, I suggest that you should invite a famous writer."}]}]}, {"word": "ambassador", "poses": [{"pos": "noun", "senses": [{"sense": "the main official sent by a government of a country to represent it in another country", "level": "B2", "dict_examp": "Britain's ambassador in Moscow has refused to comment.", "lear_examp": "On the first floor is the \"star'' of the museum: a splendid grand piano built in 1893, which was offered by the Queen to the French ambassador in 1895."}]}]}, {"word": "also", "poses": [{"pos": "adverb", "senses": [{"sense": "in addition", "level": "A1", "dict_examp": "She's a photographer and also writes books.", "lear_examp": "I also have a dog and I like to go for a walk with him."}]}]}, {"word": "alongside", "poses": [{"pos": "adverb", "senses": [{"sense": "next to someone or something", "level": "C1", "dict_examp": "A car pulled up alongside ours.", "lear_examp": "The skyline is filled with huge chimneys displacing tons of gases into the air; millions of vehicles are moving on a highway alongside a dead river, where life flourished a few decades ago."}, {"sense": "together with someone", "level": "C1", "dict_examp": "She enjoyed working alongside such famous actors.", "lear_examp": "Also he worked alongside me at another travel agency for 6 months."}]}]}, {"word": "ambition", "poses": [{"pos": "noun", "senses": [{"sense": "something you want to achieve", "level": "B1", "dict_examp": "His ambition is to run his own business.", "lear_examp": "Learning English is one of my ambitions."}, {"sense": "a strong feeling that you want to be successful or powerful", "level": "B2", "dict_examp": "My sister always had more ambition than I did.", "lear_examp": "Love, hate, ambition and fear of losing are the main subjects for Orson Welles and Tim Burton, the directors of these two films."}]}]}, {"word": "already", "poses": [{"pos": "adverb", "senses": [{"sense": "before now, or before a particular time in the past", "level": "A2", "dict_examp": "I asked him to come to the exhibition but he'd already seen it.", "lear_examp": "Juliana, I am going to start to paint my bedroom tomorrow. I have already bought the paint."}, {"sense": "used to say that something has happened earlier than you expected", "level": "B1", "dict_examp": "Are you buying Christmas cards already? It's only September!", "lear_examp": "Since I have already reserved a room for myself, I am now sitting on the balcony, watching the beautiful views of the beach and tall pine trees."}]}]}, {"word": "always", "poses": [{"pos": "adverb", "senses": [{"sense": "every time, or at all times", "level": "A1", "dict_examp": "I always walk to work.", "lear_examp": "I always try to do my best, because I want to be a good student."}, {"sense": "at all times in the past", "level": "A2", "dict_examp": "We've always lived here.", "lear_examp": "I always wanted a phone with mp3 and bluetooth."}, {"sense": "forever", "level": "A2", "dict_examp": "I'll always remember you.", "lear_examp": "That was the best weekend of my life. I'll always remember it."}, {"sense": "used to suggest something", "level": "B1", "dict_examp": "You can always stay with us if you miss your train.", "lear_examp": "Watching them painting is better than seeing their art in any museum, and you can always do some sightseeing through our historical ruins, our mountains or villages."}, {"sense": "again and again, often in an annoying way", "level": "B2", "dict_examp": "He's always losing his keys.", "lear_examp": "I am always trying to convince my friend Maria of these dangers."}]}]}, {"word": "amid", "poses": [{"pos": "preposition", "senses": [{"sense": "while something else is happening", "level": "C1", "dict_examp": "Security was increased amid fears of further terrorist attacks.", "lear_examp": "They are involved so much with their occupation that they will respond to an emergency call even when they are amid sweet dreams or having a joyful time with their loved ones."}, {"sense": "among", "level": "C2", "dict_examp": "a village set amid rolling hills", "lear_examp": "So we are mere fading stars in a huge sky, unsubjected to the elapse of time and instead of following the ancient saying \"carpe diem\", we get lost amid other stars."}]}]}, {"word": "amendment", "poses": [{"pos": "noun", "senses": [{"sense": "a change in the words of a document, or the process of doing this", "level": "C1", "dict_examp": "to make an amendment to the human rights law", "lear_examp": "Its really unfair  of him as there should be some amendments in this law for people who are physically challenged."}]}]}, {"word": "ambiguous", "poses": [{"pos": "adjective", "senses": [{"sense": "having more than one possible meaning", "level": "C2", "dict_examp": "an ambiguous statement", "lear_examp": "It is hard to choose the right option as the advice given often seems ambiguous."}]}]}, {"word": "alphabetical", "poses": [{"pos": "adjective", "senses": [{"sense": "arranged in the same order as the letters of the alphabet", "level": "B2", "dict_examp": "an alphabetical list", "lear_examp": "She looked again at the strange words and then she understood. Each letter had been replaced by the next one in the alphabetical order."}]}]}, {"word": "altogether", "poses": [{"pos": "adverb", "senses": [{"sense": "in total", "level": "B1", "dict_examp": "There were twenty people there altogether.", "lear_examp": "They cost 1700 baht altogether."}, {"sense": "completely", "level": "B2", "dict_examp": "She wrote less and less often, and eventually she stopped altogether.", "lear_examp": "I don't altogether agree with this fact."}, {"sense": "when you consider everything", "level": "B2", "dict_examp": "Altogether, I'd say the party was a great success.", "lear_examp": "Altogether, I believe that the most cruel creature on earth is the human being."}]}]}, {"word": "alternative", "poses": [{"pos": "noun", "senses": [{"sense": "one of two or more things that you can choose between", "level": "B2", "dict_examp": "It's a low-fat alternative to butter.", "lear_examp": "Another alternative is to go up the mountain by chairlifts or funicular-railway."}]}, {"pos": "adjective", "senses": [{"sense": "An alternative plan, method, etc. is one that you can use if you do not want to use another one.", "level": "B2", "dict_examp": "We can make alternative arrangements if necessary.", "lear_examp": "The new direct bus service is an alternative way of getting to Lampton."}, {"sense": "different from what is usual or traditional", "level": "B2", "dict_examp": "alternative fuels", "lear_examp": "I wonder if you've ever heard of \"alternative music\"?"}]}]}, {"word": "aluminum", "poses": [{"pos": "noun", "senses": [{"sense": "a light, silver-colored metal used for making containers, cooking equipment and aircraft parts", "level": "B2", "dict_examp": "Cover the fish with aluminum foil and bake.", "lear_examp": "Some people think that associations like Greenpeace can do something, they also try to recycle old things like batteries, aluminum, bottles or to forbid some drivers to go with their car in some areas."}]}]}, {"word": "amazingly", "poses": [{"pos": "adverb", "senses": [{"sense": "in an amazing way", "level": "B1", "dict_examp": "The food was amazingly good.", "lear_examp": "Amazingly, he didn't come back until midnight."}]}]}, {"word": "along", "poses": [{"pos": "preposition", "senses": [{"sense": "from one part of a road, river, etc. to another", "level": "A2", "dict_examp": "a romantic walk along the beach/river", "lear_examp": "Last night, we walked along the Thames."}, {"sense": "in a line next to or beside something long", "level": "B1", "dict_examp": "a row of houses along the river", "lear_examp": "The Norwich river is wonderful and I enjoyed myself seeing all the white houses with their gardens along it."}, {"sense": "based on and similar to something", "level": "C2", "dict_examp": "He gave a talk along the lines of the one he gave in Oxford.", "lear_examp": "Imagine one is encouraged by friends and institutions for their 'different' artistic or other activities, even if their works are not along the lines of 'acceptable' norms and tradition."}]}, {"pos": "adverb", "senses": [{"sense": "moving forward", "level": "B1", "dict_examp": "We were just walking along, chatting.", "lear_examp": ""}, {"sense": "with you", "level": "B1", "dict_examp": "Why don't you take him along with you when you go?", "lear_examp": "My boyfriend came along with me."}, {"sense": "at a particular place on a road, river, etc.", "level": "B2", "dict_examp": "Somewhere along this road there's a garage.", "lear_examp": "She told me that along the road there are several places to visit, like a castle which is open to the public."}, {"sense": "from the beginning of a period of time", "level": "B2", "dict_examp": "I knew all along that it was a mistake.", "lear_examp": "In the future the key word for fashion will be comfort as this is basically what everyone has been wanting all along."}, {"sense": "in addition to someone or something else", "level": "B2", "dict_examp": "Now we’ve got hospital bills along with our usual expenses.", "lear_examp": "However, along with the good times, there also came the bad, terrible, awful ones."}]}]}, {"word": "ambiguity", "poses": [{"pos": "noun", "senses": [{"sense": "when something has more than one possible meaning", "level": "C2", "dict_examp": "Legal documents must be free of ambiguity.", "lear_examp": "Lastly, there is the ambiguity of her final decision."}]}]}, {"word": "amazed", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely surprised", "level": "B1", "dict_examp": "She was amazed at how calm she felt after the accident.", "lear_examp": "Dear David Beckham, How are you? I was amazed to find your letter in my mail box."}]}]}, {"word": "although", "poses": [{"pos": "conjunction", "senses": [{"sense": "but", "level": "B1", "dict_examp": "He's coming to see us this evening, although I don't know exactly when.", "lear_examp": "I liked the food although my friends didn't like it."}, {"sense": "despite the fact that", "level": "B1", "dict_examp": "She walked home by herself, although she knew that it was dangerous.", "lear_examp": "There were no taxis on the street so, although it was raining, I started walking in the rain."}]}]}, {"word": "alternate", "poses": [{"pos": "adjective", "senses": [{"sense": "one out of every two days, weeks, years, etc.", "level": "C1", "dict_examp": "I work alternate Saturdays.", "lear_examp": "I had to go to a travel agency on alternate weekends in order to translate some programs into English."}]}, {"pos": "verb", "senses": [{"sense": "If two things alternate, one thing happens, then the other thing happens, then the first thing happens again, etc.", "level": "C1", "dict_examp": "She alternates between cheerfulness and boredom.", "lear_examp": "Xanadu Express promises to serve us food from all over the world and to alternate the menu."}]}]}, {"word": "ambitious", "poses": [{"pos": "adjective", "senses": [{"sense": "wanting  to be successful or powerful", "level": "B2", "dict_examp": "an ambitious young lawyer", "lear_examp": "I chose Omar because I find him very talented and ambitious."}, {"sense": "If a plan or idea is ambitious, it will need a lot of work and will be difficult to achieve.", "level": "B2", "dict_examp": "This is our most ambitious project so far.", "lear_examp": "If we accomplish these ambitious plans, we can even run for the 2006 Winter Olympic Games."}]}]}, {"word": "amend", "poses": [{"pos": "verb", "senses": [{"sense": "to slightly change the words of a document", "level": "C2", "dict_examp": "The contract has now been amended.", "lear_examp": "The text could be amended."}]}]}, {"word": "alter", "poses": [{"pos": "verb", "senses": [{"sense": "to change, or to make someone or something change", "level": "B2", "dict_examp": "We've had to alter some of our plans.", "lear_examp": "And this abundance of new experiences and revelations should result in altering, improving and broadening our outlook on life."}]}]}, {"word": "an", "poses": [{"pos": "determiner", "senses": [{"sense": "used instead of \"a\" when the following word begins with a vowel sound", "level": "A1", "dict_examp": "an easy question", "lear_examp": "She is an au pair in England."}]}]}, {"word": "anchor", "poses": [{"pos": "noun", "senses": [{"sense": "a heavy, metal object that is dropped into water to stop a boat from moving", "level": "C2", "dict_examp": "We dropped anchor in a quiet bay and swam.", "lear_examp": "Meanwhile, the captain had set the anchor."}, {"sense": "someone or something that gives support when needed", "level": "C2", "dict_examp": "She was my anchor when things were difficult for me.", "lear_examp": "Yet she had still been fond of his picture, he was her anchor."}, {"sense": "the person who reports the news and manages reports by others on a television or radio program", "level": "C2", "dict_examp": "She was interviewed by the anchor of the CBS Evening News.", "lear_examp": "This new form of expression is already shaping our lives, as recently seen in the U.S., where a major news anchor was fined due to findings published in a blog."}]}, {"pos": "verb", "senses": [{"sense": "to stop a boat from moving by dropping a heavy metal object into the water", "level": "C2", "dict_examp": "", "lear_examp": "Every night we used to anchor in different bays to spend the night."}, {"sense": "to make something or someone stay in one position by fastening them firmly", "level": "C2", "dict_examp": "We anchored ourselves to the rocks with a rope.", "lear_examp": "It was stronger, much more intense than text or video footage could ever be, for this unmoving image, having been anchored in space and time, solidified its content so as to have an almost physical impact on the viewer."}]}]}, {"word": "analogy", "poses": [{"pos": "noun", "senses": [{"sense": "a comparison that shows how two things are similar", "level": "C2", "dict_examp": "He  used the analogy of the mind, which has no form and is invisible, being like the sky.", "lear_examp": "The analogy bears striking similarities to the relationship of dependency between humans and their construct, the machines."}]}]}, {"word": "analogous", "poses": [{"pos": "adjective", "senses": [{"sense": "similar in some ways", "level": "C2", "dict_examp": "The stock market recorded a 0.4% annual increase that was roughly analogous to results in the late 1960s.", "lear_examp": "Raising the price of petroleum will be analogous to providing hurdles for better communication and thus the progress."}]}]}, {"word": "and", "poses": [{"pos": "conjunction", "senses": [{"sense": "used to join two words, phrases, parts of sentences or related statements together", "level": "A1", "dict_examp": "Ann and Jim", "lear_examp": "I have got a nice bed, a mirror, a sofa and a table."}, {"sense": "used to say that one thing happens after another thing", "level": "A1", "dict_examp": "I got dressed and had my breakfast.", "lear_examp": "I get up early in the morning and I have breakfast."}, {"sense": "used when saying or adding numbers", "level": "A1", "dict_examp": "It cost a hundred and twenty dollars.", "lear_examp": "It's about two and a half hours."}, {"sense": "used instead of \"to\" after some verbs, such as \"try\" and \"go\"", "level": "A2", "dict_examp": "Try and eat something.", "lear_examp": "I hope to go and see Disneyland."}, {"sense": "together with other similar things", "level": "B1", "dict_examp": "schools, colleges and so on", "lear_examp": "If you visit the city, you'll be able to do many kinds of things. For instance, you can visit me, eat Sushi in a famous restaurant, go to a hot spring, and so on."}, {"sense": "used between two words which are the same to make their meaning stronger", "level": "B1", "dict_examp": "She spends hours and hours on the telephone.", "lear_examp": "The situation became harder and harder."}]}]}, {"word": "ancient", "poses": [{"pos": "adjective", "senses": [{"sense": "from a long time ago", "level": "B1", "dict_examp": "ancient Greece/Rome/Egypt", "lear_examp": "I would recommend you to visit Rome, because you shouldn't miss seeing the huge monuments, the ancient Roman ruins and the Vatican."}]}]}, {"word": "analyze", "poses": [{"pos": "verb", "senses": [{"sense": "to examine the details of something carefully, in order to understand or explain it", "level": "B2", "dict_examp": "Researchers analyzed purchases made by 6300 households.", "lear_examp": "Almost all the companies use computers in order to collect and to analyze data about their activities or their customers."}]}]}, {"word": "angry", "poses": [{"pos": "adjective", "senses": [{"sense": "having a strong feeling against someone who has behaved badly, making you want to shout at them or hurt them", "level": "A2", "dict_examp": "He's really angry at/with me for upsetting Sophie.", "lear_examp": "Dear Ally, I'm so sorry you couldn't come to my birthday party, but don't worry, I'm not angry with you."}]}]}, {"word": "animation", "poses": [{"pos": "noun", "senses": [{"sense": "an animated film, or the process of making animated films", "level": "B1", "dict_examp": "a course in computer animation", "lear_examp": "It's a comedy animation about penguins."}]}]}, {"word": "animated", "poses": [{"pos": "adjective", "senses": [{"sense": "An animated film is one in which drawings and models seem to move.", "level": "B1", "dict_examp": "He makes animated films.", "lear_examp": "It's a funny animated film about a superhero family."}, {"sense": "showing a lot of interest and excitement", "level": "C2", "dict_examp": "an animated conversation", "lear_examp": "Whether that's true or not is a matter of controversy and animated discussion."}]}]}, {"word": "announce", "poses": [{"pos": "verb", "senses": [{"sense": "to tell people about something officially or with force or confidence", "level": "B1", "dict_examp": "The Prime Minister has just announced that public spending will be increased next year.", "lear_examp": "The TV has just announced a bus-drivers strike for tomorrow morning."}]}]}, {"word": "analysis", "poses": [{"pos": "noun", "senses": [{"sense": "the process of analyzing something", "level": "B2", "dict_examp": "Chemical analysis revealed a high content of copper.", "lear_examp": "I would not do my school projects without using a computer, because I have to do some statistical analysis."}]}]}, {"word": "angle", "poses": [{"pos": "noun", "senses": [{"sense": "the space between two lines or surfaces at the point at which they touch each other, measured in degrees", "level": "C1", "dict_examp": "an angle of 90 degrees", "lear_examp": "Carriers are to be requested to stick to the regulations which set the approach and takeoff angles at no less than 45 degrees."}, {"sense": "not horizontal or vertical, but sloping", "level": "C1", "dict_examp": "The picture was hanging at an angle, so I straightened it.", "lear_examp": "I needed to tilt the unit at an angle for it to work."}, {"sense": "the direction from which you look at something", "level": "C1", "dict_examp": "This is the same building photographed from different angles.", "lear_examp": "It is possible to see all the paintings from different angles. You can also zoom in and out."}, {"sense": "the way you think about a situation", "level": "C1", "dict_examp": "Try looking at the problem from another angle.", "lear_examp": "To be a child is to see the world from a different angle."}]}]}, {"word": "angrily", "poses": [{"pos": "adverb", "senses": [{"sense": "in an angry way", "level": "B1", "dict_examp": "\"Don't do that!\" she shouted angrily.", "lear_examp": "\"How dare she do that to me?\"  I thought, angrily."}]}]}, {"word": "ample", "poses": [{"pos": "adjective", "senses": [{"sense": "enough, or more than enough", "level": "C1", "dict_examp": "She's had ample time to get the work done.", "lear_examp": "There will be three coffee machines on each floor which should provide ample coffee for everyone."}]}]}, {"word": "analyst", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to study or examine something in detail", "level": "B2", "dict_examp": "a financial/political/systems analyst", "lear_examp": "As you know I got promotion as a project analyst recently."}]}]}, {"word": "animal", "poses": [{"pos": "noun", "senses": [{"sense": "something that lives and moves but is not a human, bird, fish or insect", "level": "A1", "dict_examp": "wild/domestic animals", "lear_examp": "I like flowers and baby animals."}, {"sense": "anything that lives and moves, including people, birds, etc.", "level": "B2", "dict_examp": "Are humans the only animals to use language?", "lear_examp": "I think the human is an animal that wants to do amusing things."}]}]}, {"word": "anger", "poses": [{"pos": "noun", "senses": [{"sense": "a strong feeling against someone who has behaved badly, making you want to shout at them or hurt them", "level": "B2", "dict_examp": "I think he feels a lot of anger towards his father who treated him very badly as a child.", "lear_examp": "Trisha, who had invited us there, looked like she was about to explode with anger or burst into tears."}]}]}, {"word": "ancestor", "poses": [{"pos": "noun", "senses": [{"sense": "a relative who lived a long time ago", "level": "B2", "dict_examp": "My ancestors came from Ireland.", "lear_examp": "We are living in a technologically advanced world where we are surrounded by all sorts of devices, which would seem fantastic to our ancestors."}]}]}, {"word": "angel", "poses": [{"pos": "noun", "senses": [{"sense": "a spiritual creature in stories or some religions, usually represented as a human with wings", "level": "B1", "dict_examp": "According to the Bible, an angel told Mary that she would have God's son, Jesus.", "lear_examp": "I like to wear a top with a picture of an angel that my mother bought for me as my birthday present."}]}]}, {"word": "amount", "poses": [{"pos": "noun", "senses": [{"sense": "how much there is of something", "level": "B1", "dict_examp": "They didn't deliver the right amount of sand.", "lear_examp": "You'll also be able to go out to pubs or night clubs, and you'll spend a very small amount of money."}]}]}, {"word": "analytical", "poses": [{"pos": "adjective", "senses": [{"sense": "examining the details of something carefully, in order to understand or explain it", "level": "C1", "dict_examp": "analytical skills", "lear_examp": "Moreover, employers nowadays are seeking the team-working, problem-solving and analytical skills needed for their company."}]}]}, {"word": "amusing", "poses": [{"pos": "adjective", "senses": [{"sense": "funny or entertaining", "level": "B1", "dict_examp": "an amusing story/person/situation", "lear_examp": "Our teacher is really amusing, he makes people laugh all the time."}]}]}, {"word": "ankle", "poses": [{"pos": "noun", "senses": [{"sense": "the joint  between the foot and the leg, or the thin part of the leg just above the foot", "level": "B1", "dict_examp": "I fell over and sprained/twisted my ankle.", "lear_examp": "I have broken my ankle and I need to stay in bed during the day."}]}]}, {"word": "amusement", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling that you have when something makes you smile or laugh", "level": "B2", "dict_examp": "She looked at him with great amusement.", "lear_examp": "Each made the other one laugh. We had great fun. It was a day with so much amusement, with my best friend John."}, {"sense": "an enjoyable way of spending your time", "level": "B2", "dict_examp": "I play the piano, but just for my own amusement.", "lear_examp": "In particular, computer games are a kind of amusement, for them and for everyone."}]}]}, {"word": "amuse", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone laugh or smile", "level": "B2", "dict_examp": "The video clips on that website always amuse me.", "lear_examp": "\"The Blind Owl\" - his masterpiece - is a surrealistic novella which has amused critics and ordinary readers for years."}, {"sense": "to keep someone interested and help them to have an enjoyable time", "level": "B2", "dict_examp": "I bought a book of crosswords to amuse myself while I was on the train.", "lear_examp": "Another idea is to call a well-known band to amuse all the young people."}]}]}, {"word": "amused", "poses": [{"pos": "adjective", "senses": [{"sense": "showing that you think something is funny", "level": "B2", "dict_examp": "an amused smile", "lear_examp": "When the taxi arrived, he was so amused about the news that an old woman took it."}, {"sense": "to keep someone interested and help them to have an enjoyable time", "level": "B2", "dict_examp": "How do you keep an 8-year-old boy amused?", "lear_examp": "I could keep them amused with my funny stories."}]}]}, {"word": "among", "poses": [{"pos": "preposition", "senses": [{"sense": "in the middle of something", "level": "B2", "dict_examp": "I saw a few familiar faces among the crowd.", "lear_examp": "If you love nature, you can eat under trees and among flowers."}, {"sense": "in a particular group of people or things", "level": "B2", "dict_examp": "Discuss it among yourselves for a few minutes.", "lear_examp": "I have got beautiful presents - some clothes and a clock, among other things."}, {"sense": "used to say that there are other details or examples in addition to the ones you are mentioning", "level": "B2", "dict_examp": "It's worth visiting the museum while you're here. There's an exhibition about Darwin and a good collection of paintings, among other things.", "lear_examp": "To go by tram or bus is a waste of time and traveling by car is - among other things - a waste of money."}, {"sense": "one of the most extreme examples of a particular type", "level": "B2", "dict_examp": "He is among the top five tennis players in the country.", "lear_examp": "It was among the worst zoos I have ever seen."}, {"sense": "to each one in a group", "level": "C1", "dict_examp": "She divided the cake among the children.", "lear_examp": "Although Brazil is the eighth biggest economy in the world and one of the richest countries regarding natural resources, that wealth is not shared equally among the population."}]}]}, {"word": "anniversary", "poses": [{"pos": "noun", "senses": [{"sense": "the day on which an important event happened in a previous year", "level": "B1", "dict_examp": "We always celebrate our wedding anniversary with dinner at an expensive restaurant.", "lear_examp": "She and her husband are touring Europe for a second honeymoon, on the 10th anniversary of their marriage."}]}]}, {"word": "announcement", "poses": [{"pos": "noun", "senses": [{"sense": "something that someone says officially, giving information about something", "level": "B1", "dict_examp": "The President made an unexpected announcement this morning.", "lear_examp": "I heard about this club in a radio announcement."}]}]}, {"word": "anything", "poses": [{"pos": "pronoun", "senses": [{"sense": "used  in questions or negatives to mean \"something\"", "level": "A1", "dict_examp": "Is there anything I can do to help?", "lear_examp": "When I'm speaking in class I'm very nervous and I can't say anything."}, {"sense": "any object, event, situation, etc.", "level": "A1", "dict_examp": "Tom will eat anything!", "lear_examp": "I like spaghetti or lasagne. But I eat anything."}, {"sense": "used to talk or ask about things of a similar type", "level": "B2", "dict_examp": "Do you want a drink or anything?", "lear_examp": ""}, {"sense": "used in questions and negatives to mean \"similar to\"", "level": "B2", "dict_examp": "Does he look anything like his brother?", "lear_examp": "Even in my dreams I haven't seen anything like it."}]}]}, {"word": "anyway", "poses": [{"pos": "adverb", "senses": [{"sense": "despite that", "level": "A2", "dict_examp": "Her parents were opposed to her quitting school, but she did it anyway.", "lear_examp": "Dear Jo, You can call me for this information but I will write it here anyway."}, {"sense": "used when you are returning to an earlier subject or changing the subject", "level": "A2", "dict_examp": "Anyway, I'll be away next week.", "lear_examp": "I hope everything will be O.K... anyway you have my phone number."}, {"sense": "used to give a more important reason for something that you are saying", "level": "B1", "dict_examp": "I don't have time to go and anyway it's too expensive.", "lear_examp": "I'm going to buy a new bed, because the old one has broken, and anyway it wasn't very comfortable."}]}]}, {"word": "antisocial", "poses": [{"pos": "adjective", "senses": [{"sense": "antisocial behavior harms society and upsets the people around you", "level": "C1", "dict_examp": "Some critics argued that movies can cause antisocial behavior.", "lear_examp": ""}, {"sense": "An antisocial person does not like being with other people.", "level": "C1", "dict_examp": "I hope they won't think I'm antisocial if I don't go to the party.", "lear_examp": "Technology has developed so much that it has made us very antisocial."}]}]}, {"word": "annoyed", "poses": [{"pos": "adjective", "senses": [{"sense": "angry", "level": "B1", "dict_examp": "I was so annoyed with him for turning up late.", "lear_examp": "I was a bit annoyed when I found out, but it's all right."}]}]}, {"word": "anymore", "poses": [{"pos": "adverb", "senses": [{"sense": "If you do not do something or something does not happen anymore, you have stopped doing it or it does not now happen.", "level": "A2", "dict_examp": "This shirt doesn't fit me anymore - would you like it?", "lear_examp": "I want to sell my radio. I don't use it anymore because I'm going to go to America next week."}]}]}, {"word": "anybody", "poses": [{"pos": "pronoun", "senses": [{"sense": "used in questions and negatives to mean \"a person or people\"", "level": "A2", "dict_examp": "I haven't asked anybody yet.", "lear_examp": "You don't need to ask anybody."}, {"sense": "any person or any people", "level": "B1", "dict_examp": "Anybody can join the club and membership is free.", "lear_examp": "Anybody could understand it!"}]}]}, {"word": "ant", "poses": [{"pos": "noun", "senses": [{"sense": "a small, black or red insect that lives in groups on the ground", "level": "B1", "dict_examp": "There were ants crawling all over the ground.", "lear_examp": "I have known Larry since I was five years old and he couldn't hurt an ant, I am sure about it."}]}]}, {"word": "anxious", "poses": [{"pos": "adjective", "senses": [{"sense": "worried and nervous", "level": "B1", "dict_examp": "He's very anxious about his exams.", "lear_examp": "I began my courses on Tuesday and I was a little bit anxious but everything was all right."}, {"sense": "wanting to do something or wanting something to happen", "level": "B2", "dict_examp": "I'm anxious to hear her news.", "lear_examp": "I am very anxious for you to tell me what type of competition you managed to win."}]}]}, {"word": "answer", "poses": [{"pos": "noun", "senses": [{"sense": "what you say or write back to someone who has asked you a question or spoken to you", "level": "A1", "dict_examp": "I asked him if he was going but I didn't hear his answer.", "lear_examp": "Please, give me an answer."}, {"sense": "information given as a reply to a question in a test, exercise, competition, etc.", "level": "A2", "dict_examp": "Did you get the answer to Question 6?", "lear_examp": "We had to fill in our questionnaires and discuss the answers in our class."}, {"sense": "when someone answers the door or telephone", "level": "A2", "dict_examp": "I've just rung him but there was no answer.", "lear_examp": "I called her, but there was no answer."}, {"sense": "a way of solving a problem", "level": "B1", "dict_examp": "It's a difficult situation and I don't know what the answer is.", "lear_examp": "Should wild animals be kept in cages, and denied their freedom so that we can have the pleasure of watching them in zoos? Well, there's no simple answer to that question."}]}, {"pos": "verb", "senses": [{"sense": "to speak or write back to someone who has asked you a question", "level": "A1", "dict_examp": "You haven't answered my question.", "lear_examp": "My teacher gives me questions and I have to answer."}, {"sense": "to open the door to someone or pick up the telephone", "level": "A2", "dict_examp": "Could someone answer the phone?", "lear_examp": "I phone you, but you don't answer!"}, {"sense": "to write or say something as a reply to a question in a test, exercise, competition, etc.", "level": "B1", "dict_examp": "I couldn't answer the last three questions.", "lear_examp": "That was to be my first interview, and I had never before answered a test of personality so I felt insecure."}]}]}, {"word": "anticipate", "poses": [{"pos": "verb", "senses": [{"sense": "to expect something, or to prepare for something before it happens", "level": "C1", "dict_examp": "to anticipate a problem", "lear_examp": "Moreover, it is anticipated that the percentage of the group will rise further in 2010."}]}]}, {"word": "anyhow", "poses": [{"pos": "adverb", "senses": [{"sense": "despite that", "level": "B2", "dict_examp": "He hates carrots but he ate them anyhow.", "lear_examp": "It wasn't a great support, but anyhow I consider my choice to be the best I could have made."}, {"sense": "used when you are returning to an earlier subject", "level": "B2", "dict_examp": "Anyhow, as I said, I'll be away next week.", "lear_examp": "After that we drove for about one hour before we had to take a lunch break. It was still very hot when we continued our trip and we had to stop once more. Anyhow, we got to Munich the same day, where we stayed for two days."}, {"sense": "used to give a more important reason for something that you are saying", "level": "B2", "dict_examp": "I don't need a car and I can't afford one anyhow.", "lear_examp": "We both thought that it was a good idea to have that stop-over at your place as it was on our route to Norway anyhow."}, {"sense": "used when you want to slightly change something that you have just said", "level": "C1", "dict_examp": "Boys aren't horrible - not all of them anyhow!", "lear_examp": ""}]}]}, {"word": "antibiotic", "poses": [{"pos": "noun", "senses": [{"sense": "a medicine which cures infections by destroying harmful bacteria", "level": "C2", "dict_examp": "He is on antibiotics for an ear infection.", "lear_examp": "Nevertheless, for all the side effects they may have, for all the unpleasantness of having a needle stuck in your arm or a spoonful of foul-tasting liquid stuck in your mouth, antibiotics and vaccines remain the greatest discovery in the history of the world."}]}]}, {"word": "antique", "poses": [{"pos": "noun", "senses": [{"sense": "an object that is old, and often rare or beautiful", "level": "B1", "dict_examp": "an antique shop", "lear_examp": "The market opens every Wednesday and you can find a lot of antiques, very interesting people who sell and buy things and delicious food."}]}, {"pos": "adjective", "senses": [{"sense": "old and often rare or beautiful", "level": "B1", "dict_examp": "antique furniture", "lear_examp": "There's a nice, cosy lobby, with antique furniture and a fireplace."}]}]}, {"word": "annoyance", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being annoyed", "level": "C1", "dict_examp": "He kept losing his keys, much to the annoyance of his wife.", "lear_examp": "This caused a lot of annoyance, so I suggest next year you make some kind of arrangement for booking the places on the computer room in advance."}]}]}, {"word": "another", "poses": [{"pos": "determiner", "senses": [{"sense": "one more person or thing, or an additional amount", "level": "A2", "dict_examp": "I'm going to have another piece of cake.", "lear_examp": "I need it because I will travel and I don't have another bag."}, {"sense": "a different person or thing of the same type", "level": "A2", "dict_examp": "She's finished with that boyfriend and found herself another (one).", "lear_examp": "I don't need it because I'm going to buy another."}, {"sense": "each other", "level": "B1", "dict_examp": "How can they reach an agreement if they won't talk to one another?", "lear_examp": "We know one another from Poland."}, {"sense": "used to talk about an occasion in the past without saying exactly which occasion it was", "level": "C2", "dict_examp": "Most of us have made a similar mistake at one time or another.", "lear_examp": "Haven't we all at one time or another come home from a holiday feeling healthy and strong with a smile on our face thinking, this is what life is about."}]}]}, {"word": "any", "poses": [{"pos": "determiner", "senses": [{"sense": "used in questions and negatives to mean some", "level": "A1", "dict_examp": "\"Is there any more soup?\" \"No, I'm afraid there isn't any left.\"", "lear_examp": "She doesn't want any more children."}, {"sense": "one of or each of a particular kind  of person or thing when it is not important which", "level": "A1", "dict_examp": "\"Which of these cakes may I eat?\" \"Any.\"", "lear_examp": "When I was a child, I liked reading any cartoon book, so my parents bought many books for me."}]}, {"pos": "adverb", "senses": [{"sense": "used in questions and negatives to emphasize a comparative adjective or adverb", "level": "B1", "dict_examp": "Do you feel any better?", "lear_examp": "I couldn't wait any longer - I had to see Sami."}]}]}, {"word": "anyone", "poses": [{"pos": "pronoun", "senses": [{"sense": "used in questions and negatives to mean 'a person or people'", "level": "A2", "dict_examp": "I haven't told anyone.", "lear_examp": "I left my cellphone at your house last night, so I can't call anyone."}, {"sense": "any person or any people", "level": "B1", "dict_examp": "Anyone can go - you don't have to be invited.", "lear_examp": "If anyone wants to know about more information, please telephone me."}]}]}, {"word": "annual", "poses": [{"pos": "adjective", "senses": [{"sense": "happening once every year, or relating to a period of one year", "level": "B1", "dict_examp": "an annual event/visit/holiday", "lear_examp": "I never miss the annual sale at the department store near my place."}]}]}, {"word": "annoy", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone angry", "level": "B1", "dict_examp": "Tim really annoyed me in the meeting this morning.", "lear_examp": "My bed makes a loud noise when I lie down on it.  It annoys me."}]}]}, {"word": "anxiety", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being very worried", "level": "B2", "dict_examp": "Children normally feel a lot of anxiety about their first day at school.", "lear_examp": "On the other hand, if we consider this statement in general, we could infer that the teenage years are quite a good time in a person's life, as there is no stress or anxiety that is usually encountered later on in life."}]}]}, {"word": "annually", "poses": [{"pos": "adverb", "senses": [{"sense": "once every year", "level": "B2", "dict_examp": "Your salary will be reviewed annually.", "lear_examp": "Lately I've decided to pick up my old hobby, since I have kept paying for my amateur-radio permit annually."}]}]}, {"word": "anxiously", "poses": [{"pos": "adverb", "senses": [{"sense": "in an anxious way", "level": "B2", "dict_examp": "We waited anxiously  by the phone.", "lear_examp": "I am waiting for your reply anxiously."}]}]}, {"word": "annoying", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel annoyed", "level": "B1", "dict_examp": "It's really annoying when a train is late and there's no explanation.", "lear_examp": "Do you like going shopping with your mom? They are sometimes annoying, aren't they?"}]}]}, {"word": "anonymous", "poses": [{"pos": "adjective", "senses": [{"sense": "not giving a name", "level": "C2", "dict_examp": "an anonymous phone call/letter", "lear_examp": "Because the internet does provide the possibility of staying anonymous, it is very hard to find the people who use it for illegal or criminal actions."}]}]}, {"word": "anticipation", "poses": [{"pos": "noun", "senses": [{"sense": "when you are waiting for something to happen, usually with excitement", "level": "C2", "dict_examp": "The children were breathless with anticipation.", "lear_examp": "Yet, what I remember and think is going to stay with me for the rest of my life is that wonderful atmosphere of a fairy tale which has come true, that feeling of excitement and anticipation of something marvelous about to happen."}, {"sense": "expecting something to happen or in preparation for something happening", "level": "C2", "dict_examp": "She's even decorated the spare room in anticipation of your visit.", "lear_examp": "This has sometimes resulted in the comic phenomenon of people traveling to a distant country, in anticipation of encountering strange and original lifestyles, only to come across situations not very different from the one they have left in their own countries."}]}]}, {"word": "apostrophe", "poses": [{"pos": "noun", "senses": [{"sense": "the  punctuation mark ' which shows when a letter or a number has been left out, or is used before or after \"s\" to show possession", "level": "B2", "dict_examp": "I'm  Ian.", "lear_examp": ""}]}]}, {"word": "apartment", "poses": [{"pos": "noun", "senses": [{"sense": "a set of rooms for living in, especially on one floor of a building", "level": "A2", "dict_examp": "a one-/two-/three-bedroom apartment", "lear_examp": "Please come to my apartment at 4:00."}]}]}, {"word": "apologize", "poses": [{"pos": "verb", "senses": [{"sense": "to tell someone that you are sorry about something you have done", "level": "B1", "dict_examp": "I   must apologize to Isobel for my behavior.", "lear_examp": "This letter is to inform you that I will not be able to attend tomorrow's class due to medical issues. I apologize for the short notice."}]}]}, {"word": "apartment building", "poses": [{"pos": "noun", "senses": [{"sense": "a building containing apartments", "level": "A2", "dict_examp": "We live on the third floor of that apartment building.", "lear_examp": ""}]}]}, {"word": "anyway", "poses": [{"pos": "adverb", "senses": [{"sense": "despite that", "level": "A2", "dict_examp": "Her parents were opposed to her quitting school, but she did it anyway.", "lear_examp": "Dear Jo, You can call me for this information but I will write it here anyway."}, {"sense": "used when you are returning to an earlier subject or changing the subject", "level": "A2", "dict_examp": "Anyway, I'll be away next week.", "lear_examp": "I hope everything will be O.K... anyway you have my phone number."}, {"sense": "used to give a more important reason for something that you are saying", "level": "B1", "dict_examp": "I don't have time to go and anyway it's too expensive.", "lear_examp": "I'm going to buy a new bed, because the old one has broken, and anyway it wasn't very comfortable."}]}]}, {"word": "appliance", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of electrical equipment with a particular purpose in the home", "level": "C1", "dict_examp": "home/household/kitchen appliances", "lear_examp": "The fair was well organized and structured into specific sections from clothing and sportswear to household appliances and electronic goods."}]}]}, {"word": "appoint", "poses": [{"pos": "verb", "senses": [{"sense": "to officially choose someone for a job", "level": "C1", "dict_examp": "She was appointed by the governor.", "lear_examp": "He was appointed by the government as head of a newly established task force."}]}]}, {"word": "appeal", "poses": [{"pos": "noun", "senses": [{"sense": "the quality in someone or something that makes them attractive or interesting", "level": "B2", "dict_examp": "Eating out has lost much of its appeal.", "lear_examp": "In my opinion, computer games are so popular because the games have developed their graphics and they have more appeal to youngsters."}, {"sense": "a formal or urgent request, especially for money or help in an emergency", "level": "C2", "dict_examp": "They're launching an appeal to raise money for earthquake victims.", "lear_examp": "I would suggest that the local authorities with the support of the community and companies start an appeal, to raise money to keep the St. Mary's running."}]}, {"pos": "verb", "senses": [{"sense": "to attract or interest someone", "level": "B2", "dict_examp": "Cycling has never really appealed to me.", "lear_examp": "In addition, books appeal to our imagination."}, {"sense": "to make a serious or formal request, especially for money or help", "level": "C1", "dict_examp": "They're appealing for clothes and blankets to send to the devastated region.", "lear_examp": "In fact so much did he like English that he was one of the first to appeal for a place in the \"Erasmus,\" a scheme allowing students to study in foreign countries of their choice."}]}]}, {"word": "appear", "poses": [{"pos": "verb", "senses": [{"sense": "to start to be seen", "level": "B1", "dict_examp": "He suddenly appeared in the doorway.", "lear_examp": "Suddenly the singer of the band appeared."}, {"sense": "to perform in a movie, play, etc.", "level": "B1", "dict_examp": "She appears briefly in the new James Bond movie.", "lear_examp": "What I like the most is that I'm going to appear on T.V."}, {"sense": "to seem", "level": "B1", "dict_examp": "He appeared calm and relaxed.", "lear_examp": "But, the reality is, that life appears very short to me.  My first impression in my new class was that the teacher was bad and too serious, but it appears that he is very nice. (1094174; Preliminary English Test; Switzerland; B1 THRESHOLD; 2002; French; Pass)"}, {"sense": "used to say that something seems to be true", "level": "B2", "dict_examp": "It appears that he had asked someone to drive him home from the party.", "lear_examp": "It appears that people are more aware about clothes and also work."}, {"sense": "to start to exist or become available", "level": "B2", "dict_examp": "Laptop computers first appeared in the 1980s.", "lear_examp": "In almost every city fast-food restaurants have appeared, which have a big group of fans."}, {"sense": "used to say that something seems to be true", "level": "C1", "dict_examp": "It would appear that nobody on board the aircraft actually had a licence to fly it.", "lear_examp": "It would appear that students are not satisfied with the hours and days offered by the Club."}]}]}, {"word": "apple", "poses": [{"pos": "noun", "senses": [{"sense": "a hard, round fruit that has a green or red skin and is white inside", "level": "A1", "dict_examp": "to peel an apple", "lear_examp": "The place is in North Iraq. I like this place, because it has very nice weather, and there is nice fruit: dates, grapes, peaches, and apples."}]}]}, {"word": "apology", "poses": [{"pos": "noun", "senses": [{"sense": "something you say or write to say that you are sorry about something you have done", "level": "B1", "dict_examp": "I have an apology to make to you - I'm afraid I opened your letter by mistake.", "lear_examp": "Hi Zita, Please accept my apology for this belated letter which you're holding in your hands."}]}]}, {"word": "apologetic", "poses": [{"pos": "adjective", "senses": [{"sense": "showing or saying that you are sorry about something", "level": "C2", "dict_examp": "an apologetic smile", "lear_examp": "I am deeply apologetic if my letter troubled anybody or was too boring to read, but I had to say my opinion out loud."}]}]}, {"word": "apart", "poses": [{"pos": "adverb", "senses": [{"sense": "except for or in addition to", "level": "B1", "dict_examp": "Apart from the low salary, it's a great job!", "lear_examp": "So, when he started to speak, I couldn't understand anything apart from \"thanks\"."}, {"sense": "separated by a space, distance or period of time", "level": "B1", "dict_examp": "Stand with your feet wide apart.", "lear_examp": "They are situated on the same street, only a hundred meters apart, on each side of the street."}, {"sense": "If two people are apart, they are not in the same place together.", "level": "B2", "dict_examp": "By this time my parents were living apart.", "lear_examp": "I'll always remember those two days which we spent together after such a long time living apart."}, {"sense": "into separate, smaller pieces", "level": "B2", "dict_examp": "I took the motor apart to see how it worked.", "lear_examp": ""}, {"sense": "to be complete opposites", "level": "C2", "dict_examp": "They are poles apart in their attitudes to religion.", "lear_examp": "Soho at night seemed to be the nicest place on Earth, poles apart from my home town."}]}]}, {"word": "applaud", "poses": [{"pos": "verb", "senses": [{"sense": "to clap your hands to show that you have enjoyed a performance, talk, etc.", "level": "C1", "dict_examp": "The audience applauded loudly.", "lear_examp": "Secondly, owing to a sudden shower, there was a short break during the dance display and the horse show, but eventually, we finished the display and the show successfully and people applauded."}, {"sense": "to approve of or admire something", "level": "C2", "dict_examp": "Most people will surely applaud the decision.", "lear_examp": "I admire and applaud Stevens' integrity and dignity."}]}]}, {"word": "apply", "poses": [{"pos": "verb", "senses": [{"sense": "to request something, usually officially, especially by writing or sending in a form", "level": "B1", "dict_examp": "By the time I saw the job advertised it was already too late to apply.", "lear_examp": "I applied for this course and went to my first lesson last week."}, {"sense": "to relate to a particular person or situation", "level": "B2", "dict_examp": "The same rules apply to everybody.", "lear_examp": "The same doesn't apply to a teenager who lives in illness and poverty and whose family and friends constantly mistreat him."}, {"sense": "to use something in a particular situation", "level": "C1", "dict_examp": "The same method can be applied to other situations.", "lear_examp": "Moreover, he can explain how theory is being applied in the field."}, {"sense": "to work hard", "level": "C2", "dict_examp": "If he doesn't apply himself, he'll never pass his exams.", "lear_examp": "Many previously unknown professions emerged, and people started to apply themselves to their jobs much more than before; the pursuit of money was initiated."}]}]}, {"word": "appearance", "poses": [{"pos": "noun", "senses": [{"sense": "the way a person or thing looks to other people", "level": "B1", "dict_examp": "The buildings are very similar in appearance.", "lear_examp": "I usually buy fashionable clothes, because I think your appearance is really important."}, {"sense": "when someone appears in public, on television, in a film, etc.", "level": "B2", "dict_examp": "It was his first appearance on television/television appearance as president.", "lear_examp": "You probably know him, because he made an appearance in the film \"Bad Boys.\""}, {"sense": "when something starts to exist or becomes available", "level": "B2", "dict_examp": "The appearance of new products on the market has increased competition.", "lear_examp": "The appearance of the car has facilitated our lives."}]}]}, {"word": "apparent", "poses": [{"pos": "adjective", "senses": [{"sense": "obvious or easy to notice", "level": "B2", "dict_examp": "Her unhappiness was apparent to everyone.", "lear_examp": "This was my Dad, always doing weird things for no apparent reason."}, {"sense": "seeming to exist or be true", "level": "C1", "dict_examp": "I was a little surprised by her apparent lack of interest.", "lear_examp": "Your company staff is well known among our club members for its quality but the only apparent flaw we can detect is that they only speak English."}]}]}, {"word": "anywhere", "poses": [{"pos": "adverb", "senses": [{"sense": "in or to any place", "level": "A2", "dict_examp": "Did you go anywhere interesting this summer?", "lear_examp": "I like that bicycle because I can go anywhere with it without anyone's help."}, {"sense": "used in questions and negatives to mean \"a place\"", "level": "A2", "dict_examp": "Is there anywhere in particular you wanted to go to eat tonight?", "lear_examp": "Do you know anywhere interesting and how can I get there?"}, {"sense": "to not make any progress", "level": "B2", "dict_examp": "I tried discussing the problem with her but I didn't get anywhere.", "lear_examp": "If we think about making an effort and changing our daily routine at once, we will never get anywhere because a drastic change usually does not last."}, {"sense": "used in questions and negatives to mean \"close to being or doing something\"", "level": "C1", "dict_examp": "The house isn't anywhere near ready.", "lear_examp": "We could not have gone anywhere near 5000 miles because all our minibuses were broken down - we even stayed in one place for 8 days."}]}]}, {"word": "appalling", "poses": [{"pos": "adjective", "senses": [{"sense": "awful, or shocking and very unpleasant or causing someone to feel upset", "level": "C2", "dict_examp": "The animals were being kept in appalling conditions.", "lear_examp": "When Susan got the news of his illness all her joy turned into an appalling despair, and she felt she would die too."}]}]}, {"word": "apparently", "poses": [{"pos": "adverb", "senses": [{"sense": "used to say you have read or been told something although you are not certain it is true", "level": "B2", "dict_examp": "Apparently it's going to rain today.", "lear_examp": "Apparently he was planning to visit me and surprise me for my birthday, which was the following day."}, {"sense": "used to say that something seems to be true, although it is not certain", "level": "B2", "dict_examp": "There were two apparently unrelated deaths.", "lear_examp": "People found it important and still do but apparently, today, we don't appreciate reading as much as our ancestors."}]}]}, {"word": "application", "poses": [{"pos": "noun", "senses": [{"sense": "an official request for something, usually in writing", "level": "B1", "dict_examp": "a job/college application", "lear_examp": "After having filled in the application form, the master pilot took us on a short trip around the hangars showing the planes used for training."}, {"sense": "a piece of computer software designed for a particular purpose", "level": "B2", "dict_examp": "Typical examples of software applications are spreadsheets, media players and database applications.", "lear_examp": "I am an experienced user of the Internet and know all application programs for Windows '95 (Word, Excel, PowerPoint, PinPoint etc.)."}, {"sense": "a way in which something can be used for a particular purpose", "level": "C2", "dict_examp": "This technology has many practical applications.", "lear_examp": "We have been working on the growing of cells in zero-gravity environments, having in mind its possible application in outer space colonies, such as the International Space Station."}]}]}, {"word": "applause", "poses": [{"pos": "noun", "senses": [{"sense": "when people make a noise by clapping their hands to show they have enjoyed or approve of something", "level": "C1", "dict_examp": "There was loud applause at the end of her speech.", "lear_examp": "Still the audience was very pleased, because they gave massive applause at the end."}, {"sense": "when people clap", "level": "C2", "dict_examp": "The crowd gave him a huge round of applause.", "lear_examp": "It was unbelievable, there was a round of applause and some people couldn't help crying."}]}]}, {"word": "appetite", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling that you want to eat", "level": "C1", "dict_examp": "a good/healthy appetite", "lear_examp": "The tasteless food spoiled our appetite."}, {"sense": "when you want something very much", "level": "C2", "dict_examp": "He has a real appetite for adventure.", "lear_examp": "It does not occur to him that Jack has degenerated into blood-lust and is driven by hatred and an appetite for power."}]}]}, {"word": "arid", "poses": [{"pos": "adjective", "senses": [{"sense": "very dry and without enough rain for plants", "level": "C2", "dict_examp": "an arid region/climate", "lear_examp": "The first thing I have noticed, during my arrival, was the impressive number of trees seen even from the plane windows. That was a big surprise for someone growing up in such an arid country as Greece."}]}]}, {"word": "argument", "poses": [{"pos": "noun", "senses": [{"sense": "an angry discussion with someone in which you both disagree", "level": "B1", "dict_examp": "The children had an argument about/over what game to play.", "lear_examp": "I wrote a song last week. It's about my boyfriend and an argument he had with his parents about our relationship."}, {"sense": "a reason or reasons why you support or oppose an idea, action, etc.", "level": "B2", "dict_examp": "There are many arguments for and against nuclear energy.", "lear_examp": "One final argument for the use of the bicycle is that bicycles don't create pollution."}]}]}, {"word": "approximate", "poses": [{"pos": "adjective", "senses": [{"sense": "not completely accurate but close", "level": "B2", "dict_examp": "Their approximate arrival time is 10:30.", "lear_examp": "The  approximate figure is about 5000 people."}]}]}, {"word": "armchair", "poses": [{"pos": "noun", "senses": [{"sense": "a comfortable chair with sides that support your arms", "level": "A2", "dict_examp": "She sat in an armchair by the fire, reading a newspaper.", "lear_examp": "I want to sell my armchair and my television."}]}]}, {"word": "archaeology", "poses": [{"pos": "noun", "senses": [{"sense": "the study of ancient cultures by looking for and examining their buildings, tools, and other objects", "level": "C1", "dict_examp": "He studied archaeology in college.", "lear_examp": "But I have to admit that there could be more presentations to cover areas like archaeology, language, etc."}]}]}, {"word": "approval", "poses": [{"pos": "noun", "senses": [{"sense": "when you have a positive opinion of someone or something", "level": "B2", "dict_examp": "He showed his approval by smiling broadly.", "lear_examp": "I hope this meets with your approval and I am looking forward to hearing from you as soon as possible."}, {"sense": "official permission", "level": "B2", "dict_examp": "We need approval for the project to move ahead.", "lear_examp": "Besides the questionable approval given by governmental authorities, the situation might be useful to us."}]}]}, {"word": "architect", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to  design buildings", "level": "B1", "dict_examp": "Who is the architect who designed this building?", "lear_examp": "He knew that I wanted to be an architect."}]}]}, {"word": "armed", "poses": [{"pos": "adjective", "senses": [{"sense": "using or carrying weapons", "level": "B2", "dict_examp": "an armed robbery", "lear_examp": "I could clearly understand that the two armed men would catch us within a few minutes."}, {"sense": "carrying or knowing something that will be useful", "level": "C2", "dict_examp": "I like to go to a meeting armed with the relevant facts.", "lear_examp": "She is not a young executive woman armed with a portable computer and three telephones."}]}]}, {"word": "appointment", "poses": [{"pos": "noun", "senses": [{"sense": "a time you have arranged to meet someone or go somewhere", "level": "A2", "dict_examp": "a dentist/doctor's appointment", "lear_examp": "My mother is taking me to a dentist appointment."}, {"sense": "when you officially choose someone for an important job, or the job itself", "level": "C2", "dict_examp": "the appointment of three new teachers", "lear_examp": "His outstanding successful work on fowl vaccine was rewarded by his appointment to lecturer in veterinary microbiology and hygiene. Soon all vet students liked him very much."}]}]}, {"word": "appropriately", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is appropriate", "level": "B2", "dict_examp": "She didn't think we were appropriately dressed for a wedding.", "lear_examp": "I enjoyed reading it and I think it appropriately describes the atmosphere of that lovely town."}]}]}, {"word": "archaeologist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who studies ancient cultures by looking for and examining their buildings, tools, and other objects", "level": "C1", "dict_examp": "Archaeologists believe the remains date back to the 5th century.", "lear_examp": "It includes articles from prominent journalists, scientists, archaeologists and other experts on Greek civilisation."}]}]}, {"word": "approve", "poses": [{"pos": "verb", "senses": [{"sense": "to allow or officially agree to something", "level": "B1", "dict_examp": "The town has approved plans for a new shopping center.", "lear_examp": "\"Congratulations, your scholarship to the UK is approved.\""}, {"sense": "to think that something is good or right", "level": "B2", "dict_examp": "She doesn't approve of my friends.", "lear_examp": "Woods didn't approve of the government's attitude to them."}]}]}, {"word": "approach", "poses": [{"pos": "verb", "senses": [{"sense": "to come close in distance or time", "level": "B2", "dict_examp": "The train was approaching the station.", "lear_examp": "I decided to approach the house since the situation looked very strange for me."}, {"sense": "to deal with something", "level": "B2", "dict_examp": "I'm not sure how to approach the problem.", "lear_examp": "This is the right way to approach the issue."}]}, {"pos": "noun", "senses": [{"sense": "a way of doing something", "level": "B2", "dict_examp": "In Sweden they have a different approach to the problem.", "lear_examp": "This will show the contrast in teaching methods, different approaches to students and the techniques used by different teachers."}, {"sense": "when something or someone gets nearer in distance or time", "level": "B2", "dict_examp": "The siren signaled the approach of an ambulance.", "lear_examp": ""}]}]}, {"word": "arise", "poses": [{"pos": "verb", "senses": [{"sense": "If a problem arises, it starts to happen.", "level": "C1", "dict_examp": "The whole problem arose from a lack of communication.", "lear_examp": "Although the place was very good, a number of problems arose during our visit."}]}]}, {"word": "army", "poses": [{"pos": "noun", "senses": [{"sense": "a particular country's fighting force", "level": "B1", "dict_examp": "When did you join the army?", "lear_examp": "I work in the army and I need to know how and what I should do if I am in a war."}, {"sense": "a group of people organized to do the same job", "level": "C2", "dict_examp": "an army of cleaners/helpers", "lear_examp": "There, you are surrounded by an army of waiters: one for the home-baked bread, one for the water, one for the wine, one for the food."}]}]}, {"word": "arbitrary", "poses": [{"pos": "adjective", "senses": [{"sense": "not based on a system or principles and often seeming unfair", "level": "C2", "dict_examp": "an arbitrary decision", "lear_examp": "To start with, this arbitrary act is, as far as I am concerned, one of the worst aggressions to nature, as an area of about two miles of greenery will have to be completely destroyed to give a place to an absurd parking garage."}]}]}, {"word": "approximately", "poses": [{"pos": "adverb", "senses": [{"sense": "close to a particular number or time although not exactly that number or time", "level": "B1", "dict_examp": "The job will take approximately two weeks, and cost around $2000.", "lear_examp": "From the airport of Larnaka you need approximately forty-five minutes by taxi, to Agia Napa."}]}]}, {"word": "appreciation", "poses": [{"pos": "noun", "senses": [{"sense": "when you understand how good or how difficult something is", "level": "B2", "dict_examp": "To show our appreciation for all your help, we bought you a little gift.", "lear_examp": "To show our appreciation, we would also like to invite you to dinner afterwards at the Red Baron."}]}]}, {"word": "appreciate", "poses": [{"pos": "verb", "senses": [{"sense": "to understand how good something is or how difficult it was", "level": "B2", "dict_examp": "There's no point buying him expensive clothes - he doesn't appreciate them.", "lear_examp": "I am sure you will appreciate the food, even if the services is not so good."}, {"sense": "used when you are politely requesting something", "level": "B2", "dict_examp": "I would appreciate it if you could let me know  in advance whether or not you will be coming.", "lear_examp": "I would really appreciate a positive answer from your side."}, {"sense": "used when you are thanking someone or showing that you are grateful", "level": "B2", "dict_examp": "Thanks for all the help you gave us last weekend. We really appreciate it.", "lear_examp": "Thanks for your congratulations. I really appreciate it."}, {"sense": "to understand something about a situation, especially that it is complicated or difficult", "level": "C2", "dict_examp": "I appreciate that it is a difficult decision for you to make.", "lear_examp": "Given the size of the house and the rather delicate nature of some of the furniture pieces, I appreciate that it may have been somewhat of a challenge."}]}]}, {"word": "argue", "poses": [{"pos": "verb", "senses": [{"sense": "to speak angrily to someone, telling them that you disagree with them", "level": "B1", "dict_examp": "My parents are always arguing.", "lear_examp": "Peter told her his parents had argued and he came with his mother to London."}, {"sense": "to give reasons to support or oppose an idea, action, etc.", "level": "B2", "dict_examp": "Several people argued in favor of creating bike lanes on the avenue.", "lear_examp": "It is often argued that family life is not important."}]}]}, {"word": "April", "poses": [{"pos": "noun", "senses": [{"sense": "the fourth month of the year, after March and before May", "level": "A1", "dict_examp": "the 20th of April/April 20(th)", "lear_examp": "The class is on the second of April and it will be three hours long."}]}]}, {"word": "arm", "poses": [{"pos": "noun", "senses": [{"sense": "the long part at each side of the human body, ending in a hand", "level": "A1", "dict_examp": "My arms ache from carrying this bag.", "lear_examp": "I've a Tennis racket that I bought a year ago. I want to sell it because I've broken my arm."}, {"sense": "the part of a chair where your arm rests", "level": "C2", "dict_examp": "The chair didn't have any arms.", "lear_examp": "It appears to me that the leather covering the left arm of the sofa has been pierced with some sharp object."}, {"sense": "with your arm gently supporting or being supported by someone else's arm", "level": "C2", "dict_examp": "They walked through the park, arm in arm.", "lear_examp": "We often walked around the playground arm in arm."}, {"sense": "to not allow someone to become too friendly with you", "level": "C2", "dict_examp": "I always had the feeling she was keeping me at arm's length.", "lear_examp": "At first she keeps them at arm's length, but Mr. Emerson is direct and advises Lucy to behave in a more natural way instead of doing what some old ladies say."}]}]}, {"word": "appropriate", "poses": [{"pos": "adjective", "senses": [{"sense": "suitable or right for a particular situation or occasion", "level": "B2", "dict_examp": "Is this film appropriate for small children?", "lear_examp": "I will explain why I am an appropriate person for this job."}]}]}, {"word": "arch", "poses": [{"pos": "noun", "senses": [{"sense": "a curved structure that usually supports something, for example a bridge or wall", "level": "C2", "dict_examp": "Passing through the arch, you enter an open courtyard.", "lear_examp": "She could have taken a short cut, but she chose this long and rather uncomfortable way deliberately, as it was leading past the old arch where a strange man used to play a violin."}]}, {"pos": "verb", "senses": [{"sense": "to be a curved shape or make something become a curved shape", "level": "C2", "dict_examp": "The bridge arched over the river.", "lear_examp": "Suddenly a flash arched across the sky, followed by an echoing rumble."}]}]}, {"word": "around", "poses": [{"pos": "preposition", "senses": [{"sense": "to surround or be on all sides of something, or in a circular movement", "level": "A2", "dict_examp": "We sat around the table.", "lear_examp": "You can go around the lake by train."}, {"sense": "to or in different parts of a place", "level": "A2", "dict_examp": "I spent a year traveling around Australia.", "lear_examp": "After that, we will walk around the shopping mall."}, {"sense": "about or approximately", "level": "A2", "dict_examp": "around two months ago", "lear_examp": "I'll go by car and I'll be there around 3:30 pm."}, {"sense": "all day and all night", "level": "C1", "dict_examp": "Rescue teams are working around the clock to search for survivors of the earthquake.", "lear_examp": "It is undeniable that people are working around the clock in order to earn a living."}]}, {"pos": "adverb", "senses": [{"sense": "to or in different parts of a place", "level": "A2", "dict_examp": "I'm going to fly to Peru and travel around for six weeks.", "lear_examp": "Come and visit, I'll show you around."}, {"sense": "in a circle or with circular movement", "level": "B1", "dict_examp": "She passed a plate of biscuits around.", "lear_examp": "Hello, everybody. Please gather around."}, {"sense": "to the opposite direction", "level": "B1", "dict_examp": "Jonny turned around and looked at her.", "lear_examp": "As the concert finished, I heard someone call my name. I turned around."}, {"sense": "If someone  is around, they are present in a place.", "level": "B2", "dict_examp": "Will you be around next week?", "lear_examp": "It was dark and not a soul was around."}, {"sense": "present or available", "level": "C2", "dict_examp": "Cell phones have been around for years now.", "lear_examp": "Major sports competitions have been around for the better part of 2500 years, ever since the original Olympic Games were held in ancient Greece."}]}]}, {"word": "architecture", "poses": [{"pos": "noun", "senses": [{"sense": "the design and style of buildings", "level": "B1", "dict_examp": "Roman architecture", "lear_examp": "There are beautiful places like Merarejonban, which is outstanding in its architecture."}, {"sense": "the skill of designing buildings", "level": "B1", "dict_examp": "He studied architecture.", "lear_examp": "I want to study architecture in the U.K. but English is a problem, so I need spend a lot of time learning it."}]}]}, {"word": "area", "poses": [{"pos": "noun", "senses": [{"sense": "a region of a country or city", "level": "A2", "dict_examp": "All areas of the country will have some rain tonight.", "lear_examp": "It's a tourist area."}, {"sense": "a part of a building or piece of land used for a particular purpose", "level": "B1", "dict_examp": "a play/picnic area", "lear_examp": "I'm staying in a very big hotel; it has a swimming pool, a golf area, gardens, and also a children's area."}, {"sense": "a part of a subject or activity", "level": "B2", "dict_examp": "Marketing is Paul's area.", "lear_examp": "I am a 30-year-old Swedish male with a diploma in gardening. I have 6 years experience of the area since I have been employed by a Swedish fruit supplier."}]}]}, {"word": "arrange", "poses": [{"pos": "verb", "senses": [{"sense": "to make the necessary plans and preparations for something to happen", "level": "B1", "dict_examp": "We've arranged a meeting for Wednesday.", "lear_examp": "Dear Friends, It's a fantastic idea to come to my country for the holidays; we could arrange to meet somewhere."}, {"sense": "to put objects in a particular order or position", "level": "B2", "dict_examp": "She arranged her birthday cards along the shelf.", "lear_examp": "Before the pop concert started, I arranged the seats and carried some musical instruments."}]}]}, {"word": "artificially", "poses": [{"pos": "adverb", "senses": [{"sense": "in an artificial way", "level": "B2", "dict_examp": "Most mushrooms sold in supermarkets have been grown artificially in manure.", "lear_examp": "Zoos are part of nature, despite the fact that they are  created artificially."}]}]}, {"word": "artist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who paints, draws or makes sculptures", "level": "A2", "dict_examp": "Monet is one of my favorite artists.", "lear_examp": "You have to bring a pencil and paintings to copy by famous artists like Goya."}]}]}, {"word": "arrive", "poses": [{"pos": "verb", "senses": [{"sense": "to reach a place, especially at the end of a journey", "level": "A2", "dict_examp": "What time does your train arrive?", "lear_examp": "I'm arriving at four o'clock."}, {"sense": "to make a decision about something after a lot of thought", "level": "C2", "dict_examp": "We didn't arrive at any firm conclusions.", "lear_examp": "This is something very important which should be discussed... We may arrive at a conclusion."}]}]}, {"word": "arrogant", "poses": [{"pos": "adjective", "senses": [{"sense": "believing that you are better or more important than other people", "level": "B2", "dict_examp": "I found him arrogant and rude.", "lear_examp": "Chubby, arrogant and filthy were the words that described him best. Every time they met, a bitter feeling of hatred bloomed in her throat."}]}]}, {"word": "artificial intelligence", "poses": [{"pos": "noun", "senses": [{"sense": "the use of computer programs that can copy some qualities of the human mind, such as the ability to understand language and \tto learn from experience, or the study of how this can be done", "level": "C2", "dict_examp": "A robot with true artificial intelligence hasn't been invented.", "lear_examp": "True artificial intelligence, one of the most terrifying dreams of man, is yet to be discovered, but we must handle it with great care if we don't want to suffer the consequences of a world in which machines start to think for us, this making our existence completely pointless."}]}]}, {"word": "arrest", "poses": [{"pos": "verb", "senses": [{"sense": "If the police arrest someone, they take them away to ask them about a crime which they might have committed.", "level": "B1", "dict_examp": "She was arrested for drinking and driving.", "lear_examp": "To my horror, they arrested me."}]}, {"pos": "noun", "senses": [{"sense": "when the police take someone away to ask them about a crime which they might have committed", "level": "B2", "dict_examp": "Police made twenty arrests at yesterday's demonstration.", "lear_examp": "When I came around, Mr. Smith was under arrest and fortunately, things finished well for me."}]}]}, {"word": "artistic", "poses": [{"pos": "adjective", "senses": [{"sense": "showing skill and imagination in creating things, especially in painting, drawing, etc.", "level": "B2", "dict_examp": "Both children are very artistic.", "lear_examp": "If the museum is a place were they can say how they feel, or express it in an abstract or artistic way, they will start to like it."}, {"sense": "relating to any form of art, including painting, literature, theater, music, etc.", "level": "B2", "dict_examp": "the artistic director of the theater", "lear_examp": "That would be perfect to improve the artistic and cultural life of Turin."}]}]}, {"word": "article", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of writing on a particular subject in a newspaper or magazine", "level": "B1", "dict_examp": "There was an interesting article on climate change in the paper yesterday.", "lear_examp": "I read an article about this zoo in the newspaper."}, {"sense": "in grammar, used to mean the words \"a,\" \"an\" and \"the\"", "level": "B1", "dict_examp": "There's a definite article missing before the noun.", "lear_examp": ""}]}]}, {"word": "art", "poses": [{"pos": "noun", "senses": [{"sense": "the making or study of paintings, drawings, etc. or the objects created", "level": "A2", "dict_examp": "modern art", "lear_examp": "The new art class after school is on Wednesday."}, {"sense": "creative areas including painting, drama, dance, music, etc.", "level": "B2", "dict_examp": "fine/decorative arts", "lear_examp": "You can enjoy both traditional and contemporary performing arts in Osaka."}, {"sense": "subjects, such as history, languages and philosophy, that are not scientific subjects", "level": "C2", "dict_examp": "the School/College of Arts and Sciences", "lear_examp": "For Arts and Science graduates, gaining a degree meant better prospects."}]}]}, {"word": "arrangement", "poses": [{"pos": "noun", "senses": [{"sense": "plans for how something will happen", "level": "B1", "dict_examp": "They'd made all the arrangements for the party.", "lear_examp": "I'll make all the arrangements."}, {"sense": "an agreement between two people or groups", "level": "B2", "dict_examp": "We had an arrangement that he would clean the house and I would cook.", "lear_examp": "I didn't know if you would be in the house or not so you need to contact him for a new arrangement on this telephone number 333-30.30."}, {"sense": "a group of objects in a particular order or position", "level": "B2", "dict_examp": "a flower arrangement", "lear_examp": "Dear Mrs. Anderson, I have learned from a friend that your club gives advanced courses in flower arrangement."}]}]}, {"word": "around", "poses": [{"pos": "preposition", "senses": [{"sense": "to surround or be on all sides of something, or in a circular movement", "level": "A2", "dict_examp": "We sat around the table.", "lear_examp": "You can go around the lake by train."}, {"sense": "to or in different parts of a place", "level": "A2", "dict_examp": "I spent a year traveling around Australia.", "lear_examp": "After that, we will walk around the shopping mall."}, {"sense": "about or approximately", "level": "A2", "dict_examp": "around two months ago", "lear_examp": "I'll go by car and I'll be there around 3:30 pm."}, {"sense": "all day and all night", "level": "C1", "dict_examp": "Rescue teams are working around the clock to search for survivors of the earthquake.", "lear_examp": "It is undeniable that people are working around the clock in order to earn a living."}]}, {"pos": "adverb", "senses": [{"sense": "to or in different parts of a place", "level": "A2", "dict_examp": "I'm going to fly to Peru and travel around for six weeks.", "lear_examp": "Come and visit, I'll show you around."}, {"sense": "in a circle or with circular movement", "level": "B1", "dict_examp": "She passed a plate of biscuits around.", "lear_examp": "Hello, everybody. Please gather around."}, {"sense": "to the opposite direction", "level": "B1", "dict_examp": "Jonny turned around and looked at her.", "lear_examp": "As the concert finished, I heard someone call my name. I turned around."}, {"sense": "If someone  is around, they are present in a place.", "level": "B2", "dict_examp": "Will you be around next week?", "lear_examp": "It was dark and not a soul was around."}, {"sense": "present or available", "level": "C2", "dict_examp": "Cell phones have been around for years now.", "lear_examp": "Major sports competitions have been around for the better part of 2500 years, ever since the original Olympic Games were held in ancient Greece."}]}]}, {"word": "arouse", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone have a particular feeling or reaction", "level": "C2", "dict_examp": "It's a subject which has aroused a lot of interest.", "lear_examp": "There was something about her that had aroused my interest."}]}]}, {"word": "arrow", "poses": [{"pos": "noun", "senses": [{"sense": "a symbol used on a sign, on a computer, etc. to show direction", "level": "B2", "dict_examp": "I followed the arrows to the parking lot.", "lear_examp": "I followed its arrow and believe it or not I found mom!"}, {"sense": "a weapon that is like a long, thin stick with a sharp point at one end and often feathers at the other, shot from a bow", "level": "B2", "dict_examp": "Robin Hood asked to be buried where his arrow landed.", "lear_examp": "The museum has many old axes, crossbows, bows and arrows."}]}]}, {"word": "artificial", "poses": [{"pos": "adjective", "senses": [{"sense": "not natural, but made by people", "level": "B2", "dict_examp": "an artificial flower/lake", "lear_examp": "Zoos are artificial settings for animals."}, {"sense": "not sincere", "level": "C2", "dict_examp": "an artificial smile", "lear_examp": "Miss Bartlett probably comes from the poorer part of the family and that is why she always tries to show her unselfishness to Lucy but this is done in a very artificial and annoying way."}]}]}, {"word": "as", "poses": [{"pos": "adverb; preposition", "senses": [{"sense": "used to talk about the job someone has", "level": "A1", "dict_examp": "She works as a waitress.", "lear_examp": "He works in a school as a teacher."}, {"sense": "also", "level": "A1", "dict_examp": "Are you going to invite Steve as well?", "lear_examp": "Dylma goes to school every day and works as well."}, {"sense": "in addition to", "level": "A2", "dict_examp": "They have lived in the United States as well as Britain.", "lear_examp": "I like pop as well as country music."}, {"sense": "like or in the same way", "level": "A2", "dict_examp": "We used the box as a table.", "lear_examp": "It is very useful because you can use it as a camera."}, {"sense": "used to compare two things, people, amounts, etc.", "level": "A2", "dict_examp": "She'll soon be as tall as her mother.", "lear_examp": "The air isn't as good as in the countryside because of the pollution."}, {"sense": "as much/quickly/soon, etc. as something can happen or be done", "level": "A2", "dict_examp": "Please sit down as quickly as possible.", "lear_examp": "I need it as soon as possible."}, {"sense": "in the way that happens most of the time", "level": "A2", "dict_examp": "As usual, James was the last to arrive.", "lear_examp": "As usual, I'll travel by plane."}, {"sense": "being or appearing to be a particular thing", "level": "B1", "dict_examp": "He was dressed as a pirate.", "lear_examp": "She was there, standing in front of me, still dressed as a bride, with tears in her eyes."}, {"sense": "at the same time or a very short time after", "level": "B1", "dict_examp": "As soon as I saw her, I knew there was something wrong.", "lear_examp": "As soon as the rain stopped, I called my friend and we all continued walking in the park, and we all enjoyed ourselves."}, {"sense": "used to say that something must happen before something else can happen", "level": "B1", "dict_examp": "I can come as long as I can leave by 4:00.", "lear_examp": "The colors I wear are not important, as long as I don't wear any pink clothes. I really dislike that color."}, {"sense": "used at the beginning of a sentence to introduce a slightly different subject, but one that is connected in some way", "level": "B2", "dict_examp": "I was pleased about the news. As for Emily, well, who cares what she thinks?", "lear_examp": "Now, as for the camping, I admit that I'm not a great fan of it."}, {"sense": "because of something", "level": "B2", "dict_examp": "Unemployment has risen as a result of the credit crunch.", "lear_examp": "On more than one occasion I missed the new releases or arrived late, as a result of trusting the theater's website."}, {"sense": "when considered as a group and not in parts", "level": "B2", "dict_examp": "The population as a whole is getting healthier.", "lear_examp": "To sum up, I can say that the greatest ever invention is the invention of computers, that has affected both individuals and society as a whole."}, {"sense": "used to give more information, or to correct something that has been said", "level": "B2", "dict_examp": "John plays golf professionally. As a matter of fact, he has just won a big tournament.", "lear_examp": "I think it would be better to choose somewhere outdoors. As a matter of fact, I prefer the open air and the sunlight!"}, {"sense": "used to introduce a list or description", "level": "B2", "dict_examp": "The main reasons are as follows.", "lear_examp": "The errors made in the newspaper are as follows."}, {"sense": "used to describe how a situation seems to be", "level": "B2", "dict_examp": "It looks as if it might rain.", "lear_examp": "Everything was so familiar, as though he had never left the place."}, {"sense": "used to show what someone thinks about something", "level": "B2", "dict_examp": "As far as I'm concerned, feng shui is just nonsense.", "lear_examp": "As far as Laura was concerned, he was the most disgusting man in the world."}, {"sense": "used to tell someone what you are talking about", "level": "B2", "dict_examp": "As far as money is concerned, we're doing very well.", "lear_examp": "First of all, I think the Majestic Hotel would be the right location, but I have doubts as far as the costs are concerned."}, {"sense": "used to say that you think something is true, but cannot be sure", "level": "B2", "dict_examp": "As far as I know, he's never been in trouble with the police.", "lear_examp": "As far as I know this hotel is very comfortable."}, {"sense": "something that you say in order to introduce a surprising fact", "level": "C1", "dict_examp": "As it happens, her birthday is the day after mine.", "lear_examp": "As it happens, I am currently looking for a computer course for myself and I would like to join one of your courses."}, {"sense": "used before a number or amount to show that the number or amount is large", "level": "C1", "dict_examp": "As many as 6,000 people may have been infected with the disease.", "lear_examp": "The quantities of goods by pipeline in 2002 was approximately 10 times as many as that in 1974, 21 and 2 million tonnes respectively."}, {"sense": "until and including this time", "level": "C1", "dict_examp": "I haven't heard as yet if their flight has arrived.", "lear_examp": "I would like to do something about it, but as I can't imagine building anything near my beautiful house (because I'm afraid it would destroy its wonderful harmony), I have no idea as yet how to solve this problem."}, {"sense": "used to talk about one thing that is the result of another", "level": "C1", "dict_examp": "A lot of birds died as a consequence of the oil spill.", "lear_examp": "The influence from Italy is very strong and, as a consequence, pasta with different sauces is common in Slovenia, especially among students."}, {"sense": "used to show that the name of something tells you something about it", "level": "C2", "dict_examp": "A \"suggested price\" is, as the name implies, the sale price suggested by the manufacturer.", "lear_examp": "Sour Sweet, as the name implies, is originally a Chinese restaurant."}, {"sense": "rather than or instead of", "level": "C2", "dict_examp": "I’d prefer to go in May, as opposed to September.", "lear_examp": "What is more important, the majority of shoppers have changed their attitude to shopping radically.   They now take it as something engrossing and satisfying as opposed to what it used to be - tiring, exhausting and infuriating."}, {"sense": "as something is now, without changes in it", "level": "C2", "dict_examp": "The law as it stands is very unclear.", "lear_examp": "In my opinion, this debate is rooted in a deeper questioning of society's foundations: some people see society as it stands today as inherently flawed, an amorphous group of people who follow and worship anyone that gives them pleasure."}]}, {"pos": "conjunction", "senses": [{"sense": "because", "level": "A2", "dict_examp": "As it was getting late, I decided to check into a hotel.", "lear_examp": "I need it as I have to return it to the library."}, {"sense": "while or during the time that", "level": "B1", "dict_examp": "I saw him as I was coming into the building.", "lear_examp": "After spending two hours searching for her I started to feel desperate, but just as I was ready to give up, the sky got normal again and I found myself at my own wedding and she was my wife!"}, {"sense": "in the same way", "level": "B1", "dict_examp": "He got divorced, (just) as his parents had done years before.", "lear_examp": "As we expected, we are going to see a movie tonight."}]}]}, {"word": "arrival", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something arrives somewhere", "level": "B1", "dict_examp": "Hundreds gathered to await the boxer's arrival at the airport.", "lear_examp": "Can you confirm your arrival time next week?"}, {"sense": "a new thing or person that has arrived", "level": "C1", "dict_examp": "Two teachers were there to greet the new arrivals.", "lear_examp": "Secondly, a barbecue would be a good thing to do on the 1st of September, to welcome the new arrivals."}, {"sense": "when something new is discovered or created or becomes available", "level": "C2", "dict_examp": "The arrival of the railroad changed the western US.", "lear_examp": "With the arrival of capitalism, the mass-production of garments inherent to this system has raised the issue of whether what people wear reflects their personality."}]}]}, {"word": "asset", "poses": [{"pos": "noun", "senses": [{"sense": "a person, skill or quality that is useful or helps you to succeed", "level": "C1", "dict_examp": "He'll be a great asset to the team.", "lear_examp": "I am sure that you will be more than satisfied with him and that he is going to be an asset to your hotel."}, {"sense": "something which a person or company owns that has a value", "level": "C1", "dict_examp": "The company has $70 billion in assets.", "lear_examp": "Somehow, all his assets were frozen by the bank and the family became poor overnight."}]}]}, {"word": "ashamed", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling guilty or embarrassed about something you have done", "level": "B1", "dict_examp": "You've got nothing to be ashamed of.", "lear_examp": "He felt very ashamed and didn't know what to do."}, {"sense": "to be angry and disappointed with a family member or friend because they have behaved badly", "level": "B2", "dict_examp": "My brother was so rude to Jane - I was ashamed of him.", "lear_examp": "I was very ashamed of them. They came from my own country."}]}]}, {"word": "ask", "poses": [{"pos": "verb", "senses": [{"sense": "to say a question to someone which you want them to answer", "level": "A1", "dict_examp": "She asked me a question.", "lear_examp": "You asked me about a day at college."}, {"sense": "to invite someone to do something", "level": "A2", "dict_examp": "I've asked David to the party.", "lear_examp": "Thank you for asking me to your wedding."}, {"sense": "to say something to someone because you want them to do something", "level": "B1", "dict_examp": "They've asked me to look after their dog while they're away.", "lear_examp": "I want to apologize for not going to your class tomorrow, it's not that I don't want to go but my mother asked me to take care of my sister because she is sick and my parents have to work."}, {"sense": "to say something to someone because you want them to give you something", "level": "B1", "dict_examp": "He's asked for a bike for his birthday.", "lear_examp": "I can ask my parents for a stereo for Christmas, but I'm not sure if they will agree or not."}, {"sense": "to say something to someone because you want to know if you can do something", "level": "B1", "dict_examp": "Bruce asked if he could stay with us for a few days.", "lear_examp": "I am going to travel with my girlfriend Anna, so I am writing you this email to ask if you can lend me your bicycle for a week."}, {"sense": "said when someone asks you about an experience that was very bad", "level": "B2", "dict_examp": "\"How was the meeting?\" \"Don't ask!\"", "lear_examp": "Don't ask me how the concert was!"}, {"sense": "used to tell someone that you do not know the answer to a question and that you are surprised they have asked you", "level": "B2", "dict_examp": "\"So why would she leave such a good job?\" \"Don't ask me!\"", "lear_examp": ""}, {"sense": "said when giving your opinion on something", "level": "C2", "dict_examp": "If you ask me, he doesn't really care about his friends.", "lear_examp": "If you ask me, the things that matter in a job are the people you work with and feeling happy about the work you are doing."}, {"sense": "to think about something carefully", "level": "C2", "dict_examp": "You've got to ask yourself whether it's what you really want.", "lear_examp": "You have to ask yourself what life is worth in these situations."}]}]}, {"word": "assertive", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving or speaking in a strong, confident way", "level": "C2", "dict_examp": "You need to be much more assertive.", "lear_examp": "I want to learn how to be more assertive, find emotional independence, fulfil my dreams, be more tolerant, less sarcastic and, most importantly, be given the precious gift of patience."}]}]}, {"word": "assessment", "poses": [{"pos": "noun", "senses": [{"sense": "when you make a judgement about the quality, size or value, etc. of something", "level": "B2", "dict_examp": "That's a fair assessment of the situation.", "lear_examp": "Secondly, I was a little bit upset about your assessment of the other performers because they showed us their great musical talents."}]}]}, {"word": "aspiring", "poses": [{"pos": "adjective", "senses": [{"sense": "someone who hopes to become a successful writer/actor/artist, etc.", "level": "C2", "dict_examp": "Marcus is an aspiring actor.", "lear_examp": "Mary Peterson was a young woman who was an aspiring journalist."}]}]}, {"word": "assert", "poses": [{"pos": "verb", "senses": [{"sense": "to say that something is certainly true", "level": "C1", "dict_examp": "He asserts that she stole money from him.", "lear_examp": "It could be asserted that less financially able children are better equipped to cope with potential life problems than the more fortunate children."}, {"sense": "to behave or speak in a strong, confident way", "level": "C2", "dict_examp": "She has to learn to assert herself.", "lear_examp": "Such an attitude may also be the result of little pangs of homesickness or of our need to assert ourselves, to feel superior in a foreign country."}, {"sense": "to do something to show other people that you have power", "level": "C2", "dict_examp": "She soon asserted her authority as leader.", "lear_examp": "He can assert his authority over all the boys who are there."}]}]}, {"word": "assess", "poses": [{"pos": "verb", "senses": [{"sense": "to make a judgement about the quality, size or value, etc. of something", "level": "B2", "dict_examp": "Examinations are a way of assessing a student's ability.", "lear_examp": "The aim of this report is to compare and assess the architecture, food and service of two restaurants in my area."}]}]}, {"word": "assign", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone a particular job or responsibility", "level": "C1", "dict_examp": "UN forces were assigned the task of rebuilding the hospital.", "lear_examp": "Some of the work they were assigned was quite boring for them."}, {"sense": "to give someone a particular job or place to work", "level": "C2", "dict_examp": "Which police officer has been assigned to this case?", "lear_examp": "She was assigned to Sanming Police Station."}]}]}, {"word": "asleep", "poses": [{"pos": "adjective", "senses": [{"sense": "sleeping or not awake", "level": "B1", "dict_examp": "The children are asleep.", "lear_examp": "I prefer reading alone, when I'm in my bed before I fall asleep."}, {"sense": "If part of your body is asleep, you cannot feel it.", "level": "C2", "dict_examp": "My arm fell asleep.", "lear_examp": ""}, {"sense": "completely asleep", "level": "C2", "dict_examp": "I looked into his room but he was still  fast asleep.", "lear_examp": "Then she took a relaxing bath and 20 minutes later she was fast asleep."}]}]}, {"word": "aspiration", "poses": [{"pos": "noun", "senses": [{"sense": "something that you hope to achieve", "level": "C2", "dict_examp": "I've never had any political aspirations.", "lear_examp": "A career should reflect a person's beliefs and aspirations, not their bank account."}]}]}, {"word": "assembly", "poses": [{"pos": "noun", "senses": [{"sense": "a group of people, such as a government, who meet to make decisions, laws, etc.", "level": "C2", "dict_examp": "The state assembly will vote on a tax bill next week.", "lear_examp": "I hope that it won't be necessary to talk to our local Assembly representative, because that would only make this process longer."}, {"sense": "when you build something by attaching parts together", "level": "C2", "dict_examp": "The frame needs to be strong enough to support the engine assembly.", "lear_examp": "The spring beneath one of the 3 seats integrated with the sofa assembly also seems to be broken."}]}]}, {"word": "aside", "poses": [{"pos": "adverb", "senses": [{"sense": "on or to one side", "level": "B2", "dict_examp": "Stand aside, please, and let these people pass.", "lear_examp": "I saw an old man slowly pull it aside and peep out, looking at the street with his eyes wide open."}, {"sense": "If you put or set something aside, you do not use it now, but keep it to use later.", "level": "B2", "dict_examp": "We've put some money aside for our vacation.", "lear_examp": "I had put some money aside for a month, thinking about the discount."}, {"sense": "except for", "level": "B2", "dict_examp": "This document needs finishing, but aside from that I think everything is done.", "lear_examp": "Secondly, it is unfair to say the other performers were second-rate aside from the Torrents, since they all sang and played very well."}]}]}, {"word": "aspire", "poses": [{"pos": "verb", "senses": [{"sense": "to hope to achieve something", "level": "C2", "dict_examp": "He has never aspired to a position of power.", "lear_examp": "The younger generation often see some of these people as role-models and aspire to a similar career and easy fame, but although I can understand their interest, I do not see this as a positive thing."}]}]}, {"word": "aspect", "poses": [{"pos": "noun", "senses": [{"sense": "one part of a situation, problem, subject, etc.", "level": "B2", "dict_examp": "Which aspects of the job do you most enjoy?", "lear_examp": "Every aspect of our daily life is influenced by technology."}]}]}, {"word": "assemble", "poses": [{"pos": "verb", "senses": [{"sense": "to build something by joining parts together", "level": "C2", "dict_examp": "Their furniture is easy to assemble.", "lear_examp": "The people of the nearby town suffer from unemployment and this makes the Town Hall dignitaries take a package of measures, for example, build a plant for assembling cars where thousands of people will be employed."}, {"sense": "to join other people somewhere to make a group, or to bring people together into a group", "level": "C2", "dict_examp": "They assembled in the meeting room after lunch.", "lear_examp": "Soon a rescue team was assembled by experienced skiers and climbers, and started combing the mountain looking for the missing snowboarder."}]}]}, {"word": "aspirin", "poses": [{"pos": "noun", "senses": [{"sense": "a common drug used to reduce pain and fever", "level": "B1", "dict_examp": "I took a couple of aspirin.", "lear_examp": "I took an aspirin quickly."}]}]}, {"word": "as", "poses": [{"pos": "adverb; preposition", "senses": [{"sense": "used to talk about the job someone has", "level": "A1", "dict_examp": "She works as a waitress.", "lear_examp": "He works in a school as a teacher."}, {"sense": "also", "level": "A1", "dict_examp": "Are you going to invite Steve as well?", "lear_examp": "Dylma goes to school every day and works as well."}, {"sense": "in addition to", "level": "A2", "dict_examp": "They have lived in the United States as well as Britain.", "lear_examp": "I like pop as well as country music."}, {"sense": "like or in the same way", "level": "A2", "dict_examp": "We used the box as a table.", "lear_examp": "It is very useful because you can use it as a camera."}, {"sense": "used to compare two things, people, amounts, etc.", "level": "A2", "dict_examp": "She'll soon be as tall as her mother.", "lear_examp": "The air isn't as good as in the countryside because of the pollution."}, {"sense": "as much/quickly/soon, etc. as something can happen or be done", "level": "A2", "dict_examp": "Please sit down as quickly as possible.", "lear_examp": "I need it as soon as possible."}, {"sense": "in the way that happens most of the time", "level": "A2", "dict_examp": "As usual, James was the last to arrive.", "lear_examp": "As usual, I'll travel by plane."}, {"sense": "being or appearing to be a particular thing", "level": "B1", "dict_examp": "He was dressed as a pirate.", "lear_examp": "She was there, standing in front of me, still dressed as a bride, with tears in her eyes."}, {"sense": "at the same time or a very short time after", "level": "B1", "dict_examp": "As soon as I saw her, I knew there was something wrong.", "lear_examp": "As soon as the rain stopped, I called my friend and we all continued walking in the park, and we all enjoyed ourselves."}, {"sense": "used to say that something must happen before something else can happen", "level": "B1", "dict_examp": "I can come as long as I can leave by 4:00.", "lear_examp": "The colors I wear are not important, as long as I don't wear any pink clothes. I really dislike that color."}, {"sense": "used at the beginning of a sentence to introduce a slightly different subject, but one that is connected in some way", "level": "B2", "dict_examp": "I was pleased about the news. As for Emily, well, who cares what she thinks?", "lear_examp": "Now, as for the camping, I admit that I'm not a great fan of it."}, {"sense": "because of something", "level": "B2", "dict_examp": "Unemployment has risen as a result of the credit crunch.", "lear_examp": "On more than one occasion I missed the new releases or arrived late, as a result of trusting the theater's website."}, {"sense": "when considered as a group and not in parts", "level": "B2", "dict_examp": "The population as a whole is getting healthier.", "lear_examp": "To sum up, I can say that the greatest ever invention is the invention of computers, that has affected both individuals and society as a whole."}, {"sense": "used to give more information, or to correct something that has been said", "level": "B2", "dict_examp": "John plays golf professionally. As a matter of fact, he has just won a big tournament.", "lear_examp": "I think it would be better to choose somewhere outdoors. As a matter of fact, I prefer the open air and the sunlight!"}, {"sense": "used to introduce a list or description", "level": "B2", "dict_examp": "The main reasons are as follows.", "lear_examp": "The errors made in the newspaper are as follows."}, {"sense": "used to describe how a situation seems to be", "level": "B2", "dict_examp": "It looks as if it might rain.", "lear_examp": "Everything was so familiar, as though he had never left the place."}, {"sense": "used to show what someone thinks about something", "level": "B2", "dict_examp": "As far as I'm concerned, feng shui is just nonsense.", "lear_examp": "As far as Laura was concerned, he was the most disgusting man in the world."}, {"sense": "used to tell someone what you are talking about", "level": "B2", "dict_examp": "As far as money is concerned, we're doing very well.", "lear_examp": "First of all, I think the Majestic Hotel would be the right location, but I have doubts as far as the costs are concerned."}, {"sense": "used to say that you think something is true, but cannot be sure", "level": "B2", "dict_examp": "As far as I know, he's never been in trouble with the police.", "lear_examp": "As far as I know this hotel is very comfortable."}, {"sense": "something that you say in order to introduce a surprising fact", "level": "C1", "dict_examp": "As it happens, her birthday is the day after mine.", "lear_examp": "As it happens, I am currently looking for a computer course for myself and I would like to join one of your courses."}, {"sense": "used before a number or amount to show that the number or amount is large", "level": "C1", "dict_examp": "As many as 6,000 people may have been infected with the disease.", "lear_examp": "The quantities of goods by pipeline in 2002 was approximately 10 times as many as that in 1974, 21 and 2 million tonnes respectively."}, {"sense": "until and including this time", "level": "C1", "dict_examp": "I haven't heard as yet if their flight has arrived.", "lear_examp": "I would like to do something about it, but as I can't imagine building anything near my beautiful house (because I'm afraid it would destroy its wonderful harmony), I have no idea as yet how to solve this problem."}, {"sense": "used to talk about one thing that is the result of another", "level": "C1", "dict_examp": "A lot of birds died as a consequence of the oil spill.", "lear_examp": "The influence from Italy is very strong and, as a consequence, pasta with different sauces is common in Slovenia, especially among students."}, {"sense": "used to show that the name of something tells you something about it", "level": "C2", "dict_examp": "A \"suggested price\" is, as the name implies, the sale price suggested by the manufacturer.", "lear_examp": "Sour Sweet, as the name implies, is originally a Chinese restaurant."}, {"sense": "rather than or instead of", "level": "C2", "dict_examp": "I’d prefer to go in May, as opposed to September.", "lear_examp": "What is more important, the majority of shoppers have changed their attitude to shopping radically.   They now take it as something engrossing and satisfying as opposed to what it used to be - tiring, exhausting and infuriating."}, {"sense": "as something is now, without changes in it", "level": "C2", "dict_examp": "The law as it stands is very unclear.", "lear_examp": "In my opinion, this debate is rooted in a deeper questioning of society's foundations: some people see society as it stands today as inherently flawed, an amorphous group of people who follow and worship anyone that gives them pleasure."}]}, {"pos": "conjunction", "senses": [{"sense": "because", "level": "A2", "dict_examp": "As it was getting late, I decided to check into a hotel.", "lear_examp": "I need it as I have to return it to the library."}, {"sense": "while or during the time that", "level": "B1", "dict_examp": "I saw him as I was coming into the building.", "lear_examp": "After spending two hours searching for her I started to feel desperate, but just as I was ready to give up, the sky got normal again and I found myself at my own wedding and she was my wife!"}, {"sense": "in the same way", "level": "B1", "dict_examp": "He got divorced, (just) as his parents had done years before.", "lear_examp": "As we expected, we are going to see a movie tonight."}]}]}, {"word": "assault", "poses": [{"pos": "noun", "senses": [{"sense": "an attack", "level": "C2", "dict_examp": "an assault on a police officer", "lear_examp": "Rapes, assaults, murders, burglaries, and robberies have been so frequent that a lot of technological progress has been made in order to prevent these from happening."}]}, {"pos": "verb", "senses": [{"sense": "to attack someone violently", "level": "C2", "dict_examp": "He was assaulted by a minor who cannot be named.", "lear_examp": "It is said that the boat was coming back to Boston's Port after having assaulted a royal ship and taken all its treasures when it came across this hurricane, Hurricane Hugo."}]}]}, {"word": "assume", "poses": [{"pos": "verb", "senses": [{"sense": "to think that something is true, without question or proof", "level": "B2", "dict_examp": "I assumed (that) you knew each other because you went to the same school.", "lear_examp": "The police assumed he was lying so they put him in jail."}, {"sense": "to take a position of control/power/responsibility, etc.", "level": "C2", "dict_examp": "He has assumed the role of spokesman for the group.", "lear_examp": "She got involved in the marketing business there and assumed responsibility very soon - she became the marketing director for continental Europe."}]}]}, {"word": "assignment", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of work, especially school work, or a job that you are given to do", "level": "B1", "dict_examp": "a vocabulary/reading/math assignment", "lear_examp": "I'll ask Susan about today's assignments."}]}]}, {"word": "astonished", "poses": [{"pos": "adjective", "senses": [{"sense": "very surprised", "level": "B2", "dict_examp": "I was astonished to see Miriam there.", "lear_examp": "She was astonished when she saw what was in front of her."}]}]}, {"word": "association", "poses": [{"pos": "noun", "senses": [{"sense": "an organization of people with the same interests or with  a particular purpose", "level": "B2", "dict_examp": "the American Medical Association", "lear_examp": "I am a member of the local Kung-Fu Association."}, {"sense": "working together with", "level": "C1", "dict_examp": "The event was organized in association with the Student Council.", "lear_examp": "This service, which will be provided in association with Foster Loft, will be available at the end of 2005."}, {"sense": "a connection or relationship between two things or people", "level": "C2", "dict_examp": "There is no association between the two groups.", "lear_examp": "The second example is people who wear clothes such as black leather suits and black or purple lip-stick, showing their association with a particular genre of music."}]}]}, {"word": "assumption", "poses": [{"pos": "noun", "senses": [{"sense": "something that you think is true without having any proof", "level": "C1", "dict_examp": "People tend to make assumptions about you when you have a disability.", "lear_examp": "But if this assumption is right, and if you consider how much fashion has changed over the last 60 years, does this mean that we are so very different from our grandparents?"}]}]}, {"word": "astronomy", "poses": [{"pos": "noun", "senses": [{"sense": "the scientific study of stars and planets", "level": "C2", "dict_examp": "This is the biggest step forward in astronomy since Galileo's first telescope over four hundred years ago.", "lear_examp": "Her father was famous for his vast knowledge of astronomy and books he wrote on this subject."}]}]}, {"word": "astonishment", "poses": [{"pos": "noun", "senses": [{"sense": "very great surprise", "level": "B2", "dict_examp": "To my astonishment, she started laughing.", "lear_examp": "To our astonishment, we were in front of a small house which seemed to have been built centuries ago."}]}]}, {"word": "assure", "poses": [{"pos": "verb", "senses": [{"sense": "to tell someone confidently that something is true, especially so that they do not worry", "level": "B2", "dict_examp": "She assured him (that) the car would be ready the next day.", "lear_examp": "I can assure you that the food will be delicious."}, {"sense": "to make something certain to happen", "level": "C1", "dict_examp": "This loan should assure the company's future.", "lear_examp": "The PT is guaranteed to assure higher test results or your money back!"}]}]}, {"word": "assistant", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to help a person who has a more important job", "level": "B1", "dict_examp": "an administrative assistant", "lear_examp": "He went to take the bag from his assistant."}]}]}, {"word": "associate", "poses": [{"pos": "verb", "senses": [{"sense": "to be related to something or caused by something", "level": "B2", "dict_examp": "There are many risks associated with smoking.", "lear_examp": "Undoubtedly there are both positive and negative points associated with this topic."}, {"sense": "to connect someone or something in your mind with someone or something else", "level": "C1", "dict_examp": "Most people associate this brand with good quality.", "lear_examp": "Nowadays we tend to associate computer games or television with young people."}, {"sense": "to spend time with or have a connection with someone", "level": "C2", "dict_examp": "I don't want you associating with that crowd - they're always getting into trouble.", "lear_examp": "This is a place where a lot of homeless people find shelter and even drug addicts go there to hide. So, it is clear that it is essential to protect our children from associating with all these people."}]}]}, {"word": "assistance", "poses": [{"pos": "noun", "senses": [{"sense": "help", "level": "B2", "dict_examp": "Can I be of any assistance?", "lear_examp": "Thank you for your assistance."}]}]}, {"word": "astonishing", "poses": [{"pos": "adjective", "senses": [{"sense": "very surprising", "level": "B2", "dict_examp": "Her first novel enjoyed an astonishing level of success.", "lear_examp": "The Lakeside Inn, is not an expensive one, at all, it has got a good restaurant, nice service and an astonishing view of Lake Frene."}]}]}, {"word": "assurance", "poses": [{"pos": "noun", "senses": [{"sense": "a promise", "level": "C1", "dict_examp": "He gave us his assurance that it would not happen again.", "lear_examp": "Again, may I give my assurances that the above two requests for equipment acquisition would be money well spent for our company."}, {"sense": "confidence", "level": "C2", "dict_examp": "He spoke with calm assurance.", "lear_examp": "\"I urge you to stay calm and wait for the rescue team,\" said Mark with assurance."}]}]}, {"word": "at", "poses": [{"pos": "preposition", "senses": [{"sense": "used to show the place or position of something", "level": "A1", "dict_examp": "She's at home/work.", "lear_examp": "I met her at sewing classes."}, {"sense": "used to show the time something happens", "level": "A1", "dict_examp": "There's a meeting at 2:30 this afternoon.", "lear_examp": "I go to work at 7:30."}, {"sense": "toward or in the direction of", "level": "A1", "dict_examp": "She smiled at me.", "lear_examp": "I like walking around these lakes and looking at ducks and swans."}, {"sense": "the @ symbol, used in e-mail addresses to separate the name of a person, department, etc. from the name of the company", "level": "A1", "dict_examp": "dictionary at cambridge dot org", "lear_examp": ""}, {"sense": "used to show the cause of something, especially a feeling", "level": "A2", "dict_examp": "We were surprised at the news.", "lear_examp": "I was very surprised at my English teacher, as she is an old lady and must be at least seventy years old."}, {"sense": "as much as, or more than, a number, amount, distance, etc.", "level": "A2", "dict_examp": "It will cost at least $500.", "lear_examp": "I can write at least once a week."}, {"sense": "used after an adjective to show a person's ability to do something", "level": "B1", "dict_examp": "I'm not very good at skiing.", "lear_examp": "She is really good at tennis."}, {"sense": "used for emphasis in questions or negative statements, to mean in any way or of any type", "level": "B1", "dict_examp": "Are you sure I can't help at all?", "lear_examp": "The sun was shining and there were no clouds at all, so we could see the light blue sky."}, {"sense": "at the highest level of achievement or quality", "level": "B1", "dict_examp": "This article is an example of journalism at its best.", "lear_examp": "I enjoyed this trip because we got to stay in the countryside and see nature at its very best."}, {"sense": "finally", "level": "B1", "dict_examp": "At last, I've found a pair of jeans that actually fit.", "lear_examp": "At last, all of us agreed on \"Cinema Farhang\"."}, {"sense": "even if nothing else happens or is true", "level": "B1", "dict_examp": "If you don't have time to clean the whole house, at least make sure the kitchen is clean.", "lear_examp": "We could go shopping or at least go and have an ice-cream somewhere."}, {"sense": "something that you say when you are telling someone about something good in a bad situation", "level": "B1", "dict_examp": "It's a small house but at least there's a backyard.", "lear_examp": "It is not impressive but at least it has some things that I like."}, {"sense": "at the beginning of a situation or period of time", "level": "B1", "dict_examp": "At first I thought she was unfriendly, but actually she's just shy.", "lear_examp": "At first, when I arrived I was very nervous because I didn't know anyone, but then a girl started talking to me and I felt better."}, {"sense": "If two things happen at the same time, they happen together.", "level": "B1", "dict_examp": "We arrived at the same time.", "lear_examp": "The kind of clothes I most like are casual but fashionable at the same time."}, {"sense": "immediately", "level": "B1", "dict_examp": "I knew at once that I'd like it here.", "lear_examp": "She called for an ambulance which came at once."}, {"sense": "used to reduce the effect of a statement", "level": "B2", "dict_examp": "I've met the President - at least, he shook my hand once.", "lear_examp": "But after years of developing my slalom, I wanted to learn something new, so, I started Hot-Dogging. Hot-Dog is great fun.  At least, people say so."}, {"sense": "used to show a price, temperature, rate, speed, etc.", "level": "B2", "dict_examp": "He was driving at 120 mph when the police spotted him.", "lear_examp": ""}, {"sense": "If something must be done at all costs, it is very important that it is done.", "level": "B2", "dict_examp": "We have to succeed at all costs.", "lear_examp": "One thing was sure: he was convinced he had to save Anne's life at all costs."}, {"sense": "available for you to use at any time", "level": "B2", "dict_examp": "We will have a car at our disposal for the whole trip.", "lear_examp": "But on Wednesday morning I'm at your disposal."}, {"sense": "responsible for something bad that has happened", "level": "B2", "dict_examp": "I was the one at fault and I apologized.", "lear_examp": "I really felt at fault."}, {"sense": "being in a situation where something bad is likely to happen", "level": "B2", "dict_examp": "All houses within 400 feet of the beach are at risk of flooding.", "lear_examp": "Lives are at risk!"}, {"sense": "If you do one thing at the expense of another, doing the first thing harms the second thing.", "level": "C1", "dict_examp": "He spent a lot of time at work, at the expense of his marriage.", "lear_examp": "Unfortunately one is usually done at the expense of the other."}, {"sense": "If you accept something at face value because of the way it first looks or seems, you do so without thinking carefully about it.", "level": "C1", "dict_examp": "You can't just accept everything you read in the newspapers at face value.", "lear_examp": "People are assessed at face value by the type of cars they drive."}, {"sense": "If you see or understand something at a glance, you see or understand it almost immediately.", "level": "C1", "dict_examp": "He could tell at a glance that something was wrong.", "lear_examp": "You could tell at a glance that Peter was a loner."}, {"sense": "near in time or space", "level": "C1", "dict_examp": "Teachers are always close at hand to give help to any child who needs it.", "lear_examp": "I haven't had any lectures in English, but now and then there are lectures in English at the University so you need to understand the spoken language with no dictionary at hand."}, {"sense": "not less than, and probably much more than", "level": "C1", "dict_examp": "At the very least, you should apologize.", "lear_examp": "Thus, I trust you will agree that at the very least I deserve a letter of explanation from you and a substantial refund of my money."}, {"sense": "chosen by chance", "level": "C1", "dict_examp": "Winners will be chosen at random.", "lear_examp": "The rooms suggested to be filmed have not been chosen at random."}, {"sense": "sometimes", "level": "C1", "dict_examp": "At times, I wish I didn't have to go to school.", "lear_examp": "STUDYING METHODS All teachers at the college are highly skilled professionals and can be very demanding at times, but this is in your best interest."}, {"sense": "when you first see or hear about something or someone", "level": "C1", "dict_examp": "It may, at first sight, seem a surprising choice.", "lear_examp": "I must admit that, at first sight, I did not feel like reading it, but later I made up my mind and decided to accept your invitation."}, {"sense": "used to show that the most positive way of considering something is still not good", "level": "C2", "dict_examp": "If he drops the course now, at best he’ll get an incomplete, and he could fail.", "lear_examp": "Then, due to the social standards, the old find themselves being abandoned and helpless. At best, such people are hospitalized."}, {"sense": "used to show that something is not good when it is the best it can be", "level": "C2", "dict_examp": "He's not exactly patient at the best of times.", "lear_examp": "They knew that even at the best of times he looked unpleasant but now he was of a completely different appearance."}, {"sense": "having problems that other people do not have", "level": "C2", "dict_examp": "Being shy puts him at a disadvantage.", "lear_examp": "These children are also at a disadvantage in terms of education, they may not be able to go to good school, engage in extracurricular activities like sports and music which can be quite expensive if you are living on a budget."}, {"sense": "in order to make someone look stupid", "level": "C2", "dict_examp": "Stop making jokes at my expense.", "lear_examp": "But despite his intellectual superiority, Piggy was subject to derision because of his physical outward appearance and the group of boys played jokes at his expense."}, {"sense": "If you have something at your fingertips, you can get it and use it very easily.", "level": "C2", "dict_examp": "He had all the information needed at his fingertips.", "lear_examp": "An Internet connection literally means having the world at your fingertips."}, {"sense": "used to say what someone is really like", "level": "C2", "dict_examp": "I'm just a kid at heart.", "lear_examp": "I also thought that she was brave at heart."}, {"sense": "most important in what is being discussed", "level": "C2", "dict_examp": "The point at issue is what is best for the child.", "lear_examp": "I wouldn't like to fall into the trap of generalizing the matter at issue, but I believe there are two ways of traveling."}, {"sense": "used after a time or date to say that something could happen before but not after that time", "level": "C2", "dict_examp": "She said to be there by 8 o'clock at the latest.", "lear_examp": "As far as employment is concerned, as people take their pensions at the age of 65 at the latest, new staff cannot be recruited."}, {"sense": "If you talk about something at length, you talk for a long time.", "level": "C2", "dict_examp": "We discussed both topics at length.", "lear_examp": "Since we have already arranged for your family to come to stay in my home and discussed the arrangements at length and in detail, I will no longer bother you with terms of payment and other information that, judging by your letter, seems to be quite irrelevant."}, {"sense": "to be allowed to do something", "level": "C2", "dict_examp": "I'm not at liberty to discuss the matter at present.", "lear_examp": "On the one hand the child is at liberty to do whatever it pleases to do but on the other hand it was never taught the responsibilities implicitly tied to such actions."}, {"sense": "not knowing what to do", "level": "C2", "dict_examp": "I'm at a loss to explain his disappearance.", "lear_examp": "And now I am completely at a loss what to write next."}, {"sense": "not knowing what to say", "level": "C2", "dict_examp": "The question was unexpected and she was temporarily at a loss for words.", "lear_examp": "If it was James I would be at a loss for words, I didn't know what to tell him."}, {"sense": "to not be able to protect yourself from something or someone that you cannot control", "level": "C2", "dict_examp": "Farmers are often at the mercy of the weather.", "lear_examp": "I couldn't believe I'd been careless enough to let them be at the mercy of Joanna's careless, boisterous friends, and I felt very lonely now, looking for them."}, {"sense": "to not agree with someone or something", "level": "C2", "dict_examp": "The two brothers were always at odds.", "lear_examp": "Young people are inexperienced as far as the world is concerned and thus they are frequently at odds with their family."}, {"sense": "If something useful is at a premium, there is not enough of it.", "level": "C2", "dict_examp": "Time is at a premium just before the start of exams.", "lear_examp": "Honesty and accuracy are very good virtues to strive for, but having friendship and a fair and caring relationship to your friend or partner have to be rated at a premium as well."}, {"sense": "used before saying what will happen if a situation continues in the same way", "level": "C2", "dict_examp": "At this rate we're not going to be there till midnight.", "lear_examp": ""}, {"sense": "used before saying one fact that is certain in a situation that you are generally not certain about", "level": "C2", "dict_examp": "Well, at any rate we need her to be there.", "lear_examp": "Nevertheless, at any rate, we would like to see a society with a full and strong workforce working towards stronger economic power."}, {"sense": "If you do something at your own risk, you are completely responsible for anything bad that might happen because of it.", "level": "C2", "dict_examp": "Customers may leave vehicles here at their own risk.", "lear_examp": "However, when a young man decides to go on a dangerous expedition, he should do so at his own risk and should not rely on help from anyone."}, {"sense": "at the young age of 8/17/25, etc.", "level": "C2", "dict_examp": "She first appeared on stage at the tender age of 12.", "lear_examp": "She met my father at the tender age of 14, and she soon knew that this was the man she wanted to stay with for the rest of her life."}, {"sense": "used to talk about an occasion in the past without saying exactly which occasion it was", "level": "C2", "dict_examp": "Most of us have made a similar mistake at one time or another.", "lear_examp": "Haven't we all at one time or another come home from a holiday feeling healthy and strong with a smile on our face thinking, this is what life is about."}, {"sense": "If something is at stake, it is in a situation where it might be lost or damaged.", "level": "C2", "dict_examp": "We have to act quickly - people's lives are at stake.", "lear_examp": "The whole human race's future is at stake."}]}]}, {"word": "assist", "poses": [{"pos": "verb", "senses": [{"sense": "to help", "level": "B2", "dict_examp": "The army arrived to assist in the search.", "lear_examp": "However, I used to assist my brother, who is a photographer."}]}]}, {"word": "atmosphere", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling which  exists in a place or situation", "level": "B1", "dict_examp": "There's a very relaxed atmosphere in our office.", "lear_examp": "You'll also love the friendly atmosphere here."}, {"sense": "the mixture of gases around the Earth", "level": "B2", "dict_examp": "These factories are releasing toxic gases into the atmosphere.", "lear_examp": "I'm against cars because their CO2 emissions destroy the atmosphere."}, {"sense": "the air inside a room or other place", "level": "B2", "dict_examp": "The atmosphere in the room was so stuffy I could hardly breathe.", "lear_examp": "The atmosphere in the halls also became hot and humid, thus making the whole experience rather unpleasant."}]}]}, {"word": "attend", "poses": [{"pos": "verb", "senses": [{"sense": "to go to an event, place, etc.", "level": "B1", "dict_examp": "Over two hundred people attended the funeral.", "lear_examp": "I attend one of these activities, it was cricket, it was for the whole day."}, {"sense": "to go regularly to a place, such as a  particular school", "level": "B1", "dict_examp": "Which school does your daughter attend?", "lear_examp": "I attend Northampton College, which is quite far away from my house."}]}]}, {"word": "atomic", "poses": [{"pos": "adjective", "senses": [{"sense": "using the energy that is created when an atom is divided", "level": "B2", "dict_examp": "atomic energy/power", "lear_examp": "There are lots more dangerous things in the world, like radioactive pollution or atomic bombs."}]}]}, {"word": "athlete", "poses": [{"pos": "noun", "senses": [{"sense": "a person who is very good at sports or physical exercise, especially one who competes in organized events", "level": "B1", "dict_examp": "He became a professional athlete at the age of 16.", "lear_examp": "It's amazing what the athletes can do, don't you think?"}]}]}, {"word": "attached", "poses": [{"pos": "adjective", "senses": [{"sense": "joined or connected to another thing", "level": "B2", "dict_examp": "Please fill out the attached form.", "lear_examp": "As I am an athletic swimmer and a good surfer too, my choice from your attached list is naturally swimming and surfing."}, {"sense": "feeling emotionally close to someone or something", "level": "C1", "dict_examp": "The children are very attached to their grandparents.", "lear_examp": "My only concern is that she is a bit shy and very attached to her family, but I really don't think it would be a problem since she travels a lot and has already spent two months abroad."}]}]}, {"word": "attack", "poses": [{"pos": "verb", "senses": [{"sense": "to try to hurt or defeat using violence", "level": "B1", "dict_examp": "He was attacked and seriously injured by a gang of youths.", "lear_examp": "At least he didn't attack me, and he even lent me his cell phone, he was such a gentle criminal."}, {"sense": "to strongly criticize someone or something", "level": "C1", "dict_examp": "She attacked the government's new education policy.", "lear_examp": "His behaviour was noticed, but the media could not attack such a successful negotiator."}, {"sense": "If a disease, chemical, etc., attacks someone or something, it damages it.", "level": "C2", "dict_examp": "The virus attacks the central nervous system.", "lear_examp": "There is a myriad of diseases that attack the less protected."}]}, {"pos": "noun", "senses": [{"sense": "a violent act intended to hurt or damage someone or something", "level": "B1", "dict_examp": "a racist attack", "lear_examp": "I have planned to see \"The attack of the super mutant aliens.\""}, {"sense": "when you say something to strongly criticize someone or something", "level": "C2", "dict_examp": "a scathing attack on the president", "lear_examp": "Young people often insist on doing everything on their own and consider advice almost an attack on their personal opinion."}]}]}, {"word": "attendance", "poses": [{"pos": "noun", "senses": [{"sense": "the number of people who go to an event, meeting, etc.", "level": "C1", "dict_examp": "falling attendance", "lear_examp": "Also in May, we had the swimming gala, which had a very high attendance from students as there were races for all abilities."}, {"sense": "when you go somewhere such as a church, school, etc. regularly", "level": "C1", "dict_examp": "His attendance at school is very poor.", "lear_examp": "Consequently, I would make attendance more flexible for the members."}, {"sense": "present at an event", "level": "C2", "dict_examp": "They have doctors in attendance at every match.", "lear_examp": "Professional coaches are in attendance and the members can have proper lessons."}]}]}, {"word": "attachment", "poses": [{"pos": "noun", "senses": [{"sense": "an extra piece of equipment that can be added to a machine", "level": "B2", "dict_examp": "This food processor has a special attachment for grinding coffee.", "lear_examp": ""}, {"sense": "a computer file that is sent together with an e-mail message", "level": "B2", "dict_examp": "I'll e-mail my report to you as an attachment.", "lear_examp": ""}, {"sense": "a feeling of love or strong connection to someone or something", "level": "C2", "dict_examp": "She had a special attachment to these students.", "lear_examp": "Despite this impression she rejected her growing attachment to George in order to fulfil her family's expectations."}]}]}, {"word": "at", "poses": [{"pos": "preposition", "senses": [{"sense": "used to show the place or position of something", "level": "A1", "dict_examp": "She's at home/work.", "lear_examp": "I met her at sewing classes."}, {"sense": "used to show the time something happens", "level": "A1", "dict_examp": "There's a meeting at 2:30 this afternoon.", "lear_examp": "I go to work at 7:30."}, {"sense": "toward or in the direction of", "level": "A1", "dict_examp": "She smiled at me.", "lear_examp": "I like walking around these lakes and looking at ducks and swans."}, {"sense": "the @ symbol, used in e-mail addresses to separate the name of a person, department, etc. from the name of the company", "level": "A1", "dict_examp": "dictionary at cambridge dot org", "lear_examp": ""}, {"sense": "used to show the cause of something, especially a feeling", "level": "A2", "dict_examp": "We were surprised at the news.", "lear_examp": "I was very surprised at my English teacher, as she is an old lady and must be at least seventy years old."}, {"sense": "as much as, or more than, a number, amount, distance, etc.", "level": "A2", "dict_examp": "It will cost at least $500.", "lear_examp": "I can write at least once a week."}, {"sense": "used after an adjective to show a person's ability to do something", "level": "B1", "dict_examp": "I'm not very good at skiing.", "lear_examp": "She is really good at tennis."}, {"sense": "used for emphasis in questions or negative statements, to mean in any way or of any type", "level": "B1", "dict_examp": "Are you sure I can't help at all?", "lear_examp": "The sun was shining and there were no clouds at all, so we could see the light blue sky."}, {"sense": "at the highest level of achievement or quality", "level": "B1", "dict_examp": "This article is an example of journalism at its best.", "lear_examp": "I enjoyed this trip because we got to stay in the countryside and see nature at its very best."}, {"sense": "finally", "level": "B1", "dict_examp": "At last, I've found a pair of jeans that actually fit.", "lear_examp": "At last, all of us agreed on \"Cinema Farhang\"."}, {"sense": "even if nothing else happens or is true", "level": "B1", "dict_examp": "If you don't have time to clean the whole house, at least make sure the kitchen is clean.", "lear_examp": "We could go shopping or at least go and have an ice-cream somewhere."}, {"sense": "something that you say when you are telling someone about something good in a bad situation", "level": "B1", "dict_examp": "It's a small house but at least there's a backyard.", "lear_examp": "It is not impressive but at least it has some things that I like."}, {"sense": "at the beginning of a situation or period of time", "level": "B1", "dict_examp": "At first I thought she was unfriendly, but actually she's just shy.", "lear_examp": "At first, when I arrived I was very nervous because I didn't know anyone, but then a girl started talking to me and I felt better."}, {"sense": "If two things happen at the same time, they happen together.", "level": "B1", "dict_examp": "We arrived at the same time.", "lear_examp": "The kind of clothes I most like are casual but fashionable at the same time."}, {"sense": "immediately", "level": "B1", "dict_examp": "I knew at once that I'd like it here.", "lear_examp": "She called for an ambulance which came at once."}, {"sense": "used to reduce the effect of a statement", "level": "B2", "dict_examp": "I've met the President - at least, he shook my hand once.", "lear_examp": "But after years of developing my slalom, I wanted to learn something new, so, I started Hot-Dogging. Hot-Dog is great fun.  At least, people say so."}, {"sense": "used to show a price, temperature, rate, speed, etc.", "level": "B2", "dict_examp": "He was driving at 120 mph when the police spotted him.", "lear_examp": ""}, {"sense": "If something must be done at all costs, it is very important that it is done.", "level": "B2", "dict_examp": "We have to succeed at all costs.", "lear_examp": "One thing was sure: he was convinced he had to save Anne's life at all costs."}, {"sense": "available for you to use at any time", "level": "B2", "dict_examp": "We will have a car at our disposal for the whole trip.", "lear_examp": "But on Wednesday morning I'm at your disposal."}, {"sense": "responsible for something bad that has happened", "level": "B2", "dict_examp": "I was the one at fault and I apologized.", "lear_examp": "I really felt at fault."}, {"sense": "being in a situation where something bad is likely to happen", "level": "B2", "dict_examp": "All houses within 400 feet of the beach are at risk of flooding.", "lear_examp": "Lives are at risk!"}, {"sense": "If you do one thing at the expense of another, doing the first thing harms the second thing.", "level": "C1", "dict_examp": "He spent a lot of time at work, at the expense of his marriage.", "lear_examp": "Unfortunately one is usually done at the expense of the other."}, {"sense": "If you accept something at face value because of the way it first looks or seems, you do so without thinking carefully about it.", "level": "C1", "dict_examp": "You can't just accept everything you read in the newspapers at face value.", "lear_examp": "People are assessed at face value by the type of cars they drive."}, {"sense": "If you see or understand something at a glance, you see or understand it almost immediately.", "level": "C1", "dict_examp": "He could tell at a glance that something was wrong.", "lear_examp": "You could tell at a glance that Peter was a loner."}, {"sense": "near in time or space", "level": "C1", "dict_examp": "Teachers are always close at hand to give help to any child who needs it.", "lear_examp": "I haven't had any lectures in English, but now and then there are lectures in English at the University so you need to understand the spoken language with no dictionary at hand."}, {"sense": "not less than, and probably much more than", "level": "C1", "dict_examp": "At the very least, you should apologize.", "lear_examp": "Thus, I trust you will agree that at the very least I deserve a letter of explanation from you and a substantial refund of my money."}, {"sense": "chosen by chance", "level": "C1", "dict_examp": "Winners will be chosen at random.", "lear_examp": "The rooms suggested to be filmed have not been chosen at random."}, {"sense": "sometimes", "level": "C1", "dict_examp": "At times, I wish I didn't have to go to school.", "lear_examp": "STUDYING METHODS All teachers at the college are highly skilled professionals and can be very demanding at times, but this is in your best interest."}, {"sense": "when you first see or hear about something or someone", "level": "C1", "dict_examp": "It may, at first sight, seem a surprising choice.", "lear_examp": "I must admit that, at first sight, I did not feel like reading it, but later I made up my mind and decided to accept your invitation."}, {"sense": "used to show that the most positive way of considering something is still not good", "level": "C2", "dict_examp": "If he drops the course now, at best he’ll get an incomplete, and he could fail.", "lear_examp": "Then, due to the social standards, the old find themselves being abandoned and helpless. At best, such people are hospitalized."}, {"sense": "used to show that something is not good when it is the best it can be", "level": "C2", "dict_examp": "He's not exactly patient at the best of times.", "lear_examp": "They knew that even at the best of times he looked unpleasant but now he was of a completely different appearance."}, {"sense": "having problems that other people do not have", "level": "C2", "dict_examp": "Being shy puts him at a disadvantage.", "lear_examp": "These children are also at a disadvantage in terms of education, they may not be able to go to good school, engage in extracurricular activities like sports and music which can be quite expensive if you are living on a budget."}, {"sense": "in order to make someone look stupid", "level": "C2", "dict_examp": "Stop making jokes at my expense.", "lear_examp": "But despite his intellectual superiority, Piggy was subject to derision because of his physical outward appearance and the group of boys played jokes at his expense."}, {"sense": "If you have something at your fingertips, you can get it and use it very easily.", "level": "C2", "dict_examp": "He had all the information needed at his fingertips.", "lear_examp": "An Internet connection literally means having the world at your fingertips."}, {"sense": "used to say what someone is really like", "level": "C2", "dict_examp": "I'm just a kid at heart.", "lear_examp": "I also thought that she was brave at heart."}, {"sense": "most important in what is being discussed", "level": "C2", "dict_examp": "The point at issue is what is best for the child.", "lear_examp": "I wouldn't like to fall into the trap of generalizing the matter at issue, but I believe there are two ways of traveling."}, {"sense": "used after a time or date to say that something could happen before but not after that time", "level": "C2", "dict_examp": "She said to be there by 8 o'clock at the latest.", "lear_examp": "As far as employment is concerned, as people take their pensions at the age of 65 at the latest, new staff cannot be recruited."}, {"sense": "If you talk about something at length, you talk for a long time.", "level": "C2", "dict_examp": "We discussed both topics at length.", "lear_examp": "Since we have already arranged for your family to come to stay in my home and discussed the arrangements at length and in detail, I will no longer bother you with terms of payment and other information that, judging by your letter, seems to be quite irrelevant."}, {"sense": "to be allowed to do something", "level": "C2", "dict_examp": "I'm not at liberty to discuss the matter at present.", "lear_examp": "On the one hand the child is at liberty to do whatever it pleases to do but on the other hand it was never taught the responsibilities implicitly tied to such actions."}, {"sense": "not knowing what to do", "level": "C2", "dict_examp": "I'm at a loss to explain his disappearance.", "lear_examp": "And now I am completely at a loss what to write next."}, {"sense": "not knowing what to say", "level": "C2", "dict_examp": "The question was unexpected and she was temporarily at a loss for words.", "lear_examp": "If it was James I would be at a loss for words, I didn't know what to tell him."}, {"sense": "to not be able to protect yourself from something or someone that you cannot control", "level": "C2", "dict_examp": "Farmers are often at the mercy of the weather.", "lear_examp": "I couldn't believe I'd been careless enough to let them be at the mercy of Joanna's careless, boisterous friends, and I felt very lonely now, looking for them."}, {"sense": "to not agree with someone or something", "level": "C2", "dict_examp": "The two brothers were always at odds.", "lear_examp": "Young people are inexperienced as far as the world is concerned and thus they are frequently at odds with their family."}, {"sense": "If something useful is at a premium, there is not enough of it.", "level": "C2", "dict_examp": "Time is at a premium just before the start of exams.", "lear_examp": "Honesty and accuracy are very good virtues to strive for, but having friendship and a fair and caring relationship to your friend or partner have to be rated at a premium as well."}, {"sense": "used before saying what will happen if a situation continues in the same way", "level": "C2", "dict_examp": "At this rate we're not going to be there till midnight.", "lear_examp": ""}, {"sense": "used before saying one fact that is certain in a situation that you are generally not certain about", "level": "C2", "dict_examp": "Well, at any rate we need her to be there.", "lear_examp": "Nevertheless, at any rate, we would like to see a society with a full and strong workforce working towards stronger economic power."}, {"sense": "If you do something at your own risk, you are completely responsible for anything bad that might happen because of it.", "level": "C2", "dict_examp": "Customers may leave vehicles here at their own risk.", "lear_examp": "However, when a young man decides to go on a dangerous expedition, he should do so at his own risk and should not rely on help from anyone."}, {"sense": "at the young age of 8/17/25, etc.", "level": "C2", "dict_examp": "She first appeared on stage at the tender age of 12.", "lear_examp": "She met my father at the tender age of 14, and she soon knew that this was the man she wanted to stay with for the rest of her life."}, {"sense": "used to talk about an occasion in the past without saying exactly which occasion it was", "level": "C2", "dict_examp": "Most of us have made a similar mistake at one time or another.", "lear_examp": "Haven't we all at one time or another come home from a holiday feeling healthy and strong with a smile on our face thinking, this is what life is about."}, {"sense": "If something is at stake, it is in a situation where it might be lost or damaged.", "level": "C2", "dict_examp": "We have to act quickly - people's lives are at stake.", "lear_examp": "The whole human race's future is at stake."}]}]}, {"word": "attain", "poses": [{"pos": "verb", "senses": [{"sense": "to achieve something, especially after a lot of work", "level": "C1", "dict_examp": "She's attained a high level of fitness.", "lear_examp": "Alternatively, an English speaker from a non-English-speaking country may be of help only if he/she has attained a level higher than yours."}]}]}, {"word": "athletic", "poses": [{"pos": "adjective", "senses": [{"sense": "strong, healthy and good at sports", "level": "B2", "dict_examp": "She looks very athletic.", "lear_examp": "Furthermore, I am not only very athletic, but also really sociable and outgoing."}]}]}, {"word": "attainable", "poses": [{"pos": "adjective", "senses": [{"sense": "possible to achieve", "level": "C2", "dict_examp": "We must ensure that we do not set ourselves goals that are not attainable.", "lear_examp": "As electronic media sources have become more affordable and attainable, more people have access to local and international news and events."}]}]}, {"word": "atom", "poses": [{"pos": "noun", "senses": [{"sense": "the smallest unit that an element can be divided into", "level": "B2", "dict_examp": "A molecule of carbon dioxide (CO2) has one carbon atom and two oxygen atoms.", "lear_examp": "Anyway, the manager of that center called me in order to inform me that I would be doing research on nuclear power and atoms."}]}]}, {"word": "attempt", "poses": [{"pos": "verb", "senses": [{"sense": "to try to do something, especially something difficult", "level": "B1", "dict_examp": "He attempted to escape through a window.", "lear_examp": "It was the second time I had attempted the exam."}]}, {"pos": "noun", "senses": [{"sense": "when you try to do something", "level": "B2", "dict_examp": "This is my second attempt at the exam.", "lear_examp": "I made several attempts to make him change his mind, but I failed."}]}]}, {"word": "attach", "poses": [{"pos": "verb", "senses": [{"sense": "to connect or fix one thing to another", "level": "B1", "dict_examp": "I attached a photo to my application form.", "lear_examp": "I attach my C.V. and I look forward to discussing it with you."}, {"sense": "to connect a file, such as a document, picture or computer program, to an e-mail", "level": "B1", "dict_examp": "", "lear_examp": "I'm going to send you some information about hotels attached to this mail."}, {"sense": "to think that someone or something has importance/value, etc.", "level": "C2", "dict_examp": "You attach too much importance to money.", "lear_examp": "My father  knew exactly when he had to attach importance to feelings or emotions."}, {"sense": "to include something as part of something else", "level": "C2", "dict_examp": "There were too many conditions attached to the deal.", "lear_examp": "Furthermore, the aid provided to these countries is not always innocent and might have strings attached."}]}]}, {"word": "availability", "poses": [{"pos": "noun", "senses": [{"sense": "when something or someone is available", "level": "B2", "dict_examp": "I checked the availability of flights online and there's plenty of choice.", "lear_examp": "Therefore, it is essential that you take account of my availability when booking the trip."}]}]}, {"word": "authority", "poses": [{"pos": "noun", "senses": [{"sense": "the power to make decisions or to control other people", "level": "B2", "dict_examp": "The United Nations has used its authority to restore peace in the area.", "lear_examp": "Their parents have lost almost all their authority."}, {"sense": "someone  with official power to control a particular type of activity", "level": "C1", "dict_examp": "local/health/school autorities", "lear_examp": "Air pollution and traffic congestions are major issues that have been raised by local authorities very recently."}, {"sense": "someone who has a lot of knowledge about a particular subject", "level": "C2", "dict_examp": "She is an authority on seventeenth-century English literature.", "lear_examp": "I read the book more than six times and I became an authority on the Roman Empire."}]}]}, {"word": "August", "poses": [{"pos": "noun", "senses": [{"sense": "the eighth month of the year, after July and before September", "level": "A1", "dict_examp": "the 13th of August/August 13(th)", "lear_examp": "Dear Jo: The class is going to be the 9th of August."}]}]}, {"word": "attractive", "poses": [{"pos": "adjective", "senses": [{"sense": "beautiful or pleasant to look at", "level": "A2", "dict_examp": "an attractive woman", "lear_examp": "It's very small but attractive."}, {"sense": "interesting or useful", "level": "B2", "dict_examp": "an attractive offer/idea", "lear_examp": "Your big library where you might find some books that are not available in other libraries is undoubtedly very attractive for anyone who loves literature."}]}]}, {"word": "attorney", "poses": [{"pos": "noun", "senses": [{"sense": "a lawyer who represents people in legal matters or speaks for them in court", "level": "C1", "dict_examp": "a defense attorney", "lear_examp": "An innocent man is arrested and the court appoints an attorney to defend him."}]}]}, {"word": "automatic", "poses": [{"pos": "adjective", "senses": [{"sense": "An automatic machine works by itself or with little human control.", "level": "B2", "dict_examp": "automatic doors", "lear_examp": "It has both manual and automatic functions so it has a lot of possibilities."}, {"sense": "done as a natural reaction, without thinking", "level": "C2", "dict_examp": "My automatic response was to pull my hand away.", "lear_examp": "Her gesture was almost automatic."}, {"sense": "certain to happen as part of the normal process or system", "level": "C2", "dict_examp": "You get an automatic promotion after two years.", "lear_examp": ""}]}]}, {"word": "audition", "poses": [{"pos": "noun", "senses": [{"sense": "when someone does a short performance to try to get a job as an actor, singer, etc.", "level": "C1", "dict_examp": "She's got an audition for the show.", "lear_examp": "Many untalented people think they can sing and attend the auditions, but others laugh at them."}]}]}, {"word": "aunt", "poses": [{"pos": "noun", "senses": [{"sense": "the sister of someone's father or mother, or the wife of someone's uncle", "level": "A2", "dict_examp": "I have an aunt in Australia.", "lear_examp": "My uncle, my aunt, my cousin and my friends (Renata, Gustavo, John, Paul) came to the party."}]}]}, {"word": "avoid", "poses": [{"pos": "verb", "senses": [{"sense": "to stay away from a person, place, situation, etc.", "level": "B1", "dict_examp": "I try to avoid going downtown on  the weekend.", "lear_examp": "People despise and avoid her because she is ugly."}, {"sense": "to prevent something from happening", "level": "B2", "dict_examp": "I left the room to avoid a fight.", "lear_examp": "I think that all these problems could have been avoided and that asking for my money back is the best way of forgetting that evening."}, {"sense": "to intentionally not do something", "level": "B2", "dict_examp": "She managed to avoid answering my question.", "lear_examp": "The writer avoided describing personal thoughts."}]}]}, {"word": "audience", "poses": [{"pos": "noun", "senses": [{"sense": "the people who sit and watch a performance at a theater, hall, outdoors, etc.", "level": "B1", "dict_examp": "There were a lot of children in the audience.", "lear_examp": "All the people in the audience looked at me, I was very excited. The band called me, so I went to the stage and they started to play a very popular song."}, {"sense": "the type of people who watch a particular TV show, read a particular book, etc.", "level": "B2", "dict_examp": "This magazine is aimed at a teenage/young audience.", "lear_examp": "The above-mentioned restaurants are totally different from each other and suit completely different customers. Pasta, to begin with, is best suited to a younger audience."}]}]}, {"word": "attic", "poses": [{"pos": "noun", "senses": [{"sense": "a space in a house just under the roof, often used for storing things", "level": "B2", "dict_examp": "There's a large room and additional storage space in the attic.", "lear_examp": "She had no idea how but she knew she had all the luck she could ever get, from the very old lucky rabbit foot she found up in the attic yesterday."}]}]}, {"word": "auction", "poses": [{"pos": "noun", "senses": [{"sense": "a sale in which things are sold to the person who offers the most money", "level": "C1", "dict_examp": "The furniture was sold at auction.", "lear_examp": "And funds could be raised for the changes by holding auctions, runs, parties, raffles, contests etc."}]}]}, {"word": "available", "poses": [{"pos": "adjective", "senses": [{"sense": "able to be bought, used, or gotten", "level": "A2", "dict_examp": "Do you have any double rooms available this weekend?", "lear_examp": "I would like to know more details and what facilities are available."}, {"sense": "If someone is available, they are not busy and so are able to do something.", "level": "A2", "dict_examp": "Are you available next weekend?", "lear_examp": "I am available any time."}]}]}, {"word": "authorize", "poses": [{"pos": "verb", "senses": [{"sense": "to give official permission for something", "level": "C1", "dict_examp": "His manager had authorized the expenditure.", "lear_examp": "If we do that, every piece of data is stored in a place accessible for anyone authorized, for example, you."}, {"sense": "to be officially allowed to do something", "level": "C1", "dict_examp": "Only managers are authorized to sign expense forms.", "lear_examp": "In my capacity as the secretary of the Social Club, I am authorized to express students' dissatisfaction with the facilities of the museum and to urge you to take remedial action toward improving the situation."}]}]}, {"word": "attract", "poses": [{"pos": "verb", "senses": [{"sense": "to make people come to a place or do a particular thing by being interesting, enjoyable, etc.", "level": "B1", "dict_examp": "The castle attracts more than 300,000 visitors a year.", "lear_examp": "Although it was the first time that I came to this new class, it attracted me deeply."}, {"sense": "to cause people to pay attention/be interested, etc.", "level": "B1", "dict_examp": "Her ideas have attracted a lot of attention in the scientific community.", "lear_examp": "When I go out with my friends I actually like wearing clothes that attract people's attention."}, {"sense": "to like someone because of the way they look or behave", "level": "B2", "dict_examp": "I was attracted to him straight away.", "lear_examp": "She was really attracted to him."}]}]}, {"word": "attention", "poses": [{"pos": "noun", "senses": [{"sense": "when you watch, listen to, or think about something carefully or with interest", "level": "B1", "dict_examp": "Ladies and gentlemen, could I have your attention, please?", "lear_examp": "Thank you for your attention."}, {"sense": "to watch, listen to, or think about something carefully", "level": "B1", "dict_examp": "You weren't paying attention to what I was saying.", "lear_examp": "Larry is a very distracted boy. Everybody says that he should pay attention to what he is doing."}, {"sense": "to make someone notice you", "level": "B2", "dict_examp": "I waved at her to get her attention.", "lear_examp": "The bank is near the school, so the lady was trying to get people's attention while the others robbed the bank."}, {"sense": "to make someone notice something or someone", "level": "B2", "dict_examp": "If I could just draw your attention to the second paragraph.", "lear_examp": "The purpose of his report is to draw attention to videos in English."}, {"sense": "to receive more attention than anyone or anything else", "level": "C2", "dict_examp": "He loves to be the center of attention.", "lear_examp": "He would have so much fun being the center of attention."}]}]}, {"word": "attribute", "poses": [{"pos": "verb", "senses": [{"sense": "to say that something is caused by something else", "level": "C2", "dict_examp": "He attributes his success to hard work.", "lear_examp": "On the other hand, it might be attributed to the laziness of the people."}]}, {"pos": "noun", "senses": [{"sense": "a quality or characteristic that someone or something has", "level": "C2", "dict_examp": "Her hair is her best attribute.", "lear_examp": "What are the attributes of a successful person, then?"}]}]}, {"word": "attraction", "poses": [{"pos": "noun", "senses": [{"sense": "something that makes people come to a place or do a particular thing", "level": "B1", "dict_examp": "tourist attractions", "lear_examp": "At first I only wanted to see the many attractions in Balboa Park."}, {"sense": "when you like someone, especially romantically, because of the way they look or behave", "level": "C2", "dict_examp": "We had a strong mutual attraction.", "lear_examp": "Ever since the beginning, since the day when Olivia met the Nawab for the first time, she felt an inexplicable attraction toward him."}]}]}, {"word": "avenue", "poses": [{"pos": "noun", "senses": [{"sense": "a street, often a wide one, in a city or town", "level": "C1", "dict_examp": "Michigan Avenue in Chicago is famous for its elegant stores.", "lear_examp": "The demonstrators just spread litter all over the largest and finest avenue."}, {"sense": "a possible way of doing or achieving something", "level": "C2", "dict_examp": "We have exhausted all other avenues of treatment.", "lear_examp": ""}]}]}, {"word": "author", "poses": [{"pos": "noun", "senses": [{"sense": "the writer of a book, article, play, etc.", "level": "B1", "dict_examp": "He is the author of two books on French history.", "lear_examp": "During the Easter holiday, I read a very good thriller by an Italian author, Andrea Camilleri."}]}]}, {"word": "authentic", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is authentic, it is real, true, or what people say it is.", "level": "C1", "dict_examp": "authentic Italian food", "lear_examp": "I am also nostalgic for authentic Thai culture which has subtly and gradually been replaced by American and European culture."}]}]}, {"word": "automatically", "poses": [{"pos": "adverb", "senses": [{"sense": "If a machine does something automatically, it does it independently, without human control.", "level": "B2", "dict_examp": "The camera adjusts the shutter speed automatically.", "lear_examp": "The television will be automatically switched on in time for the breakfast news."}, {"sense": "If you do something automatically, you do it without thinking about it.", "level": "B2", "dict_examp": "I automatically put my hand out to catch it.", "lear_examp": "There was a strange envelope between the others, so automatically, she picked it up and looked at the stamp. The letter came from Australia."}]}]}, {"word": "attitude", "poses": [{"pos": "noun", "senses": [{"sense": "how you think or feel about something, and how this makes you behave", "level": "B1", "dict_examp": "He has a very bad attitude to/toward work.", "lear_examp": "The waiters had a very good attitude toward the customers and the food was really wonderful."}]}]}, {"word": "awake", "poses": [{"pos": "adjective", "senses": [{"sense": "not sleeping", "level": "B1", "dict_examp": "I find it so difficult to stay awake late.", "lear_examp": "She felt so nervous that it kept her awake at night."}, {"sense": "to be completely awake", "level": "C2", "dict_examp": "\"Is Oliver awake yet?\" \"Yes, he's wide  awake and running around his bedroom.\"", "lear_examp": "Sometimes, when I have put my children to bed, half an hour later an aircraft flies over and my two-year old daughter is wide awake again."}]}]}, {"word": "average", "poses": [{"pos": "adjective", "senses": [{"sense": "typical and usual", "level": "A2", "dict_examp": "The average person in the street is a lot better off than they were forty years ago.", "lear_examp": "This makes people believe that a lot of the food we eat is fast-food, but it's not true at all, in fact it's a very small part of our average diet."}, {"sense": "An average number is the number you get by adding two or more amounts together and dividing the total by the number of amounts.", "level": "B1", "dict_examp": "an average age/temperature", "lear_examp": "The weather on this mountain is fantastic, with an average temperature of 17°C."}, {"sense": "not particularly good", "level": "C1", "dict_examp": "The meal  was pretty average.", "lear_examp": "I didn't get the high standard of service that you had offered me, and the food was pretty average."}]}, {"pos": "noun", "senses": [{"sense": "the result you get by adding two or more amounts together and dividing the total by the number of amounts", "level": "B1", "dict_examp": "Prices have risen by an average of 4% over the past year.", "lear_examp": "On the table was my mark sheet with the average as 90%."}, {"sense": "the usual or typical amount", "level": "B1", "dict_examp": "An 8-hour working day is about the average.", "lear_examp": "I don't have much time to watch TV and I only spend an average of two to five hours a week."}, {"sense": "usually, or based on an average", "level": "B2", "dict_examp": "Female workers earn, on average, a third less than men.", "lear_examp": "On average, our pupils are 16 years old and they join actively in all the events we organize."}]}]}, {"word": "awareness", "poses": [{"pos": "noun", "senses": [{"sense": "when you know about something", "level": "C1", "dict_examp": "Environmental awareness is increasing all the time.", "lear_examp": "Thirdly, I have a strong awareness of issues which are important to my local community."}]}]}, {"word": "award", "poses": [{"pos": "verb", "senses": [{"sense": "to give money or a prize following an official decision", "level": "B2", "dict_examp": "He was awarded the Nobel Prize for physics.", "lear_examp": "As you will see, I was awarded a grade A."}]}, {"pos": "noun", "senses": [{"sense": "a prize given to someone for something they have achieved", "level": "B2", "dict_examp": "the Academy Award for Best Director", "lear_examp": "He became world-famous when he won the Oscar award for best song last year."}]}]}, {"word": "awkward", "poses": [{"pos": "adjective", "senses": [{"sense": "difficult or causing problems", "level": "B2", "dict_examp": "an awkward shape", "lear_examp": ""}, {"sense": "embarrassing and not relaxed", "level": "B2", "dict_examp": "an awkward situation", "lear_examp": "Not a movement, not a voice, just an awkward silence."}, {"sense": "without beauty, ease, and skill when moving", "level": "C2", "dict_examp": "He’s too awkward – he’ll never be a good dancer.", "lear_examp": "Piggy's \"value\" is not apparent to the boys because it is concealed by the sight of his awkward self: he is plump, he wears thick spectacles, he is not gifted with good health."}]}]}, {"word": "away", "poses": [{"pos": "adverb", "senses": [{"sense": "in a different place, position or situation", "level": "A2", "dict_examp": "Just go away and leave me alone!", "lear_examp": "I have an important exam on your wedding day in another city far away from my city."}, {"sense": "at a particular distance from a place", "level": "A2", "dict_examp": "The nearest town was ten miles away.", "lear_examp": "I like it because its remote control could control distances of 1 or 2 meters away."}, {"sense": "in or into the usual or a suitable place, especially one that can be closed", "level": "B1", "dict_examp": "Could you put the ice-cream away in the freezer?", "lear_examp": "I am going to put all the toys away."}, {"sense": "at a particular time in the future", "level": "B1", "dict_examp": "My English exam's only a week away and I haven't even started to prepare.", "lear_examp": "Christmas is just a few months away, and I do not intend to spend it all alone like in the past few years, so I am writing to invite you to my real Christmas party without my parents."}, {"sense": "gradually disappearing until mostly or completely gone", "level": "B2", "dict_examp": "All the snow had melted away.", "lear_examp": "I always feel so fatigued at the end of the day but after a mile, the aches of the day seem to fade away."}, {"sense": "If a sports team is playing away, the game is at the place where the other team usually plays.", "level": "C1", "dict_examp": "They were playing away.", "lear_examp": ""}, {"sense": "used after a verb to mean \"continuously\" or \"repeatedly\"", "level": "C2", "dict_examp": "Chris was hammering away in the garden all day.", "lear_examp": "They chatted away for a while as Malcolm had to wait for the airport taxi."}]}]}, {"word": "awful", "poses": [{"pos": "adjective", "senses": [{"sense": "very bad, of low quality, or unpleasant", "level": "A2", "dict_examp": "The weather was awful.", "lear_examp": "We wanted to go shopping in Oxford Street but everything is too expensive and the weather was awful."}, {"sense": "a very large amount", "level": "B2", "dict_examp": "It cost an awful lot of money.", "lear_examp": "First of all, I want to highlight that we see an awful lot of mobile phones in our daily life."}]}]}, {"word": "awesome", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good", "level": "A2", "dict_examp": "Your new haircut is awesome.", "lear_examp": "My birthday party was awesome!"}, {"sense": "great or special and causing deep feelings of admiration, respect, or sometimes fear", "level": "C2", "dict_examp": "an awesome achievement", "lear_examp": "Italy is crowded by groups sheepishly following their guides in an awesome silence and respect."}]}]}, {"word": "awake", "poses": [{"pos": "adjective", "senses": [{"sense": "not sleeping", "level": "B1", "dict_examp": "I find it so difficult to stay awake late.", "lear_examp": "She felt so nervous that it kept her awake at night."}, {"sense": "to be completely awake", "level": "C2", "dict_examp": "\"Is Oliver awake yet?\" \"Yes, he's wide  awake and running around his bedroom.\"", "lear_examp": "Sometimes, when I have put my children to bed, half an hour later an aircraft flies over and my two-year old daughter is wide awake again."}]}]}, {"word": "awe", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of great respect and sometimes fear", "level": "C2", "dict_examp": "I was filled with awe at the sheer size of the building.", "lear_examp": "As a child growing up, the presence of my grandmother filled me with awe."}, {"sense": "to feel great respect for and sometimes fear of someone", "level": "C2", "dict_examp": "As children we were rather in awe of our grandfather.", "lear_examp": "As I was the eldest of the siblings, they used to respect all my orders and even now, they are a bit in awe of me."}]}]}, {"word": "aware", "poses": [{"pos": "adjective", "senses": [{"sense": "knowing that something exists, or having knowledge or experience of a particular thing", "level": "B2", "dict_examp": "Were you aware of the risks at the time?", "lear_examp": "First of all, we aren't aware of the necessity of learning such things as biology or math."}]}]}]