[{"word": "backward", "poses": [{"pos": "adverb", "senses": [{"sense": "toward the direction behind you", "level": "B1", "dict_examp": "I walked backward toward the door.", "lear_examp": "There's a big park near the place I live, and I think I'll go in-line skating there, rolling forward, cruising backward and speeding up, enjoying the exciting moment."}, {"sense": "to try very hard to do something", "level": "C1", "dict_examp": "They bent over backwards to make us feel at home.", "lear_examp": "They won't bend over backwards to look for a quick solution, but sooner or latter the matter will be solved."}]}, {"pos": "adjective", "senses": [{"sense": "less developed or slower to develop than normal", "level": "C2", "dict_examp": "The state needs to reform its backward election laws.", "lear_examp": "No longer a remote, backward, unimportant country, it became a force to be reckoned with in Europe."}]}]}, {"word": "backpacker", "poses": [{"pos": "noun", "senses": [{"sense": "someone, especially a young person, who travels around an area without spending much money, carrying a backpack", "level": "B1", "dict_examp": "The hostel is used mainly by backpackers.", "lear_examp": "There is a special offer for backpackers."}]}]}, {"word": "bad", "poses": [{"pos": "adjective", "senses": [{"sense": "unpleasant; causing difficulties or harm", "level": "A1", "dict_examp": "Our vacation was ruined by bad weather.", "lear_examp": "The weather was bad so we stayed in my house."}, {"sense": "of low quality and not acceptable", "level": "A2", "dict_examp": "The food was so bad we couldn't eat it.", "lear_examp": "I decided to join this new class because I'm bad at English and I want be the best!"}, {"sense": "satisfactory", "level": "A2", "dict_examp": "That's not bad for such a small company.", "lear_examp": "The presents are not bad."}, {"sense": "to be harmful for someone or something", "level": "A2", "dict_examp": "Looking at a computer screen for too long can be bad for your eyes.", "lear_examp": "I don't like playing on the computer because it's bad for my eyes."}, {"sense": "very serious or severe", "level": "B1", "dict_examp": "a bad injury", "lear_examp": "I can't go because I have to go to the hospital to see my grandmother who is in very bad health."}, {"sense": "not lucky, or not happening how you would like", "level": "B1", "dict_examp": "It was just bad luck that she heard us.", "lear_examp": "Actually he had bad luck in his exam this time but he can try to do his best next time, can't he?"}, {"sense": "to feel guilty or sorry about something that has happened", "level": "B1", "dict_examp": "I felt bad about letting her down.", "lear_examp": "I don't have anything else which was yours, and I feel so bad about it."}, {"sense": "used to say that you are sorry about a situation", "level": "B1", "dict_examp": "\"He didn't get the job.\" \"Oh, that's too bad.\"", "lear_examp": "Too bad you couldn't be here."}, {"sense": "(of people or actions) evil or morally unacceptable", "level": "B1", "dict_examp": "There are a lot of bad people in the world.", "lear_examp": "I knew he was a bad man."}, {"sense": "Bad food is not fresh and cannot be eaten.", "level": "B2", "dict_examp": "I think this milk is bad.", "lear_examp": "My surprise was when I opened the fridge and all the food smelt bad, so I couldn't eat anything."}, {"sense": "If you have a bad arm, leg, heart, etc., there is something wrong with it and it is painful.", "level": "C1", "dict_examp": "I've got a bad shoulder.", "lear_examp": "I'm lugging my laptop with me everywhere, with a bad back as a result."}, {"sense": "used to say that nothing can be done to change a situation", "level": "C1", "dict_examp": "I know you don't want to go but it's too bad, we have to.", "lear_examp": "Human beings have to make their own lives as good as possible, and if they do not succeed, the cynical approach is just: too bad!"}]}]}, {"word": "babysitter", "poses": [{"pos": "noun", "senses": [{"sense": "someone who takes care of your child while you are out", "level": "B1", "dict_examp": "I promised the babysitter that we'd be home by midnight.", "lear_examp": "Write me an e-mail and I will send you the address of the family who needs a babysitter."}]}]}, {"word": "background", "poses": [{"pos": "noun", "senses": [{"sense": "a person's education, family and experience of life", "level": "B1", "dict_examp": "The school has pupils from many different ethnic/cultural/religious backgrounds.", "lear_examp": "You can learn a lot about our cultural background."}, {"sense": "sounds that you can hear that are not the main sounds that you are listening to", "level": "B2", "dict_examp": "background music/noise", "lear_examp": "The exotic food together with oriental music in the background makes you dream of exotic places."}, {"sense": "the things that can be seen behind the main things or people in a picture", "level": "B2", "dict_examp": "gold stars on a black background", "lear_examp": "There are lots of nice trees and flowers which I think, would compose an interesting background."}, {"sense": "the situation that an event happens in, or things  which have happened in the past which affect it", "level": "B2", "dict_examp": "These decisions are being made against a background of high unemployment.", "lear_examp": "The background of the story is life in a small town in one of the southern states of the USA in the early 1930s."}]}]}, {"word": "backpacking", "poses": [{"pos": "noun", "senses": [{"sense": "when you travel around an area without spending much money, carrying a backpack", "level": "B1", "dict_examp": "I went backpacking when I was a student.", "lear_examp": "Until now I mainly spent my holidays backpacking through Europe."}]}]}, {"word": "bacteria", "poses": [{"pos": "noun", "senses": [{"sense": "very small living things that sometimes cause disease", "level": "C1", "dict_examp": "The infection was caused by bacteria in the lung.", "lear_examp": "We were just lucky that during that period, the weather was cold and low temperatures prevented bacteria from spreading."}]}]}, {"word": "bacon", "poses": [{"pos": "noun", "senses": [{"sense": "meat from  a pig cut into long thin slices", "level": "B1", "dict_examp": "a bacon sandwich", "lear_examp": "I like bacon very much but I ever eat it."}]}]}, {"word": "backup", "poses": [{"pos": "noun", "senses": [{"sense": "extra help, support or equipment which is available if you need it", "level": "B2", "dict_examp": "Medical staff are on call to provide backup in case of an emergency.", "lear_examp": "I'm sure that most business people have battery back-up and a very good knowledge of when the laptop battery needs to recharge."}, {"sense": "a copy of information that is held on a computer, which is stored separately from the computer", "level": "B2", "dict_examp": "Before we leave work each day, we make a backup of all the records we have entered into the computer that day.", "lear_examp": "Seems he had made a copy in a special file in a back-up memory."}]}]}, {"word": "babysit", "poses": [{"pos": "verb", "senses": [{"sense": "to look after someone's child in their home while they are not there", "level": "B1", "dict_examp": "I babysit for Jane on Tuesday evenings.", "lear_examp": "As you know I am an au pair in London and I sometimes have to babysit in the evening."}]}]}, {"word": "backache", "poses": [{"pos": "noun", "senses": [{"sense": "pain in your back", "level": "B1", "dict_examp": "I had terrible backache last week.", "lear_examp": "I had a backache."}]}]}, {"word": "baby", "poses": [{"pos": "noun", "senses": [{"sense": "a very young child", "level": "A1", "dict_examp": "a baby boy/girl", "lear_examp": "Every day Elisa goes to work, makes dinner for her little baby and watches the T.V. with her husband."}, {"sense": "a very young animal", "level": "A2", "dict_examp": "a baby elephant/monkey", "lear_examp": "They would take us to see some baby sharks, dolphins, and whales."}]}]}, {"word": "backyard", "poses": [{"pos": "noun", "senses": [{"sense": "a small area of land behind  a house that is usually covered with grass and may have a fence around it", "level": "B1", "dict_examp": "Growing up, we had a pool and swings in our backyard.", "lear_examp": "My new home is amazing and I love the backyard, it's enormous."}]}]}, {"word": "backpack", "poses": [{"pos": "noun", "senses": [{"sense": "a bag that you carry on your back", "level": "A2", "dict_examp": "I couldn't fit anything else in my backpack.", "lear_examp": "Lucy, I have left my backpack in your house. It is very important because there are all my books!"}]}]}, {"word": "backing", "poses": [{"pos": "noun", "senses": [{"sense": "support, especially money, for a person or plan", "level": "C2", "dict_examp": "financial backing", "lear_examp": "Take some examples throughout history, such as Napoleon, who was very intelligent, and Hitler who, despite being dangerous and evil, had the backing of his country when he spoke to the people."}]}]}, {"word": "back", "poses": [{"pos": "adverb", "senses": [{"sense": "where someone or something was before", "level": "A1", "dict_examp": "When do you go back to school?", "lear_examp": "She went back home at once."}, {"sense": "as a reply or reaction to something", "level": "A2", "dict_examp": "I'm busy at the moment - can I call you back?", "lear_examp": "Write back to me soon."}, {"sense": "in a direction behind you", "level": "B1", "dict_examp": "He sat back on the sofa.", "lear_examp": "I cried out, stepping back and falling down."}, {"sense": "to the state something or someone was in before", "level": "B2", "dict_examp": "It's not badly broken - I'm sure we can put it back together again.", "lear_examp": "My life was back to normal."}, {"sense": "at or to an earlier time", "level": "B2", "dict_examp": "We first met back in 1971.", "lear_examp": "All in all, it is difficult to get bored in Moscow, where you can see buildings which date back to centuries ago."}, {"sense": "in a direction away from something", "level": "B2", "dict_examp": "He pulled back the curtain.", "lear_examp": "The action of the book takes place in a lonely inn standing back from the road."}, {"sense": "in one direction and then in the opposite direction, often many times", "level": "C2", "dict_examp": "She swayed back and forth to the music.", "lear_examp": "Finally, after much walking back and forth, we found a road, which we followed till we got to the town."}]}, {"pos": "noun", "senses": [{"sense": "the part of something that is farthest from the front or on the side opposite the front", "level": "A2", "dict_examp": "He wrote her e-mail address down on the back of an envelope.", "lear_examp": "My cousins love mermaids, so each sweater has one on the back."}, {"sense": "the part of your body from your shoulders to your bottom", "level": "A2", "dict_examp": "back injuries/pain", "lear_examp": "The look on his face stopped me cold, as if someone had just poured freezing water down my back."}, {"sense": "behind someone or something", "level": "B1", "dict_examp": "They sat in back of us on the plane.", "lear_examp": "I looked in back of me and saw my best friend, Malcom, laughing like crazy."}, {"sense": "the part of a seat that you lean against when you are sitting", "level": "C2", "dict_examp": "the back of a chair", "lear_examp": "The back of the sofa is scratched, too."}, {"sense": "If you do something behind someone's back, you do it without them knowing, often in an unfair way.", "level": "C2", "dict_examp": "Have they been saying things about me behind my back?", "lear_examp": "The food must be perfect, too, or else her mother-in-law and my father's sisters will think that she's not a proper wife, and will probably say insulting things about her behind her back."}, {"sense": "to decide to stop having contact with someone or something, or to refuse to help someone", "level": "C2", "dict_examp": "She turned her back on Hollywood and went to live in Florida.", "lear_examp": "She gets to learn that Olivia turned her back on her past and merged totally with India through her attraction to and sympathy for the Nawab."}]}, {"pos": "adjective", "senses": [{"sense": "at or near the back of something", "level": "A2", "dict_examp": "a back door/room", "lear_examp": "There are two movies, but one is for adults so we will see \"The back garden\"."}, {"sense": "a small road or street without much traffic and away from the main roads", "level": "C1", "dict_examp": "I prefer to take back roads and avoid the highway traffic.", "lear_examp": "From the museum you have to walk across a pedestrian street, through an unspoiled district, where a jumble of narrow back streets retain old-world character."}]}, {"pos": "verb", "senses": [{"sense": "to give support or help to a person, plan, or idea", "level": "C2", "dict_examp": "The board refuses to back our plan.", "lear_examp": "Of course, without the people who are backing the leader in his fight, he could not achieve his success."}, {"sense": "to move backward", "level": "C2", "dict_examp": "When the dog growled, she backed away.", "lear_examp": "When he backed out of the parking lot, he almost crashed into another car."}, {"sense": "to move away from someone, usually because you are afraid", "level": "C2", "dict_examp": "I saw he had a knife and backed off immediately.", "lear_examp": "Mad Dog would kill him if he tried to back off."}, {"sense": "to decide not to do something you had planned or agreed to do", "level": "C1", "dict_examp": "Frank backed out at the last minute, so we had a spare ticket.", "lear_examp": "I met her in the next day, and tried to make an excuse, to back out of the deal, but she didn't let me."}, {"sense": "to support or help someone", "level": "B2", "dict_examp": "My family backed me up in my fight for compensation.", "lear_examp": "These courses seem to have been popular, perhaps because the teacher of these courses was there to back up and help the students."}, {"sense": "to prove that something is true", "level": "C2", "dict_examp": "His claims are backed up by recent research.", "lear_examp": "To back up this claim, the case of children who have grown up in orphanages is often cited."}, {"sense": "to make an extra copy of something that is held in your computer", "level": "B2", "dict_examp": "Always back up any music you download in case your computer crashes.", "lear_examp": ""}]}]}, {"word": "ballet", "poses": [{"pos": "noun", "senses": [{"sense": "a type of dancing where carefully organized movements tell a story or express an idea", "level": "B2", "dict_examp": "a ballet dancer", "lear_examp": "She is always making me laugh, and she likes ballet too!"}]}]}, {"word": "bake", "poses": [{"pos": "verb", "senses": [{"sense": "to cook something such as bread or a cake with dry heat in an oven", "level": "A2", "dict_examp": "I baked a cake.", "lear_examp": "I can bake some pizzas and cakes if you want me to."}]}]}, {"word": "band", "poses": [{"pos": "noun", "senses": [{"sense": "a group of musicians who play modern music together", "level": "A1", "dict_examp": "a jazz/rock band", "lear_examp": "Can we have a rock band like Etho?"}, {"sense": "a thin, flat piece or circle of material put around something or used to hold things together", "level": "C2", "dict_examp": "I have two bands for this watch, one black and one red.", "lear_examp": "It is my wedding ring I am referring to, which was presented to me 3 years ago.  It is a platinum band with 12 tiny diamonds set at regular intervals to go all around."}]}]}, {"word": "badge", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of metal, plastic,  etc., with words or a picture on it which you wear on your clothes", "level": "B2", "dict_examp": "Everyone at the conference wore a badge with their name on.", "lear_examp": "Then I saw  the badge he was wearing."}]}]}, {"word": "bank", "poses": [{"pos": "noun", "senses": [{"sense": "an organization or place where you can borrow money, save money, etc.", "level": "A1", "dict_examp": "I need to go to the bank at lunchtime.", "lear_examp": "She works in a bank."}, {"sense": "sloping raised land, especially along the sides of a river", "level": "B2", "dict_examp": "By the time we reached the opposite bank, the boat was sinking fast.", "lear_examp": "One bank of the river is stony, the other is sandy."}]}]}, {"word": "bandage", "poses": [{"pos": "noun", "senses": [{"sense": "a long piece of soft cloth that you tie around an injured part of the  body", "level": "A2", "dict_examp": "She had a bandage around her wrist.", "lear_examp": "The doctor said that in one week he would take off my bandage and as soon as possible I'll come to visit you."}]}]}, {"word": "bang", "poses": [{"pos": "verb", "senses": [{"sense": "to make a sudden loud noise or to cause something to do this", "level": "B2", "dict_examp": "She banged her fist angrily on the table.", "lear_examp": "One Friday afternoon I was putting away clothes and shoes in the little room which is under the stairs, when my little son, Tom (who was just eighteen months old) banged the door shut behind me."}]}, {"pos": "noun", "senses": [{"sense": "a sudden loud noise", "level": "B2", "dict_examp": "The window slammed shut with a loud bang.", "lear_examp": "I was reading when I suddenly heard a big bang."}]}]}, {"word": "balcony", "poses": [{"pos": "noun", "senses": [{"sense": "a small area joined to the wall outside an upper room where you can stand or sit", "level": "B1", "dict_examp": "We had a drink out on the balcony and watched the sunset.", "lear_examp": "It's got a balcony, too, from where I can see the river."}, {"sense": "the seats in an upper part of a theater", "level": "C2", "dict_examp": "We had seats in the balcony.", "lear_examp": "The balcony seats reserved for students and young tourists felt like they were located on a steep cliff, looking down on all the heads in the better seats rather than at the stage."}]}]}, {"word": "bank account", "poses": [{"pos": "noun", "senses": [{"sense": "an arrangement with a bank to keep your money there and to allow you to take it out when you need to", "level": "B2", "dict_examp": "It would be a good idea to open a bank account.", "lear_examp": "The man, whose name I can't remember, wrote a serious-looking message in which he talked about a money transfer to a Swiss bank account."}]}]}, {"word": "baker", "poses": [{"pos": "noun", "senses": [{"sense": "someone who makes and sells bread, cakes, etc.", "level": "B1", "dict_examp": "", "lear_examp": "My aunt, who is a baker, can certainly make a big delicious birthday cake for Anna."}]}]}, {"word": "bad", "poses": [{"pos": "adjective", "senses": [{"sense": "unpleasant; causing difficulties or harm", "level": "A1", "dict_examp": "Our vacation was ruined by bad weather.", "lear_examp": "The weather was bad so we stayed in my house."}, {"sense": "of low quality and not acceptable", "level": "A2", "dict_examp": "The food was so bad we couldn't eat it.", "lear_examp": "I decided to join this new class because I'm bad at English and I want be the best!"}, {"sense": "satisfactory", "level": "A2", "dict_examp": "That's not bad for such a small company.", "lear_examp": "The presents are not bad."}, {"sense": "to be harmful for someone or something", "level": "A2", "dict_examp": "Looking at a computer screen for too long can be bad for your eyes.", "lear_examp": "I don't like playing on the computer because it's bad for my eyes."}, {"sense": "very serious or severe", "level": "B1", "dict_examp": "a bad injury", "lear_examp": "I can't go because I have to go to the hospital to see my grandmother who is in very bad health."}, {"sense": "not lucky, or not happening how you would like", "level": "B1", "dict_examp": "It was just bad luck that she heard us.", "lear_examp": "Actually he had bad luck in his exam this time but he can try to do his best next time, can't he?"}, {"sense": "to feel guilty or sorry about something that has happened", "level": "B1", "dict_examp": "I felt bad about letting her down.", "lear_examp": "I don't have anything else which was yours, and I feel so bad about it."}, {"sense": "used to say that you are sorry about a situation", "level": "B1", "dict_examp": "\"He didn't get the job.\" \"Oh, that's too bad.\"", "lear_examp": "Too bad you couldn't be here."}, {"sense": "(of people or actions) evil or morally unacceptable", "level": "B1", "dict_examp": "There are a lot of bad people in the world.", "lear_examp": "I knew he was a bad man."}, {"sense": "Bad food is not fresh and cannot be eaten.", "level": "B2", "dict_examp": "I think this milk is bad.", "lear_examp": "My surprise was when I opened the fridge and all the food smelt bad, so I couldn't eat anything."}, {"sense": "If you have a bad arm, leg, heart, etc., there is something wrong with it and it is painful.", "level": "C1", "dict_examp": "I've got a bad shoulder.", "lear_examp": "I'm lugging my laptop with me everywhere, with a bad back as a result."}, {"sense": "used to say that nothing can be done to change a situation", "level": "C1", "dict_examp": "I know you don't want to go but it's too bad, we have to.", "lear_examp": "Human beings have to make their own lives as good as possible, and if they do not succeed, the cynical approach is just: too bad!"}]}]}, {"word": "banking", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of managing the money in your bank accounts", "level": "A2", "dict_examp": "I need to do my banking this afternoon.", "lear_examp": "Computers are the most modern invention of our societies, they are being used in many fields of our lives, such as banking, in communicating, especially in education."}, {"sense": "the business of operating a bank", "level": "B2", "dict_examp": "investment/commercial/consumer banking", "lear_examp": "I want to specialize in finance and banking."}]}]}, {"word": "balanced", "poses": [{"pos": "adjective", "senses": [{"sense": "a healthy mixture of different types of food", "level": "B2", "dict_examp": "If you have a balanced diet, you are getting all the vitamins you need.", "lear_examp": "It is very important to have a balanced diet."}, {"sense": "considering all the facts in a fair way", "level": "B2", "dict_examp": "The news program prides itself on its balanced reporting.", "lear_examp": "Your report contained several mistakes and it did not give a balanced view."}]}]}, {"word": "balance", "poses": [{"pos": "noun", "senses": [{"sense": "when the weight of someone or something is spread in such a way that they do not fall over", "level": "B2", "dict_examp": "I lost my balance and fell off the bike.", "lear_examp": "I began to go downstairs to the kitchen, with two hands on the wall to keep my balance."}, {"sense": "when the correct amount of importance is given to each thing so that a situation is successful", "level": "B2", "dict_examp": "We must strike a balance between  police powers and the protection of citizens.", "lear_examp": "It is not easy to find the right balance in our lives."}, {"sense": "the amount of money that you still have to pay, or that you have left to use", "level": "B2", "dict_examp": "I always pay off the balance on my credit card.", "lear_examp": "Sometimes you are surprised when you check the balance of your bank account and then need to cut down your expenses for 2 months."}, {"sense": "used to give your opinion after you have considered all the facts about something", "level": "B2", "dict_examp": "I think that on balance, I'd prefer to come straight home.", "lear_examp": "On balance, I feel that this annual festival can be even better next year."}, {"sense": "to fall because you are leaning too much to one side", "level": "C1", "dict_examp": "He lost his balance and fell down the stairs.", "lear_examp": "The most exciting part was when we accidently hit a rock and I lost my balance and fell into the cold water."}, {"sense": "to give two things the same amount of attention", "level": "C1", "dict_examp": "It's important to strike a balance between spending and saving.", "lear_examp": "Everything has good and bad sides, the most important thing is to strike a balance."}, {"sense": "If something is or hangs in the balance, nobody knows if it will continue to exist in the future or what will happen to it.", "level": "C2", "dict_examp": "The game hung in the balance until the last seconds.", "lear_examp": "It is my firm belief, that unless we make a step towards the development of our town, its future will hang in the balance and we will ultimately pay the price of our short sightedness."}]}, {"pos": "verb", "senses": [{"sense": "to be in a position where you will not fall to either side, or to put something in this position", "level": "B2", "dict_examp": "She was trying to balance a book on her head.", "lear_examp": "If you have to take many things with you, it will be better to carry them in your car, rather than balancing them on your bicycle."}, {"sense": "to give several things equal amounts of importance, time or money so that a situation is successful", "level": "B2", "dict_examp": "I struggle to balance work and family commitments.", "lear_examp": "In life we need to balance all the areas included in human behavior."}]}]}, {"word": "bakery", "poses": [{"pos": "noun", "senses": [{"sense": "a place where bread, cakes, etc. are made or sold", "level": "B2", "dict_examp": "I buy all our bread from the local bakery.", "lear_examp": "The best bakery was on the other side of town."}]}]}, {"word": "bag", "poses": [{"pos": "noun", "senses": [{"sense": "a container made of paper, plastic, leather, etc., used for carrying things", "level": "A1", "dict_examp": "a paper/plastic bag", "lear_examp": "I put my bag in the hall under the chair."}]}]}, {"word": "banana", "poses": [{"pos": "noun", "senses": [{"sense": "a long curved fruit with a yellow skin", "level": "A1", "dict_examp": "a bunch of bananas", "lear_examp": ""}]}]}, {"word": "banker", "poses": [{"pos": "noun", "senses": [{"sense": "someone with an important position in a bank", "level": "B2", "dict_examp": "She was a successful banker by the time she was forty.", "lear_examp": ""}]}]}, {"word": "badly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not acceptable or of good quality", "level": "A2", "dict_examp": "They played very badly in the first half.", "lear_examp": "I had done badly in my last exam and my teacher said she would talk to my mother."}, {"sense": "very much", "level": "A2", "dict_examp": "He needs the money very badly.", "lear_examp": "I need that very badly because I need my five-thousand rupees urgently."}, {"sense": "very seriously", "level": "A2", "dict_examp": "badly damaged/hurt/injured", "lear_examp": "My brother told me that he crashed into the tree with his car and he was badly injured."}, {"sense": "in an unpleasant way", "level": "B2", "dict_examp": "I thought he was treated very badly.", "lear_examp": "In the past, zoos treated animals quite badly."}]}]}, {"word": "bad-tempered", "poses": [{"pos": "adjective", "senses": [{"sense": "describes a person who becomes angry and annoyed easily", "level": "B2", "dict_examp": "She's very bad-tempered in the morning!", "lear_examp": "It would be possible too that you lost your temper and became a bad-tempered man."}]}]}, {"word": "ball", "poses": [{"pos": "noun", "senses": [{"sense": "a round object that you throw, kick, or hit in a game, or something with this shape", "level": "A1", "dict_examp": "a beach/golf/tennis ball", "lear_examp": "They gave me a ball and a T-shirt."}, {"sense": "to be quick to understand and react to things", "level": "C1", "dict_examp": "She's over ninety, but she's still on the ball.", "lear_examp": "When you're at Sants station, you'll need to be on the ball."}, {"sense": "to make something begin or happen", "level": "C2", "dict_examp": "We have to get the ball rolling on this project soon.", "lear_examp": ""}]}]}, {"word": "badminton", "poses": [{"pos": "noun", "senses": [{"sense": "a sport for two or four people in which you hit a light object with feathers over a net", "level": "A2", "dict_examp": "We played a game of badminton.", "lear_examp": "I like reading and playing badminton."}]}]}, {"word": "ban", "poses": [{"pos": "verb", "senses": [{"sense": "to forbid something, especially officially", "level": "B2", "dict_examp": "The film was banned in several countries.", "lear_examp": "Personally, I think that driving private cars in the main parts of cities should be banned."}]}, {"pos": "noun", "senses": [{"sense": "an official order that prevents something from happening", "level": "B2", "dict_examp": "There should be a ban on talking loudly in movie theaters.", "lear_examp": ""}]}]}, {"word": "balloon", "poses": [{"pos": "noun", "senses": [{"sense": "a small, colored rubber bag that you blow air into or fill with air until it is round in shape, used for decoration at parties or as a children's toy", "level": "A2", "dict_examp": "We tied balloons and streamers to the ceiling ready for the party.", "lear_examp": "In the party room there were many balloons."}]}]}, {"word": "bald", "poses": [{"pos": "adjective", "senses": [{"sense": "with little or no hair on the head", "level": "B1", "dict_examp": "At twenty he was already going bald.", "lear_examp": "Police Officers jumped out from the bushes and subdued the bald man, Lew Juan Yee."}]}]}, {"word": "baggage", "poses": [{"pos": "noun", "senses": [{"sense": "all the bags that you take with you when you travel", "level": "B1", "dict_examp": "checked/carry-on baggage", "lear_examp": "I didn't have much baggage, only one green suitcase."}, {"sense": "feelings and experiences from the past that influence how you think and behave now", "level": "C2", "dict_examp": "emotional baggage", "lear_examp": "Moreover they need to spend it to the best of their abilities trying to bring up a happy person whose behavior will be in harmony with his thoughts and feelings and who will be unencumbered with emotional baggage resulting from lack of love."}]}]}, {"word": "bar", "poses": [{"pos": "noun", "senses": [{"sense": "a place where especially alcoholic drinks are sold and drunk, or the area in such a place where the person serving the drinks stands", "level": "A2", "dict_examp": "He used to just sit in a bar and listen to jazz.", "lear_examp": "I can bring all my CD's and a very good CD-player, or I can work at the bar."}, {"sense": "a substance that has been made into a solid, rectangular shape", "level": "B2", "dict_examp": "a bar of soap", "lear_examp": "I think I've got the right present for your cousins. What do you think about a bar of chocolate from Switzerland?"}, {"sense": "a straight stick made of metal", "level": "B2", "dict_examp": "The gorilla rattled the bars of its cage.", "lear_examp": "When they looked into the lake, they saw a long bar of gold."}, {"sense": "in prison", "level": "B2", "dict_examp": "Until the court hearing, they will remain behind bars.", "lear_examp": "He confessed that he was guilty and was put behind bars."}]}]}, {"word": "basis", "poses": [{"pos": "noun", "senses": [{"sense": "how often something happens or is done", "level": "B2", "dict_examp": "Meetings are held on a weekly basis.", "lear_examp": "Most people use computers on regular basis at work as well as at home."}, {"sense": "the way or method of doing something", "level": "B2", "dict_examp": "Requests are decided on a case-by-case basis.", "lear_examp": "The job they are offering is on a temporary basis, part-time or full-time."}, {"sense": "the reason for something", "level": "C1", "dict_examp": "There is no scientific basis for these claims.", "lear_examp": "I cannot imagine on what basis you estimated the figure."}, {"sense": "as the result of something", "level": "C1", "dict_examp": "Grades are awarded  on the basis of progress and performance.", "lear_examp": "On the basis of the points mentioned above, it is a foregone conclusion that young people do not face any severe problems."}, {"sense": "a situation, fact, or idea from which something begins to develop", "level": "C1", "dict_examp": "Dari's essay can serve as a  basis for our discussion.", "lear_examp": "This report has been written to highlight the positive experiences, and the problems our group faced in Ireland, and can be used as a basis for improving future trips."}]}]}, {"word": "bat", "poses": [{"pos": "noun", "senses": [{"sense": "a specially shaped piece of wood used for hitting the ball in many games", "level": "A1", "dict_examp": "a baseball/cricket bat", "lear_examp": "My father brought me a bicycle and my mother gave me a baseball bat."}, {"sense": "a small animal like a mouse with wings that flies at night", "level": "B1", "dict_examp": "Bats were swooping through the night air.", "lear_examp": "A bat flew close to my left ear and far away I heard some strange sounds."}]}]}, {"word": "basement", "poses": [{"pos": "noun", "senses": [{"sense": "a room or set of rooms that is below ground level in a building", "level": "B2", "dict_examp": "a basement apartment", "lear_examp": "There is also a swimming pool in the basement."}]}]}, {"word": "bare", "poses": [{"pos": "adjective", "senses": [{"sense": "not covered by clothes", "level": "C1", "dict_examp": "bare arms/feet/legs", "lear_examp": "Most people had more essential needs to satisfy than their looks, but there were also women who painted tight-patterns on their bare legs to create a bit of post-war glamour."}, {"sense": "not covered by anything", "level": "C1", "dict_examp": "Inside, the floors were bare and there was very little furniture.", "lear_examp": "The carpet on the floor is very thin (it's like a paper!). It sometimes comes off and I can see a bare wooden floor."}, {"sense": "including only the smallest amount that you need of something", "level": "C2", "dict_examp": "The report just gave us the barest facts about the accident.", "lear_examp": "Having passed the \"prime\" of their lives, many of them would be satisfied with the bare minimum as far as material things are concerned."}, {"sense": "empty", "level": "C2", "dict_examp": "a bare room", "lear_examp": "Olivia decorates her \"nest\" with pictures, plugs and pale yellow sofas, according to the fashion in Europe, whereas the granddaughter is fully satisfied with a bare room."}, {"sense": "without using any type of tool or weapon when doing something that requires a lot of strength", "level": "C2", "dict_examp": "He wrestled the lion to the ground with his bare hands.", "lear_examp": "You could tell your grandchildren about the good old days when you hunted for mammoths and skinned them with your bare hands, just a few million years back (sigh: \"seems like yesterday\")."}]}]}, {"word": "banking", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of managing the money in your bank accounts", "level": "A2", "dict_examp": "I need to do my banking this afternoon.", "lear_examp": "Computers are the most modern invention of our societies, they are being used in many fields of our lives, such as banking, in communicating, especially in education."}, {"sense": "the business of operating a bank", "level": "B2", "dict_examp": "investment/commercial/consumer banking", "lear_examp": "I want to specialize in finance and banking."}]}]}, {"word": "basics", "poses": [{"pos": "noun", "senses": [{"sense": "the most important facts, skills, or needs", "level": "B2", "dict_examp": "I really must learn the basics of first aid.", "lear_examp": "Last year, I chose to take groups on sailing and diving trips because I already knew the basics of sailing and diving."}]}]}, {"word": "basket", "poses": [{"pos": "noun", "senses": [{"sense": "a container, usually with a handle, that is made of thin pieces of wood, wire, plastic, etc.", "level": "B1", "dict_examp": "a shopping/picnic basket", "lear_examp": "As I approached the sound, I saw something that was moving inside a basket. It was a baby, crying with hunger."}]}]}, {"word": "basically", "poses": [{"pos": "adverb", "senses": [{"sense": "used to introduce a simple explanation about something", "level": "B2", "dict_examp": "Basically, he's saying we need more time.", "lear_examp": "Basically, I don't like staying in a small tent."}, {"sense": "in most important ways, or to a large degree", "level": "B2", "dict_examp": "These two machines are basically the same, but you get a few extra features in the more expensive one.", "lear_examp": "I remember it was a very embarrassing situation because basically I didn't know what was going on."}]}]}, {"word": "bankrupt", "poses": [{"pos": "adjective", "senses": [{"sense": "unable to continue in business because you cannot pay your debts", "level": "C1", "dict_examp": "He went bankrupt after only a year in business.", "lear_examp": "But the greed for easy money is likely to diminish as many businesses have gone bankrupt these last few months."}]}]}, {"word": "baseball", "poses": [{"pos": "noun", "senses": [{"sense": "(the ball used in) a game played by two teams of nine players, in which a player hits a ball with a bat and tries to run around the four corners of a large square area of the field before the other team returns the ball", "level": "A1", "dict_examp": "Jake never played baseball like the other kids.", "lear_examp": "I like playing baseball, so let's play together!"}]}]}, {"word": "bargain", "poses": [{"pos": "noun", "senses": [{"sense": "something that is on sale for less than its usual price or its real value", "level": "B1", "dict_examp": "This coat was half-price - a real bargain.", "lear_examp": "What a bargain!"}, {"sense": "as well as everything else", "level": "C2", "dict_examp": "Caffeine has no good effects on health and is mildly addictive in the bargain.", "lear_examp": "More or less few people are, in the bargain, prepared to adapt themselves to the others in order to be accepted."}]}]}, {"word": "basic", "poses": [{"pos": "adjective", "senses": [{"sense": "being the main or most important part of something", "level": "B1", "dict_examp": "basic ideas/principles", "lear_examp": "He started to teach me the basic knowledge of nuclear physics."}, {"sense": "including or providing only the things that are most necessary", "level": "B1", "dict_examp": "basic services/skills/training", "lear_examp": "I already have a racquet and some basic knowledge of how to play."}, {"sense": "very simple, with nothing special added", "level": "B1", "dict_examp": "It's the most basic model.", "lear_examp": "The decoration was basic, but homely."}]}]}, {"word": "barbecued", "poses": [{"pos": "adjective", "senses": [{"sense": "cooked on a barbecue", "level": "B1", "dict_examp": "barbecued chicken/fish", "lear_examp": ""}]}]}, {"word": "barber", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to cut men's hair", "level": "B1", "dict_examp": "Dad goes to the barber once a month.", "lear_examp": "My mother told me to go to the barber because I had my hair very long."}]}]}, {"word": "barrier", "poses": [{"pos": "noun", "senses": [{"sense": "a type of fence that stops people from going into an area", "level": "B2", "dict_examp": "Barriers have been erected all along the route the Pope will take.", "lear_examp": "Only these people can open the barrier with their keys."}, {"sense": "something that prevents people from doing what they want to do", "level": "B2", "dict_examp": "Despite the language barrier, they soon became good friends.", "lear_examp": "Of course, it took a lot of time and effort for her to overcome various difficulties concerning the language barrier and culture shock, but she decided to try herself."}]}]}, {"word": "bath", "poses": [{"pos": "noun", "senses": [{"sense": "when you wash your body in a bathtub", "level": "A1", "dict_examp": "I took a bath this morning.", "lear_examp": "You can take a bath in my bathroom."}]}]}, {"word": "barn", "poses": [{"pos": "noun", "senses": [{"sense": "a large building on a farm where crops or animals can be kept", "level": "C2", "dict_examp": "The machinery was kept in an old barn.", "lear_examp": "In the back of the garden of my parents' house there is an old barn. It was used to store the hay when I was a little girl."}]}]}, {"word": "basketball", "poses": [{"pos": "noun", "senses": [{"sense": "a game in which two teams try to score points by throwing a ball through a high net, or the ball used in this game", "level": "A1", "dict_examp": "He plays a lot of basketball.", "lear_examp": "I like playing basketball."}]}]}, {"word": "barely", "poses": [{"pos": "adverb", "senses": [{"sense": "only just", "level": "C1", "dict_examp": "They have barely enough to pay the rent this month.", "lear_examp": "After two weeks of learning English three hours a day I can barely speak simple phrases."}]}]}, {"word": "bark", "poses": [{"pos": "verb", "senses": [{"sense": "If a dog barks, it makes loud, short sounds.", "level": "B2", "dict_examp": "They heard a dog barking outside.", "lear_examp": "He barks whenever there is a stranger in our house."}]}, {"pos": "noun", "senses": [{"sense": "the hard, outside part of a tree", "level": "C2", "dict_examp": "The bark of the birch tree is white.", "lear_examp": "By hitting the bark of trees or hollow pieces of wood rhythmically, prehistoric humans tended to communicate or entertain themselves."}]}]}, {"word": "barbershop", "poses": [{"pos": "noun", "senses": [{"sense": "a place where men and boys get their hair cut", "level": "B1", "dict_examp": "Dad went to the barbershop on Aster Place to get his hair cut.", "lear_examp": ""}]}]}, {"word": "barbecue", "poses": [{"pos": "noun", "senses": [{"sense": "a party at which meat and other food is cooked and eaten outdoors", "level": "A2", "dict_examp": "We're having a barbecue on Saturday.", "lear_examp": "I didn't get any presents, because we decided to buy more things for my barbecue."}, {"sense": "a piece of equipment used for cooking food outdoors", "level": "A2", "dict_examp": "Put the vegetables on the barbecue.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to cook food on a barbecue", "level": "B1", "dict_examp": "Their traditional sausages are delicious grilled or barbecued.", "lear_examp": ""}]}]}, {"word": "bartender", "poses": [{"pos": "noun", "senses": [{"sense": "a person who makes and serves drinks in a bar", "level": "B2", "dict_examp": "I asked the bartender to put ice in my drink.", "lear_examp": "The staff consists of 6 waiters, who are trained extremely well and very attentive. a bartender and several cooks."}]}]}, {"word": "base", "poses": [{"pos": "noun", "senses": [{"sense": "the bottom part of something, or the part something rests on", "level": "B2", "dict_examp": "a crystal glass with a heavy base", "lear_examp": ""}, {"sense": "a place where a military service operates and people in that military service live", "level": "B2", "dict_examp": "an army/navy/air force base", "lear_examp": "During the day you can visit all of our museums or schools or even the air force base, which is open from 9 o'clock."}, {"sense": "the main place where a person lives or works or where a business operates", "level": "C2", "dict_examp": "I spend a lot of time in Dallas, but Chicago is still my base.", "lear_examp": "It also has a function as a base for the fishing industry. Being located on the coast, our town's key industry is fishing."}, {"sense": "the most important part of something, from which other things can develop", "level": "C2", "dict_examp": "a solid economic base", "lear_examp": "Apart from the economic base of tourism, there are other beneficial aspects to consider."}]}, {"pos": "verb", "senses": [{"sense": "to have a particular city, town,  area, etc., as the main place where you live and work, or where you do business", "level": "B2", "dict_examp": "He was based in South Carolina.", "lear_examp": "The name of the company is Lilley's Bookshop and it is based in Central London."}, {"sense": "If you base something on facts or ideas, you use those facts or ideas to develop it.", "level": "B1", "dict_examp": "The film is based on a short story by Thomas Mann.", "lear_examp": "This is an exciting film based on the musical \"The Phantom of the Opera\"."}]}]}, {"word": "battery", "poses": [{"pos": "noun", "senses": [{"sense": "a device that produces electricity to provide power for cell phones, laptop computers, radios, cars, etc.", "level": "A2", "dict_examp": "My car has a dead battery.", "lear_examp": "I left it turned on, so the battery must be very low."}, {"sense": "to have a period of rest and relaxation so that you feel energetic again", "level": "C2", "dict_examp": "She took a trip to the south of France to recharge her batteries.", "lear_examp": "It is a very effective way in which we could rejuvenate ourselves and recharge our batteries in order to face the difficulties of the daily routine."}]}]}, {"word": "beat", "poses": [{"pos": "verb", "senses": [{"sense": "to defeat or do better than", "level": "B1", "dict_examp": "Simon always beats me at tennis.", "lear_examp": "Sebastian beat me 6-2."}, {"sense": "When your heart beats, it makes regular movements and sounds.", "level": "B1", "dict_examp": "By the time the doctor had arrived, his heart had stopped beating.", "lear_examp": "My heart was beating like a bell and I was really excited."}, {"sense": "to hit a person or animal repeatedly", "level": "B2", "dict_examp": "They saw him beating his dog with a stick.", "lear_examp": "He began to drink, and when he was drunk, he beat Kelly."}, {"sense": "to be better than", "level": "B2", "dict_examp": "I take the train - it beats driving for seven hours.", "lear_examp": "And finally everybody needs to realize that biking within a city always beats driving by car, concerning the time it takes to commute from point A to point B."}, {"sense": "to avoid talking about something difficult or embarrassing", "level": "C1", "dict_examp": "I decided to stop beating around the bush and told him exactly what I thought of him.", "lear_examp": "Well, let's stop beating about the bush and get to the point."}, {"sense": "to mix food using quick movements", "level": "C1", "dict_examp": "Beat the egg whites until they are stiff.", "lear_examp": ""}, {"sense": "to hit against something, making sound in a continuous or regular pattern", "level": "C2", "dict_examp": "He steadily beat the drum.", "lear_examp": "The sound of the pelting rain beating against the slates made the minutes last longer than ever and my cosy sofa looked so cold and small."}, {"sense": "used to emphasize that something is best", "level": "C2", "dict_examp": "You can't beat Pedro's for a great pizza.", "lear_examp": "You can't beat their \"French cuisine\" she usually said, when asked why didn't she change the place."}, {"sense": "in a place where few people go", "level": "C2", "dict_examp": "I prefer to take my vacation somewhere off the beaten track.", "lear_examp": "Furthermore, in areas off the beaten track, there are not even police sometimes."}, {"sense": "to attack someone by hitting or kicking them", "level": "B2", "dict_examp": "He beat up one of the other prisoners.", "lear_examp": "He would often beat her up when he was drunk."}]}, {"pos": "noun", "senses": [{"sense": "a regular movement or sound, especially that made by your heart", "level": "B2", "dict_examp": "I put my head on his chest but I could feel no heart beat.", "lear_examp": "She started to exhale after a moment, counting the beats of her heart."}, {"sense": "the main rhythm of a piece of music", "level": "B2", "dict_examp": "The guitar comes in on the third beat.", "lear_examp": "They play rock with a very good beat."}]}]}, {"word": "beauty", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being beautiful", "level": "B1", "dict_examp": "This is an area of outstanding natural beauty.", "lear_examp": "It's a very nice place and I wanted to record its beauty."}, {"sense": "the quality that makes something especially good or attractive", "level": "C2", "dict_examp": "The beauty of the plan is that it won't cost anything.", "lear_examp": ""}]}]}, {"word": "beam", "poses": [{"pos": "noun", "senses": [{"sense": "a line of light shining from something", "level": "B2", "dict_examp": "a laser beam", "lear_examp": "I was beginning to feel rather impatient when a door opened letting a beam of light come into the dark room."}]}]}, {"word": "beautiful", "poses": [{"pos": "adjective", "senses": [{"sense": "very attractive", "level": "A1", "dict_examp": "a beautiful woman", "lear_examp": "It's a beautiful park."}, {"sense": "very pleasant", "level": "A1", "dict_examp": "a beautiful piece of music", "lear_examp": "I like pop music but I prefer classical music because it's the most beautiful."}]}]}, {"word": "beard", "poses": [{"pos": "noun", "senses": [{"sense": "the hair that grows on a man's chin", "level": "A1", "dict_examp": "a long white beard", "lear_examp": "He has a nice beard."}]}]}, {"word": "bathing suit", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of clothing you wear to go swimming", "level": "A2", "dict_examp": "I bought a new bathing suit.", "lear_examp": "Bring your bathing suit because here it's very hot and we will go to the swimming pool!"}]}]}, {"word": "beach", "poses": [{"pos": "noun", "senses": [{"sense": "an area of sand or small stones next to the ocean or a lake", "level": "A1", "dict_examp": "We spent the day at the beach.", "lear_examp": "After, I went to the beach with my family."}]}]}, {"word": "because of", "poses": [{"pos": "preposition", "senses": [{"sense": "as a result of", "level": "B1", "dict_examp": "The train was delayed because of bad weather.", "lear_examp": "I am fine but a little stressed because of my exams!"}]}]}, {"word": "battle", "poses": [{"pos": "noun", "senses": [{"sense": "a fight between armed forces in a war", "level": "B1", "dict_examp": "the Battle of Gettysburg", "lear_examp": "But he died in a battle, so nobody knew where the treasure was hidden!"}, {"sense": "a fight against something that is very difficult, or that is hurting or destroying you", "level": "B2", "dict_examp": "a long battle against cancer", "lear_examp": "His life was a hard battle, trying to break through."}, {"sense": "when two people or groups compete against each other or have an argument about something", "level": "C2", "dict_examp": "They’re in a battle with their publisher over electronic rights.", "lear_examp": "A very important point is that there must always be a discussion between children and parents, which allows everyone to understand the different points of view and avoids a constant battle between the family members."}]}, {"pos": "verb", "senses": [{"sense": "to try very hard to do something difficult or to fight against someone or something", "level": "C2", "dict_examp": "Throughout the campaign, Johnson was battling health problems.", "lear_examp": "Many countries are battling with environmental problems and certain tourists feel that it is perfectly acceptable to leave their litter behind them on beaches and other public places, after all in two or three weeks they can leave it all behind them."}]}]}, {"word": "bathtub", "poses": [{"pos": "noun", "senses": [{"sense": "the container that you sit or lie in to wash your  body", "level": "B1", "dict_examp": "Did you clean the bathtub?", "lear_examp": "Do you have an attached bathroom, complete with bathtub or shower?"}]}]}, {"word": "bean", "poses": [{"pos": "noun", "senses": [{"sense": "a seed, or the pod containing seeds, of various climbing plants, eaten as a vegetable", "level": "A1", "dict_examp": "pinto/black/kidney beans", "lear_examp": "Everybody likes to eat beans, rice, chips and meat, but on Saturday, people like a special lunch."}]}]}, {"word": "bay", "poses": [{"pos": "noun", "senses": [{"sense": "an area of water with land on three sides", "level": "B1", "dict_examp": "San Francisco Bay", "lear_examp": "It's also possible to hire a small yacht there and have a trip round the bay."}, {"sense": "to prevent someone or something being closer or causing your problems", "level": "C2", "dict_examp": "Gunmen kept police at bay for almost four hours.", "lear_examp": "The Leary brothers are unable to cope with real life, which reinforces their innate ability to keep the world at bay and themselves untouched by life and love."}]}]}, {"word": "beak", "poses": [{"pos": "noun", "senses": [{"sense": "the hard part of a bird's mouth", "level": "C1", "dict_examp": "It carried a huge stick in its beak.", "lear_examp": "It is an elegant bird, about 2 ft tall, with gray feathers, a black tail and a yellow beak."}]}]}, {"word": "beautifully", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is beautiful", "level": "B1", "dict_examp": "She dresses beautifully.", "lear_examp": "My room is big and beautifully decorated."}]}]}, {"word": "bear", "poses": [{"pos": "noun", "senses": [{"sense": "a large, strong, wild animal with thick fur", "level": "A2", "dict_examp": "a brown/black bear", "lear_examp": "I love bears, you know."}]}, {"pos": "verb", "senses": [{"sense": "to accept something unpleasant", "level": "C1", "dict_examp": "Since you will bear most of the responsibility, you should get the rewards.", "lear_examp": "Consequently, you must bear the hassles of public transport."}, {"sense": "to have or show a particular name, picture, or symbol", "level": "C1", "dict_examp": "The shop bore his family name.", "lear_examp": "I have been to many places, but this which I will never forget about is the island Lefkada, which is located in the north-west of Greece - in the Ionian Pelagos - and, especially, the capital of it, which bears the same name."}, {"sense": "to move or turn to the left or right", "level": "C1", "dict_examp": "Bear right at the next set of traffic lights.", "lear_examp": "The taxi has to bear left at the fork and then you can see my house, 200 yards on the right side, it's a white house with the number 53."}, {"sense": "to be similar to someone or something", "level": "C2", "dict_examp": "He bears a striking resemblance to his father.", "lear_examp": "Modern buildings should bear some resemblance to the old ones and therefore complete the image of the city preserved through time."}, {"sense": "to give birth to a child", "level": "C2", "dict_examp": "She has been told that she will never bear children.", "lear_examp": "Women can still bear children at the age of 30. In the past this was not possible because either the mother or the baby would have died."}, {"sense": "If something that someone does bears fruit, it produces successful results.", "level": "C2", "dict_examp": "Some of their research is now bearing fruit, and the results are interesting.", "lear_examp": "Being friendly at work may not necessarily be easy, but it always bears fruit."}, {"sense": "to accept an unpleasant or difficult situation because there is nothing you can do to improve it", "level": "C2", "dict_examp": "I hate my job, but I'm just going to have to grin and bear it for a while.", "lear_examp": "As I couldn't simply get up and go away, I just had to grin and bear it for a little while longer."}]}]}, {"word": "because", "poses": [{"pos": "conjunction", "senses": [{"sense": "used to give a reason for something", "level": "A1", "dict_examp": "We can't go to Julia's party because we're going away that weekend.", "lear_examp": "I will be at your house at 7:30 because I have an appointment before that."}]}]}, {"word": "bathroom", "poses": [{"pos": "noun", "senses": [{"sense": "a room with a sink, a toilet, and often a bathtub and/or shower", "level": "A1", "dict_examp": "The bathroom is right down the hall, on your left.", "lear_examp": "We have these three bedrooms, one kitchen, living room, and bathroom."}, {"sense": "to empty the body of urine or solid waste, usually using a toilet in a bathroom", "level": "A2", "dict_examp": "It's going to be a long ride, kids, so if you need to go to the bathroom do it now.", "lear_examp": "I left a history book in your house. It is important because I have to study.  I think I left it in your house when you went to the bathroom."}]}]}, {"word": "be", "poses": [{"pos": "verb", "senses": [{"sense": "used to give information about someone or something", "level": "A1", "dict_examp": "I'm tired.", "lear_examp": "My friend's name is Sarah."}, {"sense": "used to say that someone or something exists", "level": "A1", "dict_examp": "There are six Italians in the class.", "lear_examp": "There are many interesting things."}, {"sense": "used to say or ask where someone or something is", "level": "A1", "dict_examp": "He's in the garden.", "lear_examp": "I think my bag is in your kitchen."}, {"sense": "used to say that someone has gone to a place and returned from that place", "level": "A2", "dict_examp": "I've been to Mexico.", "lear_examp": "I like Japanese people and I've been to Japan three times."}]}, {"pos": "auxiliary verb", "senses": [{"sense": "used with the present participle of other verbs to describe actions that are or were still continuing", "level": "A2", "dict_examp": "I'm still eating.", "lear_examp": "I'm thinking of painting it blue."}, {"sense": "used with the past participle of other verbs to form the passive", "level": "A2", "dict_examp": "This dessert  is made from eggs, sugar, and cream.", "lear_examp": "I like it very much, because it is interesting and it was written by an excellent author, Lev Tolstoy."}]}]}, {"word": "bedroom", "poses": [{"pos": "noun", "senses": [{"sense": "a room used for sleeping in", "level": "A1", "dict_examp": "Our house has three bedrooms.", "lear_examp": "I think my T-shirt is in your bedroom."}]}]}, {"word": "beef", "poses": [{"pos": "noun", "senses": [{"sense": "the meat of a cow", "level": "B1", "dict_examp": "roast beef", "lear_examp": "They like eating beef,  lamb and salad."}]}]}, {"word": "bed", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of furniture that you sleep on", "level": "A1", "dict_examp": "He lived in a room with only two chairs, a bed and a table.", "lear_examp": "I'd like to sell my bed."}, {"sense": "the ground on the bottom of the sea, a river, etc.", "level": "C2", "dict_examp": "the sea bed", "lear_examp": "They landed upside down on a river bed and almost everyone was killed during the fall."}, {"sense": "a piece of ground that is used for growing plants, especially flowers", "level": "C2", "dict_examp": "a flower bed", "lear_examp": "Remember my house has the number four, you can't miss it, it is a big white house with a large bed of roses just near the front door."}]}]}, {"word": "belief", "poses": [{"pos": "noun", "senses": [{"sense": "when you believe that something is true or real", "level": "B2", "dict_examp": "a popular/common/widespread belief", "lear_examp": "At this time, tango was considered an immoral type of music; but Carlos Gardel changed this belief, and people from all over the world loved him."}, {"sense": "an idea that you are certain is true", "level": "B2", "dict_examp": "He made no secret of his belief that she would recover.", "lear_examp": "We get to know the beliefs, superstitions or the principles of other religious denominations."}, {"sense": "the feeling that someone or something is effective or right", "level": "C2", "dict_examp": "a belief in social justice", "lear_examp": "With our hectic lifestyles and complacent belief in modern medical sciences we may forget about the importance of proper eating."}]}]}, {"word": "behave", "poses": [{"pos": "verb", "senses": [{"sense": "to do or say things in a particular way", "level": "B1", "dict_examp": "She always behaves badly at bedtime.", "lear_examp": "As always, I'll behave like a gentleman."}, {"sense": "to be polite and not make a situation difficult", "level": "B1", "dict_examp": "Did the children behave (themselves)?", "lear_examp": "Team sports can also help children to behave themselves."}]}]}, {"word": "behalf", "poses": [{"pos": "noun", "senses": [{"sense": "If you do something on behalf of someone, you do it for them or instead of them.", "level": "B2", "dict_examp": "On behalf of the entire company, I would like to thank you for all your work.", "lear_examp": "I am writing on behalf of our college English club members to welcome you to our city."}]}]}, {"word": "become", "poses": [{"pos": "verb", "senses": [{"sense": "to start to be something", "level": "A2", "dict_examp": "They became great friends.", "lear_examp": "I think we will become good friends."}, {"sense": "to happen to someone or something", "level": "C2", "dict_examp": "What became of your friend Harry?", "lear_examp": "You might ask yourself: who is this girl in the room and what became of that friend of hers?"}]}]}, {"word": "behind", "poses": [{"pos": "preposition", "senses": [{"sense": "at or to the back of someone or something", "level": "A1", "dict_examp": "Close the door behind you.", "lear_examp": "I think we should meet in front of the restaurant, behind the library."}, {"sense": "slower or less successful than someone or something", "level": "B1", "dict_examp": "The project is already behind schedule.", "lear_examp": "I have already told Lissa, and she'll lend me her copy book so I don't get behind."}, {"sense": "giving your help or support to someone", "level": "B1", "dict_examp": "The group is 100 percent behind her.", "lear_examp": "He is very nice because if you have problems he is always behind you to help you."}, {"sense": "in prison", "level": "B2", "dict_examp": "Until the court hearing, they will remain behind bars.", "lear_examp": "He confessed that he was guilty and was put behind bars."}, {"sense": "causing something, or responsible for something", "level": "C1", "dict_examp": "What was the reason behind her decision to leave?", "lear_examp": "Another reason behind this kind of thinking is that some boys feel awkward when they see girls and they think they are being ignored in the class."}, {"sense": "not fashionable or modern", "level": "C1", "dict_examp": "Dad's a bit behind the times.", "lear_examp": "We should improve our equipment. Otherwise we will be behind the times."}, {"sense": "If a bad experience or your own bad behavior is behind you, it does not exist or affect your life now.", "level": "C2", "dict_examp": "He's put his troubled past behind him.", "lear_examp": "We have got to put the past behind us."}, {"sense": "If you do something behind someone's back, you do it without them knowing, often in an unfair way.", "level": "C2", "dict_examp": "Have they been saying things about me behind my back?", "lear_examp": "The food must be perfect, too, or else her mother-in-law and my father's sisters will think that she's not a proper wife, and will probably say insulting things about her behind her back."}, {"sense": "privately and not in public", "level": "C2", "dict_examp": "Most of the deals were made behind closed doors.", "lear_examp": "Decisions which affect the whole world are made behind closed doors and are top secret."}, {"sense": "If something happens behind the scenes, it happens secretly.", "level": "C2", "dict_examp": "A lot of hard work has been going on behind the scenes.", "lear_examp": "Ms. Bolam knew a lot of things going on behind the scenes, which were not known to the patients."}]}, {"pos": "adverb", "senses": [{"sense": "at or to the back of someone or something", "level": "B1", "dict_examp": "Somebody grabbed me from behind.", "lear_examp": "An old man appeared from behind wearing the same clothes as the owner of the phone and asked her for it."}, {"sense": "slower or later than someone else, or than you should be", "level": "C1", "dict_examp": "She's behind on the rent.", "lear_examp": "Those children who do not get this at home are the ones who are behind in their schoolwork."}]}]}, {"word": "believe", "poses": [{"pos": "verb", "senses": [{"sense": "to think that something is true, or that what someone says is true", "level": "A2", "dict_examp": "They believe that their health has suffered because of the chemicals.", "lear_examp": "I believe him."}, {"sense": "to think something, without being completely sure", "level": "A2", "dict_examp": "\"Is she coming alone?\" \"I believe so.\"", "lear_examp": "I believe it is in your bedroom."}, {"sense": "to be very surprised when you see someone or something, or when you hear what someone says", "level": "B1", "dict_examp": "I couldn't believe my ears when Dan said they were getting married.", "lear_examp": "Well, this church was extremely simple on the outside, but when I got inside it, I couldn't believe my eyes."}, {"sense": "used to say that something is true although it seems surprising", "level": "B1", "dict_examp": "He even remembered my birthday, believe it or not.", "lear_examp": "First I visited the \"Roman Bath'' which is more than 2000 years old and, believe it or not, it still works!"}, {"sense": "to be certain that something exists", "level": "B1", "dict_examp": "Do you believe in ghosts?", "lear_examp": "Claire I want to tell you that we have to believe in miracles!"}, {"sense": "to be confident that something is effective and right", "level": "B2", "dict_examp": "He believes in saying what he thinks.", "lear_examp": "Nowadays I don't believe in changing your decision."}]}]}, {"word": "beginning", "poses": [{"pos": "noun", "senses": [{"sense": "the first part of something or the start of something", "level": "A2", "dict_examp": "We met at the beginning of 1998.", "lear_examp": "At the beginning of the party, we danced and sang."}]}]}, {"word": "beer", "poses": [{"pos": "noun", "senses": [{"sense": "an alcoholic drink made from grain", "level": "A1", "dict_examp": "a bottle of beer", "lear_examp": "She likes drinking beer and sometimes goes to the nightclub."}]}]}, {"word": "before", "poses": [{"pos": "preposition", "senses": [{"sense": "earlier than something or someone", "level": "A1", "dict_examp": "She arrived before me.", "lear_examp": "We will come before 7 o'clock and help you with dinner."}, {"sense": "at a place that you pass when traveling toward another place", "level": "A2", "dict_examp": "The hospital is just before the bridge.", "lear_examp": "Just before the bridge turn right, the college is on your left."}, {"sense": "in a position in front of someone or something", "level": "B1", "dict_examp": "I've never performed this before an audience.", "lear_examp": ""}, {"sense": "in front of someone or something in an order or a list", "level": "B1", "dict_examp": "The letter K comes before L in the English alphabet.", "lear_examp": ""}, {"sense": "treated as more important than someone or something", "level": "C2", "dict_examp": "They always put the children's needs before their own.", "lear_examp": "She puts people with their needs before her own comfort, that is why she is successful."}]}, {"pos": "conjunction", "senses": [{"sense": "earlier than the time when something happens", "level": "A2", "dict_examp": "He was a teacher before he became famous.", "lear_examp": "I think the notebook is in your bedroom. I was studying there before I left your home."}, {"sense": "in order to avoid something bad happening", "level": "B1", "dict_examp": "Put that stick down before you hurt someone!", "lear_examp": ""}, {"sense": "until (the event mentioned)", "level": "B1", "dict_examp": "It took a few moments before I realized that he was joking.", "lear_examp": ""}, {"sense": "very soon", "level": "C1", "dict_examp": "We'll be there before you know it.", "lear_examp": "It is a bit dark inside, and especially in winter, it is dark before you know it."}]}, {"pos": "adverb", "senses": [{"sense": "at an earlier time, or on a previous occasion", "level": "A2", "dict_examp": "He said he had never seen her before.", "lear_examp": "My father never bought me any birthday presents before."}, {"sense": "a long period of time before something", "level": "C2", "dict_examp": "I was a vegetarian long before I met Sally.", "lear_examp": "The cups belonged to my family long before I was born and the fact they are a part of my family tradition makes them valuable in my eyes."}]}]}, {"word": "behavior", "poses": [{"pos": "noun", "senses": [{"sense": "the way that you behave", "level": "B1", "dict_examp": "bad/good behavior", "lear_examp": "But he answered my e-mail where I was apologizing for my behavior at his party, but he was really upset with me because I dropped his birthday cake into the pool and everyone laughed."}]}]}, {"word": "beg", "poses": [{"pos": "verb", "senses": [{"sense": "to make a very strong and urgent request", "level": "B2", "dict_examp": "They begged for mercy.", "lear_examp": "But before she left I begged her not to tell anybody."}, {"sense": "to ask someone for food or money, because you do not have any", "level": "B2", "dict_examp": "There are more and more homeless people begging on the streets these days.", "lear_examp": "He had a shabby coat, old shoes and he was begging for money."}]}]}, {"word": "being", "poses": [{"pos": "noun", "senses": [{"sense": "to start to exist", "level": "C2", "dict_examp": "The Internet as we see it today did not come into being all at once, but developed over time.", "lear_examp": "Nobody doubts that this situation could come into being mostly due to the extremally great progress of medicine and the other naturl sciences that could be observed one century ago and which is even greater now."}]}]}, {"word": "bee", "poses": [{"pos": "noun", "senses": [{"sense": "a yellow and black flying insect which makes honey and can sting you", "level": "B1", "dict_examp": "A swarm of bees flew into the garden.", "lear_examp": "Did you know that bees are endangered?"}]}]}, {"word": "beginner", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is starting to do or learn something for the first time", "level": "A2", "dict_examp": "I'm a complete beginner at yoga.", "lear_examp": "The book must have the vocabulary for a beginner."}]}]}, {"word": "begin", "poses": [{"pos": "verb", "senses": [{"sense": "to start to happen", "level": "A1", "dict_examp": "What time does the concert begin?", "lear_examp": "I think the class began yesterday."}, {"sense": "to start to do something", "level": "A2", "dict_examp": "The children began to cry.", "lear_examp": "We began to talk about music."}, {"sense": "to have something at the start", "level": "B1", "dict_examp": "The word \"cat\" begins with the letter \"C.\"", "lear_examp": ""}, {"sense": "at the start of a situation", "level": "B1", "dict_examp": "To begin with, the two girls got on well.", "lear_examp": "It wasn't stunningly beautiful, but a bed and a bathroom is really all we needed to begin with!"}, {"sense": "used to give the first important reason for something", "level": "B2", "dict_examp": "To begin with, we can't afford to move.", "lear_examp": "To begin with, it doesn't pollute and I think it's time we started thinking about the environment."}]}]}, {"word": "belt", "poses": [{"pos": "noun", "senses": [{"sense": "a long, thin piece of leather, cloth, or plastic that you wear around your waist", "level": "A2", "dict_examp": "She buckled/fastened her belt around her waist.", "lear_examp": "Juliana gave me a pink belt."}, {"sense": "to spend less money", "level": "C2", "dict_examp": "Since I lost my job we've all had to tighten our belts.", "lear_examp": "All this costs money and where do we get this extra money from but from the tax payers, who once again have to tighten their belts."}]}]}, {"word": "belong", "poses": [{"pos": "verb", "senses": [{"sense": "If something belongs somewhere, that is the place it should be in.", "level": "B2", "dict_examp": "This table belongs in the living room.", "lear_examp": "I can understand people who say that animals belong in nature."}, {"sense": "to feel happy or comfortable in a situation", "level": "B2", "dict_examp": "I spent two years in Boston but I never felt that I belonged there.", "lear_examp": ""}, {"sense": "If something belongs to you, you own it.", "level": "A2", "dict_examp": "This book belongs to Sarah.", "lear_examp": "I need it back because it belongs to my cousin."}, {"sense": "to be a member of a group or organization", "level": "B1", "dict_examp": "We belong to the same tennis club.", "lear_examp": "Also, I belonged to a golf club when I went to university in Japan."}]}]}, {"word": "best", "poses": [{"pos": "adjective", "senses": [{"sense": "(superlative of good) better than any other", "level": "A1", "dict_examp": "She was my best friend.", "lear_examp": "She likes to meet me every day because we are best friends."}, {"sense": "something that you write at the end of a letter", "level": "A2", "dict_examp": "With best wishes, Anna", "lear_examp": "With best wishes,"}, {"sense": "the thing that is best, if you cannot have or do the thing you really want", "level": "C1", "dict_examp": "Coaching baseball is the next best thing to playing.", "lear_examp": "For many working people, there is hardly time to cook and prepare your dinner, so the next best thing is to rush into a McDonalds' or Burger King."}, {"sense": "Someone’s best bet is the action most likely to be successful.", "level": "C2", "dict_examp": "If you want to get to the theater on time, your best bet is to get a cab.", "lear_examp": "The international cuisine chef can whip up some delicious creations from time to time; but your best bet is to go for one of the delicious steaks served."}]}, {"pos": "adverb", "senses": [{"sense": "(superlative of well) most, or more than any other", "level": "A1", "dict_examp": "Which of the songs did you like best?", "lear_examp": "I like Australia best."}, {"sense": "(superlative of well) in the most suitable or satisfactory way", "level": "B1", "dict_examp": "I sleep best with the window open.", "lear_examp": "It would be best if you came on Wednesday 27th."}, {"sense": "to be the most suitable person to have responsibility and make important decisions", "level": "C2", "dict_examp": "When it comes to dealing with my own son, I think I know best.", "lear_examp": "How true is that expression \"Father knows best.\" If my father was alive today he would probably be laughing his head off."}]}, {"pos": "noun", "senses": [{"sense": "used to say that you hope someone will be happy, healthy, successful, etc., often when saying goodbye", "level": "A2", "dict_examp": "Well, all the best - it was nice meeting you.", "lear_examp": "I want to wish you all the best!"}, {"sense": "someone or something that is better than any other", "level": "B1", "dict_examp": "I like all of Hitchcock's films, but I think \"Notorious\" is the best.", "lear_examp": "The trip was the best I have ever been on in my life."}, {"sense": "at the highest level of achievement or quality", "level": "B1", "dict_examp": "The article is an example of journalism at its best.", "lear_examp": "I enjoyed this trip because we got to stay in the countryside and see nature at its very best."}, {"sense": "to make the greatest effort possible", "level": "B1", "dict_examp": "I did my best to persuade him.", "lear_examp": "And the police said that they will try their best."}, {"sense": "to try to be positive about a situation you do not like but cannot change", "level": "B2", "dict_examp": "Our hotel room is pretty small, but we'll just have to make the best of it.", "lear_examp": "Unfortunately I don't have very much spare time so we will have to arrange it carefully in order to make the best of your time in London."}, {"sense": "to have the advantages of two different situations", "level": "C1", "dict_examp": "Living in the country and working in the city you have the best of both worlds.", "lear_examp": "Only those that can afford to live in the suburban areas can combine the best of both worlds and they tend to be rather affluent."}, {"sense": "used to show that the most positive way of considering something is still not good", "level": "C2", "dict_examp": "If he drops the course now, at best he’ll get an incomplete, and he could fail.", "lear_examp": "Then, due to the social standards, the old find themselves being abandoned and helpless. At best, such people are hospitalized."}, {"sense": "If something is for the best, it seems unpleasant now, but will improve a situation in the future.", "level": "C2", "dict_examp": "Moving to a smaller apartment really was for the best.", "lear_examp": "It's a kind of sad thing to think about but maybe it's for the best."}, {"sense": "to cause someone's best qualities to show", "level": "C2", "dict_examp": "This chance to work with young people has really brought out the best in him.", "lear_examp": "TV can be a babysitter, but such a relationship is not going to bring out the best in a child."}, {"sense": "used to show that something is not good when it is the best it can be", "level": "C2", "dict_examp": "He's not exactly patient at the best of times.", "lear_examp": "They knew that even at the best of times he looked unpleasant but now he was of a completely different appearance."}]}]}, {"word": "benefit", "poses": [{"pos": "noun", "senses": [{"sense": "something that helps you or gives you an advantage", "level": "B1", "dict_examp": "The discovery of oil brought many benefits to the town.", "lear_examp": "Taking everything into account, the drawbacks far outweigh its benefits."}, {"sense": "a helpful service employees receive in addition to their pay", "level": "B1", "dict_examp": "health/medical benefits", "lear_examp": ""}, {"sense": "to choose to believe what someone tells you even though it may be wrong or a lie", "level": "C2", "dict_examp": "She says her train was late, so I suppose we'd better give her the benefit of the doubt.", "lear_examp": "Every time our parents tell us \".. have you thought about it, are you sure you are not making a mistake?\" we just answer \"sure I have, no problem.\" Next time they do, let's give them the benefit of the doubt and let's think twice about the subject."}, {"sense": "in order to help someone", "level": "C2", "dict_examp": "We bought the piano for the children's benefit.", "lear_examp": "Needless to say, I hope you take into consideration all of this, not only for Gustavo's benefit, but also for the benefit of the astronaut training program and the world."}]}, {"pos": "verb", "senses": [{"sense": "to be helped by something or to help someone", "level": "B2", "dict_examp": "I feel that I have benefited greatly from her experience.", "lear_examp": "I am sure that the café would benefit a great deal from a non-smoking-area."}]}]}, {"word": "bend", "poses": [{"pos": "verb", "senses": [{"sense": "to move your body or part of your body so that it is not straight", "level": "B2", "dict_examp": "Bend your knees when lifting heavy objects.", "lear_examp": "My friend was bending over the table laughing hysterically."}, {"sense": "to (cause to) curve", "level": "B2", "dict_examp": "The trees were bending in the wind.", "lear_examp": "I saw fir trees bending in half and 500-year-old oaks shedding their leaves."}, {"sense": "to try very hard to do something", "level": "C1", "dict_examp": "They bent over backwards to make us feel at home.", "lear_examp": "They won't bend over backwards to look for a quick solution, but sooner or latter the matter will be solved."}]}, {"pos": "noun", "senses": [{"sense": "a curved part of something", "level": "B2", "dict_examp": "There's a bend in the pipe so you can't see from one end to the other.", "lear_examp": "The other car disappeared around a sharp bend and when we came around it, we saw that the car had stopped in the middle of the road."}]}]}, {"word": "beside", "poses": [{"pos": "preposition", "senses": [{"sense": "next to someone or something, or very near them", "level": "B1", "dict_examp": "Come and sit here beside me.", "lear_examp": "We shall go shopping after the film because the shopping complex is beside the cinema."}, {"sense": "to experience a powerful emotion", "level": "C2", "dict_examp": "He was beside himself  when he found out his dog had died.", "lear_examp": "Spending one's spare time being beside oneself with anger scarcely ever makes holidays enjoyable."}]}]}, {"word": "beneficial", "poses": [{"pos": "adjective", "senses": [{"sense": "helpful, useful or good", "level": "B2", "dict_examp": "The improvement in sales figures had a beneficial effect on the company as a whole.", "lear_examp": "To sum up, team sports are beneficial to children so if the schools they attend do not have any, they should take up something."}]}]}, {"word": "beneath", "poses": [{"pos": "preposition", "senses": [{"sense": "under something, or in a lower position than something", "level": "B2", "dict_examp": "Jeremy hid the letter beneath a pile of papers.", "lear_examp": "She could feel the train coming because the ground beneath her feet was moving."}, {"sense": "not good enough or of not enough importance for you notice or to spend you time on", "level": "C2", "dict_examp": "He thinks housework is beneath him.", "lear_examp": "He hadn't realized how much he would miss the high-life until he was forced to watch all the rich and famous people come into the restaurant and look down on everything and everyone who was beneath them."}]}]}, {"word": "belongings", "poses": [{"pos": "noun", "senses": [{"sense": "the things that a person owns, especially those which can be carried", "level": "B2", "dict_examp": "I put a few personal belongings in a bag and left the house for the last time.", "lear_examp": "Five different kings have lived there with their families and it is possible to see several of their personal belongings."}]}]}, {"word": "below", "poses": [{"pos": "adverb", "senses": [{"sense": "in a lower position than someone or something else", "level": "A1", "dict_examp": "From the top of the skyscraper the cars below us looked like insects.", "lear_examp": "I think it's a nice place, because you have a great view of the other mountains and the country below you."}, {"sense": "less than a particular amount or level", "level": "B1", "dict_examp": "His marks in English have been below average for some time now.", "lear_examp": "We have to learn that it is not natural for a lion to be living in a country where, in winter, the temperature can fall below zero."}, {"sense": "lower in rank", "level": "C2", "dict_examp": "Monica is a grade below me.", "lear_examp": "With him being only 37 years old and having been promoted to the second level below the board of directors of a well-known international company, he seems like a good example of a successful person, at least in this area of success."}]}]}, {"word": "bench", "poses": [{"pos": "noun", "senses": [{"sense": "a long seat for two or more people, usually made of wood or metal", "level": "B2", "dict_examp": "a park bench", "lear_examp": "At 1 p.m. Paul was sitting on a bench and waiting for Julia."}]}]}, {"word": "believe", "poses": [{"pos": "verb", "senses": [{"sense": "to think that something is true, or that what someone says is true", "level": "A2", "dict_examp": "They believe that their health has suffered because of the chemicals.", "lear_examp": "I believe him."}, {"sense": "to think something, without being completely sure", "level": "A2", "dict_examp": "\"Is she coming alone?\" \"I believe so.\"", "lear_examp": "I believe it is in your bedroom."}, {"sense": "to be very surprised when you see someone or something, or when you hear what someone says", "level": "B1", "dict_examp": "I couldn't believe my ears when Dan said they were getting married.", "lear_examp": "Well, this church was extremely simple on the outside, but when I got inside it, I couldn't believe my eyes."}, {"sense": "used to say that something is true although it seems surprising", "level": "B1", "dict_examp": "He even remembered my birthday, believe it or not.", "lear_examp": "First I visited the \"Roman Bath'' which is more than 2000 years old and, believe it or not, it still works!"}, {"sense": "to be certain that something exists", "level": "B1", "dict_examp": "Do you believe in ghosts?", "lear_examp": "Claire I want to tell you that we have to believe in miracles!"}, {"sense": "to be confident that something is effective and right", "level": "B2", "dict_examp": "He believes in saying what he thinks.", "lear_examp": "Nowadays I don't believe in changing your decision."}]}]}, {"word": "bell", "poses": [{"pos": "noun", "senses": [{"sense": "an electrical object that makes a ringing sound when you press a button", "level": "B1", "dict_examp": "Please ring the bell for attention.", "lear_examp": "I was relaxing at home when suddenly the bell rang."}, {"sense": "a hollow, metal object, shaped like a cup, that makes a ringing sound when you hit it", "level": "B2", "dict_examp": "the sound of church bells ringing", "lear_examp": "Then I heard the bells from the tower."}, {"sense": "If a word, especially a name, rings a bell, you think you have heard it before.", "level": "C2", "dict_examp": "Shane Watson? That name rings a bell.", "lear_examp": "Its name is Laser - I suppose it rings a bell?"}]}]}, {"word": "berry", "poses": [{"pos": "noun", "senses": [{"sense": "a small round fruit on particular plants and trees", "level": "B2", "dict_examp": "I usually scatter a few berries on my muesli.", "lear_examp": "Every day we were swimming, fishing, picking mushrooms and berries, hunting and making fires to prepare food."}]}]}, {"word": "besides", "poses": [{"pos": "preposition", "senses": [{"sense": "in addition to something or someone", "level": "B1", "dict_examp": "Do you play any other sports besides football and basketball?", "lear_examp": "It's a Chinese food buffet but besides Chinese food they also have Italian food like pizza."}]}, {"pos": "adverb", "senses": [{"sense": "used to give another reason for something", "level": "B1", "dict_examp": "She won't mind your being late - besides, it's hardly your fault.", "lear_examp": "I think that I'm going to buy \"Troy\" because it looks to me to be a great movie - besides, it reminds me of your vacations in Mexico."}, {"sense": "in addition to", "level": "B1", "dict_examp": "Besides looking after the children, she runs a successful business.", "lear_examp": "But besides playing, you can also sit in the \"club lounge\", where you can drink something with your friends or just play cards."}]}]}, {"word": "bestseller", "poses": [{"pos": "noun", "senses": [{"sense": "a very popular book that many people have bought", "level": "B2", "dict_examp": "His latest book is likely to be another bestseller.", "lear_examp": "Maybe your parents could bring me one of the newest bestsellers, which haven't been translated into Polish yet."}]}]}, {"word": "bid", "poses": [{"pos": "noun", "senses": [{"sense": "an attempt to get or achieve something", "level": "C1", "dict_examp": "He was defeated in his bid for governor.", "lear_examp": "The state school premises are in derelict condition. Sometimes the students' parents as a group try to raise money in a bid to solve this problem, but their efforts are never enough."}, {"sense": "an offer to do a job for a particular amount of money when you are competing with other people to do it", "level": "C1", "dict_examp": "We put in a bid for the stadium contract.", "lear_examp": "From the three bids received, it emerges that Kavanagh Catering Services would be able to provide a functional and cheap service, which is considered one of the most important aspects by the students."}, {"sense": "an offer to pay a particular amount of money for something", "level": "C2", "dict_examp": "I made a bid of $150 for the painting.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to offer to pay an amount of money for something", "level": "C2", "dict_examp": "They bid $500 million for the company.", "lear_examp": "As a Tea Company chairman, he buys his tea in Calcutta or Colombo, and generally bids at the right price."}]}]}, {"word": "better", "poses": [{"pos": "adjective", "senses": [{"sense": "(comparative of good) of a higher quality, more effective, or more enjoyable than something or someone else", "level": "A1", "dict_examp": "She found a better job.", "lear_examp": "It is a better pen than others."}, {"sense": "healthy, or less ill than before", "level": "A1", "dict_examp": "Do you feel better now?", "lear_examp": "I visited my cousin last night in the hospital he was ill. He is now better."}, {"sense": "to look old or be   in bad condition because of a lot of use", "level": "C2", "dict_examp": "This jacket has seen better days.", "lear_examp": "In the dense fog he managed to see a man standing nearby, whose clothes had definitely seen better days."}]}, {"pos": "adverb", "senses": [{"sense": "(comparative of well) to a greater degree, or in a more successful or more effective way", "level": "A2", "dict_examp": "I'd like to get to know him better.", "lear_examp": "But she explained everything very clearly, so I understood better."}, {"sense": "used to say what someone should do", "level": "A2", "dict_examp": "You'd better hurry or you'll miss the train.", "lear_examp": "You'd better bring a notebook."}, {"sense": "to have enough experience not to do something stupid or something that will not achieve anything", "level": "C2", "dict_examp": "I thought she'd listen to me - I should have known better.", "lear_examp": "Surely two grown-ups should have known better than to shout at each other at the top of their lungs."}]}]}, {"word": "biased", "poses": [{"pos": "adjective", "senses": [{"sense": "showing unfair support for or opposition to someone or something because of your personal opinions", "level": "C1", "dict_examp": "The newspapers gave a biased report of the meeting.", "lear_examp": "Maybe it is not an original idea, but I must admit my choice was a little bit biased, since I am reading a book about this era at the moment."}]}]}, {"word": "best", "poses": [{"pos": "adjective", "senses": [{"sense": "(superlative of good) better than any other", "level": "A1", "dict_examp": "She was my best friend.", "lear_examp": "She likes to meet me every day because we are best friends."}, {"sense": "something that you write at the end of a letter", "level": "A2", "dict_examp": "With best wishes, Anna", "lear_examp": "With best wishes,"}, {"sense": "the thing that is best, if you cannot have or do the thing you really want", "level": "C1", "dict_examp": "Coaching baseball is the next best thing to playing.", "lear_examp": "For many working people, there is hardly time to cook and prepare your dinner, so the next best thing is to rush into a McDonalds' or Burger King."}, {"sense": "Someone’s best bet is the action most likely to be successful.", "level": "C2", "dict_examp": "If you want to get to the theater on time, your best bet is to get a cab.", "lear_examp": "The international cuisine chef can whip up some delicious creations from time to time; but your best bet is to go for one of the delicious steaks served."}]}, {"pos": "adverb", "senses": [{"sense": "(superlative of well) most, or more than any other", "level": "A1", "dict_examp": "Which of the songs did you like best?", "lear_examp": "I like Australia best."}, {"sense": "(superlative of well) in the most suitable or satisfactory way", "level": "B1", "dict_examp": "I sleep best with the window open.", "lear_examp": "It would be best if you came on Wednesday 27th."}, {"sense": "to be the most suitable person to have responsibility and make important decisions", "level": "C2", "dict_examp": "When it comes to dealing with my own son, I think I know best.", "lear_examp": "How true is that expression \"Father knows best.\" If my father was alive today he would probably be laughing his head off."}]}, {"pos": "noun", "senses": [{"sense": "used to say that you hope someone will be happy, healthy, successful, etc., often when saying goodbye", "level": "A2", "dict_examp": "Well, all the best - it was nice meeting you.", "lear_examp": "I want to wish you all the best!"}, {"sense": "someone or something that is better than any other", "level": "B1", "dict_examp": "I like all of Hitchcock's films, but I think \"Notorious\" is the best.", "lear_examp": "The trip was the best I have ever been on in my life."}, {"sense": "at the highest level of achievement or quality", "level": "B1", "dict_examp": "The article is an example of journalism at its best.", "lear_examp": "I enjoyed this trip because we got to stay in the countryside and see nature at its very best."}, {"sense": "to make the greatest effort possible", "level": "B1", "dict_examp": "I did my best to persuade him.", "lear_examp": "And the police said that they will try their best."}, {"sense": "to try to be positive about a situation you do not like but cannot change", "level": "B2", "dict_examp": "Our hotel room is pretty small, but we'll just have to make the best of it.", "lear_examp": "Unfortunately I don't have very much spare time so we will have to arrange it carefully in order to make the best of your time in London."}, {"sense": "to have the advantages of two different situations", "level": "C1", "dict_examp": "Living in the country and working in the city you have the best of both worlds.", "lear_examp": "Only those that can afford to live in the suburban areas can combine the best of both worlds and they tend to be rather affluent."}, {"sense": "used to show that the most positive way of considering something is still not good", "level": "C2", "dict_examp": "If he drops the course now, at best he’ll get an incomplete, and he could fail.", "lear_examp": "Then, due to the social standards, the old find themselves being abandoned and helpless. At best, such people are hospitalized."}, {"sense": "If something is for the best, it seems unpleasant now, but will improve a situation in the future.", "level": "C2", "dict_examp": "Moving to a smaller apartment really was for the best.", "lear_examp": "It's a kind of sad thing to think about but maybe it's for the best."}, {"sense": "to cause someone's best qualities to show", "level": "C2", "dict_examp": "This chance to work with young people has really brought out the best in him.", "lear_examp": "TV can be a babysitter, but such a relationship is not going to bring out the best in a child."}, {"sense": "used to show that something is not good when it is the best it can be", "level": "C2", "dict_examp": "He's not exactly patient at the best of times.", "lear_examp": "They knew that even at the best of times he looked unpleasant but now he was of a completely different appearance."}]}]}, {"word": "bet", "poses": [{"pos": "verb", "senses": [{"sense": "something that you say to show that you believe that something is true or will happen", "level": "B1", "dict_examp": "I bet you she's missed the bus.", "lear_examp": "The movie is amazing. I bet you'll see it soon."}, {"sense": "to risk money on the result of a game, competition, etc.", "level": "C1", "dict_examp": "He lost all his money betting on horses.", "lear_examp": "The game lost its innocence long before 1985 when players were betting on the result of their own game."}]}, {"pos": "noun", "senses": [{"sense": "when you guess about something or  risk money on the result of a game, competition, etc.", "level": "C2", "dict_examp": "She was right - she won our bet.", "lear_examp": "But I do remember the little village where the auction was, the awful tea served in plastic cups, and how nervous I was to place a bet."}, {"sense": "Someone’s best bet is the action most likely to be successful.", "level": "C2", "dict_examp": "If you want to get to the theater on time, your best bet is to get a cab.", "lear_examp": "The international cuisine chef can whip up some delicious creations from time to time; but your best bet is to go for one of the delicious steaks served."}, {"sense": "something that you are certain will happen", "level": "C2", "dict_examp": "Wheeler is a safe bet for a place on the team.", "lear_examp": "Automatically, we think that black is a safe bet for any occasion."}]}]}, {"word": "beware", "poses": [{"pos": "verb", "senses": [{"sense": "used in order to warn someone to be careful", "level": "C1", "dict_examp": "Beware of the dog.", "lear_examp": "Although it's fun to surf, beware of the danger..."}]}]}, {"word": "beyond", "poses": [{"pos": "preposition", "senses": [{"sense": "continuing after a particular time or date", "level": "B1", "dict_examp": "Few people live beyond the age of a hundred.", "lear_examp": "You should take a break every two hours  because, beyond two hours, your mind cannot record what you are learning."}, {"sense": "on the other side of something", "level": "B2", "dict_examp": "Beyond the river is a small town.", "lear_examp": "Suddenly she recognized something red, beyond a tree and covered with some leaves."}, {"sense": "not able to be changed by me/us, etc.", "level": "B2", "dict_examp": "Tonight's performance has been cancelled due to circumstances beyond our control.", "lear_examp": "This is a story about an event that turned out to be beyond my control."}, {"sense": "involving or affecting more things, people, etc., than the ones you have talked about", "level": "C1", "dict_examp": "My job goes beyond teaching facts – my aim is to get children to think for themselves.", "lear_examp": "Finally, I suggest that the magazine could go beyond sport activities and interviews by including book reviews and news about the latest films."}, {"sense": "in a degree or amount that is greater than can be done, described, understood, etc", "level": "C2", "dict_examp": "That old computer is beyond repair.", "lear_examp": "It was beyond description how terribly scared I was."}, {"sense": "something is impossible for you to understand", "level": "C2", "dict_examp": "How they can live in such chaos is beyond me.", "lear_examp": "How these people dismiss our educational system, which in my opinion is exceptional, is beyond me."}, {"sense": "completely certain and without any doubt", "level": "C2", "dict_examp": "It is beyond doubt that she the best students I’ve ever taught.", "lear_examp": "What I would regard as being my most treasured possession is beyond doubt my precious collection of books."}, {"sense": "If something is true beyond a shadow of a doubt, it is certainly true.", "level": "C2", "dict_examp": "He convinced me , but it hasn't been proved beyond the shadow of a doubt.", "lear_examp": "It has been established beyond a shadow of a doubt that the growth in world population is one of the most compelling problems the Earth is facing."}, {"sense": "bigger or better than anything you could imagine or hope for", "level": "C2", "dict_examp": "The house was beyond my wildest dreams.", "lear_examp": "It was beyond my wildest dreams."}]}, {"pos": "adverb", "senses": [{"sense": "at or past the far side of something", "level": "C1", "dict_examp": "From the top of the hill we could see our house and the woods beyond.", "lear_examp": "The airport-bus will take you to the center of Ostersund where I live and even beyond."}, {"sense": "continuing after a particular time or date", "level": "C2", "dict_examp": "The dispute is likely to continue into March and beyond.", "lear_examp": "The fact of living longer allows people to share part of their lives with their children, their grandchildren and sometimes even one generation beyond."}]}]}, {"word": "bias", "poses": [{"pos": "noun", "senses": [{"sense": "when you support or oppose someone or something in an unfair way because you are influenced by your personal opinions", "level": "C2", "dict_examp": "Some people feel news coverage always reflects a reporter’s bias.", "lear_examp": "It is necessary to get rid of all our previous bias when we go to a foreign country, to achieve a better understanding of the local culture."}]}]}, {"word": "bicycle", "poses": [{"pos": "noun", "senses": [{"sense": "a two-wheeled vehicle that you sit on and move by turning the two pedals", "level": "A2", "dict_examp": "I go to work by bicycle.", "lear_examp": "I want to sell my bicycle."}]}]}, {"word": "big", "poses": [{"pos": "adjective", "senses": [{"sense": "large in size or amount", "level": "A1", "dict_examp": "He's a big man.", "lear_examp": "I got a lot of presents: CDs, DVDs, photos, clothes and a big blue bear."}, {"sense": "your older brother/sister", "level": "A2", "dict_examp": "My big sister is coming to pick me up.", "lear_examp": "It was given to me by my big brother and I loved it."}, {"sense": "important or serious", "level": "A2", "dict_examp": "He had a big decision to make.", "lear_examp": "But there was a very big problem: she has a boyfriend."}, {"sense": "successful or popular", "level": "C1", "dict_examp": "The program's been a                          big hit with young children.", "lear_examp": "Of course, the many traditional craft stalls were a big hit also, and there were hardly any things left!"}]}]}, {"word": "betray", "poses": [{"pos": "verb", "senses": [{"sense": "to behave in a dishonest or cruel way to someone who trusts you", "level": "B2", "dict_examp": "She felt betrayed by her mother's lack of support.", "lear_examp": "He couldn't believe that his best friend had betrayed him."}]}]}, {"word": "between", "poses": [{"pos": "preposition", "senses": [{"sense": "in the space that separates two places, people or objects", "level": "A1", "dict_examp": "The town lies halfway between Rome and Florence.", "lear_examp": "I think that I left it in your bedroom, on the shelf between your bed and your brother's."}, {"sense": "in the period of time that separates two different events or times", "level": "A1", "dict_examp": "You shouldn't eat between meals.", "lear_examp": "I will arrive between 10 o'clock and 11 o'clock."}, {"sense": "involving two or more groups of people", "level": "A1", "dict_examp": "Tonight's game is between the New Orleans Saints and the Los Angeles Rams.", "lear_examp": "I would like to go shopping and then see the match between Spain and Germany."}, {"sense": "used to show the largest and smallest amount or level of something", "level": "A2", "dict_examp": "The box weighs between 55 and 60 pounds.", "lear_examp": "It's for young people aged between 18 and 30 years old."}, {"sense": "connecting two or more places, things or people", "level": "A2", "dict_examp": "There is regular train service between Philadelphia and Washington.", "lear_examp": ""}, {"sense": "separating two places or things", "level": "A2", "dict_examp": "The wall between East and West Berlin came down in 1989.", "lear_examp": "I think that the most interesting place near my town is the mountains which are like a wall between my country and China."}, {"sense": "among two or more people or things", "level": "B1", "dict_examp": "We drank two bottles of wine between four of us.", "lear_examp": "I think you'll have to discuss the ideas between you."}, {"sense": "If you read between the lines, you understand what something really means when it hasn't been directly said or written.", "level": "C2", "dict_examp": "Reading between the lines, it was obvious that something was wrong.", "lear_examp": "All songs send positive thoughts and messages to listeners, although sometimes you really have to read between the lines to understand this profound message."}]}, {"pos": "adverb", "senses": [{"sense": "in the space that separates two people, places, or things", "level": "C1", "dict_examp": "The wood is in neat piles with newspaper placed in between.", "lear_examp": "There is a shuttle bus from the airport straight to the main station with only one stop in between."}, {"sense": "in the period of time that separates two events or times", "level": "C1", "dict_examp": "There's a train at 6:15 and one at 10:30 but nothing in between.", "lear_examp": "Besides, there is research that proves that people cannot work for more than two hours at a time. They can't concentrate that long and they need to rest their minds for short periods in between."}, {"sense": "not happening or existing very often", "level": "C2", "dict_examp": "Opportunities like this are few and far between.", "lear_examp": "Jobs in those days were few and far between and for a number of years he was alternating between temporary jobs and unemployment benefits."}]}]}, {"word": "bill", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of paper that tells you how much you must pay for something you have bought or for a service you have used", "level": "A2", "dict_examp": "an electricity/gas/phone bill", "lear_examp": "I need it because I must pay the bills."}, {"sense": "a piece of paper money", "level": "B1", "dict_examp": "a twenty-dollar bill", "lear_examp": "If your University has Internet access, there might be a way to earn lots of dollar bills."}, {"sense": "to pay for something that costs a lot of money", "level": "C2", "dict_examp": "His parents can’t afford to foot the bill for his college education.", "lear_examp": "Only one problem arouse, which is who is going to foot the bill because such a factory is quite expensive."}]}]}, {"word": "bird", "poses": [{"pos": "noun", "senses": [{"sense": "an animal that has wings and feathers, and is usually able to fly", "level": "A1", "dict_examp": "caged/wild birds", "lear_examp": "I saw lots of birds in the trees."}]}]}, {"word": "blackmail", "poses": [{"pos": "noun", "senses": [{"sense": "when someone forces you to do something or to pay them money, by saying they will tell another person something that you want to keep secret", "level": "C2", "dict_examp": "She was charged with blackmail.", "lear_examp": "She knows exactly how to handle him, seducing him, accusing him of ingratitude or using emotional blackmail."}]}, {"pos": "verb", "senses": [{"sense": "to force someone to do something by using blackmail", "level": "C2", "dict_examp": "They used the photographs to blackmail her into spying for them.", "lear_examp": "It's all over, but she is blackmailing me."}]}]}, {"word": "big", "poses": [{"pos": "adjective", "senses": [{"sense": "large in size or amount", "level": "A1", "dict_examp": "He's a big man.", "lear_examp": "I got a lot of presents: CDs, DVDs, photos, clothes and a big blue bear."}, {"sense": "your older brother/sister", "level": "A2", "dict_examp": "My big sister is coming to pick me up.", "lear_examp": "It was given to me by my big brother and I loved it."}, {"sense": "important or serious", "level": "A2", "dict_examp": "He had a big decision to make.", "lear_examp": "But there was a very big problem: she has a boyfriend."}, {"sense": "successful or popular", "level": "C1", "dict_examp": "The program's been a                          big hit with young children.", "lear_examp": "Of course, the many traditional craft stalls were a big hit also, and there were hardly any things left!"}]}]}, {"word": "bike", "poses": [{"pos": "noun", "senses": [{"sense": "a bicycle", "level": "A1", "dict_examp": "He was on his bike.", "lear_examp": "We can go for a walk, ride a bike, or play football and other sports."}, {"sense": "a motorcycle", "level": "B1", "dict_examp": "He came on his bike.", "lear_examp": ""}]}]}, {"word": "bizarre", "poses": [{"pos": "adjective", "senses": [{"sense": "very strange and unusual", "level": "B2", "dict_examp": "bizarre behavior", "lear_examp": "Things are sometimes quite bizarre, aren't they?"}]}]}, {"word": "bitter", "poses": [{"pos": "adjective", "senses": [{"sense": "with an unpleasantly sharp taste", "level": "B1", "dict_examp": "a bitter taste", "lear_examp": "And due to these bizarre situations I went through as a little boy, everything related to shopping seems like a bitter liquid which I'm forced to drink."}, {"sense": "angry and upset because of something bad that has happened that you cannot forget", "level": "B2", "dict_examp": "I feel very bitter about my childhood and the way I was treated.", "lear_examp": "What can be more real than when your lover is gone or taken away your own soul is also alone, bitter and dark and there is nothing else than feelings of revenge, anger, frustration and sadness?"}, {"sense": "full of hate or anger", "level": "B2", "dict_examp": "a bitter argument/dispute", "lear_examp": "Every time they met, a bitter feeling of hatred bloomed in her throat."}, {"sense": "making you feel very disappointed", "level": "B2", "dict_examp": "Failing the final exam was a bitter disappointment for me.", "lear_examp": "Now, I've already recovered from this bitter experience."}, {"sense": "extremely cold", "level": "B2", "dict_examp": "a bitter wind", "lear_examp": ""}, {"sense": "If you do something to/till/until the bitter end, you continue it until it is finished, although it is difficult and takes a long time.", "level": "C2", "dict_examp": "The president fought for his plan to the bitter end.", "lear_examp": "We are willing to talk and find alternatives to the situation, but we are also ready to fight till the bitter end to stand for our rights."}]}]}, {"word": "birthday", "poses": [{"pos": "noun", "senses": [{"sense": "the day on which someone was born, or the same date each year", "level": "A1", "dict_examp": "Happy birthday!", "lear_examp": "I have just had a birthday."}]}]}, {"word": "birth", "poses": [{"pos": "noun", "senses": [{"sense": "the time when a baby is born", "level": "A2", "dict_examp": "He weighed seven pounds at birth.", "lear_examp": "It begins with the birth of his sister Margana and ends with his death."}, {"sense": "When a woman or an animal gives birth, she produces a baby from her body.", "level": "B2", "dict_examp": "She gave birth to twins.", "lear_examp": "The most important person in my life is the person who gave birth to me, my mother."}, {"sense": "born in a particular place or with a particular nationality", "level": "B2", "dict_examp": "I grew up in Paris, but I'm Italian by birth.", "lear_examp": "I am an eighteen year old college student and I am Portuguese by birth."}, {"sense": "the beginning of something", "level": "C1", "dict_examp": "the birth of  modern science", "lear_examp": "Pericles was the man who achieved the birth of democracy."}]}]}, {"word": "blame", "poses": [{"pos": "verb", "senses": [{"sense": "to say or think that someone or something is responsible for something bad that has happened", "level": "B1", "dict_examp": "Don't blame me if you miss the bus!", "lear_examp": "She thought that I would blame her so she decided to write me a letter."}, {"sense": "to be responsible for something bad that has happened", "level": "C1", "dict_examp": "Poor housing is to  blame for many of their health problems.", "lear_examp": "Nevertheless, the child is not to blame for this and neither are his parents."}, {"sense": "used to say that you understand and accept the reason for what someone is doing", "level": "C2", "dict_examp": "\"I think I'll go home early.\" \"I don't blame you - you look really tired.\"", "lear_examp": "You might regard me as an immature, seventeen year old girl for decorating my diary.  Honestly I do not blame you for that."}]}, {"pos": "noun", "senses": [{"sense": "when people say or think that someone or something is responsible for something bad", "level": "B2", "dict_examp": "The manager should take the blame for the team's defeat.", "lear_examp": "In addition to all the above I want to tell you that I was very pleased with the tour guide and I don't want to put the blame on her."}]}]}, {"word": "bind", "poses": [{"pos": "verb", "senses": [{"sense": "to tie something together with string, rope, etc.", "level": "C2", "dict_examp": "His hands were bound behind his back.", "lear_examp": "Take this rope and bind yourselves together, so as not to lose someone."}, {"sense": "to unite people", "level": "C2", "dict_examp": "Culture and language bind people together.", "lear_examp": "And even if people mostly cheer for athletes from their own country, it can be seen as a safe outlet for nationalist feelings, that bind a country together without turning to racism, for example."}]}]}, {"word": "bilingual", "poses": [{"pos": "adjective", "senses": [{"sense": "using or able to speak two languages", "level": "C1", "dict_examp": "a bilingual dictionary", "lear_examp": "As I work as a bilingual secretary in a multinational company, I use English regularly."}]}]}, {"word": "bland", "poses": [{"pos": "adjective", "senses": [{"sense": "If food is bland, it does not have much taste.", "level": "C2", "dict_examp": "The soup was a bit bland.", "lear_examp": "In the evenings they usually attended boring dinner parties, where bland, soggy food was served, and the other guests were at least 20 years older than her and rather snobbish and stiff."}, {"sense": "not interesting or exciting", "level": "C2", "dict_examp": "bland statements", "lear_examp": "Peeping through the viewer she focused her gaze on the bland face of the man outside."}]}]}, {"word": "biography", "poses": [{"pos": "noun", "senses": [{"sense": "the life story of a person written by someone else", "level": "B1", "dict_examp": "He wrote a biography of Winston Churchill.", "lear_examp": "I found Orwell's biography so I bought it."}]}]}, {"word": "blackboard", "poses": [{"pos": "noun", "senses": [{"sense": "a large board with a dark surface that a teacher writes on with chalk", "level": "A2", "dict_examp": "She wrote her name on the blackboard.", "lear_examp": ""}]}]}, {"word": "biological", "poses": [{"pos": "adjective", "senses": [{"sense": "connected with the natural processes of living things", "level": "B2", "dict_examp": "the biological sciences", "lear_examp": "Paul always knew that the Watsons weren't his biological parents."}]}]}, {"word": "bite", "poses": [{"pos": "verb", "senses": [{"sense": "to cut something using your teeth", "level": "B1", "dict_examp": "He bit into the apple.", "lear_examp": "A snake bit me on my leg, but that's ok."}]}, {"pos": "noun", "senses": [{"sense": "a piece taken from food when you bite it", "level": "B2", "dict_examp": "She took a bite of her pizza.", "lear_examp": "When Alice took a bite out of the cake, something hard touched her teeth."}, {"sense": "an injury caused when an animal or insect bites you", "level": "B2", "dict_examp": "mosquito bites", "lear_examp": "As far as your question about our sleeping is concerned, I wouldn't mind either staying in rooms or tents, but since you ask me to express my preference, I would suggest staying in rooms, in order to avoid insect bites."}, {"sense": "a small meal", "level": "C2", "dict_examp": "I just want to grab a bite to eat.", "lear_examp": "It all went smoothly until 2 o'clock when they stopped for a break and a bite to eat."}]}]}, {"word": "blade", "poses": [{"pos": "noun", "senses": [{"sense": "the flat part on a knife or similar tool or weapon, with a very thin edge used for cutting", "level": "B2", "dict_examp": "a sword with a steel blade", "lear_examp": "Suddenly she felt the blade on her neck and she screamed in panic."}]}]}, {"word": "black", "poses": [{"pos": "adjective", "senses": [{"sense": "being the darkest color there is, like the color of coal or of a very dark night", "level": "A1", "dict_examp": "black shoes", "lear_examp": "Lisa gave me a black t-shirt."}, {"sense": "Someone who is black has the dark skin typical of people from Africa.", "level": "A2", "dict_examp": "black culture", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the color of coal or of the sky on a very dark night", "level": "A2", "dict_examp": "She always dresses in black.", "lear_examp": "Oh! Yeah try wearing black because we're gonna be dirty."}]}]}, {"word": "bit", "poses": [{"pos": "noun", "senses": [{"sense": "slightly", "level": "A2", "dict_examp": "The dress is a bit too big for me.", "lear_examp": "I'd like to walk or do any other sport, because I am a bit fat."}, {"sense": "a small amount or piece of something", "level": "B1", "dict_examp": "There were little bits of paper all over the floor.", "lear_examp": "I'm not going because I'm feeling bad and I also have a bit of fever."}, {"sense": "a lot", "level": "B1", "dict_examp": "He does quite a bit of traveling.", "lear_examp": "We spent quite a bit of time going along the beach."}, {"sense": "a short period of time", "level": "B2", "dict_examp": "I'm just going out for a bit. See you later.", "lear_examp": "I had my breakfast, I went to buy the newspaper and then I came back to my house to rest for a bit."}, {"sense": "a surprise, problem, mess, etc. that is not too big or serious", "level": "C1", "dict_examp": "I am a bit of a romantic.", "lear_examp": "It is sometimes a bit of a nuisance to check every time whether both doors are well locked up."}, {"sense": "gradually", "level": "C1", "dict_examp": "She saved up the money, bit by bit.", "lear_examp": "This film is full of tension as the truth is only revealed bit by bit."}, {"sense": "small things or jobs which are not connected or not very important", "level": "C2", "dict_examp": "We've packed most of it up now, there are just a few bits and pieces left.", "lear_examp": "So, it's memories that make us keep odd bits and pieces."}]}]}, {"word": "billion", "poses": [{"pos": "noun", "senses": [{"sense": "the number 1,000,000,000", "level": "B2", "dict_examp": "Cosmetics is a billion dollar industry.", "lear_examp": "There she was, 70m above the sea with a crazy man with a gun behind her and billions of thoughts in her head."}]}]}, {"word": "bikini", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of clothing with two parts that women wear for swimming", "level": "B2", "dict_examp": "I packed my bikini for the beach.", "lear_examp": "Thelma was right: her bikini was really too big for her."}]}]}, {"word": "biology", "poses": [{"pos": "noun", "senses": [{"sense": "the scientific study  of living things", "level": "A2", "dict_examp": "molecular/cellular biology", "lear_examp": "Dear Gary, Last night I think I left my biology book at your house."}]}]}, {"word": "blend", "poses": [{"pos": "noun", "senses": [{"sense": "a combination of two or more things", "level": "C2", "dict_examp": "Their music is a blend of jazz and African rhythms.", "lear_examp": "I suppose this is a blend of entertainment and the darker sides of human nature, like envy or curiosity."}]}]}, {"word": "blog", "poses": [{"pos": "noun", "senses": [{"sense": "a record of your activities or opinions that you put on the Internet for other people to read and that you change regularly", "level": "B1", "dict_examp": "There are two or three blogs that I read on a daily basis.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to write or add material to a blog", "level": "B1", "dict_examp": "He blogs about living with the disease.", "lear_examp": ""}]}]}, {"word": "blond", "poses": [{"pos": "adjective", "senses": [{"sense": "with pale yellow hair", "level": "A2", "dict_examp": "blond hair", "lear_examp": "She is 40 years old and she has blond hair."}]}]}, {"word": "bleak", "poses": [{"pos": "adjective", "senses": [{"sense": "If a situation is bleak, there is little or no hope for the future.", "level": "C2", "dict_examp": "The future is looking bleak for small businesses struggling with debts.", "lear_examp": "This may seem like a very bleak future for many young people today."}, {"sense": "If a place is bleak, it is cold, empty and not attractive.", "level": "C2", "dict_examp": "a bleak landscape", "lear_examp": "They lack basic training and experience and thus often get lost or hurt in bleak and isolated areas, giving the mountain rescue teams a hard time."}]}]}, {"word": "blindness", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being blind", "level": "C1", "dict_examp": "In its later stages the disease causes blindness.", "lear_examp": "Apart from his blindness, his health has worsened in general."}, {"sense": "the state of not noticing something, or not wanting to notice or understand it", "level": "C2", "dict_examp": "My blindness to what was happening led me to make a bad decision.", "lear_examp": "His mother and Mister Hooper, with their blindness and insensitivity, do not see what is going on between the two boys."}]}]}, {"word": "blanket", "poses": [{"pos": "noun", "senses": [{"sense": "a thick, warm cover that you sleep under", "level": "A2", "dict_examp": "She put an extra blanket on the bed.", "lear_examp": "I think I'll buy some new pillows, a duvet and a warm blanket."}, {"sense": "a thick layer of something", "level": "C2", "dict_examp": "a blanket of snow/dust", "lear_examp": "I do remember it rained heavily and the sky was covered with a blanket of gray."}]}]}, {"word": "blouse", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of clothing for women that is like a shirt", "level": "A1", "dict_examp": "sleeveless/long-sleeved blouses", "lear_examp": "I'll wear a black blouse, jeans and black boots."}]}]}, {"word": "block", "poses": [{"pos": "noun", "senses": [{"sense": "the distance along a street from where one road crosses it to the place where the next road crosses it", "level": "A2", "dict_examp": "The museum is just six blocks away.", "lear_examp": "So you have to go along 3 blocks and turn on your left and just in front of you is the Cathedral and next to the Cathedral is the Zocalo."}, {"sense": "the land and buildings on a part of street between two other streets that cross it, or  an area of land and buildings inside a rectangle formed by four streets", "level": "A2", "dict_examp": "My friend and I live on the same block.", "lear_examp": "We took a walk around the block and we had lunch together."}, {"sense": "a solid piece of hard material, usually in the shape of a square or rectangle", "level": "B2", "dict_examp": "a block of ice/stone/wood", "lear_examp": "It is like an enormous block of stone!"}, {"sense": "something that makes it difficult to move or make progress", "level": "C2", "dict_examp": "Lack of money has been the main stumbling block.", "lear_examp": "Very often students are asked to present a certain subject, but the main stumbling block is that they are not given the knowledge of how to do it properly."}]}, {"pos": "verb", "senses": [{"sense": "to prevent movement through or past something", "level": "B2", "dict_examp": "A fallen tree is blocking the road.", "lear_examp": "It took over three hours because there was a car accident and the street was blocked for two hours."}, {"sense": "to be between someone and the thing they are looking at, so that they cannot see", "level": "C1", "dict_examp": "A pillar was blocking my view.", "lear_examp": "You cannot have a panoramic view of the mountains any more because buildings block it and the people in the nearby village think only of profit."}, {"sense": "to stop something from happening or making progress", "level": "C2", "dict_examp": "The city council has blocked plans for a mall.", "lear_examp": ""}]}]}, {"word": "blogger", "poses": [{"pos": "noun", "senses": [{"sense": "someone who writes a blog", "level": "B1", "dict_examp": "Bloggers everywhere are commenting on the issue.", "lear_examp": ""}]}]}, {"word": "blink", "poses": [{"pos": "verb", "senses": [{"sense": "to  open and close both of your eyes quickly", "level": "B2", "dict_examp": "You've got something in your eye - try blinking a few times.", "lear_examp": "Her eyes were blinking as she was looking at the bright sunlight outside the window."}]}, {"pos": "noun", "senses": [{"sense": "extremely quickly", "level": "C2", "dict_examp": "In the blink of an eye, he was gone.", "lear_examp": "I got dressed in the blink of an eye and I got down to the kitchen almost rolling down the stairs."}]}]}, {"word": "blind", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to see", "level": "B1", "dict_examp": "She's been blind since birth.", "lear_examp": "She told him she was blind and she couldn't find her dog."}, {"sense": "to not notice something, or not want to notice something", "level": "C2", "dict_examp": "Drivers who speed are often blind to the risks to other drivers.", "lear_examp": "Not only is she completely oblivious of his inner feelings and thoughts, but she also seems to be blind to what is going on around her."}]}, {"pos": "noun", "senses": [{"sense": "people who are blind", "level": "C1", "dict_examp": "He went to a school for the blind.", "lear_examp": "I write from Helpers, a Uruguayan Enterprise specializing in selling products for both the blind and the mute, and whose offerings your company in Britain is interested in selling."}]}]}, {"word": "blister", "poses": [{"pos": "noun", "senses": [{"sense": "a painful, raised area of skin with liquid inside, that you get if your skin has been rubbed or burned, or a similar area on a painted surface", "level": "C2", "dict_examp": "I've got a blister on my toe.", "lear_examp": "Some people weren't really walking any more. The blisters and aching muscles gave them too much stress."}]}]}, {"word": "blank", "poses": [{"pos": "adjective", "senses": [{"sense": "empty or clear, or containing no information or mark", "level": "B1", "dict_examp": "a blank paper/page/form", "lear_examp": "We must bring a pencil and blank paper."}, {"sense": "If your mind goes blank, you suddenly cannot remember or think of something.", "level": "B2", "dict_examp": "When she asked me his name, I just went blank.", "lear_examp": "My mind went blank, I couldn't utter a word."}, {"sense": "showing no feeling or understanding", "level": "C2", "dict_examp": "a blank expression", "lear_examp": "The old woman froze, her blank gaze staring in Leila's direction."}]}, {"pos": "noun", "senses": [{"sense": "an empty space on a test or form where an answer must be written", "level": "C1", "dict_examp": "fill in the blanks", "lear_examp": "I have always thought that a person which is incredibly good at filling in blanks is not necessarily also an intelligent person."}]}]}, {"word": "bloody", "poses": [{"pos": "adjective", "senses": [{"sense": "covered in blood", "level": "B2", "dict_examp": "a bloody nose", "lear_examp": "The police found a bloody knife under his pillow."}, {"sense": "violent and involving a lot of blood and injuries", "level": "C1", "dict_examp": "a bloody war", "lear_examp": "About 50,000 Romans died during this bloody battle, including the famous Roman Commander Varus."}]}]}, {"word": "blow", "poses": [{"pos": "verb", "senses": [{"sense": "If the wind blows, it moves and makes currents of air.", "level": "B1", "dict_examp": "The wind was blowing harder every minute.", "lear_examp": "Sometimes a cool wind blows, and Bodrum is like heaven with many handsome boys, different kinds of shops, fresh air and clear sea."}, {"sense": "to force air out through your mouth", "level": "B1", "dict_examp": "She blew on her coffee before taking a sip.", "lear_examp": ""}, {"sense": "to clear your nose by forcing air through it into a piece of paper or cloth", "level": "B1", "dict_examp": "He blew his nose loudly.", "lear_examp": ""}, {"sense": "to make a sound by forcing air out of your mouth and through an instrument", "level": "C2", "dict_examp": "Ann blew a few notes on the trumpet.", "lear_examp": "I had never played an instrument before, but when I put the flute to my mouth and blew, it was as though I had played it all my life and that it had always been mine."}, {"sense": "If you blow it or blow your chance, you lose an opportunity to do something by doing or saying the wrong thing.", "level": "C2", "dict_examp": "I guess I blew it when I told my teacher I didn't care what grade she gave me.", "lear_examp": "I'm giving you one last chance. If you blow it, you'll be sent to an Institution which treats people like you."}, {"sense": "If something blows your mind, you are very excited or surprised by it.", "level": "C2", "dict_examp": "There was one scene in the movie that really blew my mind.", "lear_examp": "\"MOMO,\" written by Michael Ende, is a book that blew my mind as a child and as an adult, I have read it many times, but the last time has been a while now."}, {"sense": "If something blows away, or if the wind blows something away, that thing moves because the wind blows it.", "level": "B1", "dict_examp": "The letter blew away and I had to run after it.", "lear_examp": ""}, {"sense": "If something blows down, or if the wind blows something down, that thing falls to the ground because the wind blows it.", "level": "B1", "dict_examp": "Two huge trees had blown down in the storm.", "lear_examp": "To make matters worse, the tree that was standing near the bus stop was suddenly blown down by the wind."}, {"sense": "If a flame blows out, or if you blow it out, it stops burning because you or the wind have blown it.", "level": "B1", "dict_examp": "The candle blew out and we were left in darkness.", "lear_examp": "On my birthday, I open my presents, blow out candles, play games and more."}, {"sense": "to fill something such as a balloon or tire with air", "level": "B1", "dict_examp": "I spent the whole morning blowing up balloons for Joe's party.", "lear_examp": "I quickly helped others to decorate the hall - we blew up as many balloons as we could and sprayed them gold and silver."}, {"sense": "to destroy something or kill someone with a bomb, or to be destroyed or killed by a bomb", "level": "B1", "dict_examp": "They threatened to blow up the plane if their demands were not met.", "lear_examp": "He said that a bomb had blown up in our hotel and that a lot of people were injured."}]}, {"pos": "noun", "senses": [{"sense": "a hard hit with a hand or a weapon", "level": "C2", "dict_examp": "A sharp blow on the chest sent him spinning to the floor.", "lear_examp": "He was really starting to panic when he felt a hard blow to his head."}, {"sense": "an unexpected event that has a damaging effect on someone or something", "level": "C2", "dict_examp": "Losing his job was a severe blow to his confidence.", "lear_examp": "Douglas, due to his callousness or because it had been too great a blow for him, was unable to understand or assimilate the fact, so he just went on, doing his duty to his country and his people as before."}]}]}, {"word": "blood", "poses": [{"pos": "noun", "senses": [{"sense": "the red liquid that flows around your body", "level": "A2", "dict_examp": "a blood test/sample", "lear_examp": "I opened the door and screamed - in front of me was a man standing with hands covered in blood."}, {"sense": "new people in an organization who will provide new ideas and energy", "level": "C1", "dict_examp": "We need some new blood in the organization.", "lear_examp": "Regardless of the age limit many companies encourage employees in high positions to retire after 55 as they want some new blood or probably a new look for the company."}, {"sense": "in a cruel way, without showing any emotion", "level": "C2", "dict_examp": "He shot three policemen in cold blood.", "lear_examp": "Returning to the story, when I arrived, I went directly to Hillton Avenue where I should have met 005, but when I arrived at the meeting point I found him lying on the floor with two shots in his back; he had been murdered in cold blood."}, {"sense": "the family or place that you come from", "level": "C2", "dict_examp": "I've got some Spanish blood in me.", "lear_examp": "I have a background in my blood which, I believe, explains my way of thinking: my mother is Dutch and my father is half from Alsace, half from Hungary."}, {"sense": "If something makes your blood run cold, it frightens you very much.", "level": "C2", "dict_examp": "I heard a tapping on the window which made my blood run cold.", "lear_examp": "This thought scared me and made my blood run cold."}, {"sense": "to make you extremely angry", "level": "C2", "dict_examp": "The way they have treated those people makes my blood boil.", "lear_examp": "Paul said something repulsive, with a cold light in his eyes, and it made her blood boil."}, {"sense": "a member of your family", "level": "C2", "dict_examp": "I can't hate him - he's my own flesh and blood.", "lear_examp": "On the other hand, another problem old people have to face is a feeling of not being useful to society and what proves this is that they are put into old people's homes even by their own flesh and blood."}]}]}, {"word": "bleed", "poses": [{"pos": "verb", "senses": [{"sense": "to lose blood", "level": "B1", "dict_examp": "Your arm is bleeding.", "lear_examp": "When I arrived, he was on the ground bleeding and with his arm broken."}]}]}, {"word": "bland", "poses": [{"pos": "adjective", "senses": [{"sense": "If food is bland, it does not have much taste.", "level": "C2", "dict_examp": "The soup was a bit bland.", "lear_examp": "In the evenings they usually attended boring dinner parties, where bland, soggy food was served, and the other guests were at least 20 years older than her and rather snobbish and stiff."}, {"sense": "not interesting or exciting", "level": "C2", "dict_examp": "bland statements", "lear_examp": "Peeping through the viewer she focused her gaze on the bland face of the man outside."}]}]}, {"word": "bombing", "poses": [{"pos": "noun", "senses": [{"sense": "an attack or several attacks using bombs", "level": "B2", "dict_examp": "The city came under heavy bombing.", "lear_examp": "In fact, despite the number of plane accidents and bombing attempts on airplanes, it is the safest way to travel."}]}]}, {"word": "blunt", "poses": [{"pos": "adjective", "senses": [{"sense": "not sharp", "level": "C2", "dict_examp": "a blunt knife", "lear_examp": "A dead woman lying on the floor, her face covered in blood as if she had been beaten repeatedly with a blunt object."}, {"sense": "saying exactly what you think without caring about people's feelings", "level": "C2", "dict_examp": "blunt questions/criticism", "lear_examp": "She knows what kind of questions the viewers want answered and asks them without being rude or blunt."}]}]}, {"word": "boiled", "poses": [{"pos": "adjective", "senses": [{"sense": "cooked in water that is boiling", "level": "B1", "dict_examp": "boiled potatoes", "lear_examp": "We ordered pork chops, boiled potatoes, greens, and apple pie."}]}]}, {"word": "bonus", "poses": [{"pos": "noun", "senses": [{"sense": "another pleasant  thing in addition to something you were expecting", "level": "B2", "dict_examp": "I love the job, and it's an added bonus that it's so close to home.", "lear_examp": "As a bonus we'll have staff discounts on books and CDs."}, {"sense": "an extra amount of money that you are given, especially because you have worked hard", "level": "B2", "dict_examp": "a Christmas bonus", "lear_examp": "My employer said if I pass my exam, he will give me a bonus of fifty pounds."}]}]}, {"word": "board", "poses": [{"pos": "noun", "senses": [{"sense": "a surface on the wall of a classroom that a teacher writes on", "level": "A1", "dict_examp": "a white board", "lear_examp": ""}, {"sense": "a piece of wood, plastic, etc. on a wall where information can be put", "level": "A2", "dict_examp": "I stuck the notice up on the board.", "lear_examp": "The information is posted on the information board, and the class is every Monday from 5pm to 7pm."}, {"sense": "a flat piece of wood, cardboard, etc. for playing games on", "level": "A2", "dict_examp": "a chess board", "lear_examp": "I got a chess board, Harry Potter and the Order of Phoenix, some photo frames, wall hangings and a lot of other gifts."}, {"sense": "a flat piece of wood, plastic, etc. used for a particular purpose", "level": "B1", "dict_examp": "Cut the vegetables on a chopping board.", "lear_examp": "That was really nice and sometimes really funny, because we had some people trying to surf, but they couldn't stand up on the board for at least five seconds."}, {"sense": "on a boat, train, aircraft, etc.", "level": "B1", "dict_examp": "There were 230 people on board the plane.", "lear_examp": "I caught a taxi and went to airport.  After I checked in, I was on board."}, {"sense": "meals that are provided at a place where you stay", "level": "B2", "dict_examp": "How much do they charge for room and board?", "lear_examp": "Thank you for board and lodging."}, {"sense": "a group of people who officially control a company or organization, or a particular type of business activity", "level": "C1", "dict_examp": "She is on the boards of several large companies.", "lear_examp": "We will try to get a subsidy during the next Board of Directors meeting."}, {"sense": "happening or having an effect on everyone or everything in every area", "level": "C2", "dict_examp": "The improvement has been across the board, with all divisions reporting increased profits.", "lear_examp": "Children in separate schools get on with things regardless of it being work for boys or girls, which can be quite positive especially in today's lifestyles where chores are done across the board."}]}, {"pos": "verb", "senses": [{"sense": "to get onto or allow people to get onto a boat, train or aircraft", "level": "B1", "dict_examp": "She boarded the plane to Australia.", "lear_examp": "We all boarded the train."}]}]}, {"word": "blue", "poses": [{"pos": "adjective", "senses": [{"sense": "being  the same color as the sky when there are no clouds", "level": "A1", "dict_examp": "a dark/light/pale blue jacket", "lear_examp": "I like her long brown hair and blue eyes."}, {"sense": "sad", "level": "C2", "dict_examp": "I was just feeling blue.", "lear_examp": "Do you feel the need to dress, behave, and consume the same products as your friends? Are you the kind of person who goes shopping when you feel blue or a little morose?"}]}, {"pos": "noun", "senses": [{"sense": "a blue color", "level": "A2", "dict_examp": "There's a lot of blue in this room.", "lear_examp": "I want my bedroom to be painted in yellow and blue."}, {"sense": "If something happens out of the blue, it is completely unexpected.", "level": "C1", "dict_examp": "An old fried of mine from college called me out of the blue yesterday.", "lear_examp": "Dear Kim, I was extremely happy when I received your letter out of the blue."}]}]}, {"word": "boldly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is brave or very confident", "level": "B2", "dict_examp": "The President had already boldly declared victory.", "lear_examp": "One boldly ventures where none of their family members have been before in search of a better lifestyle, good weather..."}]}]}, {"word": "boiling", "poses": [{"pos": "adjective", "senses": [{"sense": "very hot", "level": "B2", "dict_examp": "It's boiling in this room!", "lear_examp": "I wouldn't like  a job like that, especially in the summer, when it's boiling hot."}]}]}, {"word": "bomb", "poses": [{"pos": "noun", "senses": [{"sense": "a weapon that explodes and causes damage", "level": "B1", "dict_examp": "The bomb exploded/went off near a busy market.", "lear_examp": "A bomb had exploded and that boy rescued me from the accident."}]}, {"pos": "verb", "senses": [{"sense": "to attack a place using bombs", "level": "B1", "dict_examp": "This building was bombed a few years ago.", "lear_examp": "Houses had been bombed during the war and nothing was reconstructed."}]}]}, {"word": "body", "poses": [{"pos": "noun", "senses": [{"sense": "the whole physical structure that forms a person or animal", "level": "A1", "dict_examp": "A good diet and plenty of exercise will help you to keep your body healthy.", "lear_examp": "I think swimming is good for my body."}, {"sense": "a dead person", "level": "A2", "dict_examp": "A body was washed up on the beach last week.", "lear_examp": "I cried a lot next to his cold body."}, {"sense": "the main part of a person's or animal's body, without the head, arms and legs", "level": "B1", "dict_examp": "The dog had a thin body and short legs.", "lear_examp": "There was a black spider with long legs and a fat round body near my head."}, {"sense": "an official group of people who work together", "level": "C2", "dict_examp": "the sport's regulatory body", "lear_examp": "This progress is also facilitated by companies and organisations that are represented in many countries, institutions that tend to be controlled by centrally defined policies or a single governing body."}]}]}, {"word": "board game", "poses": [{"pos": "noun", "senses": [{"sense": "a game such as chess that is played on a board", "level": "A2", "dict_examp": "It rained all day so we played lots of board games.", "lear_examp": "My parents gave me a camera and others gave me books, clothes and board games."}]}]}, {"word": "boast", "poses": [{"pos": "verb", "senses": [{"sense": "to talk with too much pride about what you have done or what you own", "level": "B2", "dict_examp": "He didn't talk about his exam score because other people might think he was boasting.", "lear_examp": "Later that evening I went home boasting about my success."}, {"sense": "If a place boasts something good, it has it.", "level": "C2", "dict_examp": "New York boasts some of the best museums in the world.", "lear_examp": "The park boasts a picturesque lake with swans and ducks and a walled formal garden."}]}]}, {"word": "boat", "poses": [{"pos": "noun", "senses": [{"sense": "a vehicle for traveling on water", "level": "A1", "dict_examp": "a fishing boat", "lear_examp": "We can go there by boat."}, {"sense": "to do or say something that changes a situation in a way that causes problems", "level": "C2", "dict_examp": "They seemed very happy and I didn't want to rock the boat.", "lear_examp": "But let's not rock the boat. Our preposterous cravings and wishes might become our downfall."}, {"sense": "to be in the same unpleasant situation as other people", "level": "C2", "dict_examp": "She complains that she doesn't have enough money, but we're all in the same boat.", "lear_examp": "Unemployment and its consequences is still a major problem. Now we are in the same boat."}, {"sense": "to be too late to do or get something", "level": "C2", "dict_examp": "I'm afraid you've missed the boat. All the concert tickets have been sold.", "lear_examp": "What if she never had another chance?  What if she missed the boat? Overcome by the anxiety and the lack of sleep, the first thing she did in the morning was to pick up two of her best poems and put them in an envelope."}]}]}, {"word": "bomber", "poses": [{"pos": "noun", "senses": [{"sense": "a person who uses bombs", "level": "B2", "dict_examp": "Rajiv Gandhi is believed to have been killed by a suicide bomber.", "lear_examp": ""}, {"sense": "an aircraft that drops bombs", "level": "C2", "dict_examp": "He flew bombers in the war.", "lear_examp": "During the war... the terror of the German bombers, the sound of destruction all around, bombs exploding, people crying and dying."}]}]}, {"word": "bond", "poses": [{"pos": "noun", "senses": [{"sense": "an interest, experience, or feeling that makes people feel connected", "level": "B2", "dict_examp": "the bond between the mother and baby", "lear_examp": "The strong bond among the family members makes them feel secure and confident."}]}, {"pos": "verb", "senses": [{"sense": "to develop a strong relationship with someone", "level": "C2", "dict_examp": "Physical contact helps a mother bond with her baby.", "lear_examp": "Another aspect is the fact that it is far more easier to just spend money on your children than to actually bond with them."}]}]}, {"word": "bold", "poses": [{"pos": "adjective", "senses": [{"sense": "strong in color or shape and therefore easy to notice", "level": "B2", "dict_examp": "bold colors/letters", "lear_examp": "It had some advertisements and I could read something written in bold words."}, {"sense": "not frightened of taking risks", "level": "B2", "dict_examp": "She was a bold and fearless climber.", "lear_examp": "That was the punishment for being bold!"}]}]}, {"word": "bone", "poses": [{"pos": "noun", "senses": [{"sense": "one of the hard pieces that make the structure inside a human or animal", "level": "B1", "dict_examp": "The X-ray showed a broken bone in his left hand.", "lear_examp": "I saw things like dinosaur bones, mummies, etc."}, {"sense": "something that people argue about", "level": "C2", "dict_examp": "Housework is a major bone of contention in our house.", "lear_examp": "Prices have always been the bone of contention among the managers."}]}]}, {"word": "blush", "poses": [{"pos": "verb", "senses": [{"sense": "to become pink in the face, usually from embarrassment", "level": "B2", "dict_examp": "He blushes every time she speaks to him.", "lear_examp": "But there is one special \"embarrassing moment\" that even today I blush when I think about it."}]}]}, {"word": "blow", "poses": [{"pos": "verb", "senses": [{"sense": "If the wind blows, it moves and makes currents of air.", "level": "B1", "dict_examp": "The wind was blowing harder every minute.", "lear_examp": "Sometimes a cool wind blows, and Bodrum is like heaven with many handsome boys, different kinds of shops, fresh air and clear sea."}, {"sense": "to force air out through your mouth", "level": "B1", "dict_examp": "She blew on her coffee before taking a sip.", "lear_examp": ""}, {"sense": "to clear your nose by forcing air through it into a piece of paper or cloth", "level": "B1", "dict_examp": "He blew his nose loudly.", "lear_examp": ""}, {"sense": "to make a sound by forcing air out of your mouth and through an instrument", "level": "C2", "dict_examp": "Ann blew a few notes on the trumpet.", "lear_examp": "I had never played an instrument before, but when I put the flute to my mouth and blew, it was as though I had played it all my life and that it had always been mine."}, {"sense": "If you blow it or blow your chance, you lose an opportunity to do something by doing or saying the wrong thing.", "level": "C2", "dict_examp": "I guess I blew it when I told my teacher I didn't care what grade she gave me.", "lear_examp": "I'm giving you one last chance. If you blow it, you'll be sent to an Institution which treats people like you."}, {"sense": "If something blows your mind, you are very excited or surprised by it.", "level": "C2", "dict_examp": "There was one scene in the movie that really blew my mind.", "lear_examp": "\"MOMO,\" written by Michael Ende, is a book that blew my mind as a child and as an adult, I have read it many times, but the last time has been a while now."}, {"sense": "If something blows away, or if the wind blows something away, that thing moves because the wind blows it.", "level": "B1", "dict_examp": "The letter blew away and I had to run after it.", "lear_examp": ""}, {"sense": "If something blows down, or if the wind blows something down, that thing falls to the ground because the wind blows it.", "level": "B1", "dict_examp": "Two huge trees had blown down in the storm.", "lear_examp": "To make matters worse, the tree that was standing near the bus stop was suddenly blown down by the wind."}, {"sense": "If a flame blows out, or if you blow it out, it stops burning because you or the wind have blown it.", "level": "B1", "dict_examp": "The candle blew out and we were left in darkness.", "lear_examp": "On my birthday, I open my presents, blow out candles, play games and more."}, {"sense": "to fill something such as a balloon or tire with air", "level": "B1", "dict_examp": "I spent the whole morning blowing up balloons for Joe's party.", "lear_examp": "I quickly helped others to decorate the hall - we blew up as many balloons as we could and sprayed them gold and silver."}, {"sense": "to destroy something or kill someone with a bomb, or to be destroyed or killed by a bomb", "level": "B1", "dict_examp": "They threatened to blow up the plane if their demands were not met.", "lear_examp": "He said that a bomb had blown up in our hotel and that a lot of people were injured."}]}, {"pos": "noun", "senses": [{"sense": "a hard hit with a hand or a weapon", "level": "C2", "dict_examp": "A sharp blow on the chest sent him spinning to the floor.", "lear_examp": "He was really starting to panic when he felt a hard blow to his head."}, {"sense": "an unexpected event that has a damaging effect on someone or something", "level": "C2", "dict_examp": "Losing his job was a severe blow to his confidence.", "lear_examp": "Douglas, due to his callousness or because it had been too great a blow for him, was unable to understand or assimilate the fact, so he just went on, doing his duty to his country and his people as before."}]}]}, {"word": "boil", "poses": [{"pos": "verb", "senses": [{"sense": "If a liquid boils, or if you boil it, it reaches the temperature where bubbles rise up in it and it produces steam.", "level": "B1", "dict_examp": "I had to boil the water before drinking it.", "lear_examp": "First he saw his mother cooking and she was chopping the vegetables with her hands, after that she started to boil the water with her own body heat, just puting her hand next to the cup."}, {"sense": "to cook food in water that is boiling", "level": "B1", "dict_examp": "Boil the potatoes until soft.", "lear_examp": "I teach them how to swim, how to boil rice without electrical equipment and so on."}, {"sense": "If a container of liquid boils, or if you boil it, it reaches the temperature where bubbles rise up in it and it produces steam.", "level": "B1", "dict_examp": "The pot's boiling.", "lear_examp": ""}, {"sense": "to make you extremely angry", "level": "C2", "dict_examp": "The way they have treated those people makes my blood boil.", "lear_examp": "Paul said something repulsive, with a cold light in his eyes, and it made her blood boil."}]}]}, {"word": "bookmark", "poses": [{"pos": "noun", "senses": [{"sense": "a way of marking an  Internet website so that you can find it  easily", "level": "B2", "dict_examp": "Add this website to your bookmarks.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to mark an Internet website on  your computer so that you can find it easily", "level": "B2", "dict_examp": "I've bookmarked the page.", "lear_examp": ""}]}]}, {"word": "boss", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is responsible for employees and tells them what to do", "level": "A2", "dict_examp": "I'll ask my  boss if I can leave work early tomorrow.", "lear_examp": "I asked my boss, but he said I have to work on Wednesday until late afternoon."}]}]}, {"word": "bottle", "poses": [{"pos": "noun", "senses": [{"sense": "a container for liquids, usually made of glass or plastic, with a narrow top", "level": "A2", "dict_examp": "a water bottle", "lear_examp": "You must take a bottle of water because you will be thirsty."}]}]}, {"word": "bored", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling tired and unhappy because something is not interesting or because you have nothing to do", "level": "B1", "dict_examp": "It was a cold, wet day and the children were bored.", "lear_examp": "Ask them nicely and tell them you would get bored without your friends."}]}]}, {"word": "both", "poses": [{"pos": "determiner", "senses": [{"sense": "used to talk about two people or things", "level": "A1", "dict_examp": "Both my parents are teachers.", "lear_examp": "I like both pop and jazz."}, {"sense": "to have the advantages of two different situations", "level": "C1", "dict_examp": "Living in the country and working in the city you have the best of both worlds.", "lear_examp": "Only those that can afford to live in the suburban areas can combine the best of both worlds and they tend to be rather affluent."}]}]}, {"word": "born", "poses": [{"pos": "verb", "senses": [{"sense": "When a person or animal is born, they come out of their mother's body and start to exist.", "level": "A2", "dict_examp": "Ellen  was born in 1984.", "lear_examp": "She was born two months ago."}, {"sense": "If an idea is born, it starts to exist.", "level": "C2", "dict_examp": "The idea for the business was born during a trip to Alaska.", "lear_examp": "They examine the customer needs and-wishes, ask the people on the street, and by inventing new things, all influences come into it and a new lifestyle is born!"}]}]}, {"word": "bookstore", "poses": [{"pos": "noun", "senses": [{"sense": "a store where books are sold", "level": "A1", "dict_examp": "We are going to the bookstore on Nineteenth Street to hear an author speak about his latest book.", "lear_examp": "I'll be free all night, so wecan meet at a bookstore near my house at 7 p.m."}]}]}, {"word": "bossy", "poses": [{"pos": "adjective", "senses": [{"sense": "always telling other people what to do", "level": "B2", "dict_examp": "a bossy older sister", "lear_examp": "Granny is the problem - she's a bit bossy!"}]}]}, {"word": "bound", "poses": [{"pos": "adjective", "senses": [{"sense": "certain to do something, or certain to happen", "level": "B2", "dict_examp": "You're bound to feel nervous before your driving test.", "lear_examp": "I'm bound to feel nervous."}, {"sense": "traveling toward a particular place", "level": "C1", "dict_examp": "He was on a train bound for Berlin.", "lear_examp": "The only risk you run is getting on a bus bound for Boras, so take care you avoid this one."}, {"sense": "closely connected with something", "level": "C2", "dict_examp": "A country's culture is bound up with its language and history.", "lear_examp": "It's just the way of the world, I will have to say, and convince myself that I am not as inextricably bound up with that particular diary."}]}]}, {"word": "book", "poses": [{"pos": "noun", "senses": [{"sense": "a set of attached pages in a cover, with words or pictures that tell a story or provide information", "level": "A1", "dict_examp": "I've read all his books.", "lear_examp": "I like reading books in the library."}, {"sense": "a set of attached pages in a cover, which are blank to write or draw on or have spaces to record information", "level": "B1", "dict_examp": "I need to get a composition/exercise book for writing class.", "lear_examp": "You have to bring with you some pencils for drawing and a drawing book."}, {"sense": "a set of stamps, tickets, etc. that are sold together inside a cover", "level": "C2", "dict_examp": "I'll get  a book of stamps when I go to the post office tomorrow.", "lear_examp": ""}, {"sense": "to not decide what someone or something is like only by looking at them", "level": "C2", "dict_examp": "You know, his desk is a mess but don't judge a book by it's cover, he does careful, detailed work.", "lear_examp": "I'm simply pointing out one should never judge a book by it's cover as things aren't always what they seem."}, {"sense": "to do something exactly according to the rules", "level": "C2", "dict_examp": "The lawyers want to make sure we've done everything strictly by the book.", "lear_examp": "The upper-class people always do things by the book, follow the rules and the conventions and therefore are stand-offish and cold."}]}, {"pos": "verb", "senses": [{"sense": "to arrange to use or do something at a particular time in the future", "level": "B1", "dict_examp": "You need to book your flight before the fares go up.", "lear_examp": "They told me that it's better to book a room in advance."}, {"sense": "to arrange for someone to stay at a hotel", "level": "B1", "dict_examp": "She booked me into a hotel uptown.", "lear_examp": "You all have been booked into the \"Palace Hotel\" which is one of the most comfortable hotels in town."}]}]}, {"word": "bounce", "poses": [{"pos": "verb", "senses": [{"sense": "to move up or away after hitting a surface, or to make something move this way", "level": "B1", "dict_examp": "The basketball bounced off the rim of the basket.", "lear_examp": "As soon as I read the letter I started shouting and bouncing on the sofa."}, {"sense": "to move somewhere in a happy and energetic way", "level": "C1", "dict_examp": "Sarah bounced into the room with a big smile on her face.", "lear_examp": "At \"Elton John\" people were singing ad dancing without to much pushing, while at \"Metallica\" people were screaming and shouting the lyrics out while they stage-dived and were bouncing around."}, {"sense": "If e-mail bounces back, it is returned to you because the address is not correct or there is a computer problem.", "level": "C2", "dict_examp": "I tried to send you an email, but it bounced back.", "lear_examp": ""}, {"sense": "to start to be successful again after a difficult period", "level": "C1", "dict_examp": "Stock prices bounced back after a steep plunge earlier this week.", "lear_examp": "The figures reflecting the number of tonnes carried by the rail network had initially fallen in the nineteen eighties and nineteen nineties by about 40 per cent but then bounced back by the beginning of the new century."}]}]}, {"word": "boot", "poses": [{"pos": "noun", "senses": [{"sense": "a strong shoe that covers your foot and part of your leg", "level": "A1", "dict_examp": "a pair of boots", "lear_examp": "You should wear old clothes and a pair of boots."}]}]}, {"word": "border", "poses": [{"pos": "noun", "senses": [{"sense": "the line that divides one country from another", "level": "B1", "dict_examp": "Were you stopped at the border?", "lear_examp": "We could visit the mountains near the Czech and German border."}]}]}, {"word": "bow", "poses": [{"pos": "noun", "senses": [{"sense": "a knot with two curved parts and two loose ends, that is used to tie shoes or as decoration", "level": "B2", "dict_examp": "The present was wrapped in gold paper and tied with a big red bow.", "lear_examp": "He saw a big black bow on the handle of the door."}, {"sense": "a piece of curved wood with a string attached to both ends, used for shooting arrows", "level": "B2", "dict_examp": "a bow and arrows", "lear_examp": "The bow was very beautiful and there were some letters on it: Artemis. He could not believe it, he had the bow of Artemis."}, {"sense": "a long, thin piece of wood with hairs stretched between the ends, used to play some musical instruments", "level": "C2", "dict_examp": "a violin bow", "lear_examp": "The feeling was, moreover, enhanced by his unique style, as for instance with the guitar solo on \"Dazed and Confused,\" played with a violin bow."}]}]}, {"word": "boundary", "poses": [{"pos": "noun", "senses": [{"sense": "a line that divides two areas or forms an edge around an area", "level": "C1", "dict_examp": "The mountains mark the boundary between the two countries.", "lear_examp": "This gives youngsters the opportunity to exchange opinions with people all over the world, and so the boundaries of the countries or the continents have less meaning."}, {"sense": "a limit", "level": "C1", "dict_examp": "Your work is limited only by the boundaries of your imagination.", "lear_examp": "This is a movie that reminds us that a man's soul cannot be measured with a measuring tape, that passion knows no boundaries, and that love accepts no defeat."}]}]}, {"word": "bottom", "poses": [{"pos": "noun", "senses": [{"sense": "the lowest part of something", "level": "A1", "dict_examp": "He stood at the bottom of the stairs and called up to me.", "lear_examp": "One of the most amazing places we visited was a small lake at the bottom of a huge mountain."}, {"sense": "the flat surface on the lowest side of something", "level": "A2", "dict_examp": "There was a label on the bottom of the box.", "lear_examp": "On the bottom of the box I found a card saying \"MARRY ME..."}, {"sense": "the lowest position in a group, organization, etc.", "level": "B1", "dict_examp": "When Einstein was in school, he was at the bottom of his class.", "lear_examp": ""}, {"sense": "the ground under a river, lake, or sea", "level": "B1", "dict_examp": "The ship had sunk to the bottom of the sea.", "lear_examp": "It gives me great pleasure to go and see all the beautiful kinds of fish in the modern aquarium, which shows you the wonderful world that exists at the bottom of the ocean."}, {"sense": "the most important fact of final result in an activity, discussion, or situation", "level": "C2", "dict_examp": "The bottom line is that they lost the game.", "lear_examp": "The bottom line is that the adults of today have to stop for a second and think about what they are doing."}, {"sense": "completely", "level": "C2", "dict_examp": "I've searched the house from top to bottom and still can't find it.", "lear_examp": "Very often we can see someone in black, from top to bottom, or in white."}]}]}, {"word": "bothered", "poses": [{"pos": "adjective", "senses": [{"sense": "If you are bothered by or about something, it is important to you and you are worried about it.", "level": "B2", "dict_examp": "He doesn't seem bothered by what people think of him.", "lear_examp": "I'm also bothered about what's going on around me."}]}]}, {"word": "booklet", "poses": [{"pos": "noun", "senses": [{"sense": "a small, thin book that contains information", "level": "B2", "dict_examp": "The tourist office has booklets about the area.", "lear_examp": "I would really appreciate it if you could send me a booklet describing all outdoor and indoor activities."}]}]}, {"word": "bookcase", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of furniture with shelves for putting books on", "level": "A1", "dict_examp": "The gardening books are on/in that bookcase on the left.", "lear_examp": "I left my passport at your house in the living-room on the bookcase, and my flight will be tomorrow evening, so I can't get my plane If I don't have it."}]}]}, {"word": "bookshelf", "poses": [{"pos": "noun", "senses": [{"sense": "a shelf that you put books on", "level": "A2", "dict_examp": "There's a bookshelf above our bed.", "lear_examp": "There are many books on my bookshelf."}]}]}, {"word": "borrow", "poses": [{"pos": "verb", "senses": [{"sense": "to get or receive something from someone with the intention of giving it back after a period of time", "level": "A2", "dict_examp": "I've borrowed some CDs  from Mike.", "lear_examp": "I think that I can borrow the stereo player from my brother."}, {"sense": "to get money from a bank or financial organization and pay it back over a period of time", "level": "C1", "dict_examp": "We had to borrow heavily to set up the business.", "lear_examp": "Some even borrow from loan sharks just to satisfy impulse shopping needs, which may eventually lead to building up debts to an individual or his family."}]}]}, {"word": "bother", "poses": [{"pos": "verb", "senses": [{"sense": "to annoy or cause problems for someone", "level": "A2", "dict_examp": "I'm sorry to bother you, but could you direct me to the station?", "lear_examp": "Carol, I'm sorry to bother you but I forgot my note book in your bedroom last night."}, {"sense": "to make someone feel worried or upset", "level": "B2", "dict_examp": "Does it bother you that he's out so much of the time?", "lear_examp": "Then I want to mention that there is one thing that bothers me a lot."}, {"sense": "to make the effort to do something", "level": "B2", "dict_examp": "He hasn't even bothered to write.", "lear_examp": "TV is entertaining, and it's all digested for you: you don't need to bother thinking after a long day's work."}, {"sense": "If you can't be bothered to do something, you are too lazy or tired to do it or think it is not important.", "level": "B2", "dict_examp": "I can't be bothered to iron my clothes.", "lear_examp": "It woke me up but I didn't answer it, I couldn't be bothered."}]}]}, {"word": "boost", "poses": [{"pos": "noun", "senses": [{"sense": "something that makes you feel more confident and happy, or that helps something increase or improve", "level": "B2", "dict_examp": "Passing my driving test was such a boost to my confidence.", "lear_examp": "It really gave us a boost!"}]}, {"pos": "verb", "senses": [{"sense": "to improve or increase something", "level": "B2", "dict_examp": "The theater managed to boost its audiences by cutting ticket prices.", "lear_examp": "It would not only boost my self-confidence but also look very good on my CV."}]}]}, {"word": "boring", "poses": [{"pos": "adjective", "senses": [{"sense": "not interesting or exciting", "level": "A1", "dict_examp": "a  boring job/lecture", "lear_examp": "My party was boring without you."}]}]}, {"word": "brave", "poses": [{"pos": "adjective", "senses": [{"sense": "showing no fear of dangerous or difficult situations", "level": "B1", "dict_examp": "a brave soldier", "lear_examp": "They all laughed at me, but I was brave enough to mount the horse again."}]}]}, {"word": "boy", "poses": [{"pos": "noun", "senses": [{"sense": "a male child or young man", "level": "A1", "dict_examp": "a teenage boy", "lear_examp": "I hope it's a boy."}, {"sense": "a group of male friends", "level": "B2", "dict_examp": "I'm going out with the boys tonight.", "lear_examp": "Then, I went to play football with the boys."}]}]}, {"word": "boxing", "poses": [{"pos": "noun", "senses": [{"sense": "a sport in which two competitors fight by hitting each other with their hands", "level": "B1", "dict_examp": "Many doctors believe that boxing is too dangerous and should be banned.", "lear_examp": "You can do gym,   boxing, squash, and tennis."}]}]}, {"word": "box", "poses": [{"pos": "noun", "senses": [{"sense": "a square or rectangular container", "level": "A1", "dict_examp": "a cardboard box", "lear_examp": "I got clothes and a box of chocolates."}, {"sense": "a small square on a page that gives you information or where you write information", "level": "A2", "dict_examp": "Choose an adjective from the box to complete each sentence.", "lear_examp": ""}]}]}, {"word": "brass", "poses": [{"pos": "noun", "senses": [{"sense": "a shiny yellow metal", "level": "C1", "dict_examp": "a door with a brass handle", "lear_examp": "The dark marble is easy to keep clean and the solid brass handles look luxurious."}, {"sense": "the group of musical instruments made from brass", "level": "C2", "dict_examp": "a brass band", "lear_examp": "I liked it so much that I decided to become a brass band musician myself."}]}]}, {"word": "break", "poses": [{"pos": "verb", "senses": [{"sense": "to separate into two or more pieces or to make something do this", "level": "A2", "dict_examp": "The dish fell to the floor and broke.", "lear_examp": "I  broke a beautiful glass."}, {"sense": "to damage a bone in your arm/leg, etc.", "level": "A2", "dict_examp": "Barbara slipped on the ice and broke her arm.", "lear_examp": "I'm selling my bicycle because I broke my leg."}, {"sense": "If you break a machine, object, etc., or if it breaks, it stops working because it is damaged.", "level": "A2", "dict_examp": "I think I've broken your camera.", "lear_examp": "I'd like a new mobile phone because the other one has broken."}, {"sense": "to stop doing something for a short time", "level": "B1", "dict_examp": "Let's break for lunch.", "lear_examp": "At last I managed to break the routine of the city and play with my brothers and sisters."}, {"sense": "to come to an end or make something come to an end", "level": "B2", "dict_examp": "Eventually someone spoke, breaking  the silence.", "lear_examp": "George was looking outside when something broke the silence."}, {"sense": "to do something better, faster, etc. than anyone else", "level": "B2", "dict_examp": "Usain Bolt broke the world record for the 200 meters.", "lear_examp": "I personally think that nobody will ever break his record of being champion seven times."}, {"sense": "to not do what you should do", "level": "B2", "dict_examp": "She agreed not to tell anyone, but she broke her promise.", "lear_examp": "I am very surprised that such a reputable theater as yours has been able to break all  the promises that appeared in the advertisement."}, {"sense": "to do something illegal", "level": "B2", "dict_examp": "He didn't know he was breaking the law by smoking inside the building.", "lear_examp": "Jem, the youngest brother, is a horse-thief, so he breaks the law as well, but his crime is a minor one."}, {"sense": "to make people feel more relaxed in a social situation", "level": "B2", "dict_examp": "I told everyone a joke, which helped to break the ice.", "lear_examp": "And, of course, don't forget that a warm smile is one of the best ways to break the ice."}, {"sense": "to make someone feel extremely sad", "level": "B2", "dict_examp": "She really broke his heart when she left.", "lear_examp": "I thought that the hamster would live forever but I was wrong and that mistake broke my heart."}, {"sense": "to make as much money as you spent, but no more", "level": "C1", "dict_examp": "The company only managed to break even this year.", "lear_examp": "Company C does not seem to be doing well. In the year 2000, it just seems to be breaking even."}, {"sense": "If news or a story breaks, or if someone breaks it, it becomes known by the public for the first time.", "level": "C2", "dict_examp": "News of the scandal broke just before the election.", "lear_examp": ""}, {"sense": "to tell someone about something new or important", "level": "C2", "dict_examp": "When they broke the news of their engagement, their parents were was delighted.", "lear_examp": "It wasn't hard to understand why she was filled with delight and happiness when her manager broke the news. The company was opening a new branch in Miami and they wanted her to become the director there."}, {"sense": "to escape from someone or something that is controlling you", "level": "C2", "dict_examp": "She tried to break free from the social conditioning of her upbringing.", "lear_examp": "I would like to revisit there one day as it's firmly connected to my adolescence, when I struggled to break free from my peers, and tried to establish my own identity."}, {"sense": "to suddenly escape or become separate from something or someone", "level": "C2", "dict_examp": "The dog broke free and ran into traffic.", "lear_examp": ""}, {"sense": "If a storm breaks, it starts suddenly.", "level": "C2", "dict_examp": "The storm broke just as we reached home.", "lear_examp": "Suddenly the moon disappeared behind the clouds and, in a few moments, a violent storm broke."}, {"sense": "If a machine or vehicle breaks down, it stops working.", "level": "B1", "dict_examp": "Our car broke down and we had to push it off the road.", "lear_examp": "I'm just writing to tell you why I need to borrow your bicycle, because I am going to go to my farm next week and my car has broken down."}, {"sense": "to get into a building or car using force, usually to steal something", "level": "B1", "dict_examp": "The burglars broke in through the kitchen window.", "lear_examp": "I even thought a burglar might have broken into my house and was going to kill me."}, {"sense": "to end (something) suddenly", "level": "B2", "dict_examp": "She broke off in the middle of a sentence.", "lear_examp": "As you remember, my car didn't work as well as it should and I had to break off my trip."}, {"sense": "If something dangerous or unpleasant breaks out, it suddenly starts.", "level": "B2", "dict_examp": "War broke out in 1914.", "lear_examp": "Unfortunately everything was stopped because the Second World War broke out."}, {"sense": "to force your way through something that is holding you back", "level": "B2", "dict_examp": "Protesters broke through the barriers.", "lear_examp": "It broke through the ceiling and when she looked she saw it was a UFO."}, {"sense": "If two people break up, they stop having a  relationship.", "level": "B1", "dict_examp": "Jenny and George have broken up.", "lear_examp": "The problem is that a few months ago, when he had broken up with me, I wanted him to feel jealous, so I started meeting with Fredo, a friend."}]}, {"pos": "noun", "senses": [{"sense": "when you stop an activity for a short time, usually to rest or to eat", "level": "A2", "dict_examp": "a coffee/lunch break", "lear_examp": "You must bring an old shirt, pencils, water and some food for the break."}, {"sense": "a vacation or period of time away from work, school, etc.", "level": "B1", "dict_examp": "Where are you going over spring break?", "lear_examp": "He had a break for the weekend, and he called me: \"I am in London, so, if you want to see me, it's the time!\""}, {"sense": "where something has cracked or separated into pieces", "level": "B1", "dict_examp": "A break in a water pipe caused a flood.", "lear_examp": ""}, {"sense": "a lucky opportunity", "level": "C2", "dict_examp": "His big break came when he was offered a part in a TV series.", "lear_examp": ""}]}]}, {"word": "branch", "poses": [{"pos": "noun", "senses": [{"sense": "one of the many parts of a tree that grows out from its trunk", "level": "B1", "dict_examp": "Birds often make nests in the top branches of the tree.", "lear_examp": "She slowly climbed the tree and sat on one of the biggest branches."}, {"sense": "one of several stores, offices, etc. that are  part of a company or organization", "level": "B1", "dict_examp": "I used to work in the local branch of a large bank.", "lear_examp": "He has come from our branch office in New York, where he worked as an assistant."}, {"sense": "a part of a subject", "level": "B2", "dict_examp": "Immunology is a branch of biological science.", "lear_examp": "As a matter of fact, innovations have taken place quite frequently in every branch of science."}]}]}, {"word": "brain", "poses": [{"pos": "noun", "senses": [{"sense": "the body part inside your  head that controls thought, memory, feelings and activity", "level": "A2", "dict_examp": "He studies the brain and  nervous system.", "lear_examp": "The class starts at 3:00 and ends at 4:00.  You don't need to bring any thing but yourself; your clothes and your brain."}, {"sense": "used to refer to intelligence", "level": "C1", "dict_examp": "She's the brains behind our software development.", "lear_examp": "I would have to do my best to teach my children how to use their brains more instead of using technology system like computer."}]}]}, {"word": "bra", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of women's underwear that supports the breasts", "level": "B2", "dict_examp": "", "lear_examp": "She knew that I had bought my first bra without having asked her for advice."}]}]}, {"word": "bracelet", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of jewelry that you wear around your wrist", "level": "A2", "dict_examp": "a gold/silver/diamond bracelet", "lear_examp": "Actually I was very sad as the bracelet was particularly valuable to me."}]}]}, {"word": "bravely", "poses": [{"pos": "adverb", "senses": [{"sense": "in a brave way", "level": "B1", "dict_examp": "She faced the consequences bravely.", "lear_examp": ""}]}]}, {"word": "brake", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a vehicle that makes it stop or move  more slowly", "level": "B1", "dict_examp": "She had no brakes on her bicycle.", "lear_examp": "It has 24 active gears and multilink kevlor brakes."}]}, {"pos": "verb", "senses": [{"sense": "to make a vehicle stop or move more slowly", "level": "B2", "dict_examp": "I tried to brake but it was too late.", "lear_examp": "The motorcyclist cut in dangerously, so we had to brake."}]}]}, {"word": "brand new", "poses": [{"pos": "adjective", "senses": [{"sense": "completely new", "level": "B1", "dict_examp": "The washing machine is brand new.", "lear_examp": "Well, I've decided to buy a new TV set and a brand new sofa!"}]}]}, {"word": "boyfriend", "poses": [{"pos": "noun", "senses": [{"sense": "a man or boy who someone is having a romantic relationship with", "level": "A2", "dict_examp": "He's not my boyfriend - we're just good friends!", "lear_examp": "Maria and her boyfriend gave me a wonderful mirror."}]}]}, {"word": "bow", "poses": [{"pos": "noun", "senses": [{"sense": "a knot with two curved parts and two loose ends, that is used to tie shoes or as decoration", "level": "B2", "dict_examp": "The present was wrapped in gold paper and tied with a big red bow.", "lear_examp": "He saw a big black bow on the handle of the door."}, {"sense": "a piece of curved wood with a string attached to both ends, used for shooting arrows", "level": "B2", "dict_examp": "a bow and arrows", "lear_examp": "The bow was very beautiful and there were some letters on it: Artemis. He could not believe it, he had the bow of Artemis."}, {"sense": "a long, thin piece of wood with hairs stretched between the ends, used to play some musical instruments", "level": "C2", "dict_examp": "a violin bow", "lear_examp": "The feeling was, moreover, enhanced by his unique style, as for instance with the guitar solo on \"Dazed and Confused,\" played with a violin bow."}]}]}, {"word": "bowl", "poses": [{"pos": "noun", "senses": [{"sense": "a round, deep dish used for holding soup and other food", "level": "A2", "dict_examp": "a bowl of soup", "lear_examp": "We also used to complain about the fact that we had to have a bowl of soup every single day."}]}]}, {"word": "bravery", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is brave", "level": "B2", "dict_examp": "He was awarded a medal for his bravery in battle.", "lear_examp": "Of course my bravery disappeared and I felt my heart beating faster and faster."}]}]}, {"word": "breadth", "poses": [{"pos": "noun", "senses": [{"sense": "the great number of different things that someone has done, knows, is interested in, etc.", "level": "C2", "dict_examp": "Her novels show her huge breadth of knowledge.", "lear_examp": "In my opinion, it is irresponsible to base our knowledge only on our experience and to overlook the example of all those who, with their breadth of learning, made amazing innovations and helped society."}, {"sense": "in every part of a place", "level": "C2", "dict_examp": "They traveled the length and breadth of Scotland together.", "lear_examp": "It is the reason that we can easily see the foreigners wandering the length and breadth of the museum being unaware of the origin of items they look at."}]}]}, {"word": "bread", "poses": [{"pos": "noun", "senses": [{"sense": "a basic food made by mixing flour, water and sometimes  yeast", "level": "A1", "dict_examp": "a piece/slice of bread", "lear_examp": "I like bread,  rice and beans."}]}]}, {"word": "bracket", "poses": [{"pos": "noun", "senses": [{"sense": "either of two symbols like two halves of a square, put around a word, phrase or sentence in a piece of writing to show that what is between them should be considered as separate from the main part", "level": "C1", "dict_examp": "Biographical information is included in brackets.", "lear_examp": "About the free time given to costumers, I would like to add that maybe they don’t know how to spend it, that is why I am suggesting to  offer some proposals, written in brackets on the program sheet."}, {"sense": "a group of people or things within particular lower and higher limits", "level": "C1", "dict_examp": "Most heart attack victims are in the 45 to 65 age bracket.", "lear_examp": "Australians more than 50 years old watch a movie less than the other age brackets."}]}]}, {"word": "brand", "poses": [{"pos": "noun", "senses": [{"sense": "a type of product made by a particular company", "level": "B2", "dict_examp": "a best-selling/well-known brand", "lear_examp": "My computer brand is Acer."}]}]}, {"word": "bridge", "poses": [{"pos": "noun", "senses": [{"sense": "a structure that is built over a river, road, train tracks, etc., to allow people and vehicles to cross from one side to the other", "level": "A2", "dict_examp": "We drove across/over the bridge.", "lear_examp": "We can see Bogaz bridge from the window."}, {"sense": "something that connects two groups, organizations, etc., and improves the relationship between them", "level": "C2", "dict_examp": "They are trying to build bridges with neighboring countries.", "lear_examp": "It is difficult to prevent this but we must do our best to build bridges between countries."}]}]}, {"word": "breast", "poses": [{"pos": "noun", "senses": [{"sense": "either of the two soft, rounded parts of a woman's chest that produce milk after she has a baby", "level": "B1", "dict_examp": "When a woman becomes pregnant her breasts tend to grow larger.", "lear_examp": "This person is so special to me because after I was born I was drinking milk from her breast."}]}]}, {"word": "break", "poses": [{"pos": "verb", "senses": [{"sense": "to separate into two or more pieces or to make something do this", "level": "A2", "dict_examp": "The dish fell to the floor and broke.", "lear_examp": "I  broke a beautiful glass."}, {"sense": "to damage a bone in your arm/leg, etc.", "level": "A2", "dict_examp": "Barbara slipped on the ice and broke her arm.", "lear_examp": "I'm selling my bicycle because I broke my leg."}, {"sense": "If you break a machine, object, etc., or if it breaks, it stops working because it is damaged.", "level": "A2", "dict_examp": "I think I've broken your camera.", "lear_examp": "I'd like a new mobile phone because the other one has broken."}, {"sense": "to stop doing something for a short time", "level": "B1", "dict_examp": "Let's break for lunch.", "lear_examp": "At last I managed to break the routine of the city and play with my brothers and sisters."}, {"sense": "to come to an end or make something come to an end", "level": "B2", "dict_examp": "Eventually someone spoke, breaking  the silence.", "lear_examp": "George was looking outside when something broke the silence."}, {"sense": "to do something better, faster, etc. than anyone else", "level": "B2", "dict_examp": "Usain Bolt broke the world record for the 200 meters.", "lear_examp": "I personally think that nobody will ever break his record of being champion seven times."}, {"sense": "to not do what you should do", "level": "B2", "dict_examp": "She agreed not to tell anyone, but she broke her promise.", "lear_examp": "I am very surprised that such a reputable theater as yours has been able to break all  the promises that appeared in the advertisement."}, {"sense": "to do something illegal", "level": "B2", "dict_examp": "He didn't know he was breaking the law by smoking inside the building.", "lear_examp": "Jem, the youngest brother, is a horse-thief, so he breaks the law as well, but his crime is a minor one."}, {"sense": "to make people feel more relaxed in a social situation", "level": "B2", "dict_examp": "I told everyone a joke, which helped to break the ice.", "lear_examp": "And, of course, don't forget that a warm smile is one of the best ways to break the ice."}, {"sense": "to make someone feel extremely sad", "level": "B2", "dict_examp": "She really broke his heart when she left.", "lear_examp": "I thought that the hamster would live forever but I was wrong and that mistake broke my heart."}, {"sense": "to make as much money as you spent, but no more", "level": "C1", "dict_examp": "The company only managed to break even this year.", "lear_examp": "Company C does not seem to be doing well. In the year 2000, it just seems to be breaking even."}, {"sense": "If news or a story breaks, or if someone breaks it, it becomes known by the public for the first time.", "level": "C2", "dict_examp": "News of the scandal broke just before the election.", "lear_examp": ""}, {"sense": "to tell someone about something new or important", "level": "C2", "dict_examp": "When they broke the news of their engagement, their parents were was delighted.", "lear_examp": "It wasn't hard to understand why she was filled with delight and happiness when her manager broke the news. The company was opening a new branch in Miami and they wanted her to become the director there."}, {"sense": "to escape from someone or something that is controlling you", "level": "C2", "dict_examp": "She tried to break free from the social conditioning of her upbringing.", "lear_examp": "I would like to revisit there one day as it's firmly connected to my adolescence, when I struggled to break free from my peers, and tried to establish my own identity."}, {"sense": "to suddenly escape or become separate from something or someone", "level": "C2", "dict_examp": "The dog broke free and ran into traffic.", "lear_examp": ""}, {"sense": "If a storm breaks, it starts suddenly.", "level": "C2", "dict_examp": "The storm broke just as we reached home.", "lear_examp": "Suddenly the moon disappeared behind the clouds and, in a few moments, a violent storm broke."}, {"sense": "If a machine or vehicle breaks down, it stops working.", "level": "B1", "dict_examp": "Our car broke down and we had to push it off the road.", "lear_examp": "I'm just writing to tell you why I need to borrow your bicycle, because I am going to go to my farm next week and my car has broken down."}, {"sense": "to get into a building or car using force, usually to steal something", "level": "B1", "dict_examp": "The burglars broke in through the kitchen window.", "lear_examp": "I even thought a burglar might have broken into my house and was going to kill me."}, {"sense": "to end (something) suddenly", "level": "B2", "dict_examp": "She broke off in the middle of a sentence.", "lear_examp": "As you remember, my car didn't work as well as it should and I had to break off my trip."}, {"sense": "If something dangerous or unpleasant breaks out, it suddenly starts.", "level": "B2", "dict_examp": "War broke out in 1914.", "lear_examp": "Unfortunately everything was stopped because the Second World War broke out."}, {"sense": "to force your way through something that is holding you back", "level": "B2", "dict_examp": "Protesters broke through the barriers.", "lear_examp": "It broke through the ceiling and when she looked she saw it was a UFO."}, {"sense": "If two people break up, they stop having a  relationship.", "level": "B1", "dict_examp": "Jenny and George have broken up.", "lear_examp": "The problem is that a few months ago, when he had broken up with me, I wanted him to feel jealous, so I started meeting with Fredo, a friend."}]}, {"pos": "noun", "senses": [{"sense": "when you stop an activity for a short time, usually to rest or to eat", "level": "A2", "dict_examp": "a coffee/lunch break", "lear_examp": "You must bring an old shirt, pencils, water and some food for the break."}, {"sense": "a vacation or period of time away from work, school, etc.", "level": "B1", "dict_examp": "Where are you going over spring break?", "lear_examp": "He had a break for the weekend, and he called me: \"I am in London, so, if you want to see me, it's the time!\""}, {"sense": "where something has cracked or separated into pieces", "level": "B1", "dict_examp": "A break in a water pipe caused a flood.", "lear_examp": ""}, {"sense": "a lucky opportunity", "level": "C2", "dict_examp": "His big break came when he was offered a part in a TV series.", "lear_examp": ""}]}]}, {"word": "bring", "poses": [{"pos": "verb", "senses": [{"sense": "to take someone or something with you when you go somewhere", "level": "A2", "dict_examp": "I'm definitely coming to the party - can I bring anything?", "lear_examp": "Please bring old clothes with you."}, {"sense": "to cause happiness/luck/peace, etc.", "level": "B1", "dict_examp": "She's brought us so much happiness over the years.", "lear_examp": "She thought that the painting brought her bad luck but she thought that she was just talking nonsense and that it wouldn't happen again."}, {"sense": "to make something finish", "level": "C1", "dict_examp": "The stories in the newspaper brought her career to a sudden end.", "lear_examp": "At the end of the year 2002 a great construction was brought to an end."}, {"sense": "to cause someone's best qualities to show", "level": "C2", "dict_examp": "This chance to work with young people has really brought out the best in him.", "lear_examp": "TV can be a babysitter, but such a relationship is not going to bring out the best in a child."}, {"sense": "If information is brought to light, it is learned or discovered.", "level": "C2", "dict_examp": "Her research has brought to light new information about Jefferson’s early life.", "lear_examp": "The evening investigation which was carried out by the mysterious Inspector brought all these facts to light."}, {"sense": "to make you feel such strong emotion that you want to cry", "level": "C2", "dict_examp": "It was a very moving speech, and it brought a lump to my throat.", "lear_examp": "This devastating image brought a lump to John's throat."}, {"sense": "to return from somewhere with something", "level": "A2", "dict_examp": "Can you bring me back some milk?", "lear_examp": ""}, {"sense": "to produce something to sell to the public", "level": "B2", "dict_examp": "They've just brought out a new, smaller phone.", "lear_examp": "Everybody knows how difficult it is to direct movies here in Greece because only a few movies are brought out every year."}, {"sense": "to care for a child until it is an adult", "level": "B1", "dict_examp": "She was brought up by her grandmother.", "lear_examp": "I'm a woman in my mid-forties and have brought up three children."}, {"sense": "to start to talk about a particular subject", "level": "B2", "dict_examp": "There are several points I'd like to bring up at tomorrow's meeting.", "lear_examp": "This matter has always brought up some problems."}]}]}, {"word": "breakable", "poses": [{"pos": "adjective", "senses": [{"sense": "easy to break", "level": "B2", "dict_examp": "That vase is breakable so be careful.", "lear_examp": ""}]}]}, {"word": "breathe", "poses": [{"pos": "verb", "senses": [{"sense": "to take air into and out of your lungs", "level": "B1", "dict_examp": "It's so airless in here - I can hardly breathe.", "lear_examp": "The air you will breathe is cleaner than the air in the city."}]}]}, {"word": "breakdown", "poses": [{"pos": "noun", "senses": [{"sense": "a short period of mental illness when people are too ill to continue with their normal lives", "level": "B2", "dict_examp": "Later that year she had a breakdown.", "lear_examp": "Instead of that I almost ended up in hospital suffering a nervous breakdown."}, {"sense": "when a vehicle or machine stops working for a period of time", "level": "B2", "dict_examp": "I had a breakdown in the middle of the road.", "lear_examp": "On Friday we went to Scotland but unfortunately we had a breakdown. By chance a very nice farmer fixed our car and as it was late he suggested we should spend the night on his farm."}, {"sense": "a failure to continue to communicate or to continue or develop a relationship", "level": "C1", "dict_examp": "a breakdown in the peace talks", "lear_examp": "Eventually, society may be affected by the breakdown of these relationships."}, {"sense": "information broken into parts to easily show the details", "level": "C2", "dict_examp": "I need a breakdown of the costs involved.", "lear_examp": "The pie charts showing the breakdown of annual spending of the school take into account money spent on insurance, teachers' salaries, furniture and equipment, resources (such as books), and other workers' salaries."}]}]}, {"word": "bribery", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is offered money or a present so that they will do something, usually something dishonest", "level": "C2", "dict_examp": "bribery and corruption", "lear_examp": "They treat bribery as something natural - as it was in the last political system."}]}]}, {"word": "brick", "poses": [{"pos": "noun", "senses": [{"sense": "a small, hard, rectangular block used for building walls and houses", "level": "B2", "dict_examp": "a brick wall", "lear_examp": "Future homes might not be built out of bricks at all!"}]}]}, {"word": "breeze", "poses": [{"pos": "noun", "senses": [{"sense": "a light and pleasant wind", "level": "B1", "dict_examp": "a cool breeze", "lear_examp": "It was not that hot and we had a cool breeze as we cycled downhill."}]}]}, {"word": "breed", "poses": [{"pos": "verb", "senses": [{"sense": "to keep animals for the purpose of producing young animals", "level": "B2", "dict_examp": "His main income comes from breeding cattle.", "lear_examp": "We can keep animals, breed them, observe, and protect them."}, {"sense": "to cause something to develop, especially something bad", "level": "C2", "dict_examp": "He believes that movies like this breed violence.", "lear_examp": "Although it sounds banal it is hard to deny that modernity breeds misunderstandings; that complexity of our modern life make us susceptible for one of the most dangerous threats to our times: xenophobia."}]}, {"pos": "noun", "senses": [{"sense": "a type of dog, sheep, etc.", "level": "B2", "dict_examp": "This rare breed of sheep is particularly good for wool.", "lear_examp": "After she had seen pictures of the show animals, she decided to buy a small male kitten of the Cornish rex breed."}]}]}, {"word": "bride", "poses": [{"pos": "noun", "senses": [{"sense": "a woman who is getting married", "level": "B1", "dict_examp": "He returned from New York with his lovely new bride.", "lear_examp": "The day of the wedding, I took lots of pictures of the bride and the groom."}]}]}, {"word": "brightly", "poses": [{"pos": "adverb", "senses": [{"sense": "with a lot of strong color or light", "level": "B2", "dict_examp": "brightly colored clothes", "lear_examp": "The sun was shining brightly over the white mountain tops."}]}]}, {"word": "brilliantly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a very skillful way", "level": "B2", "dict_examp": "He seems to do everything brilliantly - piano playing, skiing, sailing.", "lear_examp": "Although they are not very famous like JULIE BLOOM, they sang brilliantly."}]}]}, {"word": "brilliant", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely intelligent or very skillful", "level": "B1", "dict_examp": "a brilliant mathematician", "lear_examp": "He is an engineering student and he is brilliant in his studies."}, {"sense": "full of light or color", "level": "B1", "dict_examp": "The sky was a brilliant blue.", "lear_examp": "It was 11:15 so I thought \"they won't come\" but suddenly a brilliant light bathed me."}]}]}, {"word": "brief", "poses": [{"pos": "adjective", "senses": [{"sense": "lasting only a short time or using only a  few words", "level": "B1", "dict_examp": "His acceptance speech was very brief.", "lear_examp": "Turning to the website, I could not find all the information about the films, just a brief comment about the director, which is not useful for me."}, {"sense": "using only a few words", "level": "B2", "dict_examp": "world news in brief", "lear_examp": "Now I will tell you in brief what exactly happened to me."}]}]}, {"word": "breakthrough", "poses": [{"pos": "noun", "senses": [{"sense": "an important discovery or event that helps to improve a situation or provide an answer to a problem", "level": "B2", "dict_examp": "Scientists are hoping for a breakthrough in the search for a cure for cancer.", "lear_examp": "For me the main technology breakthrough has been in computers."}]}]}, {"word": "bribe", "poses": [{"pos": "noun", "senses": [{"sense": "money or a present given to someone so that they will do something for you, usually something dishonest", "level": "C1", "dict_examp": "The politician was accused of accepting bribes from several companies.", "lear_examp": "It is almost impossible to succeed in this case, without the help of your friends.  Needless to say, bribes are a frequent occurrence."}]}, {"pos": "verb", "senses": [{"sense": "to try to make someone do something for you by giving them money, presents, or something else they want", "level": "C1", "dict_examp": "He was accused of bribing a building inspector.", "lear_examp": "She considers presents to be a means of bribing her in order to love you."}]}]}, {"word": "briefly", "poses": [{"pos": "adverb", "senses": [{"sense": "for a short time", "level": "B1", "dict_examp": "We chatted briefly about the weather.", "lear_examp": "In this essay, I shall briefly look at the advantages and disadvantages of owning a car."}]}]}, {"word": "breathtaking", "poses": [{"pos": "adjective", "senses": [{"sense": "very beautiful or surprising", "level": "B2", "dict_examp": "breathtaking scenery/views", "lear_examp": "For me it is a very beautiful country, with amazing and breathtaking scenery."}]}]}, {"word": "breath", "poses": [{"pos": "noun", "senses": [{"sense": "the air that goes into and out of your lungs", "level": "B1", "dict_examp": "Her breath smelled of garlic.", "lear_examp": "Then I felt someone's breath on my shoulder..."}, {"sense": "to be breathing quickly because you have been running, walking fast, etc.", "level": "B2", "dict_examp": "He burst into the room, red-faced and out of breath.", "lear_examp": "Although I was out of breath I started to run faster and faster."}, {"sense": "to keep air in your lungs and not let it out", "level": "B2", "dict_examp": "How long can you hold your breath under water?", "lear_examp": "My heart was beating fast. I was holding my breath."}, {"sense": "If something takes your breath away, you feel surprise and admiration because it is so beautiful or exciting.", "level": "B2", "dict_examp": "The view from the window took my breath away.", "lear_examp": "The landscape just takes your breath away sometimes."}, {"sense": "to fill your lungs with air", "level": "B2", "dict_examp": "Take a deep breath and relax.", "lear_examp": "But if you took a deep breath after reading the question, don't worry."}, {"sense": "to rest for a short time until you can breathe regularly again", "level": "C1", "dict_examp": "Let's stop here and catch our breath.", "lear_examp": "Unfortunately, the rooms we stayed in were on the 4th floor. The older people couldn't catch their breath when they finally arrived there!"}, {"sense": "If you say something under your breath, you say it very quietly so that other people cannot clearly hear it.", "level": "C2", "dict_examp": "\"It's time to go,\" she muttered under her breath.", "lear_examp": "\"We must have taken a wrong turn somewhere...\" he kept muttering under his breath."}, {"sense": "in an excited or anxious way", "level": "C2", "dict_examp": "I waited with bated breath as the results were read out.", "lear_examp": "Nevertheless, a huge number of scientists carrying out very useful research, and composers, actors, and artists making us watch their creations with bated breath, do not earn as much money as a lot of outstanding sportsmen do."}, {"sense": "someone or something that is new, different, and exciting", "level": "C2", "dict_examp": "Having Eve around has been a breath of fresh air.", "lear_examp": "Should this be everything the Town Council has promised, it will bring a breath of fresh air for our local youth."}, {"sense": "to wait for something to happen, often feeling anxious", "level": "C2", "dict_examp": "While the leaders negotiated, the world held its breath.", "lear_examp": "They, the critics, the fans and friends and his wife, held their breath and crossed their fingers, hoping to once again hear his enchanting voice."}]}]}, {"word": "bright", "poses": [{"pos": "adjective", "senses": [{"sense": "strong in color", "level": "A2", "dict_examp": "Leslie always wears bright colors.", "lear_examp": "I will be using bright orange for my bedroom."}, {"sense": "full of light, shining", "level": "B1", "dict_examp": "bright sunshine", "lear_examp": "It was bright and sunny."}, {"sense": "clever", "level": "B2", "dict_examp": "They were bright children, always asking questions.", "lear_examp": "Rony had the bright idea of calling the firemen."}, {"sense": "happy or full of hope", "level": "B2", "dict_examp": "You're very bright and cheery this morning!", "lear_examp": "I think I'm a very bright kind of person, friendly with lots of energy."}, {"sense": "to find good things in a bad situation", "level": "C1", "dict_examp": "Look on the bright side - no one was badly hurt.", "lear_examp": "I am quite self-confident and I usually look on the bright side, as I am not interested in pessimistic thoughts."}]}]}, {"word": "breakfast", "poses": [{"pos": "noun", "senses": [{"sense": "the food you eat in the morning after you wake up", "level": "A1", "dict_examp": "What do you want for breakfast?", "lear_examp": "You can have breakfast in my house."}]}]}, {"word": "brush", "poses": [{"pos": "noun", "senses": [{"sense": "an object made of short pieces of stiff hair, plastic or wire fixed to a handle, which is used for cleaning, smoothing hair, painting, etc.", "level": "A2", "dict_examp": "combs and brushes", "lear_examp": "We need to bring a size 3 brush, a size 12 brush and a palette."}]}, {"pos": "verb", "senses": [{"sense": "to use a brush to clean or arrange something", "level": "A2", "dict_examp": "Could you brush your hair?", "lear_examp": "I really need it to brush my hair tomorrow for Katie's party."}, {"sense": "to lightly touch someone or something as you move past", "level": "B2", "dict_examp": "Charlotte brushed against him as she left the room.", "lear_examp": "A soft, cool breeze brushed my skin."}, {"sense": "to move something somewhere using a brush or your hand", "level": "C1", "dict_examp": "Jackie brushed the hair out of her eyes.", "lear_examp": "She picked the diary up, brushed off the dust, and immediately started to read it."}, {"sense": "to improve your knowledge of something already learned but partly forgotten", "level": "C1", "dict_examp": "I thought I'd brush up on my French before going to Paris.", "lear_examp": "Do you want to make new friends?  Or perhaps you want to brush up on your English?"}]}]}, {"word": "bronze", "poses": [{"pos": "noun", "senses": [{"sense": "a bronze medal", "level": "C1", "dict_examp": "He won the bronze in the 200m.", "lear_examp": "I have won two bronze medals and one gold for swimming 50m."}, {"sense": "a shiny orange-brown metal", "level": "C2", "dict_examp": "a statue made of bronze", "lear_examp": "The ancient ones are made with precious metals: gold, silver, bronze and even some semi-precious gems."}]}, {"pos": "adjective", "senses": [{"sense": "made of bronze", "level": "C2", "dict_examp": "a bronze statue", "lear_examp": "The water flowed from the mouth of a bronze dolphin to the small pond full of lily-pads and reeds."}, {"sense": "being the color of bronze", "level": "C2", "dict_examp": "bronze skin", "lear_examp": "It looked as if the autumn had taken all the colors of spring and softly blended them in richly intense shades of amber, bronze and purple."}]}]}, {"word": "brown", "poses": [{"pos": "adjective", "senses": [{"sense": "being the color of chocolate or soil", "level": "A1", "dict_examp": "dark/light brown", "lear_examp": "I'm going to wear an old T-shirt and brown trousers."}]}, {"pos": "noun", "senses": [{"sense": "a brown color", "level": "A2", "dict_examp": "I don't wear brown.", "lear_examp": "I'm going to paint my bedroom. I'll use soft brown."}]}]}, {"word": "broadband", "poses": [{"pos": "noun", "senses": [{"sense": "a type of Internet connection that allows large amounts of information to be sent or received very quickly", "level": "B2", "dict_examp": "We've got broadband at home.", "lear_examp": ""}]}]}, {"word": "browser", "poses": [{"pos": "noun", "senses": [{"sense": "a computer program that makes it possible for you to read information on the Internet", "level": "B2", "dict_examp": "a Web browser", "lear_examp": "It is important to install an Internet browser, that could be Internet Explorer, as well as the free Mozilla Firefox."}]}]}, {"word": "brink", "poses": [{"pos": "noun", "senses": [{"sense": "to be in a situation where something bad is going to happen very soon", "level": "C2", "dict_examp": "The two countries are on the brink of war.", "lear_examp": "By the end of the 21st century, Earth was on the brink of destruction. The atmosphere was polluted, the seas were poisoned, the animals were just a distant memory."}]}]}, {"word": "bruise", "poses": [{"pos": "noun", "senses": [{"sense": "a dark area on your skin where you have been hurt", "level": "B2", "dict_examp": "His arms and back were covered in bruises.", "lear_examp": "I entered the room and saw him, covered in bruises, but I couldn't see his face because he was sleeping turned to the other side."}]}]}, {"word": "bug", "poses": [{"pos": "noun", "senses": [{"sense": "a very small insect", "level": "B1", "dict_examp": "He found a bug in his bed.", "lear_examp": "Maybe you're thinking that he's a loving man who talks only about bugs and insects, but it's not true."}, {"sense": "a bacteria or a virus causing an illness that is usually not serious", "level": "B2", "dict_examp": "I had a stomach bug last week.", "lear_examp": ""}, {"sense": "a mistake or problem in a computer program", "level": "B2", "dict_examp": "A bug had caused the company's computer system to crash.", "lear_examp": "For instance, the millennium bug might make all computers confused, and banks will lose money."}]}]}, {"word": "bring", "poses": [{"pos": "verb", "senses": [{"sense": "to take someone or something with you when you go somewhere", "level": "A2", "dict_examp": "I'm definitely coming to the party - can I bring anything?", "lear_examp": "Please bring old clothes with you."}, {"sense": "to cause happiness/luck/peace, etc.", "level": "B1", "dict_examp": "She's brought us so much happiness over the years.", "lear_examp": "She thought that the painting brought her bad luck but she thought that she was just talking nonsense and that it wouldn't happen again."}, {"sense": "to make something finish", "level": "C1", "dict_examp": "The stories in the newspaper brought her career to a sudden end.", "lear_examp": "At the end of the year 2002 a great construction was brought to an end."}, {"sense": "to cause someone's best qualities to show", "level": "C2", "dict_examp": "This chance to work with young people has really brought out the best in him.", "lear_examp": "TV can be a babysitter, but such a relationship is not going to bring out the best in a child."}, {"sense": "If information is brought to light, it is learned or discovered.", "level": "C2", "dict_examp": "Her research has brought to light new information about Jefferson’s early life.", "lear_examp": "The evening investigation which was carried out by the mysterious Inspector brought all these facts to light."}, {"sense": "to make you feel such strong emotion that you want to cry", "level": "C2", "dict_examp": "It was a very moving speech, and it brought a lump to my throat.", "lear_examp": "This devastating image brought a lump to John's throat."}, {"sense": "to return from somewhere with something", "level": "A2", "dict_examp": "Can you bring me back some milk?", "lear_examp": ""}, {"sense": "to produce something to sell to the public", "level": "B2", "dict_examp": "They've just brought out a new, smaller phone.", "lear_examp": "Everybody knows how difficult it is to direct movies here in Greece because only a few movies are brought out every year."}, {"sense": "to care for a child until it is an adult", "level": "B1", "dict_examp": "She was brought up by her grandmother.", "lear_examp": "I'm a woman in my mid-forties and have brought up three children."}, {"sense": "to start to talk about a particular subject", "level": "B2", "dict_examp": "There are several points I'd like to bring up at tomorrow's meeting.", "lear_examp": "This matter has always brought up some problems."}]}]}, {"word": "brother", "poses": [{"pos": "noun", "senses": [{"sense": "a man or boy with the same parents as another person", "level": "A1", "dict_examp": "Do you have any brothers and sisters?", "lear_examp": "I need to buy a book for my younger brother."}]}]}, {"word": "broadcast", "poses": [{"pos": "verb", "senses": [{"sense": "to send out a program on television, radio or the Internet", "level": "B2", "dict_examp": "The game is being broadcast on ESPN.", "lear_examp": "They were going to broadcast the final match of the world league, and Italy was going to play."}]}]}, {"word": "broad", "poses": [{"pos": "adjective", "senses": [{"sense": "wide", "level": "B1", "dict_examp": "We walked down a broad avenue lined with trees.", "lear_examp": "Joss Merlyn was seven feet high, with broad, immense shoulders."}, {"sense": "a group that includes many different things or people", "level": "B1", "dict_examp": "The magazine covers a broad range of subjects, from sewing to psychology.", "lear_examp": "My last employer asked me to work again this summer. However, I would like to have a broad experience in different camps."}]}]}, {"word": "broad-minded", "poses": [{"pos": "adjective", "senses": [{"sense": "willing to accept other people's behavior and beliefs that are different from your own", "level": "C2", "dict_examp": "My eighty-year-old aunt is very broad-minded.", "lear_examp": "It should also be pointed out that Alexander is a broad-minded and sociable person with outstanding organizational skills."}]}]}, {"word": "brochure", "poses": [{"pos": "noun", "senses": [{"sense": "a thin book with pictures and information, usually advertising something", "level": "B1", "dict_examp": "We looked at some tourist brochures last night.", "lear_examp": "I will send you some brochures of Switzerland, so you can choose some destinations."}]}]}, {"word": "broadly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a general way and not including everything or everyone", "level": "C1", "dict_examp": "The plans have been broadly accepted.", "lear_examp": "The car is a marvelous means of transport as far as mobility, freedom, speed and comfort are concerned but it is now broadly acknowledged that it is inappropriate for the short journeys in our big cities."}]}]}, {"word": "build", "poses": [{"pos": "verb", "senses": [{"sense": "to make something by putting materials and parts together", "level": "A2", "dict_examp": "They're building new houses by the river.", "lear_examp": "It was built in 1880."}, {"sense": "to increase or develop, or to make something increase or develop", "level": "C1", "dict_examp": "This will help to build up his confidence.", "lear_examp": "What might take a long time to build up could be ruined in a very short time."}]}]}, {"word": "budget", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of money a person or organization has available to spend", "level": "B2", "dict_examp": "an annual budget of $40 million", "lear_examp": "Finally, as I am a student on a very tight budget I would prefer a cheap B and B or a family rather than a local campsite."}]}]}, {"word": "broken", "poses": [{"pos": "adjective", "senses": [{"sense": "damaged and separated into pieces", "level": "A2", "dict_examp": "He attacked the man with a broken bottle.", "lear_examp": "The first thing we saw was a broken window."}, {"sense": "an arm/leg, etc. with a damaged bone", "level": "A2", "dict_examp": "Her little brother has a broken arm.", "lear_examp": "I stayed there for 2 weeks with a broken leg and sore ribs."}, {"sense": "no longer able to work", "level": "A2", "dict_examp": "My watch is broken.", "lear_examp": "My bicycle is broken."}, {"sense": "when you are very sad because of the end of a relationship", "level": "B2", "dict_examp": "They said she died of a broken heart.", "lear_examp": "He will split up with you and you will get a broken heart!"}, {"sense": "English/Spanish, etc. that is spoken slowly and has a lot of mistakes in it", "level": "C1", "dict_examp": "I managed to make myself understood in broken French.", "lear_examp": "A non-English speaker may be able to talk in broken English to a native English speaker, but has only a vague idea as to what he's uttering."}, {"sense": "a family in which the parents do not now live together", "level": "C2", "dict_examp": "Many of these children come from broken homes.", "lear_examp": "The development of the modern society has brought with it a growing number of broken homes, divorces and economic problems which have directly affected the parent-child relationship."}]}]}, {"word": "broccoli", "poses": [{"pos": "noun", "senses": [{"sense": "a green vegetable with a thick stem", "level": "B1", "dict_examp": "I had pasta with broccoli and tomatoes.", "lear_examp": ""}]}]}, {"word": "browse", "poses": [{"pos": "verb", "senses": [{"sense": "to look through a book or magazine without reading everything, or to walk around a shop looking at several things without intending to buy any of them", "level": "B2", "dict_examp": "I was just browsing through some magazines.", "lear_examp": "I do really enjoy shopping as it's really fun to browse through the clothes and pick your choice."}, {"sense": "to look at information on the Internet", "level": "B2", "dict_examp": "I can use my phone to browse the Web, read e-mail, and  sync with my computer.", "lear_examp": "Furthermore people read when they browse on the internet, whether for entertainment or educational and business affairs."}]}]}, {"word": "broaden", "poses": [{"pos": "verb", "senses": [{"sense": "to increase or make something increase and include more things or people", "level": "C1", "dict_examp": "Going to college will broaden your interests.", "lear_examp": "I mentioned the fact that such a presentation would broaden his mind and help him to strengthen his position in the company."}]}]}, {"word": "bubble", "poses": [{"pos": "noun", "senses": [{"sense": "a ball of air or gas with liquid around it", "level": "C1", "dict_examp": "an air bubble", "lear_examp": "As a consequence the sea became polluted, and its deep blue color turned into a dirty green, covered with bubbles!"}]}, {"pos": "verb", "senses": [{"sense": "to be full of a positive emotion or quality", "level": "C1", "dict_examp": "The children were bubbling over with excitement.", "lear_examp": "I feel as if you were bubbling over with excitement as you never had done before."}, {"sense": "If a liquid bubbles, balls of air or gas rise to its surface.", "level": "C2", "dict_examp": "The soup was bubbling on the stove.", "lear_examp": ""}]}]}, {"word": "bucket", "poses": [{"pos": "noun", "senses": [{"sense": "a container with an open top and a handle, often used for carrying liquids", "level": "B1", "dict_examp": "a bucket of water", "lear_examp": "I screamed and ran out the door, when a bucket of ice cold water fell on my head!"}]}]}, {"word": "brutal", "poses": [{"pos": "adjective", "senses": [{"sense": "very violent or cruel", "level": "C1", "dict_examp": "a brutal murder", "lear_examp": "Can you remember the days when soccer was peaceful, harmless and all about joy? It has nothing to do with contemporary soccer, which is brutal, aggressive, and emotional."}]}]}, {"word": "brother-in-law", "poses": [{"pos": "noun", "senses": [{"sense": "the man married to your sister or the brother of your husband or wife", "level": "B2", "dict_examp": "It's my brother-in-law's birthday today.", "lear_examp": ""}]}]}, {"word": "bullet", "poses": [{"pos": "noun", "senses": [{"sense": "a small, metal object that is shot from a gun", "level": "B2", "dict_examp": "A bullet had lodged in the boy's leg.", "lear_examp": "After this, she was working for the FBI until she received a bullet in the shoulder."}]}]}, {"word": "bumper", "poses": [{"pos": "noun", "senses": [{"sense": "a bar fixed along the front or the back of a vehicle to protect it in an accident", "level": "B2", "dict_examp": "a front/rear bumper", "lear_examp": "The cars were bumper to bumper."}]}]}, {"word": "building", "poses": [{"pos": "noun", "senses": [{"sense": "a structure with walls and a roof such as a house or factory, or the business of making these", "level": "A2", "dict_examp": "old/new/tall buildings", "lear_examp": "I think it's an interesting place because it is the tallest building in Malaysia."}]}]}, {"word": "burglary", "poses": [{"pos": "noun", "senses": [{"sense": "the crime of illegally entering a building and stealing things", "level": "B2", "dict_examp": "He was charged with burglary.", "lear_examp": "It makes the shops more secure against burglary and vandalism."}]}]}, {"word": "bundle", "poses": [{"pos": "noun", "senses": [{"sense": "a number of things that are tied together", "level": "C2", "dict_examp": "a bundle of letters/clothes", "lear_examp": "It was a bundle of papers hanging out of a hole in the ceiling."}, {"sense": "a very energetic/nervous person", "level": "C2", "dict_examp": "I was a bundle of nerves before the speech.", "lear_examp": "When he began to be a bundle of nerves, he understood that he had to ask her for the truth."}]}]}, {"word": "bureaucracy", "poses": [{"pos": "noun", "senses": [{"sense": "complicated rules and processes used by an organization, especially when they do not seem necessary", "level": "C2", "dict_examp": "government bureaucracy", "lear_examp": "It was difficult because the bureaucracy proved to be extremely slow and I was all on my own suddenly."}, {"sense": "a government or organization in which there are a lot of officials in a lot of departments", "level": "C2", "dict_examp": "The country has a powerful bureaucracy.", "lear_examp": "In any case, the Government and bureaucracy must play a leading role in the performance of the economy."}]}]}, {"word": "bulky", "poses": [{"pos": "adjective", "senses": [{"sense": "too big and taking up too much space", "level": "C1", "dict_examp": "bulky equipment", "lear_examp": "The problem is actually that to get access to this kind of program, one needs to buy special equipment, which is still quite expensive and bulky."}]}]}, {"word": "bump", "poses": [{"pos": "verb", "senses": [{"sense": "to hurt part of your body by hitting it against something hard", "level": "B2", "dict_examp": "I bumped my head on the shelf as I stood up.", "lear_examp": ""}, {"sense": "to hit something with force", "level": "B2", "dict_examp": "She bumped into his tray, knocking the food onto his lap.", "lear_examp": "A young man ran after the ball and bumped into her."}, {"sense": "to meet someone you know when you have not expected to meet them", "level": "C1", "dict_examp": "I bumped into Mark when I was out shopping this afternoon.", "lear_examp": "This seemed like a very good decision at the beginning as now you could walk freely and could stand freely in the middle of any street to chat with a friend when you bumped into one."}]}, {"pos": "noun", "senses": [{"sense": "a raised area on your body where it has been hurt by hitting something hard", "level": "C1", "dict_examp": "I got a bump on my head when I hit it getting into the car.", "lear_examp": ""}, {"sense": "a round, raised area on a surface", "level": "C1", "dict_examp": "I fell off my bike when I hit a bump riding down the hill.", "lear_examp": "People don't feel safe on the streets anymore due to the lack of speed limit signs or speed bumps on the roads, or simply traffic lights!"}]}]}, {"word": "bully", "poses": [{"pos": "verb", "senses": [{"sense": "to intentionally frighten someone who is smaller or weaker than you", "level": "C1", "dict_examp": "He was bullied at school by some older boys.", "lear_examp": "Nowadays, due to active bullying prevention by the schools, the children are exposed to the bad effects of bullying and how to stand up if anybody tries to bully them."}]}, {"pos": "noun", "senses": [{"sense": "someone who intentionally frightens a person who is smaller or weaker than them", "level": "C1", "dict_examp": "Teachers usually know who the bullies are in a class.", "lear_examp": "One day you accidentally kill the bully of the village with a sword you found, and you are cast out of the village."}]}]}, {"word": "bulb", "poses": [{"pos": "noun", "senses": [{"sense": "a glass object that produces light from electricity", "level": "B1", "dict_examp": "an energy-saving light bulb", "lear_examp": "We use the bulb everywhere and for almost everything."}]}]}, {"word": "burger", "poses": [{"pos": "noun", "senses": [{"sense": "meat or other food pressed into a round, flat shape and fried", "level": "A2", "dict_examp": "a burger and French fries", "lear_examp": "You can have garlic bread and French fries, burgers and salads and cold drinks."}]}]}, {"word": "burglar", "poses": [{"pos": "noun", "senses": [{"sense": "a person who illegally enters buildings and steals things", "level": "B2", "dict_examp": "I saw someone climbing in through a window and assumed it must be a burglar.", "lear_examp": "Was it possible that a burglar was trying to break into the house?"}]}]}, {"word": "burst", "poses": [{"pos": "verb", "senses": [{"sense": "to break open or apart suddenly, or to make something do this", "level": "B2", "dict_examp": "The  balloon burst and frightened the children.", "lear_examp": "We had a lovely lunch there and ate so much that we nearly burst."}, {"sense": "to be full of an emotion or quality", "level": "C2", "dict_examp": "She was bursting with pride.", "lear_examp": "And after, they feel as fit as a fiddle, bursting with energy to go back to work."}, {"sense": "to suddenly start burning", "level": "C2", "dict_examp": "The car plunged down a hill and burst into flames.", "lear_examp": "When we turned it on, it burst into flames and before we could extinguish it, the fire destroyed my desk."}, {"sense": "to enter a room or building suddenly and without warning", "level": "B2", "dict_examp": "The head of the department suddenly burst into the conference room.", "lear_examp": "One of the bodyguards burst into the building, while Paul made his way out through the roof."}, {"sense": "to suddenly start to make a noise, especially to start crying", "level": "B2", "dict_examp": "She put the phone down and burst into tears.", "lear_examp": "Ginny felt so depressed and disappointed that she burst into tears."}, {"sense": "to suddenly start laughing/crying/shouting, etc.", "level": "B2", "dict_examp": "He took one look at the hat she was wearing and burst out laughing.", "lear_examp": "I burst out crying because my apron had burned completely."}]}]}, {"word": "build", "poses": [{"pos": "verb", "senses": [{"sense": "to make something by putting materials and parts together", "level": "A2", "dict_examp": "They're building new houses by the river.", "lear_examp": "It was built in 1880."}, {"sense": "to increase or develop, or to make something increase or develop", "level": "C1", "dict_examp": "This will help to build up his confidence.", "lear_examp": "What might take a long time to build up could be ruined in a very short time."}]}]}, {"word": "builder", "poses": [{"pos": "noun", "senses": [{"sense": "a person whose job it is to make buildings", "level": "B1", "dict_examp": "", "lear_examp": "Currently he's working in a hotel but in his own country he's a builder."}]}]}, {"word": "burial", "poses": [{"pos": "noun", "senses": [{"sense": "when a dead body is put into the ground", "level": "C2", "dict_examp": "The burial took place on Monday.", "lear_examp": "After his burial, I would receive a book where all kinds of items were made explicit to me."}]}]}, {"word": "burning", "poses": [{"pos": "adjective", "senses": [{"sense": "on fire", "level": "B1", "dict_examp": "A man staggered from the burning car.", "lear_examp": "I saw a burning car."}, {"sense": "a subject or question that must be taken care of or answered quickly", "level": "C1", "dict_examp": "Climate change remains a burning issue.", "lear_examp": "Your staff is very nice but we are sorry to learn that they only speak English.  It's a burning issue for us because we have few European travelers: German, Italian or French."}, {"sense": "a very strong need to do something", "level": "C1", "dict_examp": "I have no burning desire to go diving.", "lear_examp": "My most important quality is my burning desire to make a change."}]}]}, {"word": "bury", "poses": [{"pos": "verb", "senses": [{"sense": "to put a dead body into the ground", "level": "B1", "dict_examp": "His father was buried in the churchyard.", "lear_examp": "Apparently, no human being was walking outside and she could not even hear anything but a distant bell, certainly that of the church where they had buried poor aunt Charlotte."}, {"sense": "to put something into a hole in the ground and cover it", "level": "B2", "dict_examp": "The dog trotted off to bury its bone.", "lear_examp": "I was really frightened, so I decided to bury the money in the back garden."}, {"sense": "to give all your attention to something", "level": "C2", "dict_examp": "He buried himself in his work.", "lear_examp": "Miss Kenton is clearly attracted to the butler but he is equally clearly terrified of intimacy and buries himself in his work."}, {"sense": "to move your face/head somewhere where it is hidden", "level": "C2", "dict_examp": "She buried her face in her hands.", "lear_examp": "A seemingly courageous young man, who had stayed perfectly calm until that moment, dropped to his knees, then buried his face in the scorching sand."}]}]}, {"word": "bulletin board", "poses": [{"pos": "noun", "senses": [{"sense": "a board on the wall where you put advertisements and announcements", "level": "B1", "dict_examp": "The class schedule is up on the bulletin board.", "lear_examp": ""}]}]}, {"word": "burden", "poses": [{"pos": "noun", "senses": [{"sense": "something difficult or unpleasant that you have to deal with or worry about", "level": "C1", "dict_examp": "the burden of responsibility", "lear_examp": "You can imagine the reaction of people: we're exhausted, we cannot stand the burden of new taxes; the government should reduce them, instead of increasing fiscal pressure."}]}]}, {"word": "burn", "poses": [{"pos": "verb", "senses": [{"sense": "to (cause something to) be damaged or destroyed by fire or extreme heat", "level": "B1", "dict_examp": "The factory burned to the ground.", "lear_examp": "I could see how the fire was burning the door and the room became hotter and hotter."}, {"sense": "to be on fire, or to produce flames", "level": "B1", "dict_examp": "The wood was wet and would not burn.", "lear_examp": "After a while I found matches and firewood,  and soon a nice warm fire was burning in the fireplace."}, {"sense": "If you burn something that you are cooking, you cook it too much and if something you are cooking burns, it cooks too much.", "level": "B1", "dict_examp": "Check the pizza - I think it's burning!", "lear_examp": "He burned the chicken, so we had only salad and bread."}, {"sense": "to hurt a part of the body with fire or heat", "level": "B1", "dict_examp": "I burned my hand on the iron.", "lear_examp": "If I go to the beach I like to wear a swimming suit that covers all of my body because I don't want to burn my skin."}, {"sense": "to copy music, information or images onto a CD", "level": "B2", "dict_examp": "He's burned all his favorite music onto a CD.", "lear_examp": "Microsoft Vista is such a complex system that there is no need for the additional programs for viewing web sites, watching movies, listening to music or burning your own CDs or DVDs."}, {"sense": "to use fuel to produce energy", "level": "B2", "dict_examp": "A car this size burns a lot of gas.", "lear_examp": "People should burn calories by cycling or jogging."}, {"sense": "to work late into the night", "level": "C2", "dict_examp": "I had to burn the midnight oil to get the essay finished.", "lear_examp": "My examinations were nearing and I was always burning the midnight oil."}, {"sense": "to destroy something, especially a building, by fire, or to be destroyed by fire", "level": "B2", "dict_examp": "Their house burnt down while they were away on vacation.", "lear_examp": "In about 1850, the king's castle burned down, and then he bought Amalienberg and made it a residence for the royal family."}, {"sense": "to become ill or very tired from working too hard", "level": "B2", "dict_examp": "If he keeps working this hard he'll just burn out.", "lear_examp": "I am sure that you soon will reach a stage where you will be burned out."}]}]}, {"word": "bunch", "poses": [{"pos": "noun", "senses": [{"sense": "a number of things of the same type which are joined or held together", "level": "B1", "dict_examp": "a bunch of flowers/grapes/bananas/keys", "lear_examp": "He gave me a bunch of roses."}, {"sense": "a group of people", "level": "B1", "dict_examp": "His friends are a nice bunch.", "lear_examp": "I met a bunch of guys there, and they were all good to me."}]}]}, {"word": "bulk", "poses": [{"pos": "noun", "senses": [{"sense": "in large amounts", "level": "C1", "dict_examp": "to buy in bulk", "lear_examp": "I suggest that you buy food in bulk so that you not only save money but also save time."}, {"sense": "the largest part or most of something", "level": "C1", "dict_examp": "He spends the bulk of his money on rent.", "lear_examp": "I have noticed that the bulk of the committee are people over forty years old."}]}]}, {"word": "bull", "poses": [{"pos": "noun", "senses": [{"sense": "a male cow, or the male of particular animals such as the elephant or the whale", "level": "B1", "dict_examp": "They did not see the sign by the gate saying \"Beware of the bull.\"", "lear_examp": ""}]}]}, {"word": "bun", "poses": [{"pos": "noun", "senses": [{"sense": "a small, round cake or piece of bread", "level": "B2", "dict_examp": "a hamburger/hot dog bun", "lear_examp": "I was selling sweet buns and coffee in the coffee shop."}]}]}, {"word": "bus stop", "poses": [{"pos": "noun", "senses": [{"sense": "a place where a bus stops to allow passengers to get on and off", "level": "A2", "dict_examp": "Wait for me at the bus stop.", "lear_examp": "The bus stop is in front of my house."}]}]}, {"word": "businessman", "poses": [{"pos": "noun", "senses": [{"sense": "a man who works in business, especially if he has a high position in a company", "level": "A2", "dict_examp": "He was a successful businessman before becoming a writer.", "lear_examp": ""}]}]}, {"word": "business", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of buying and selling goods and services", "level": "A1", "dict_examp": "He's in business with his cousin.", "lear_examp": "This week I have to go to Germany to do some business with one of our customers."}, {"sense": "an organization that sells goods or services", "level": "A2", "dict_examp": "He runs a small IT business.", "lear_examp": "This is a horrible time to start a new job or business."}, {"sense": "the work that you do to earn money", "level": "B1", "dict_examp": "I'm in Baltimore on business.", "lear_examp": "I was there on business."}, {"sense": "If something is none of someone's business, they do not need to know about it, although they want to, because it does not affect them.", "level": "B2", "dict_examp": "I'm certainly not going to tell Lara how much money I've spent - it's none of her business!", "lear_examp": "You might think it's none of my business, but I simply have to say this."}, {"sense": "used to tell someone in that you are annoyed and they should not ask about something  private", "level": "C2", "dict_examp": "I wish you'd just mind your own business.", "lear_examp": "Despite knowing that he was only doing what he thought was best for me, I couldn't stand him, and I often told him to mind his own business."}]}]}, {"word": "butter", "poses": [{"pos": "noun", "senses": [{"sense": "a pale yellow food made from cream that you put on bread or use in cooking", "level": "A1", "dict_examp": "Have some bread and butter.", "lear_examp": "We have fresh farm food like butter, milk, cheese."}]}]}, {"word": "button", "poses": [{"pos": "noun", "senses": [{"sense": "a switch that you press to control a piece of equipment", "level": "B1", "dict_examp": "He inserted the DVD and pressed the \"play\" button.", "lear_examp": "I could have written a letter in a bottle but waiting for the answer would take a decade, now with e-mail it's just a click of a button."}, {"sense": "a small, round object used to fasten something, for example a shirt or coat", "level": "B1", "dict_examp": "I need to sew a new button on my blouse.", "lear_examp": "It was a long dress with some square buttons on the front of it."}]}]}, {"word": "businesswoman", "poses": [{"pos": "noun", "senses": [{"sense": "a woman who works in business, especially if she has a high position in a company", "level": "A2", "dict_examp": "She is a successful businesswoman.", "lear_examp": ""}]}]}, {"word": "buy", "poses": [{"pos": "verb", "senses": [{"sense": "to get something by paying money for it", "level": "A1", "dict_examp": "Eventually she had saved enough money to buy a small car.", "lear_examp": "I bought it five years ago."}]}]}, {"word": "but", "poses": [{"pos": "conjunction", "senses": [{"sense": "used to introduce an added statement, usually something that is different from what you have said before", "level": "A1", "dict_examp": "You can invite Keith to the party, but please don't ask that friend of his.", "lear_examp": "There are eight rooms but the best one is my bedroom, because there are a lot of books."}, {"sense": "used before you say why something will not or did not happen or is not true", "level": "B1", "dict_examp": "I was going to go to his party, but I was ill.", "lear_examp": "I'm really sorry I haven't written for so long, but I was very busy last week."}]}, {"pos": "preposition", "senses": [{"sense": "except", "level": "B1", "dict_examp": "Everyone knows but Andrew.", "lear_examp": "I'm free all days of the week but Monday and Wednesday."}, {"sense": "almost", "level": "C2", "dict_examp": "The movie was all but over by the time we got there.", "lear_examp": "He could all but hear their stomachs rumble."}]}]}, {"word": "butterfly", "poses": [{"pos": "noun", "senses": [{"sense": "an insect with large, patterned wings", "level": "B1", "dict_examp": "A butterfly landed on her sleeve for a moment.", "lear_examp": "There were lots of wild flowers and we saw some beautiful birds and butterflies."}]}]}, {"word": "buzz", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of excitement, energy, or pleasure", "level": "C2", "dict_examp": "He gets a real buzz from going to the gym.", "lear_examp": "The reading groups will then create a real buzz in the community in regard to reading."}, {"sense": "a continuous sound like a bee makes", "level": "C2", "dict_examp": "I could hear the buzz of a fly near my ear.", "lear_examp": "I was working when I started hearing a kind of buzz, that was getting louder and louder."}]}, {"pos": "verb", "senses": [{"sense": "to make a continuous noise like a bee", "level": "C2", "dict_examp": "I can hear something buzzing.", "lear_examp": "They are now sitting quietly at their desks in a classroom where you can hear the flies buzz."}, {"sense": "to be full of activity and excitement", "level": "C2", "dict_examp": "The crowd was buzzing with excitement.", "lear_examp": "Summer was getting into full swing and the city was buzzing with activity."}]}]}, {"word": "butt", "poses": [{"pos": "noun", "senses": [{"sense": "the part of your body that you sit on", "level": "C1", "dict_examp": "The baby is learning to walk and keeps falling on her butt.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to interrupt or join in a conversation or activity when the other people do not want you to", "level": "C2", "dict_examp": "The interviewer kept butting in and wouldn't let me answer the question.", "lear_examp": "\"Was it a big one, Granny?\", the little girl butted in."}]}]}, {"word": "buyer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who buys something expensive such as a house", "level": "B1", "dict_examp": "He's still looking for a buyer for his house.", "lear_examp": "She had already found a buyer for the famous painting."}]}]}, {"word": "bury", "poses": [{"pos": "verb", "senses": [{"sense": "to put a dead body into the ground", "level": "B1", "dict_examp": "His father was buried in the churchyard.", "lear_examp": "Apparently, no human being was walking outside and she could not even hear anything but a distant bell, certainly that of the church where they had buried poor aunt Charlotte."}, {"sense": "to put something into a hole in the ground and cover it", "level": "B2", "dict_examp": "The dog trotted off to bury its bone.", "lear_examp": "I was really frightened, so I decided to bury the money in the back garden."}, {"sense": "to give all your attention to something", "level": "C2", "dict_examp": "He buried himself in his work.", "lear_examp": "Miss Kenton is clearly attracted to the butler but he is equally clearly terrified of intimacy and buries himself in his work."}, {"sense": "to move your face/head somewhere where it is hidden", "level": "C2", "dict_examp": "She buried her face in her hands.", "lear_examp": "A seemingly courageous young man, who had stayed perfectly calm until that moment, dropped to his knees, then buried his face in the scorching sand."}]}]}, {"word": "butcher", "poses": [{"pos": "noun", "senses": [{"sense": "a person who sells meat in a store", "level": "B1", "dict_examp": "", "lear_examp": "He  started to work as a butcher."}]}]}, {"word": "bus", "poses": [{"pos": "noun", "senses": [{"sense": "a large vehicle in which people are driven from one place to another", "level": "A1", "dict_examp": "You should take the bus if you want to see the sights.", "lear_examp": "You can get there by bus."}]}]}, {"word": "bush", "poses": [{"pos": "noun", "senses": [{"sense": "a short, thick plant with a lot of branches", "level": "B2", "dict_examp": "a rose bush", "lear_examp": "There were so many flowers and bushes, and the water of the lake was so  fresh."}, {"sense": "to avoid talking about something difficult or embarrassing", "level": "C1", "dict_examp": "I decided to stop beating around the bush and told him exactly what I thought of him.", "lear_examp": "Well, let's stop beating about the bush and get to the point."}, {"sense": "areas in places like Africa and Australia that are covered with bushes and trees where very few people live", "level": "C2", "dict_examp": "He spent weeks wandering in the bush.", "lear_examp": "For the first three days we were walking through different types of bush that changed like in a kaleidoscope; the swampy, the dry, the barren."}]}]}, {"word": "busy", "poses": [{"pos": "adjective", "senses": [{"sense": "If you are busy, you are working hard, or giving your attention to a particular thing", "level": "A1", "dict_examp": "Mom was busy in the kitchen.", "lear_examp": "I'm sorry I haven't written before, but I've been very busy studying."}, {"sense": "A busy place is full of activity or people.", "level": "A1", "dict_examp": "a busy restaurant", "lear_examp": "Despite the fact that Rome is a busy city, you can find quiet places like Broccian lake and the seaside in Ostia."}, {"sense": "In a busy period, you have a lot of things to do.", "level": "A2", "dict_examp": "I've got a busy week ahead of me.", "lear_examp": "It was a busy day."}]}]}, {"word": "bus station", "poses": [{"pos": "noun", "senses": [{"sense": "the place where a bus starts or ends its journey", "level": "A2", "dict_examp": "The bus station is downtown.", "lear_examp": "I will meet you at the bus station."}]}]}, {"word": "by", "poses": [{"pos": "preposition", "senses": [{"sense": "used to show the person or thing that does something", "level": "A2", "dict_examp": "She  was examined by a doctor.", "lear_examp": "You have to read the \"House of Terror\" by Constanza Vanges, which is about strange things that start happening in a house."}, {"sense": "used to show how something is done", "level": "A2", "dict_examp": "They traveled across Europe by train/car.", "lear_examp": "You can go there by bus."}, {"sense": "not later than; at/on or before", "level": "A2", "dict_examp": "She promised to be back by five o'clock.", "lear_examp": "Please come tomorrow by 3 o'clock in the afternoon to paint my bedroom."}, {"sense": "used when you say something new or on a different subject", "level": "A2", "dict_examp": "I think we've discussed everything we need to - by the way, what time is it?", "lear_examp": "By the way, I want to buy a raincoat for my brother."}, {"sense": "near or next to something or someone", "level": "B1", "dict_examp": "A small child stood by her side.", "lear_examp": "I think the best solution could be to put a desk by the window because I'll have natural light and a double bed next to the door."}, {"sense": "as a result of an accident, mistake, etc.", "level": "B1", "dict_examp": "I went to the wrong room by mistake.", "lear_examp": "I was putting my shopping bags on the table and I pushed it by mistake."}, {"sense": "done or made by a person instead of a machine", "level": "B1", "dict_examp": "This sweater has to be washed by hand.", "lear_examp": ""}, {"sense": "holding a particular part of someone or something", "level": "B2", "dict_examp": "She grabbed me by the arm.", "lear_examp": ""}, {"sense": "by a great amount", "level": "B2", "dict_examp": "They are by far the best students in the class.", "lear_examp": "I have traveled to many countries, but New Zealand is by far the best."}, {"sense": "so that you can remember all of something", "level": "B2", "dict_examp": "We had to learn the whole poem by heart.", "lear_examp": "I know all his songs by heart and I was singing all the time."}, {"sense": "used in particular phrases to mean \"gradually\" or \"in units of\"", "level": "B2", "dict_examp": "Day by day he grew stronger.", "lear_examp": "The weather gets warmer and warmer day by day and no one misses the rain and the severe cold of winter."}, {"sense": "used to show measurements or amounts", "level": "B2", "dict_examp": "The room measures 15 feet by 20 feet.", "lear_examp": "Therefore you will see that this festival attracts people by the truckload."}, {"sense": "as said by a lot of people", "level": "C1", "dict_examp": "The party was, by all accounts, a great success.", "lear_examp": "I have known Michael Van Cleef for over two decades now, and he is, by all accounts, an exemplary worker."}, {"sense": "in general", "level": "C1", "dict_examp": "By and large, people have welcomed the changes.", "lear_examp": "By and large, it is clear that we all enjoy some kind of sport."}, {"sense": "If you have to do something by law, it is illegal not to do it.", "level": "C1", "dict_examp": "They have to provide a contract by law.", "lear_examp": "They consist in preparing e-mails or letters, all formal, giving explanations to clients about their fiscal situation in Brazil, preparing and calculating tax returns, providing to the IRS our clients asset positions, which is required by law and also, having meetings with clients - this is the most important and exciting part of our work."}, {"sense": "not in any way", "level": "C1", "dict_examp": "I'm not an expert by any means.", "lear_examp": "For one thing, the fight against air pollution is by no means an easy mission."}, {"sense": "as a type of something", "level": "C1", "dict_examp": "He sent me some flowers by way of apology.", "lear_examp": "The Academy however provided nothing whatsoever by way of entertainment, though with a group of interesting young people and a little imagination this should not be a problem."}, {"sense": "to do something exactly according to the rules", "level": "C2", "dict_examp": "The lawyers want to make sure we've done everything strictly by the book.", "lear_examp": "The upper-class people always do things by the book, follow the rules and the conventions and therefore are stand-offish and cold."}, {"sense": "something that you say when you are agreeing to let someone do something", "level": "C2", "dict_examp": "I have a copy of the report on my desk. By all means have a look at it.", "lear_examp": "The kitchen utensils stay next to the sink. You can make use of them by all means."}, {"sense": "by one person telling another telling you", "level": "C2", "dict_examp": "Students learned of the center by word of mouth.", "lear_examp": "In the past news traveled mostly by word of mouth and it took days and sometimes weeks before a person would become aware of an occurrence on the other end of the world."}, {"sense": "in a similar way", "level": "C2", "dict_examp": "You have to let people know your plans in good time and, by the same token, they should give you some advance warning.", "lear_examp": "Our college will only benefit from this event as long as it gives a nice and memorable impression. By the same token, we should all be well prepared and visualise beforehand possible manoeuvres that could appear, so that we can control the situation."}, {"sense": "because of something", "level": "C2", "dict_examp": "She succeeded by virtue of hard work.", "lear_examp": "However, you should take into consideration the expenses, which might be exorbitant by virtue of the fact that you intend to create places with a beautiful ambience and a wide range of comforts offered that will facilitate residents' lives."}]}]}, {"word": "by", "poses": [{"pos": "preposition", "senses": [{"sense": "used to show the person or thing that does something", "level": "A2", "dict_examp": "She  was examined by a doctor.", "lear_examp": "You have to read the \"House of Terror\" by Constanza Vanges, which is about strange things that start happening in a house."}, {"sense": "used to show how something is done", "level": "A2", "dict_examp": "They traveled across Europe by train/car.", "lear_examp": "You can go there by bus."}, {"sense": "not later than; at/on or before", "level": "A2", "dict_examp": "She promised to be back by five o'clock.", "lear_examp": "Please come tomorrow by 3 o'clock in the afternoon to paint my bedroom."}, {"sense": "used when you say something new or on a different subject", "level": "A2", "dict_examp": "I think we've discussed everything we need to - by the way, what time is it?", "lear_examp": "By the way, I want to buy a raincoat for my brother."}, {"sense": "near or next to something or someone", "level": "B1", "dict_examp": "A small child stood by her side.", "lear_examp": "I think the best solution could be to put a desk by the window because I'll have natural light and a double bed next to the door."}, {"sense": "as a result of an accident, mistake, etc.", "level": "B1", "dict_examp": "I went to the wrong room by mistake.", "lear_examp": "I was putting my shopping bags on the table and I pushed it by mistake."}, {"sense": "done or made by a person instead of a machine", "level": "B1", "dict_examp": "This sweater has to be washed by hand.", "lear_examp": ""}, {"sense": "holding a particular part of someone or something", "level": "B2", "dict_examp": "She grabbed me by the arm.", "lear_examp": ""}, {"sense": "by a great amount", "level": "B2", "dict_examp": "They are by far the best students in the class.", "lear_examp": "I have traveled to many countries, but New Zealand is by far the best."}, {"sense": "so that you can remember all of something", "level": "B2", "dict_examp": "We had to learn the whole poem by heart.", "lear_examp": "I know all his songs by heart and I was singing all the time."}, {"sense": "used in particular phrases to mean \"gradually\" or \"in units of\"", "level": "B2", "dict_examp": "Day by day he grew stronger.", "lear_examp": "The weather gets warmer and warmer day by day and no one misses the rain and the severe cold of winter."}, {"sense": "used to show measurements or amounts", "level": "B2", "dict_examp": "The room measures 15 feet by 20 feet.", "lear_examp": "Therefore you will see that this festival attracts people by the truckload."}, {"sense": "as said by a lot of people", "level": "C1", "dict_examp": "The party was, by all accounts, a great success.", "lear_examp": "I have known Michael Van Cleef for over two decades now, and he is, by all accounts, an exemplary worker."}, {"sense": "in general", "level": "C1", "dict_examp": "By and large, people have welcomed the changes.", "lear_examp": "By and large, it is clear that we all enjoy some kind of sport."}, {"sense": "If you have to do something by law, it is illegal not to do it.", "level": "C1", "dict_examp": "They have to provide a contract by law.", "lear_examp": "They consist in preparing e-mails or letters, all formal, giving explanations to clients about their fiscal situation in Brazil, preparing and calculating tax returns, providing to the IRS our clients asset positions, which is required by law and also, having meetings with clients - this is the most important and exciting part of our work."}, {"sense": "not in any way", "level": "C1", "dict_examp": "I'm not an expert by any means.", "lear_examp": "For one thing, the fight against air pollution is by no means an easy mission."}, {"sense": "as a type of something", "level": "C1", "dict_examp": "He sent me some flowers by way of apology.", "lear_examp": "The Academy however provided nothing whatsoever by way of entertainment, though with a group of interesting young people and a little imagination this should not be a problem."}, {"sense": "to do something exactly according to the rules", "level": "C2", "dict_examp": "The lawyers want to make sure we've done everything strictly by the book.", "lear_examp": "The upper-class people always do things by the book, follow the rules and the conventions and therefore are stand-offish and cold."}, {"sense": "something that you say when you are agreeing to let someone do something", "level": "C2", "dict_examp": "I have a copy of the report on my desk. By all means have a look at it.", "lear_examp": "The kitchen utensils stay next to the sink. You can make use of them by all means."}, {"sense": "by one person telling another telling you", "level": "C2", "dict_examp": "Students learned of the center by word of mouth.", "lear_examp": "In the past news traveled mostly by word of mouth and it took days and sometimes weeks before a person would become aware of an occurrence on the other end of the world."}, {"sense": "in a similar way", "level": "C2", "dict_examp": "You have to let people know your plans in good time and, by the same token, they should give you some advance warning.", "lear_examp": "Our college will only benefit from this event as long as it gives a nice and memorable impression. By the same token, we should all be well prepared and visualise beforehand possible manoeuvres that could appear, so that we can control the situation."}, {"sense": "because of something", "level": "C2", "dict_examp": "She succeeded by virtue of hard work.", "lear_examp": "However, you should take into consideration the expenses, which might be exorbitant by virtue of the fact that you intend to create places with a beautiful ambience and a wide range of comforts offered that will facilitate residents' lives."}]}]}, {"word": "bye", "poses": [{"pos": "exclamation", "senses": [{"sense": "goodbye", "level": "A1", "dict_examp": "Bye! We'll see you soon.", "lear_examp": "Bye, see you soon."}]}]}]