[{"word": "dairy", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to milk or products made using milk", "level": "B2", "dict_examp": "dairy products", "lear_examp": "Meat, poultry, vegetables and dairy products are excellent for your health."}]}]}, {"word": "dad", "poses": [{"pos": "noun", "senses": [{"sense": "a father", "level": "A1", "dict_examp": "It was nice to see your mom and dad at the school concert last night.", "lear_examp": "My dad gave me a computer."}]}]}, {"word": "dash", "poses": [{"pos": "verb", "senses": [{"sense": "to go somewhere quickly", "level": "B2", "dict_examp": "I've been dashing around all day.", "lear_examp": "I dashed out, almost forgetting the gift I had bought for my friend."}]}, {"pos": "noun", "senses": [{"sense": "when you run somewhere very quickly", "level": "B2", "dict_examp": "We made a dash for the bus.", "lear_examp": "I made a dash to catch the plane."}, {"sense": "a mark (-) that can be used to separate parts of a sentence", "level": "B2", "dict_examp": "", "lear_examp": ""}, {"sense": "a small amount of something, often food", "level": "C2", "dict_examp": "Serve the tomatoes with a dash of salt and some olive oil.", "lear_examp": "The beginners should add a dash of syrup to the beer and taste the difference."}]}]}, {"word": "damn", "poses": [{"pos": "exclamation", "senses": [{"sense": "used to express anger or disappointment", "level": "B1", "dict_examp": "Damn! I forgot the tickets.", "lear_examp": "It was just a joke, damn it."}]}]}, {"word": "damaged", "poses": [{"pos": "adjective", "senses": [{"sense": "harmed or spoiled", "level": "B1", "dict_examp": "They're selling off damaged goods at reduced prices.", "lear_examp": "Unfortunately, my father died from a fractured skull and a damaged brain."}]}]}, {"word": "darling", "poses": [{"pos": "noun", "senses": [{"sense": "used when you speak to someone you love or like", "level": "B2", "dict_examp": "Would you like a drink, darling?", "lear_examp": "Don't worry, darling."}]}]}, {"word": "dance", "poses": [{"pos": "verb", "senses": [{"sense": "to move your feet and body to the rhythm of music", "level": "A1", "dict_examp": "We danced all night.", "lear_examp": "She likes to go out with her friends and her boyfriend, play computer games, dance, etc."}]}, {"pos": "noun", "senses": [{"sense": "when you move your feet and body to music", "level": "A1", "dict_examp": "OK - one more dance before we go home.", "lear_examp": "I did a dance and it was very beautiful."}, {"sense": "a social occasion at which people dance", "level": "A2", "dict_examp": "Our band will play at the school dance.", "lear_examp": "Yesterday I bought two t-shirts and a skirt for a dance at school."}, {"sense": "the activity or skill of dancing", "level": "A2", "dict_examp": "a dance class", "lear_examp": "There was a dance floor there and the D.J. was very nice."}, {"sense": "a particular series of movements which you perform to music or the type of music which is connected with it", "level": "B1", "dict_examp": "The band played a slow dance.", "lear_examp": "There will be music and traditional dances from the countries involved in the meeting."}]}]}, {"word": "daily", "poses": [{"pos": "adjective", "senses": [{"sense": "happening or done every day or once a day", "level": "A2", "dict_examp": "Exercise has become part of my daily routine.", "lear_examp": "It's very easy to reach because some bus companies provide a daily bus service."}, {"sense": "the usual things that happen to you every day", "level": "B1", "dict_examp": "I try to keep exercise a  part of my daily life.", "lear_examp": "Mr. Bean often does funny things in his daily life."}]}, {"pos": "adverb", "senses": [{"sense": "every day or once a day", "level": "A2", "dict_examp": "Take the medication twice daily.", "lear_examp": "It's open daily."}]}]}, {"word": "database", "poses": [{"pos": "noun", "senses": [{"sense": "a large amount of information stored in a computer system in such a way that it can be easily looked at or changed", "level": "B2", "dict_examp": "We're linked to the online database at our head office.", "lear_examp": "So,  we decided to access our school database and change our test results."}]}]}, {"word": "dangerously", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is dangerous", "level": "B1", "dict_examp": "She drives dangerously.", "lear_examp": "A driver could lose his or her life by driving dangerously."}]}]}, {"word": "damage", "poses": [{"pos": "noun", "senses": [{"sense": "harm or injury", "level": "B1", "dict_examp": "Strong winds had caused serious damage to the roof.", "lear_examp": "I read in the paper last week that overworking may cause serious damage to your health."}]}, {"pos": "verb", "senses": [{"sense": "to harm, break or spoil something", "level": "B1", "dict_examp": "Many buildings were badly damaged during the war.", "lear_examp": "They may be using chemicals that could damage the ozone layer."}]}]}, {"word": "dancer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who dances either as a job or for pleasure", "level": "A2", "dict_examp": "He's a dancer in the Royal Ballet.", "lear_examp": "He is a very good dancer, too."}]}]}, {"word": "danger", "poses": [{"pos": "noun", "senses": [{"sense": "the possibility that  someone or something will be harmed or killed, or that something bad will happen", "level": "A2", "dict_examp": "Danger! Keep out!", "lear_examp": "I thought Steven was in danger - somebody wanted to kill him or something like that."}, {"sense": "something or someone that may harm you", "level": "B1", "dict_examp": "Icy roads are a danger to drivers.", "lear_examp": "In fact cars may be a danger to human life in many ways."}]}]}, {"word": "dare", "poses": [{"pos": "verb", "senses": [{"sense": "to be brave enough to do something", "level": "B2", "dict_examp": "I wouldn't dare talk to my mother the way Ben talks to his.", "lear_examp": "Carla didn't dare to look at the door. She just sat there and waited for things to happen."}, {"sense": "to try to make someone do something dangerous", "level": "C1", "dict_examp": "She dared her friend to climb onto the roof.", "lear_examp": "The idea was to hang like that for a while, then push strongly and start sliding on the rope until you got to the other end.  My friends dared me to try it."}, {"sense": "used to express anger about something someone has done", "level": "C1", "dict_examp": "How dare you talk to me like that!", "lear_examp": "How dare you call that high standards?!"}, {"sense": "used to tell someone strongly not to do something", "level": "C2", "dict_examp": "Don't you dare hit your sister!", "lear_examp": "He had been standing on the exact spot when his friends had made him promise: \"Don't you dare forget me, I want letters from you promptly, understand!\""}]}]}, {"word": "damp", "poses": [{"pos": "adjective", "senses": [{"sense": "slightly wet, especially in a way that is not pleasant or comfortable", "level": "B2", "dict_examp": "The grass is still damp.", "lear_examp": "I have recently noticed that they are stored in dark, damp rooms because the library has no money to restore these places."}]}]}, {"word": "data", "poses": [{"pos": "noun", "senses": [{"sense": "information or facts about something (in scientific English, this can be followed by a plural verb, where the singular form is \"datum\")", "level": "B2", "dict_examp": "The data was collected by various researchers.", "lear_examp": "I collected lots of data on different air, noise, water, sea and land pollution."}, {"sense": "information in the form of text, numbers or symbols that can be used by or stored in a computer", "level": "B2", "dict_examp": "Now the data is being transferred from magnetic tape to hard disk.", "lear_examp": "Save your data on the hard disk bit by bit - do not wait until the whole article is ready."}]}]}, {"word": "darkness", "poses": [{"pos": "noun", "senses": [{"sense": "when there is little or no light", "level": "B2", "dict_examp": "There was a power failure and the house was in darkness.", "lear_examp": "Too frightened to start crying, I just stood up and stared into the darkness."}]}]}, {"word": "dark", "poses": [{"pos": "adjective", "senses": [{"sense": "nearer to black than white in color", "level": "A1", "dict_examp": "dark blue/green", "lear_examp": "I like wearing dark color clothes, I always liked them."}, {"sense": "with little or no light", "level": "A2", "dict_examp": "It was too dark to see properly.", "lear_examp": "It was a very dark night."}, {"sense": "frightening or unpleasant", "level": "C1", "dict_examp": "a dark period in human history", "lear_examp": "They cannot cope with such matters as finances and studies, so they have to turn to the dark side of society."}]}, {"pos": "noun", "senses": [{"sense": "when there is no light somewhere", "level": "B1", "dict_examp": "Cats can see in the dark.", "lear_examp": "As I was walking alone in the dark, I got really scared."}, {"sense": "before/after the sun has gone down", "level": "B1", "dict_examp": "It isn't safe to leave the house after dark.", "lear_examp": "Yesterday, soon after dark, I was in the kitchen and I was making my dinner."}, {"sense": "not knowing about something because other people are not telling you", "level": "C2", "dict_examp": "They kept us in the dark about their plans.", "lear_examp": "Peter had always kept her in the dark about the reason for their fight."}]}]}, {"word": "date", "poses": [{"pos": "noun", "senses": [{"sense": "a particular day of a month or year", "level": "A1", "dict_examp": "What's the date?/What's today's date?", "lear_examp": "Let me know the date of your visit."}, {"sense": "a plan for something to happen at a particular time", "level": "B1", "dict_examp": "Let's make a date to have lunch.", "lear_examp": "We made a date for our next meeting in the \"Mamboo.\""}, {"sense": "a social meeting when two people go somewhere together, such as to a restaurant or to see a film", "level": "B1", "dict_examp": "He's asked her out on a date.", "lear_examp": "I'm going on a date with Priseila and my bicycle is broken."}, {"sense": "old and no longer useful, correct or fashionable", "level": "B1", "dict_examp": "These unemployment figures are out of date.", "lear_examp": "The library has got very poor staff and most of it is out of date."}, {"sense": "modern, recent or containing the latest information", "level": "B1", "dict_examp": "Great care is taken to keep our database up to date.", "lear_examp": "Furthermore, the website is not always up to date."}, {"sense": "up to the present time", "level": "B2", "dict_examp": "This is her best work to date.", "lear_examp": "I enclose a copy of my curriculum vitae, which will give you further details about my career to date."}, {"sense": "a sticky brown fruit with a long seed inside", "level": "C1", "dict_examp": "I bought a box of dates.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to write or print the day's date on something", "level": "B1", "dict_examp": "Thank you for your letter dated August 30th.", "lear_examp": "Dear Mrs Harris, Thank you very much for your letter dated June 7."}, {"sense": "to regularly spend time with someone you have a romantic relationship with", "level": "B1", "dict_examp": "We've been dating for six months.", "lear_examp": "They were dating for a while and last month, Jim gave Maria a ring!"}, {"sense": "to have existed a particular length of time or since a particular time", "level": "B2", "dict_examp": "This house dates back to 1650.", "lear_examp": "Near the end of the route there's a castle that dates back to the Middle Ages, which would be really nice to visit."}, {"sense": "to have existed since a particular time", "level": "B2", "dict_examp": "The castle dates from the 11th century.", "lear_examp": "The Olympic Museum dates from the 19th century and is the biggest in Europe."}]}]}, {"word": "dancing", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of moving your feet and your body to the rhythm of music", "level": "A1", "dict_examp": "Do you want to go dancing tonight?", "lear_examp": "He likes football, dancing, and snowboarding."}]}]}, {"word": "dangerous", "poses": [{"pos": "adjective", "senses": [{"sense": "Someone or something that is dangerous could harm you.", "level": "A2", "dict_examp": "dangerous chemicals", "lear_examp": "I can do anything you want but nothing dangerous!"}]}]}, {"word": "day care", "poses": [{"pos": "noun", "senses": [{"sense": "care provided during the day for young children or for older people who cannot look after themselves", "level": "C1", "dict_examp": "The twins are in day care three afternoons a week.", "lear_examp": "It is not very easy for a working mother to find day care to look after her children while she is working."}]}]}, {"word": "daughter-in-law", "poses": [{"pos": "noun", "senses": [{"sense": "your son's wife", "level": "B2", "dict_examp": "I get on well with my daughter-in-law.", "lear_examp": "And do you know what, we met  your daughter-in-law."}]}]}, {"word": "dazzling", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good and exciting", "level": "C2", "dict_examp": "a dazzling display/performance", "lear_examp": "The lights, the people, the atmosphere all created a dazzling spectacle where everyone was having fun and singing together, even if they didn't really know the words."}, {"sense": "A dazzling light is so bright that you cannot see for a short time after looking at it.", "level": "C2", "dict_examp": "a dazzling white light", "lear_examp": "Blinded by the dazzling lights of the interior of Luton Airport, I tried very hard not to panic."}]}]}, {"word": "dated", "poses": [{"pos": "adjective", "senses": [{"sense": "from a time in the past, or old-fashioned", "level": "C2", "dict_examp": "This is dated information about the program - a lot has changed.", "lear_examp": "The books are so old and dated that it is no longer possible to use them in the classroom."}]}]}, {"word": "deal", "poses": [{"pos": "noun", "senses": [{"sense": "an agreement or an arrangement, especially in business", "level": "B2", "dict_examp": "a business deal", "lear_examp": "\"I want to make a deal with you,\" he went on."}, {"sense": "a lot", "level": "B2", "dict_examp": "She used to talk a great deal about her childhood in Indiana.", "lear_examp": "There will be lots of events which you could see and take a great deal of pictures of."}, {"sense": "an agreement, arrangement, or situation that benefits you", "level": "C1", "dict_examp": "I think we got a really good deal on our new car.", "lear_examp": "The possibility of getting the needed staff from our own departments is absolutely a good deal for the company."}]}, {"pos": "verb", "senses": [{"sense": "to take action in order to achieve something or in order to solve a problem", "level": "B1", "dict_examp": "How do you intend to deal with this problem?", "lear_examp": "Sorry about such a late reply, but I've had some problems to deal with."}, {"sense": "to talk to someone or meet someone, especially as part of your job", "level": "B2", "dict_examp": "She's used to dealing with difficult customers.", "lear_examp": "In my previous job,  I used to deal with many, many people."}]}]}, {"word": "daughter", "poses": [{"pos": "noun", "senses": [{"sense": "your female child", "level": "A1", "dict_examp": "Liz and Phil have a daughter and three sons.", "lear_examp": "Her daughter is 13 years old."}]}]}, {"word": "day", "poses": [{"pos": "noun", "senses": [{"sense": "a period of 24 hours", "level": "A1", "dict_examp": "January has 31 days.", "lear_examp": "It will take ten days."}, {"sense": "the period during the day when there is light from the sun", "level": "A2", "dict_examp": "a bright, sunny day", "lear_examp": "It is better to spend your day exploring the museums and ancient buildings in the city."}, {"sense": "the time that you usually spend at work or at school", "level": "A2", "dict_examp": "a normal working day", "lear_examp": "Tuesday is my free day."}, {"sense": "used to talk about the present time", "level": "A2", "dict_examp": "Vegetarianism is very popular these days.", "lear_examp": "How are you these days?"}, {"sense": "used to talk about something that happened in the past", "level": "A2", "dict_examp": "One day, I came home to find my windows smashed.", "lear_examp": "One day, I was reading an interesting book when someone called me."}, {"sense": "a few days ago", "level": "B1", "dict_examp": "Didn't I see you in the post office the other day?", "lear_examp": "For example, the other day I stayed in my house all day watching television in bed."}, {"sense": "at sometime in the future", "level": "B1", "dict_examp": "One of these days I'll tell her what really happened.", "lear_examp": "I hope one day you will come with me."}, {"sense": "for a long time", "level": "B1", "dict_examp": "They haven't been seen for days.", "lear_examp": "I had to wait for days while the car was being repaired."}, {"sense": "used to talk about a period in the past", "level": "B2", "dict_examp": "In those days, boys used to wear short trousers.", "lear_examp": "In those days, life was much harder than now."}, {"sense": "used to talk about a particular period of time when something happened or existed", "level": "C1", "dict_examp": "in my younger days", "lear_examp": "Before the days of television, we had the radio."}, {"sense": "a period in the past", "level": "C1", "dict_examp": "This place isn't as good as it was in the old days!", "lear_examp": "In the old days, a scholar could spend years of his life in search of specific information, which now can be easily and inexpensively found at the click of a button!"}, {"sense": "to stop doing something, especially working", "level": "C2", "dict_examp": "It's almost midnight - let's call it a day.", "lear_examp": "She decided to call it a day, so Meredith mustered all her courage and wrote a letter to him: \"You are not good enough for me,\" she told him."}, {"sense": "to make someone very happy", "level": "C2", "dict_examp": "Seeing those little kids having so much fun just made my day.", "lear_examp": "Thank you for returning my lost diary; you have made my day!"}, {"sense": "to look old or be   in bad condition because of a lot of use", "level": "C2", "dict_examp": "This jacket has seen better days.", "lear_examp": "In the dense fog he managed to see a man standing nearby, whose clothes had definitely seen better days."}]}]}, {"word": "deadline", "poses": [{"pos": "noun", "senses": [{"sense": "a time or day by which something must be done", "level": "B2", "dict_examp": "There's no way I can meet that deadline.", "lear_examp": "My last question is about the deadline of your offer."}]}]}, {"word": "dealer", "poses": [{"pos": "noun", "senses": [{"sense": "a person  who buys and sells a particular type of goods", "level": "B2", "dict_examp": "a car dealer", "lear_examp": "A month ago there was a very special offer by the local VOBIS computer dealer which I could not resist."}]}]}, {"word": "daylight", "poses": [{"pos": "noun", "senses": [{"sense": "the natural light from the sun", "level": "B2", "dict_examp": "The colors look much better in daylight.", "lear_examp": "At the same time, we could change the curtains for lighter ones because we need the daylight."}]}]}, {"word": "dazzle", "poses": [{"pos": "verb", "senses": [{"sense": "If you are dazzled by someone or something, you think they are extremely good or exciting", "level": "C2", "dict_examp": "I was dazzled by his intelligence and good looks.", "lear_examp": "The unique, marvellous, awe-inspiring scene can only fill you with admiration and leave you feeling stunned, dazzled by the wonders of nature."}, {"sense": "If light dazzles someone, it makes them unable to see for a short time.", "level": "C2", "dict_examp": "He was dazzled by the car's headlights.", "lear_examp": "Since it was the first live musical event I had been to, I was impressed by how loud the music was being played and dazzled by the lights."}]}]}, {"word": "deadly", "poses": [{"pos": "adjective", "senses": [{"sense": "likely to cause death", "level": "B2", "dict_examp": "a deadly virus", "lear_examp": "Caught without cover, they were quickly eliminated by a burst of Bull's deadly machine gun."}]}, {"pos": "adverb", "senses": [{"sense": "extremely dull/serious, etc.", "level": "C1", "dict_examp": "His speech was deadly dull.", "lear_examp": "Sports don't have to be boring and deadly serious."}]}]}, {"word": "deaf", "poses": [{"pos": "adjective", "senses": [{"sense": "unable to hear, either completely or partly", "level": "B1", "dict_examp": "He's been totally/partially deaf since birth.", "lear_examp": "She should take care of her family, especially her deaf three-year-old daughter."}, {"sense": "If advice or a request falls on deaf ears, people ignore it.", "level": "C2", "dict_examp": "Our pleas for help fell on deaf ears.", "lear_examp": "His cry for help and for a more meaningful relationship between himself and Mildred invariably fell on deaf ears."}]}]}, {"word": "daydream", "poses": [{"pos": "verb", "senses": [{"sense": "to have pleasant thoughts about something you like or would like to happen", "level": "C1", "dict_examp": "She just sits in class daydreaming about her horses.", "lear_examp": "When we are young, we daydream about becoming famous."}]}]}, {"word": "dawn", "poses": [{"pos": "noun", "senses": [{"sense": "the early morning when light first appears in the sky", "level": "B2", "dict_examp": "We woke at dawn.", "lear_examp": "The other ones will work from dawn till dusk."}, {"sense": "the time when something began", "level": "C1", "dict_examp": "the dawn of civilization", "lear_examp": "Since the dawn of time, people of all religions have considered that there is a higher power that dictates their destiny."}, {"sense": "very early in the morning", "level": "C2", "dict_examp": "He gets up at the crack of dawn.", "lear_examp": "From the crack of dawn until bed time citizens have to breathe all kinds of gas coming out of cars, motorbikes or factories."}]}, {"pos": "verb", "senses": [{"sense": "If a fact dawns on you, you become aware of it after a period of not being aware of it.", "level": "C2", "dict_examp": "It finally dawned on him that she’d been joking.", "lear_examp": "It dawned on him that for whatever the reason he was now alone in the city."}]}]}, {"word": "daytime", "poses": [{"pos": "noun", "senses": [{"sense": "the period of the day when there is light from the sun, or the period when most people are at work", "level": "B2", "dict_examp": "I tend to sleep in/during the daytime and study at night.", "lear_examp": "There are different places to visit in the daytime."}]}]}, {"word": "day-to-day", "poses": [{"pos": "adjective", "senses": [{"sense": "happening every day as a regular part of your job or your life", "level": "C1", "dict_examp": "the usual day-to-day problems", "lear_examp": "Unfortunately modern life is very stressful; the day-to-day office routine makes people feel very stressed and upset with their lives."}]}]}, {"word": "date", "poses": [{"pos": "noun", "senses": [{"sense": "a particular day of a month or year", "level": "A1", "dict_examp": "What's the date?/What's today's date?", "lear_examp": "Let me know the date of your visit."}, {"sense": "a plan for something to happen at a particular time", "level": "B1", "dict_examp": "Let's make a date to have lunch.", "lear_examp": "We made a date for our next meeting in the \"Mamboo.\""}, {"sense": "a social meeting when two people go somewhere together, such as to a restaurant or to see a film", "level": "B1", "dict_examp": "He's asked her out on a date.", "lear_examp": "I'm going on a date with Priseila and my bicycle is broken."}, {"sense": "old and no longer useful, correct or fashionable", "level": "B1", "dict_examp": "These unemployment figures are out of date.", "lear_examp": "The library has got very poor staff and most of it is out of date."}, {"sense": "modern, recent or containing the latest information", "level": "B1", "dict_examp": "Great care is taken to keep our database up to date.", "lear_examp": "Furthermore, the website is not always up to date."}, {"sense": "up to the present time", "level": "B2", "dict_examp": "This is her best work to date.", "lear_examp": "I enclose a copy of my curriculum vitae, which will give you further details about my career to date."}, {"sense": "a sticky brown fruit with a long seed inside", "level": "C1", "dict_examp": "I bought a box of dates.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to write or print the day's date on something", "level": "B1", "dict_examp": "Thank you for your letter dated August 30th.", "lear_examp": "Dear Mrs Harris, Thank you very much for your letter dated June 7."}, {"sense": "to regularly spend time with someone you have a romantic relationship with", "level": "B1", "dict_examp": "We've been dating for six months.", "lear_examp": "They were dating for a while and last month, Jim gave Maria a ring!"}, {"sense": "to have existed a particular length of time or since a particular time", "level": "B2", "dict_examp": "This house dates back to 1650.", "lear_examp": "Near the end of the route there's a castle that dates back to the Middle Ages, which would be really nice to visit."}, {"sense": "to have existed since a particular time", "level": "B2", "dict_examp": "The castle dates from the 11th century.", "lear_examp": "The Olympic Museum dates from the 19th century and is the biggest in Europe."}]}]}, {"word": "dazed", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to think clearly because you are shocked or have hit your head", "level": "C2", "dict_examp": "The driver seemed dazed but not badly hurt.", "lear_examp": "Their faces looked dazed."}]}]}, {"word": "dead", "poses": [{"pos": "adjective", "senses": [{"sense": "not now alive", "level": "A2", "dict_examp": "She's been dead for twenty years now.", "lear_examp": "We cut down a dead tree to keep the house warm because it was very cold."}, {"sense": "If a piece of equipment is dead, it is not working.", "level": "B2", "dict_examp": "a dead battery", "lear_examp": "I tried to phone my sister, but the phone was dead."}, {"sense": "If a place is dead, it is too quiet and nothing interesting is happening there.", "level": "C2", "dict_examp": "The streets of the financial district are dead after 6 p.m.", "lear_examp": "Jane was walking through the empty streets of New York. ... The city was absolutely dead."}, {"sense": "complete", "level": "C2", "dict_examp": "There was dead silence as the votes were counted.", "lear_examp": "When I finally got inside a terror took hold of me as there was only dead silence."}, {"sense": "to die very suddenly", "level": "C2", "dict_examp": "He just dropped dead.", "lear_examp": "We can enjoy our longer lives because we don't have to work until we drop dead."}]}, {"pos": "adverb", "senses": [{"sense": "to oppose something strongly", "level": "C1", "dict_examp": "She was dead set against getting married.", "lear_examp": "Some others are dead set against the council's decision and provide some alternative ideas."}, {"sense": "extremely or completely", "level": "C2", "dict_examp": "The directions were dead wrong.", "lear_examp": "However, it did require me to put in long hours daily and I usually ended up dead tired at the end of a busy day."}]}]}, {"word": "decide", "poses": [{"pos": "verb", "senses": [{"sense": "to choose something after thinking about several possibilities", "level": "A2", "dict_examp": "They have to decide by next Friday.", "lear_examp": "I have decided to paint my room orange."}, {"sense": "to cause something to have a particular result", "level": "C2", "dict_examp": "This match will decide the tournament.", "lear_examp": "At any rate, science will decide whether it is better to live longer."}, {"sense": "something important that helps to make the final decision", "level": "C2", "dict_examp": "Cost was the deciding factor in choosing this builder.", "lear_examp": "Personally, I think the quality of teachers, school reputation and facilities should be the deciding factors for parents in which schools their children should be educated in."}]}]}, {"word": "debit", "poses": [{"pos": "noun", "senses": [{"sense": "money taken out of a bank account, or a record of this", "level": "B2", "dict_examp": "The statement shows your most recent debits.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to take money out of a bank account", "level": "B2", "dict_examp": "Twenty dollars has been debited from my account.", "lear_examp": ""}]}]}, {"word": "decade", "poses": [{"pos": "noun", "senses": [{"sense": "a period of ten years, especially a period such as 1860 to 1869, or 2000 to 2009", "level": "B2", "dict_examp": "", "lear_examp": "It is a question debated over the last decade whether television entertains and also educates."}]}]}, {"word": "decoration", "poses": [{"pos": "noun", "senses": [{"sense": "something that you put on something to make it look attractive or special, or the activity of putting things on something to make it look more attractive or special", "level": "B2", "dict_examp": "Christmas/party/table/cake decorations", "lear_examp": "When I worked at the festival, I helped out with the decorations."}]}]}, {"word": "decaffeinated", "poses": [{"pos": "adjective", "senses": [{"sense": "Decaffeinated tea or coffee is made by removing the caffeine.", "level": "C2", "dict_examp": "Could I have a decaffeinated coffee, please?", "lear_examp": ""}]}]}, {"word": "decorate", "poses": [{"pos": "verb", "senses": [{"sense": "to add something to or change an object or place to make it attractive", "level": "B1", "dict_examp": "They decorated the hall with balloons and colorful flags.", "lear_examp": "The church always is decorated with beautiful flowers and other things."}]}]}, {"word": "dedicate", "poses": [{"pos": "verb", "senses": [{"sense": "to give most of your energy and time to something", "level": "C1", "dict_examp": "She has dedicated her life to helping others.", "lear_examp": "I have been interested in these matters but due to my lack of time, I haven't been able to dedicate myself to this investigation."}, {"sense": "to say that something you have made or done is to show your love or respect for someone", "level": "C2", "dict_examp": "This book is dedicated to my daughter.", "lear_examp": "This story is dedicated to my sister to whom I can only feel deep admiration."}]}]}, {"word": "deceased", "poses": [{"pos": "adjective", "senses": [{"sense": "dead", "level": "C2", "dict_examp": "the deceased man's belongings", "lear_examp": "A picture of a deceased family member brings back lots of memories."}]}, {"pos": "noun", "senses": [{"sense": "someone who has died", "level": "C2", "dict_examp": "There will be no service, at the deceased’s request.", "lear_examp": "The deceased was a 19-year-old girl who had run away from home some months ago."}]}]}, {"word": "declaration", "poses": [{"pos": "noun", "senses": [{"sense": "a statement, often one that is written and official", "level": "C1", "dict_examp": "a declaration of independence/war", "lear_examp": "The Spanish government has not been an exception and has tried to control pollution. Apart from taking part in world conferences and joining Kyoto's declaration, it has also taken some measures."}]}]}, {"word": "debut", "poses": [{"pos": "noun", "senses": [{"sense": "when someone performs or presents something to the public for the first time", "level": "C1", "dict_examp": "She made her debut as a pianist in 1975.", "lear_examp": "Pavarotti's grand debut took place in the Royal Theatre of Reggio Emilia."}]}]}, {"word": "death", "poses": [{"pos": "noun", "senses": [{"sense": "the end of life", "level": "B1", "dict_examp": "a sudden/natural death", "lear_examp": "After his father's death, he didn't want to study."}, {"sense": "extremely bored, frightened, scared, etc.", "level": "B2", "dict_examp": "She's scared to death of dogs.", "lear_examp": "Preparing a surprise party, her parents had almost scared her to death."}, {"sense": "until you die", "level": "C2", "dict_examp": "Fire ants stung a woman to death.", "lear_examp": "She would have been trampled to death as the stampede of furious fans came over her."}, {"sense": "to kill someone as a punishment", "level": "C2", "dict_examp": "The convicted murderers will be put to death.", "lear_examp": "He has become dangerous for Jack and must thus be eliminated, put to death."}, {"sense": "a serious situation where people could die", "level": "C2", "dict_examp": "Getting water to these people is a matter of life and death.", "lear_examp": "I told him it was a matter of life and death."}]}]}, {"word": "deceive", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone believe something that is not true", "level": "B2", "dict_examp": "The company deceived customers by selling old computers as new ones.", "lear_examp": "So if you don't want to feel deceived or offended, think twice before you decide to go shopping."}]}]}, {"word": "decorative", "poses": [{"pos": "adjective", "senses": [{"sense": "made to look attractive", "level": "B2", "dict_examp": "a decorative display of plants and flowers", "lear_examp": "It seems that the decorative role of clothes will have disappeared by the year  2050."}]}]}, {"word": "debt", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of money that you owe someone", "level": "B2", "dict_examp": "He managed to pay off his debts in two years.", "lear_examp": "She thought of getting a loan but she already had huge debts."}, {"sense": "when you owe money to someone", "level": "B2", "dict_examp": "They are in debt to the bank.", "lear_examp": "The consequence is that I'm in debt."}]}]}, {"word": "deck", "poses": [{"pos": "noun", "senses": [{"sense": "a set of cards that you use to play a game", "level": "A2", "dict_examp": "I brought a deck of cards so we can play on the train.", "lear_examp": "I forgot my Yu-gi-oh card deck at your house yesterday."}, {"sense": "the flat area of a ship  or boat that is not covered", "level": "B2", "dict_examp": "We sat on deck until it was dark.", "lear_examp": "When I woke up and went on the deck, I saw the skipper who was coming back from the village in the small boat."}]}]}, {"word": "debit card", "poses": [{"pos": "noun", "senses": [{"sense": "a plastic card used to pay for things directly from your bank account", "level": "B2", "dict_examp": "I use my debit card for most of my shopping.", "lear_examp": ""}]}]}, {"word": "deceptive", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is deceptive, it makes you believe something that is not true.", "level": "C2", "dict_examp": "Appearances can be deceptive.", "lear_examp": "One should also remember another common, albeit wise phrase: appearances can be deceptive."}]}]}, {"word": "decisive", "poses": [{"pos": "adjective", "senses": [{"sense": "able to make decisions quickly and confidently, or showing this quality", "level": "B2", "dict_examp": "You need to be more decisive.", "lear_examp": "They were attractive, handsome, brave and decisive men."}, {"sense": "strongly affecting how a situation will progress or end", "level": "C1", "dict_examp": "a decisive action/victory", "lear_examp": "Recently, our Board of Executives has taken a decisive step: from now on, our clothes will also be available for purchase on the Internet!"}]}]}, {"word": "decline", "poses": [{"pos": "verb", "senses": [{"sense": "to gradually become less or worse", "level": "B2", "dict_examp": "His interest in the project declined after his wife died.", "lear_examp": "It had slightly declined to about 88 per cent in 1992."}, {"sense": "to refuse politely", "level": "B2", "dict_examp": "I invited him to the meeting but he declined.", "lear_examp": "We thank you for your offer of accommodation, but we decline it."}]}, {"pos": "noun", "senses": [{"sense": "when something becomes less in amount, importance, quality or strength", "level": "B2", "dict_examp": "industrial decline", "lear_examp": "For the 25-34 age group, a decline can be seen from 2006 to 2010."}]}]}, {"word": "decisively", "poses": [{"pos": "adverb", "senses": [{"sense": "in a decisive way", "level": "C2", "dict_examp": "We need to act decisively.", "lear_examp": "Putting your foot down quickly and decisively before things really get out of hand seems sensible."}]}]}, {"word": "decent", "poses": [{"pos": "adjective", "senses": [{"sense": "of a satisfactory quality or level", "level": "B2", "dict_examp": "He earns a decent salary.", "lear_examp": "I think it's a decent place for us to stay for a night."}, {"sense": "honest and morally good", "level": "B2", "dict_examp": "Decent people have had their lives ruined by his behavior.", "lear_examp": "In fact, it had such a bad reputation that nobody \"decent\" went there any longer."}]}]}, {"word": "decrease", "poses": [{"pos": "verb", "senses": [{"sense": "to become less, or to make something become less", "level": "B1", "dict_examp": "During the summer months, rainfall decreases.", "lear_examp": "The aim to satisfy different interests should not allow the quality to decrease."}]}, {"pos": "noun", "senses": [{"sense": "a reduction", "level": "B1", "dict_examp": "There has been a steady decrease in the number of visitors.", "lear_examp": "Their yellow and black stripe has a mysterious beauty (which is the main reason for the huge decrease in the tiger population)."}]}]}, {"word": "decay", "poses": [{"pos": "verb", "senses": [{"sense": "to become gradually damaged or to cause something to become gradually damaged", "level": "B2", "dict_examp": "Sugar makes your teeth decay.", "lear_examp": "The historic buildings are starting to decay."}]}, {"pos": "noun", "senses": [{"sense": "when something decays", "level": "C2", "dict_examp": "Many of the buildings had fallen into decay.", "lear_examp": "Furthermore, by having tourism, the authorities of the country, such as the government, will be obliged to restore any monuments which have fallen into decay."}]}]}, {"word": "decision", "poses": [{"pos": "noun", "senses": [{"sense": "a choice that you make about something after thinking about several possibilities", "level": "B1", "dict_examp": "She had to make some very difficult decisions.", "lear_examp": "Tell me your decision soon."}]}]}, {"word": "declare", "poses": [{"pos": "verb", "senses": [{"sense": "to officially tell someone the value of goods you have bought, or the amount of money you have earned, because you might have to pay tax", "level": "B1", "dict_examp": "Have you got anything to declare?", "lear_examp": ""}, {"sense": "to announce something publicly or officially", "level": "B2", "dict_examp": "They declared their support for the proposal.", "lear_examp": "We should declare the city center a pedestrian zone."}]}]}, {"word": "debate", "poses": [{"pos": "noun", "senses": [{"sense": "(a) discussion  or argument about a subject in which many people take part", "level": "B2", "dict_examp": "Education is the current focus of public debate.", "lear_examp": "Public debates are shown on television and television is the best way for politicians to explain their actions and projects."}]}, {"pos": "verb", "senses": [{"sense": "to discuss a subject in a formal way", "level": "C2", "dict_examp": "These issues need to be debated openly.", "lear_examp": "Homelessness is a worrying issue that is being debated by most of the developed countries' governments."}]}]}, {"word": "dear", "poses": [{"pos": "adjective", "senses": [{"sense": "used at the beginning of a letter to greet the person you are writing to", "level": "A1", "dict_examp": "Dear Kerry/Mom and Dad/Ms. Smith/Sir", "lear_examp": "Dear Jo, I think the new art class is on Friday."}, {"sense": "liked very much", "level": "B2", "dict_examp": "She was a very dear friend.", "lear_examp": "I decided to go to my dear friend Mary's house after writing a letter saying where I was and why."}, {"sense": "If something is dear to someone or dear to someone's heart, it is very important to them.", "level": "C2", "dict_examp": "The charity was very dear to his heart.", "lear_examp": "Among all the places I enjoyed visiting, the city of Singapore is especially dear to my heart."}]}, {"pos": "exclamation", "senses": [{"sense": "used to express surprise or disappointment", "level": "A2", "dict_examp": "Oh dear! I forgot my keys.", "lear_examp": "Oh dear! Why do you work so hard?"}]}]}, {"word": "December", "poses": [{"pos": "noun", "senses": [{"sense": "the twelfth and last month of the year", "level": "A1", "dict_examp": "the 23rd of December/December 23(rd)", "lear_examp": "We can see it on December 15th."}]}]}, {"word": "deception", "poses": [{"pos": "noun", "senses": [{"sense": "when you make someone believe something that is not true", "level": "C2", "dict_examp": "He was found guilty of obtaining money by deception.", "lear_examp": "On the other hand, his deception means that he betrayed his own nation."}]}]}, {"word": "define", "poses": [{"pos": "verb", "senses": [{"sense": "to say exactly what something means, or what someone or something is like", "level": "B2", "dict_examp": "In the dictionary \"reality\" is defined as \"the state of things as they are, rather than as they are imagined to be.\"", "lear_examp": "I guess you would have to define the word \"fit\" to answer that question."}]}]}, {"word": "deer", "poses": [{"pos": "noun", "senses": [{"sense": "a large, wild animal that is sometimes hunted for food and has antlers (= long horns) if it is male", "level": "B2", "dict_examp": "a deer park", "lear_examp": "It would be even nicer if there would be some wildlife in the park, like deer, walking free all over."}]}]}, {"word": "deem", "poses": [{"pos": "verb", "senses": [{"sense": "to judge or consider something in a particular way", "level": "C2", "dict_examp": "The book was deemed appropriate for children ages six to eight.", "lear_examp": "Were it not for the fact that we regard our job as adequately paid and providing sufficient free time, it could not be deemed a satisfactory one."}]}]}, {"word": "deficiency", "poses": [{"pos": "noun", "senses": [{"sense": "a mistake or fault in something so that it is not good enough", "level": "C1", "dict_examp": "Parents are complaining of serious deficiencies in the education system.", "lear_examp": "By studying the effects of rain and ways to handle the expected amount of water, one can plan the laying out of the new roads and correct the deficiencies in the present ones."}, {"sense": "when you do not have enough of something", "level": "C2", "dict_examp": "a vitamin   deficiency", "lear_examp": "The baby was born with a chromosome deficiency and the specialists gave her a life expectancy of up to six months."}]}]}, {"word": "deep", "poses": [{"pos": "adjective", "senses": [{"sense": "having a long distance from the top to the bottom", "level": "A2", "dict_examp": "a deep river/sea/lake", "lear_examp": "That place is good for the families too, because the water is not so deep.  (1980761; Skills for Life (Entry 1); ; A1 BREAKTHROUGH; 2007; Hungarian; ?)"}, {"sense": "A deep color is strong and dark.", "level": "B1", "dict_examp": "deep purple", "lear_examp": "He is tall and has got black hair and beautiful deep brown eyes."}, {"sense": "A deep feeling or experience is very strong.", "level": "B2", "dict_examp": "deep regret", "lear_examp": "I fell into a deep depression, and took an extremely long time to recover."}, {"sense": "A deep sound is low.", "level": "B2", "dict_examp": "a wonderfully deep voice", "lear_examp": "\"I'm not Gary,\" a strange and deep voice answered, \"I'm someone who wants to warn you that tomorrow, you are going to die.\""}, {"sense": "to fill your lungs with air", "level": "B2", "dict_examp": "Take a deep breath and relax.", "lear_examp": "But if you took a deep breath after reading the question, don't worry."}, {"sense": "having a distance of 6 inches/4 feet, etc. from the top to the bottom, or from the front to the back", "level": "B2", "dict_examp": "This end of the pool is eight feet deep.", "lear_examp": "Her father's friend, who is a professional scuba-diver, invited her to do her first immersion on the reefs, 15 meters deep."}, {"sense": "when someone is sleeping in a way that makes it difficult to wake them up", "level": "B2", "dict_examp": "He fell into a deep sleep.", "lear_examp": "And then, he fell to a deep sleep, putting his sack next to him."}, {"sense": "serious and difficult to understand", "level": "C2", "dict_examp": "a deep and meaningful conversation", "lear_examp": "I think we really need to go back to the classics to receive something from the deep thinkers."}, {"sense": "to make someone start a new and difficult job or activity without helping them or preparing them for it", "level": "C2", "dict_examp": "My first job was to organize a huge conference - they really threw me in at the deep end!", "lear_examp": "Sometimes we can be thrown in at the deep end and have qualms about making a decision."}, {"sense": "giving all of your attention to what you are thinking or talking about, and not noticing anything else", "level": "C2", "dict_examp": "I noticed that Ali and Ben were deep in conversation.", "lear_examp": "He was deep in thought, chewing on something brown and rectangular."}]}, {"pos": "adverb", "senses": [{"sense": "a long way into something from the top or outside", "level": "B1", "dict_examp": "They traveled deep into the forest.", "lear_examp": "I just fall deep into the story, into the writer's own world."}, {"sense": "If you know or feel something deep down, you are certain that it is true, or you feel it strongly although you do not admit it or show it.", "level": "B2", "dict_examp": "Deep down, I knew that I was right.", "lear_examp": "No, because I feel deep down that it's wrong to put animals behind bars."}, {"sense": "If a feeling or a problem goes deep, it is very strong or serious and has existed for a long time.", "level": "C2", "dict_examp": "Their commitment to this town runs deep.", "lear_examp": ""}]}]}, {"word": "defender", "poses": [{"pos": "noun", "senses": [{"sense": "someone on a sports team who tries to prevent the other team from scoring points, goals, etc.", "level": "B2", "dict_examp": "She's the best defender on the school's basketball team.", "lear_examp": "I'm mostly a defender, so scoring a goal for the first time gave me great pleasure!"}]}]}, {"word": "dedicated", "poses": [{"pos": "adjective", "senses": [{"sense": "believing that something is very important and giving a lot of time and energy to it", "level": "C1", "dict_examp": "a dedicated teacher", "lear_examp": "I myself am a totally dedicated sports fan and I believe that basketball is the greatest sport on this earth."}, {"sense": "designed to be used for a particular purpose", "level": "C2", "dict_examp": "The city has created hundreds of miles of dedicated bike lanes.", "lear_examp": "Apart from the occasional dedicated traffic lane, busses suffer the same congestion as other motorized traffic."}]}]}, {"word": "dedicate", "poses": [{"pos": "verb", "senses": [{"sense": "to give most of your energy and time to something", "level": "C1", "dict_examp": "She has dedicated her life to helping others.", "lear_examp": "I have been interested in these matters but due to my lack of time, I haven't been able to dedicate myself to this investigation."}, {"sense": "to say that something you have made or done is to show your love or respect for someone", "level": "C2", "dict_examp": "This book is dedicated to my daughter.", "lear_examp": "This story is dedicated to my sister to whom I can only feel deep admiration."}]}]}, {"word": "deficit", "poses": [{"pos": "noun", "senses": [{"sense": "the amount by which the money that you spend is more than the money that you receive", "level": "C1", "dict_examp": "a budget   deficit", "lear_examp": "Unfortunately, this could not be fulfilled by the government due to a huge budget deficit."}]}]}, {"word": "definition", "poses": [{"pos": "noun", "senses": [{"sense": "an explanation of the meaning of a word or phrase", "level": "B2", "dict_examp": "a dictionary definition", "lear_examp": "He tried to give a definition of friendship."}, {"sense": "how clear an image of something is in a photograph or on a screen", "level": "C1", "dict_examp": "They filmed using a high-definition camera.", "lear_examp": "And, do not forget to appreciate the keyboard work from the legendary Tony Banks, and the spectacular guitar-playing from Mike Rutherford, all of them surrounded by three, huge, high-definition screens."}]}]}, {"word": "definitely", "poses": [{"pos": "adverb", "senses": [{"sense": "without any doubt", "level": "B1", "dict_examp": "Have you definitely decided to go to Australia?", "lear_examp": "So if I were you, I would definitely stay in the city."}, {"sense": "used to emphasize that there is no doubt that something is not true or will not happen, or to say \"no\"", "level": "C1", "dict_examp": "\"Will the work be finished by June?\" \"Definitely not.\"", "lear_examp": "That's nice, but do you think that money is all that matters? Definitely not!"}]}]}, {"word": "defect", "poses": [{"pos": "noun", "senses": [{"sense": "a fault or problem with someone or something", "level": "C1", "dict_examp": "genetic defects", "lear_examp": "There are also people that are overweight and it is not their own fault, because they suffer from genetic defects."}]}]}, {"word": "definite article", "poses": [{"pos": "noun", "senses": [{"sense": "the grammatical name for the word \"the\" in English, or the words in other languages which have a similar use", "level": "B1", "dict_examp": "\"The Loop,\" referring to the downtown area of Chicago, takes the definite article.", "lear_examp": ""}]}]}, {"word": "defense", "poses": [{"pos": "noun", "senses": [{"sense": "protection or support against attack, criticism or infection", "level": "B1", "dict_examp": "When Helen criticized me, Chris came/rushed to my defense.", "lear_examp": "I exploded and made quite a speech in defense of reading."}, {"sense": "the part of a sports team which tries to prevent the other team from scoring points", "level": "B1", "dict_examp": "I'm best playing defense.", "lear_examp": "They said that I'm good at defense and they want that I be in reserve for the competition."}, {"sense": "the weapons and military forces that a country uses to protect itself against attack", "level": "C1", "dict_examp": "Spending on defense / Defense spending is increasing.", "lear_examp": "The majority of the government's expenditure went to other things apart from defense, education and health."}, {"sense": "the person or people in a court who are accused of doing a crime, and their lawyer", "level": "C2", "dict_examp": "He was cross-examined by the defense.", "lear_examp": "He tried to explain that the counsel for the defense was one of the best old hands in the country but they did not even pretend to listen to him."}]}]}, {"word": "defend", "poses": [{"pos": "verb", "senses": [{"sense": "to protect someone or something from being attacked, especially by fighting", "level": "B1", "dict_examp": "How can we defend our homeland if we don't have an army?", "lear_examp": "In the fourth one, you learn to defend yourself by doing Karate and in the last section, you could learn fencing."}, {"sense": "to support someone or something that is being criticized", "level": "B2", "dict_examp": "The newspaper's editor defended his decision to publish the photos.", "lear_examp": "Do we know a lot of people nowadays who would be able to take the risk of being a prisoner for 10 or 20 years \"just\" to defend his beliefs?"}, {"sense": "to try to show in a court that someone is not guilty of a crime", "level": "C1", "dict_examp": "He has hired two lawyers to defend him in court.", "lear_examp": "An innocent man is arrested and the court appoints an attorney to defend him."}]}]}, {"word": "defeat", "poses": [{"pos": "verb", "senses": [{"sense": "to win a victory over someone in a fight, war or competition", "level": "B1", "dict_examp": "Napoleon was defeated by the Duke of Wellington at the battle of Waterloo.", "lear_examp": "I still remember when Marcelo became number 1 in 1998 after he defeated Andre Agassi in the final of the \"fifth Grand Slam\"."}, {"sense": "to cause someone or something to fail", "level": "B2", "dict_examp": "The proposal to change the rules was narrowly defeated by 201 votes to 196.", "lear_examp": "But it was useless, Tina's friends had defeated their plan, and her."}]}, {"pos": "noun", "senses": [{"sense": "when someone loses against someone else in a fight, war or competition", "level": "B1", "dict_examp": "After their defeat in battle, the soldiers surrendered.", "lear_examp": "The whole team will face serious problems, which may lead to big defeats."}, {"sense": "when someone or something is made to fail", "level": "B2", "dict_examp": "The party suffered a stinging defeat in the last election.", "lear_examp": "After long negotiations with the police, Linda admitted defeat and gave up."}]}]}, {"word": "deduce", "poses": [{"pos": "verb", "senses": [{"sense": "to decide that something is true using the available information", "level": "C2", "dict_examp": "From the contents of his shopping basket, I deduced that he was single.", "lear_examp": "Having considered this particular case, we may be able to deduce some of the qualities needed to be \"successful.\""}]}]}, {"word": "deepen", "poses": [{"pos": "verb", "senses": [{"sense": "if someone's knowledge or understanding deepens, it increases.", "level": "C1", "dict_examp": "It certainly helped to deepen my understanding of the situation.", "lear_examp": "Although all the choices can contribute to deepen the knowledge of the students about languages, I think the most appropriate would be the computer room."}, {"sense": "to become worse or stronger, or to make something become worse or stronger", "level": "C2", "dict_examp": "The economic  crisis has deepened.", "lear_examp": "But as years passed and the gap between the successful and unsuccessful began to deepen, the stress rate culminated."}]}]}, {"word": "definite", "poses": [{"pos": "adjective", "senses": [{"sense": "certain, fixed and not likely to change", "level": "B2", "dict_examp": "The date for the meeting - is that definite?", "lear_examp": "I'm really excited about your definite plans to come."}]}]}, {"word": "defective", "poses": [{"pos": "adjective", "senses": [{"sense": "not in good condition or not working correctly", "level": "C2", "dict_examp": "I replaced the defective light.", "lear_examp": "The electric installations are defective, some locks are broken, and the ceiling leaks. Under these conditions, it's no wonder the library has no visitors."}]}]}, {"word": "dedication", "poses": [{"pos": "noun", "senses": [{"sense": "when you are willing to give a lot of time and energy to something because you believe it is very important", "level": "C1", "dict_examp": "She thanked the staff for their dedication and enthusiasm.", "lear_examp": "Sacrifice and self-denial are cornerstones, together with dedication and commitment to a good cause."}]}]}, {"word": "defensive", "poses": [{"pos": "adjective", "senses": [{"sense": "quick to protect yourself from being criticized", "level": "C2", "dict_examp": "He's very defensive about his weight.", "lear_examp": "And because the traveler's own value system is challenged, he reacts in a defensive way."}]}]}, {"word": "deeply", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely or strongly", "level": "B2", "dict_examp": "I'm deeply grateful to you.", "lear_examp": "I was deeply impressed by the long-term cooperation between the zoo and the school."}]}]}, {"word": "deduction", "poses": [{"pos": "noun", "senses": [{"sense": "when an amount or a part of something is taken away from a total, or the amount that is taken", "level": "C1", "dict_examp": "tax deductions", "lear_examp": "After the deduction of 5% administration expense and 10% entertainment cost, we contributed the remaining 85% of the surplus to the local hospital."}, {"sense": "when you decide something using the available information", "level": "C2", "dict_examp": "I worked out the facts by a process of deduction.", "lear_examp": "My deductions obviously went further, and I found relief in thinking that neither was the story real nor had the lost diary even existed."}]}]}, {"word": "delicious", "poses": [{"pos": "adjective", "senses": [{"sense": "having a very pleasant taste or smell", "level": "B1", "dict_examp": "a delicious cake", "lear_examp": "I love it because they make delicious hamburgers."}]}]}, {"word": "deliberately", "poses": [{"pos": "adverb", "senses": [{"sense": "intentionally", "level": "B2", "dict_examp": "I'm sure he says these things deliberately to annoy me.", "lear_examp": "Many of them choose the bicycle deliberately, just to have at least a small amount of exercise before and after the hours they spend sitting at their desks."}]}]}, {"word": "demanding", "poses": [{"pos": "adjective", "senses": [{"sense": "needing a lot of time, attention or energy", "level": "B2", "dict_examp": "She's a very demanding child.", "lear_examp": "Although the job was demanding I enjoyed it."}]}]}, {"word": "demolish", "poses": [{"pos": "verb", "senses": [{"sense": "to completely destroy a building, especially in order to use the land for something else", "level": "B2", "dict_examp": "A number of houses were demolished so that the supermarket could be built.", "lear_examp": "The building was demolished, and so was the dream of a house of their own."}]}]}, {"word": "delicate", "poses": [{"pos": "adjective", "senses": [{"sense": "soft, light or gentle", "level": "B2", "dict_examp": "a delicate flavor", "lear_examp": "She liked his delicate skin and his body's warmth."}, {"sense": "easy to damage or break", "level": "B2", "dict_examp": "delicate china", "lear_examp": "Although you told me I can make use of anything, I'd like to make sure that it isn't a problem to use such delicate things as the computer and the CD player?"}, {"sense": "needing to be handled with great care or skill", "level": "C1", "dict_examp": "delicate negotiations", "lear_examp": "Being aware of the two proposals our local government is considering in order to solve the apparently unavoidable matter of traffic in our beloved city, I feel compelled to offer my views on such a delicate subject."}, {"sense": "having a small, attractive shape", "level": "C2", "dict_examp": "delicate hands", "lear_examp": "Suddenly a shadow moved among the trees and a surprisingly beautiful and delicate woman walked towards me."}]}]}, {"word": "deliver", "poses": [{"pos": "verb", "senses": [{"sense": "to take things such as goods, letters, or packages to people's houses or places of work", "level": "B1", "dict_examp": "Express packages are delivered to our office several times a day.", "lear_examp": "I need to borrow your bicycle to deliver my father's wallet."}, {"sense": "to speak formally to a group of people", "level": "B2", "dict_examp": "The president delivered a speech on health care.", "lear_examp": "Then, he delivered a speech to the public."}, {"sense": "to achieve or do something that you have promised to do or that people expect you to do", "level": "C1", "dict_examp": "The company failed to deliver the high-quality service we expect.", "lear_examp": "I can also help as a team-leader to help others to deliver the right services."}]}]}, {"word": "densely", "poses": [{"pos": "adverb", "senses": [{"sense": "with a lot of things close together", "level": "B2", "dict_examp": "We waited in a densely packed room.", "lear_examp": "It's densely populated and with that the ugliness of densely populated places follows."}]}]}, {"word": "demonstrate", "poses": [{"pos": "verb", "senses": [{"sense": "to show or prove that something exists or is true", "level": "B2", "dict_examp": "These problems demonstrate the importance of strategic planning.", "lear_examp": "The results were amazing, the group managed to demonstrate that the learning capacity increased a lot with respect to traditional methods."}, {"sense": "to march or stand with a group of people to show that you disagree with or support someone or something", "level": "B2", "dict_examp": "Thousands of people gathered to demonstrate against the war.", "lear_examp": "Maybe the RSPCA should demonstrate, to show that it's not acceptable. We have to stand up for their rights!"}, {"sense": "to show something and explain how it works", "level": "C1", "dict_examp": "The teacher demonstrated how to use the equipment.", "lear_examp": "I could demonstrate to people how to create compost pits and use kitchen waste to generate compost for their gardens."}, {"sense": "to express or show that you have a feeling, quality, or ability", "level": "C2", "dict_examp": "He has demonstrated a genuine interest in the project.", "lear_examp": "As a result, he does not allow himself to demonstrate any emotion apart from anger."}]}]}, {"word": "demand", "poses": [{"pos": "verb", "senses": [{"sense": "to ask for something  in a way that shows that you do not expect to be refused", "level": "B1", "dict_examp": "I demanded an explanation.", "lear_examp": "I demand a full refund or I will be forced to take this matter further."}, {"sense": "to need something such as time or effort", "level": "B2", "dict_examp": "This job demands a high level of concentration.", "lear_examp": "I would say that driving a car demands a lot of responsibility."}]}, {"pos": "noun", "senses": [{"sense": "a strong request", "level": "B1", "dict_examp": "You can't give in to children's demands all the time.", "lear_examp": "Of course only when my demands are logical."}, {"sense": "a need for something to be sold or supplied", "level": "B2", "dict_examp": "There was little demand for tickets.", "lear_examp": "I believe we have to stop the demand for ivory!"}, {"sense": "wanted or needed in large numbers", "level": "C2", "dict_examp": "Good teachers are always in demand.", "lear_examp": "Many goods are not in demand because each family produces its own goods."}]}]}, {"word": "delivery", "poses": [{"pos": "noun", "senses": [{"sense": "when things such as goods, letters, or packages are taken to people's houses or places of work", "level": "B1", "dict_examp": "a delivery truck", "lear_examp": "I called for a delivery from Pizza Hut and after that went to study."}]}]}, {"word": "democratic", "poses": [{"pos": "adjective", "senses": [{"sense": "based on the principles of democracy", "level": "B2", "dict_examp": "We must accept the results of a democratic election.", "lear_examp": "If we regard ourselves as modern people, we must be democratic enough to release them."}]}]}, {"word": "delighted", "poses": [{"pos": "adjective", "senses": [{"sense": "very pleased", "level": "B1", "dict_examp": "We're delighted with our new house.", "lear_examp": "I've just seen your letter and I'm really delighted to have won the first prize in your competition."}]}]}, {"word": "demonstration", "poses": [{"pos": "noun", "senses": [{"sense": "when a group of people march or stand together to show that they disagree with or support something or someone", "level": "B2", "dict_examp": "The students are holding a demonstration to protest against higher tuition.", "lear_examp": "There were many demonstrations and violence."}, {"sense": "showing  how to do something, or how something works", "level": "C1", "dict_examp": "Let me give you a demonstration of how the camera works.", "lear_examp": "Some of our workers will give you a demonstration on how they produce, step-by-step, some of the world's best-known rings and necklaces."}, {"sense": "proof that something exists or is true", "level": "C1", "dict_examp": "This disaster is a clear demonstration of the need for tighter controls.", "lear_examp": "Most women are now allowed to wear pants and this is a demonstration of the change of their role in society throughout the years."}]}]}, {"word": "deliberate", "poses": [{"pos": "adjective", "senses": [{"sense": "done intentionally or planned", "level": "B2", "dict_examp": "a deliberate attack/insult/lie", "lear_examp": "I'm sure that his deliberate intention with this was to make us get closer."}]}]}, {"word": "delete", "poses": [{"pos": "verb", "senses": [{"sense": "to remove something, especially from a computer's memory", "level": "B1", "dict_examp": "All names have been deleted from the report.", "lear_examp": "I didn't take notice of the email and deleted it again."}]}]}, {"word": "denial", "poses": [{"pos": "noun", "senses": [{"sense": "when you say that something is not true", "level": "C2", "dict_examp": "a denial of his guilt", "lear_examp": "Although everyone past forty claims to be relieved not to be twenty anymore, most of them miss the excitement of the days when everything was less serious, when fun was a top priority and responsibilities lost somewhere close to denial."}]}]}, {"word": "degree", "poses": [{"pos": "noun", "senses": [{"sense": "a unit for measuring temperature, shown by the symbol ° written after a number", "level": "A2", "dict_examp": "Water boils at 212 degrees Fahrenheit and 100 degrees Celsius/centigrade.", "lear_examp": "Today it is very windy and too cold for bathing, just about 15 degrees."}, {"sense": "a title of achievement given for completing a course of study at a college or university", "level": "B1", "dict_examp": "\"What is your degree in?\" \"Art History.\"", "lear_examp": "I completed my languages degree course at U.P.N University."}, {"sense": "an amount or level of something", "level": "B2", "dict_examp": "This job demands a high degree of skill.", "lear_examp": "It is quite obvious that the modern society exploits natural resources to an extremely high degree."}, {"sense": "a small level or amount of something", "level": "C2", "dict_examp": "There was some degree of truth in what she said.", "lear_examp": "Nevertheless, some degree of freedom is obviously necessary for the healthy development of a young individual."}]}]}, {"word": "defy", "poses": [{"pos": "verb", "senses": [{"sense": "to refuse to obey someone or something", "level": "C2", "dict_examp": "Some of these children openly defy their teachers.", "lear_examp": "Jack was the only one, or the most conspicuous of all, to defy him."}, {"sense": "to be beyond what you could expect/find a category for/describe, etc.", "level": "C2", "dict_examp": "His success has defied expectations.", "lear_examp": "The horror of those endless days, when the whole family was as if in suspension not knowing the final diagnosis, defies any description."}]}]}, {"word": "delight", "poses": [{"pos": "noun", "senses": [{"sense": "(something or someone that gives) great pleasure, satisfaction or happiness", "level": "B2", "dict_examp": "My sister's little boy is a real delight.", "lear_examp": "At midnight fireworks covered the concert hall and I, as well as the rest of the spectators, felt excitement and delight."}]}]}, {"word": "density", "poses": [{"pos": "noun", "senses": [{"sense": "the number of people or things in a place when compared with the size of the place", "level": "C1", "dict_examp": "The area has a high population density.", "lear_examp": "However, the factors of population density and transport systems in some regions must not be ignored during this analysis."}]}]}, {"word": "delightful", "poses": [{"pos": "adjective", "senses": [{"sense": "very pleasant, attractive, or enjoyable", "level": "B2", "dict_examp": "We had a delightful evening.", "lear_examp": "The staff is pleasant and the food is absolutely delightful."}]}]}, {"word": "definitive", "poses": [{"pos": "adjective", "senses": [{"sense": "certain, clear, and not likely to change", "level": "C2", "dict_examp": "a definitive answer", "lear_examp": "I know many people who offer easy and definitive answers to every question."}]}]}, {"word": "delay", "poses": [{"pos": "verb", "senses": [{"sense": "to make something happen at a later time than originally planned or expected", "level": "A2", "dict_examp": "My plane was delayed an hour.", "lear_examp": "The bus was delayed and I decided to go on foot."}, {"sense": "to cause someone or something to be slow or late", "level": "B1", "dict_examp": "I was delayed by traffic.", "lear_examp": "The roads were crowded with a lot of traffic, so I got really delayed."}]}, {"pos": "noun", "senses": [{"sense": "when you have to wait longer than expected for something to happen, or the time that you have to wait", "level": "A2", "dict_examp": "An accident caused long delays on the Interstate.", "lear_examp": "It was terrible at Heathrow airport because my flight had a delay of over two hours."}, {"sense": "immediately", "level": "B1", "dict_examp": "This problem needs to be dealt with without delay.", "lear_examp": "Anyway, as I told you I wanted to go the resort, once I had booked a room, without delay. But on my way something happened."}]}]}, {"word": "delegate", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is sent somewhere to represent a group of people, especially at a meeting", "level": "C1", "dict_examp": "The delegates were all given badges to wear.", "lear_examp": "I participated at the opening of the new arts center as a delegate from my college."}]}, {"pos": "verb", "senses": [{"sense": "to give someone else part of your work or some of your responsibilities", "level": "C2", "dict_examp": "He needs to learn to delegate or he'll never get everything done.", "lear_examp": "Let me call him Mr. X. His success is based on various qualities of modern leadership: he delegates as much responsibility as possible to subordinates and gives them all competence to carry out their tasks."}]}]}, {"word": "delegation", "poses": [{"pos": "noun", "senses": [{"sense": "a group of people who have been chosen to represent a much larger group of people", "level": "C2", "dict_examp": "a delegation of Chinese officials", "lear_examp": "For instance, two weeks ago I had to go to Kiev to work as a translator with a delegation at the Ukrainian Central Bank."}]}]}, {"word": "dense", "poses": [{"pos": "adjective", "senses": [{"sense": "thick and difficult to see through", "level": "B2", "dict_examp": "dense fog", "lear_examp": "\"Don't be afraid and don't run\" shouted someone from the dense forest."}]}]}, {"word": "denim", "poses": [{"pos": "noun", "senses": [{"sense": "thick, strong, cotton cloth, often blue in color, used especially for making jeans", "level": "B2", "dict_examp": "a denim jacket and jeans", "lear_examp": "If you have time to go shopping you could buy me a pair of blue denim jeans."}]}]}, {"word": "democracy", "poses": [{"pos": "noun", "senses": [{"sense": "a system of government in which people elect their leaders, or a country with this system", "level": "B2", "dict_examp": "The early 1990s saw the spread of democracy in Eastern Europe.", "lear_examp": "From then on it represented democracy and freedom until Hitler took over power in January 1933."}]}]}, {"word": "describe", "poses": [{"pos": "verb", "senses": [{"sense": "to say or write what someone or something is like", "level": "A2", "dict_examp": "Can you describe your bag?", "lear_examp": "I would like to describe the food from my country."}]}]}, {"word": "depth", "poses": [{"pos": "noun", "senses": [{"sense": "the distance down either from the top of something to the bottom, or to a distance below the top surface of something", "level": "B1", "dict_examp": "the depth of a lake/pond", "lear_examp": "But suddenly Laura did not feel any fear anymore and within a second she jumped into the air and fell into the endless depth of the Grand Canyon."}, {"sense": "when you have serious qualities or the ability to think seriously about something", "level": "B2", "dict_examp": "Terry lacks depth - he's a very superficial person.", "lear_examp": "I think that the main reason why someone has to read this book twice is the strength and depth of the two main characters: Donald Woods and Steve Biko."}, {"sense": "in a very detailed way", "level": "B2", "dict_examp": "With access to the Internet, students can research their topics in greater depth.", "lear_examp": "I would love to learn English in more depth during the summer."}, {"sense": "how much someone knows or feels about something", "level": "C2", "dict_examp": "She was amazed at the depth of his knowledge.", "lear_examp": "More and more people seem to take refuge in the depth of his philosophy now."}, {"sense": "not having the knowledge, experience, or skills to deal with a particular subject or situation", "level": "C2", "dict_examp": "When they start talking about philosophy, I'm completely out of my depth.", "lear_examp": "It was my first day of school. What I can remember is that I really felt out of my depth: my parents were so happy that I couldn't succeed in telling them that I was terribly frightened and that the only thing that I wanted was my doll."}]}]}, {"word": "descendant", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is related to someone who lived a long time ago", "level": "C2", "dict_examp": "We are New Yorkers and the descendants of Chinese immigrants.", "lear_examp": "Someone born poor in the country will never have a chance to heighten his social status, and generations later, his descendants will be poor as well."}]}]}, {"word": "description", "poses": [{"pos": "noun", "senses": [{"sense": "something that tells you what something or someone is like", "level": "B1", "dict_examp": "Write a description of your favorite vacation spot.", "lear_examp": "Here's a description of my bedroom."}]}]}, {"word": "depressing", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel unhappy and without hope for the future", "level": "B2", "dict_examp": "I find this weather so depressing.", "lear_examp": "It was really depressing, seeing people drinking and having fun when I just had to work."}]}]}, {"word": "deserted", "poses": [{"pos": "adjective", "senses": [{"sense": "If a place is deserted, it has no people in it.", "level": "C1", "dict_examp": "a deserted street", "lear_examp": "The park, which is situated in the northern part of Koropi, used to be a quiet, peaceful, almost deserted area."}]}]}, {"word": "derive", "poses": [{"pos": "verb", "senses": [{"sense": "to get a positive feeling or advantage from someone or something", "level": "C2", "dict_examp": "I derive much pleasure from gardening.", "lear_examp": "Last but not least, it is a fact that people derive pleasure from being in a position to have the things they desire and can afford to buy."}, {"sense": "to come from or be developed from something", "level": "C1", "dict_examp": "Many English words derive from Latin.", "lear_examp": "From another chart, we can have a clear understanding of nuclear power's contribution to different European countries: 78.0% of electricity production derived from nuclear power in France, and 60.1% of that in Belgium."}]}]}, {"word": "deprivation", "poses": [{"pos": "noun", "senses": [{"sense": "the state of not having enough of something", "level": "C2", "dict_examp": "sleep deprivation", "lear_examp": "Often it has been seen that children suffering from extreme deprivation in their childhood can become deviant as they grow up."}]}]}, {"word": "deputy", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has the second most important job in an organization", "level": "C1", "dict_examp": "the deputy chairman/editor", "lear_examp": "If you would like to have a teacher on your side, for general questions, I would propose our deputy principal Mr. Brown."}]}]}, {"word": "dentist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who examines and repairs teeth", "level": "A2", "dict_examp": "You should have your teeth checked by a dentist at least twice a year.", "lear_examp": "She is a dentist and can speak several languages."}]}]}, {"word": "depend", "poses": [{"pos": "verb", "senses": [{"sense": "used to say that you are not certain about something because other things affect your answer", "level": "B1", "dict_examp": "\"Are you coming out tonight?\" \"It depends (on) what you're planning to do.\"", "lear_examp": "It depends how you want to spend your holidays."}, {"sense": "If something depends on someone or something, it is influenced by them, or changes because of them.", "level": "B1", "dict_examp": "Which phone you can buy depends on how much you're willing to spend.", "lear_examp": "But, on the other hand, you should explain to your parents what you want to do because you know that your decision depends on what they say."}, {"sense": "to need the help and support of someone or something in order to exist or continue as before", "level": "B2", "dict_examp": "She depends on her son for everything.", "lear_examp": "I don't want to depend on my parents any more."}, {"sense": "to trust someone or something and know that they will help you or do what you want or expect them to do", "level": "B2", "dict_examp": "You can always depend on Michael in a crisis.", "lear_examp": "I hope you'll let me join your foundation because I could be a member you can depend on."}]}]}, {"word": "desert", "poses": [{"pos": "noun", "senses": [{"sense": "a large, hot, dry area of land with very few plants", "level": "A2", "dict_examp": "the Sahara Desert", "lear_examp": "It's an interesting place because, it is carrying the water from the desert to the center of the city."}]}]}, {"word": "deprived", "poses": [{"pos": "adjective", "senses": [{"sense": "not having enough food, money, or other things that you need to have a normal life", "level": "C1", "dict_examp": "He took pictures in deprived areas of the city.", "lear_examp": "It is true that possibly, because of a deprived childhood in which every purchase had to be considered carefully, a person learns to manage his finances."}]}]}, {"word": "dependent", "poses": [{"pos": "adjective", "senses": [{"sense": "needing the support of something or someone in order to continue existing or operating", "level": "B2", "dict_examp": "He has three dependent children.", "lear_examp": "If I went to school by car I would be dependent on my father."}, {"sense": "influenced by or decided by something", "level": "C1", "dict_examp": "The amount of tax you pay is dependent on your income.", "lear_examp": "Almost every possible requirement of a human life from cradle to grave is vastly dependent on availability of money."}]}]}, {"word": "design", "poses": [{"pos": "noun", "senses": [{"sense": "the way in which something is planned and made", "level": "B1", "dict_examp": "I don't like the design of this kettle.", "lear_examp": "I was looking to find a good bicycle with a nice design."}, {"sense": "the art of making plans or drawings for something", "level": "B1", "dict_examp": "She's an expert on kitchen/software design.", "lear_examp": "You know that my subject is design."}, {"sense": "a pattern or decoration", "level": "B1", "dict_examp": "a floral design", "lear_examp": "Last year I made and sold more than 200 pairs of knitted socks and because of that I got a prize from The Swedish Handcraft Company for the wonderful and original design on my socks."}, {"sense": "a drawing which shows how an object, machine, or building will be made", "level": "C1", "dict_examp": "Engineers are working on the new designs.", "lear_examp": "To finish some of your designs on time you could take them home and continue them there or you could work for longer in your office."}]}, {"pos": "verb", "senses": [{"sense": "to draw or plan something before making it", "level": "B1", "dict_examp": "Who designed this building/dress/furniture?", "lear_examp": "It was built in 1570 and designed by the Italian architect Morando."}, {"sense": "to have been planned or done for a particular purpose", "level": "B2", "dict_examp": "This dictionary is designed for learners of English.", "lear_examp": "The end-of-conference party is designed to give rough ideas about many different cultures."}]}]}, {"word": "deodorant", "poses": [{"pos": "noun", "senses": [{"sense": "a substance that you put on your body to prevent or hide unpleasant smells", "level": "C1", "dict_examp": "I always use deodorant.", "lear_examp": "On the other hand, men require regular supplies of shaving lotions, shampoo, deodorant, and many more things too."}]}]}, {"word": "department", "poses": [{"pos": "noun", "senses": [{"sense": "a part of an organization such as a school, business or government which deals with a particular area of study or work", "level": "A2", "dict_examp": "the African Studies department/the department of African Studies", "lear_examp": "Then we went down to the Design and Technology department and the English department."}]}]}, {"word": "depression", "poses": [{"pos": "noun", "senses": [{"sense": "when you feel very unhappy, or a mental illness that makes you feel very unhappy and anxious for long periods", "level": "B2", "dict_examp": "If you suffer from depression, it's best to get professional help.", "lear_examp": "Some people think that going shopping can keep you away from depression."}, {"sense": "a time when there is not much business activity", "level": "C2", "dict_examp": "The stock market crash marked the start of a severe depression.", "lear_examp": "We are just coming out of a financial depression, and companies have had to lay off thousands of people."}]}]}, {"word": "deposit", "poses": [{"pos": "noun", "senses": [{"sense": "a payment of part of the total cost of something that you want to buy and will finish paying for later", "level": "B1", "dict_examp": "They've put down a deposit on a house.", "lear_examp": "How many days in advance do we have to make our reservation? I also wonder if there is a deposit that we have to pay."}, {"sense": "an amount of money that you put into a bank account", "level": "C1", "dict_examp": "to make a deposit", "lear_examp": "Now, you can make a deposit, have a record of your expenses, transfer funds from one account to another and even pay your credit card ."}, {"sense": "an amount of money that you pay when you rent something, and that is given back to you when you return it without any damage", "level": "C1", "dict_examp": "Did you get your deposit back?", "lear_examp": "Further development of the concept of the \"City Bike\", a bike that anyone can borrow for free, leaving a small deposit, is recommended."}, {"sense": "a layer of a substance that has developed from a natural or chemical process", "level": "C2", "dict_examp": "deposits of iron ore", "lear_examp": "When these foods are taken in excess quantities, the digestive system converts the bits that are useful to the body and the rest are stored as fat deposits in different parts of the body."}]}, {"pos": "verb", "senses": [{"sense": "to put money into a bank or valuable things into a safe place", "level": "C1", "dict_examp": "She deposited $150,000 in a Swiss bank account.", "lear_examp": "The excess of any allowance was deposited into a piggy bank."}]}]}, {"word": "departure", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something  leaves a place, especially to start a journey to another place", "level": "B1", "dict_examp": "There are four departures daily to Albany from Rochester.", "lear_examp": "Now I am just waiting for the day of departure."}]}]}, {"word": "department store", "poses": [{"pos": "noun", "senses": [{"sense": "a large shop divided into several different parts, each of which sells different things", "level": "A2", "dict_examp": "", "lear_examp": "First we'll go to May's department store, because things are so cheap there."}]}]}, {"word": "depict", "poses": [{"pos": "verb", "senses": [{"sense": "to represent someone or something in a picture or story", "level": "C2", "dict_examp": "The cartoon depicts the president as a vampire.", "lear_examp": "A picture depicts an image that allows us different feelings, depending on the moment and the sensations we experienced while the picture was shot."}]}]}, {"word": "dental", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the teeth", "level": "B2", "dict_examp": "dental care", "lear_examp": "For example, they will have checks, dental checks regularly to maintain healthy bodies."}]}]}, {"word": "descend", "poses": [{"pos": "verb", "senses": [{"sense": "to go or come down", "level": "B2", "dict_examp": "The path descended steeply into the valley.", "lear_examp": "Paul slowly descended to the river and sat down on the grassy bank."}, {"sense": "to be related to a person or group of people who lived in the past", "level": "C2", "dict_examp": "Her father is descended from Greek royalty.", "lear_examp": "It is to say that the proprietor descends from an important family of cooks and that he knows all the secrets of ancient home-made dishes."}]}]}, {"word": "deny", "poses": [{"pos": "verb", "senses": [{"sense": "to say that something is not true", "level": "B2", "dict_examp": "Neil denies that he broke the window, but I'm sure he did.", "lear_examp": "We cannot deny that technology has changed our lives."}, {"sense": "to not allow someone to have or do something", "level": "B2", "dict_examp": "Her request for time off work was denied.", "lear_examp": "Should wild animals be kept in cages, and denied their freedom so that we can have the pleasure of watching them at zoos?"}]}]}, {"word": "dependence", "poses": [{"pos": "noun", "senses": [{"sense": "when you need someone or something all the time in order to exist or continue", "level": "C2", "dict_examp": "Our society needs to reduce its dependence on the car.", "lear_examp": "The dependence on oil is a menace because oil reserves will disappear and because at this time we have no other invention to replace it."}]}]}, {"word": "deprive", "poses": [{"pos": "verb", "senses": [{"sense": "to take something, especially something necessary or pleasant, away from someone", "level": "B2", "dict_examp": "He claimed that he had been deprived of his freedom/rights.", "lear_examp": "We shouldn't deprive our music fans of this wonderful event, that can only enrich our city's cultural life."}]}]}, {"word": "depart", "poses": [{"pos": "verb", "senses": [{"sense": "to go away or leave, especially on a journey", "level": "B1", "dict_examp": "The plane departs at 6.00 a.m.", "lear_examp": "The boat departs from King's Bridge."}]}]}, {"word": "depressed", "poses": [{"pos": "adjective", "senses": [{"sense": "unhappy and without hope for the future", "level": "B1", "dict_examp": "He seemed a bit depressed about work.", "lear_examp": "I felt depressed and decided to go to live in another city."}, {"sense": "A depressed country, area, or economy does not have enough jobs or business activity.", "level": "C2", "dict_examp": "an economically depressed area", "lear_examp": "Our area is getting closer to a depressed area rather than a peaceful and nice one."}]}]}, {"word": "deserve", "poses": [{"pos": "verb", "senses": [{"sense": "If you deserve something good or bad, it should happen to you because of the way you have behaved.", "level": "B1", "dict_examp": "After all that hard work, you deserve a holiday.", "lear_examp": "I wish you happiness, you deserve it."}]}]}, {"word": "despair", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of having no hope", "level": "B2", "dict_examp": "a mood/sense of despair", "lear_examp": "Almost in despair, I came out of the bathroom and tried my best to look for a candle."}]}]}, {"word": "desired", "poses": [{"pos": "adjective", "senses": [{"sense": "the effect/result/shape, etc. that is wanted", "level": "C2", "dict_examp": "Her medicine seems to have had the desired effect.", "lear_examp": "Nonetheless, this effort has to materialize, taking into account our local culture in order to have the desired result for our city."}]}]}, {"word": "detail", "poses": [{"pos": "noun", "senses": [{"sense": "information about someone or something", "level": "A2", "dict_examp": "They haven't given me any details yet.", "lear_examp": "Here are the details you asked for."}, {"sense": "one of many facts or pieces of information about something", "level": "B1", "dict_examp": "She insisted on telling me every single detail.", "lear_examp": "Consequently we want to know every single detail about them and their lives."}, {"sense": "including or considering all the information about something or every part of something", "level": "B1", "dict_examp": "We haven't discussed the matter in detail yet.", "lear_examp": "I'm really sorry that I didn't write back earlier, but to make up for this I will answer your questions in detail!"}, {"sense": "to tell or include all the facts about something", "level": "B2", "dict_examp": "I won't go into detail over the phone, but I've been having a few health problems recently.", "lear_examp": "In one of his books he really goes into detail about how children treat other children who have difficulties with their \"new\" language."}]}]}, {"word": "destiny", "poses": [{"pos": "noun", "senses": [{"sense": "the things that will happen to someone in the future", "level": "C1", "dict_examp": "At last she feels in control of her own destiny.", "lear_examp": "It was our parents' destiny, it is our destiny and is going to be our children's destiny, too."}, {"sense": "a power that some people believe controls what will happen in the future", "level": "C1", "dict_examp": "Nick said it was destiny that we met.", "lear_examp": "If anybody ever asked me if I believed in destiny, I would hesitate."}]}]}, {"word": "desperate", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely worried or frightened and ready to do anything to change the bad situation you are in", "level": "B2", "dict_examp": "The doctors made one last desperate attempt/effort to save the boy's life.", "lear_examp": "I was almost desperate, trying to think about any possible solution to my problem, but the more I thought, the bigger was my problem, because hours went by."}, {"sense": "needing or wanting something very much", "level": "B2", "dict_examp": "She was desperate to get news of her family.", "lear_examp": "I am really desperate to share my hobby with somebody as nobody I know is interested in my work."}, {"sense": "very serious or bad", "level": "C2", "dict_examp": "The earthquake survivors are in desperate need of help.", "lear_examp": "In desperate situations one may even think that our only task in this world is to face and try to overcome everyday problems."}]}]}, {"word": "detective", "poses": [{"pos": "noun", "senses": [{"sense": "someone, especially a police officer, whose job is to discover information about a crime", "level": "B1", "dict_examp": "a private detective", "lear_examp": "I know that you love detective stories."}]}]}, {"word": "desperately", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely or very much", "level": "B2", "dict_examp": "He was desperately ill.", "lear_examp": "I desperately need a bicycle as a bicycle competition is going to take place in our city."}, {"sense": "in a way that shows you are frightened and ready to try anything to change a situation", "level": "B2", "dict_examp": "They fought desperately for their lives.", "lear_examp": "He desperately tried to keep the stalking sharks at bay, but he couldn't succeed."}]}]}, {"word": "devastation", "poses": [{"pos": "noun", "senses": [{"sense": "serious damage caused by a violent event", "level": "C2", "dict_examp": "The tornado has already left a trail of devastation through four states from Nebraska to Missouri.", "lear_examp": "As you might know, this is one of the few green areas that has survived the devastation suffered by our town during the past five years."}]}]}, {"word": "devastated", "poses": [{"pos": "adjective", "senses": [{"sense": "very shocked and upset", "level": "C1", "dict_examp": "She was devastated when her husband died.", "lear_examp": "To begin with, everyone was devastated at how long we had to wait at the airport, as the flight to Dublin was late."}]}]}, {"word": "desirable", "poses": [{"pos": "adjective", "senses": [{"sense": "worth having and wanted by most people", "level": "B2", "dict_examp": "Reducing class sizes in schools is a desirable aim.", "lear_examp": "It is desirable that they include showers, although a bath tub would be nice, too."}]}]}, {"word": "design", "poses": [{"pos": "noun", "senses": [{"sense": "the way in which something is planned and made", "level": "B1", "dict_examp": "I don't like the design of this kettle.", "lear_examp": "I was looking to find a good bicycle with a nice design."}, {"sense": "the art of making plans or drawings for something", "level": "B1", "dict_examp": "She's an expert on kitchen/software design.", "lear_examp": "You know that my subject is design."}, {"sense": "a pattern or decoration", "level": "B1", "dict_examp": "a floral design", "lear_examp": "Last year I made and sold more than 200 pairs of knitted socks and because of that I got a prize from The Swedish Handcraft Company for the wonderful and original design on my socks."}, {"sense": "a drawing which shows how an object, machine, or building will be made", "level": "C1", "dict_examp": "Engineers are working on the new designs.", "lear_examp": "To finish some of your designs on time you could take them home and continue them there or you could work for longer in your office."}]}, {"pos": "verb", "senses": [{"sense": "to draw or plan something before making it", "level": "B1", "dict_examp": "Who designed this building/dress/furniture?", "lear_examp": "It was built in 1570 and designed by the Italian architect Morando."}, {"sense": "to have been planned or done for a particular purpose", "level": "B2", "dict_examp": "This dictionary is designed for learners of English.", "lear_examp": "The end-of-conference party is designed to give rough ideas about many different cultures."}]}]}, {"word": "dessert", "poses": [{"pos": "noun", "senses": [{"sense": "sweet food eaten after the main part of a meal", "level": "A2", "dict_examp": "For dessert there's apple pie, cheesecake or fruit.", "lear_examp": "I always order a t-bone steak with salad, and for dessert a piece of chocolate cake."}]}]}, {"word": "determiner", "poses": [{"pos": "noun", "senses": [{"sense": "in grammar, a word which is used before a noun to show which particular example of the noun you are referring to", "level": "B2", "dict_examp": "In the phrases \"my first boyfriend\" and \"that strange woman,\" the words \"my\" and \"that\" are determiners.", "lear_examp": ""}]}]}, {"word": "detached", "poses": [{"pos": "adjective", "senses": [{"sense": "separate and not joined or connected to another part, building, etc.", "level": "C2", "dict_examp": "Their new house has a detached garage.", "lear_examp": "Its use in eye surgery began with a discovery, that it could help to repair a detached retina (of which existence Dr. Townes had never heard before)."}, {"sense": "If someone is detached, they do not feel involved with someone or emotional about something.", "level": "C2", "dict_examp": "As a nurse, I see some very distressing things, but I try to stay detached.", "lear_examp": "Whereas Olivia was very much attracted by and interested in India's mysteries, Douglas had a much more detached view of India."}]}]}, {"word": "desperation", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being desperate", "level": "C2", "dict_examp": "I was overcome by a sense of desperation.", "lear_examp": "Many are driven to desperation and turn to stealing to survive."}]}]}, {"word": "despite", "poses": [{"pos": "preposition", "senses": [{"sense": "used to say that something happened or is true, although this seems not likely because of something else", "level": "B1", "dict_examp": "I still enjoyed the week despite the weather.", "lear_examp": "Despite having to share a bedroom with my three cousins, I feel very comfortable."}, {"sense": "used to refer to a fact or situation that is surprising in relation to another fact", "level": "B2", "dict_examp": "The company has been forced to reduce its price, despite the fact that the offer has been very popular.", "lear_examp": "The advantages of the kind of life that people had years ago is that they could eat more fruit and vegetables than us. However, there are advantages for us too, because despite the fact that we eat more fast food, we do more exercise than they did."}]}]}, {"word": "destruction", "poses": [{"pos": "noun", "senses": [{"sense": "when something is destroyed", "level": "B2", "dict_examp": "Many people are very concerned about the destruction of the rainforests.", "lear_examp": "It can be a solution to avoid the concentration of pollution and consequently avoid the destruction of the buildings."}]}]}, {"word": "desk", "poses": [{"pos": "noun", "senses": [{"sense": "a type of table that you can work at, often one with drawers", "level": "A1", "dict_examp": "an office/school desk", "lear_examp": "There is a television, a stereo, a computer, a big bed and a desk with a chair."}]}]}, {"word": "destination", "poses": [{"pos": "noun", "senses": [{"sense": "the place where someone or something is going", "level": "B1", "dict_examp": "We arrived at our destination tired and hungry.", "lear_examp": "The journey to the destination lasted about an hour."}]}]}, {"word": "deteriorate", "poses": [{"pos": "verb", "senses": [{"sense": "to become worse", "level": "C1", "dict_examp": "Her condition deteriorated rapidly.", "lear_examp": "Otherwise, the situation will deteriorate more and more."}]}]}, {"word": "destroy", "poses": [{"pos": "verb", "senses": [{"sense": "to damage something so badly that it does not exist or cannot be used", "level": "B1", "dict_examp": "Most of the old part of the city was destroyed by bombs during the war.", "lear_examp": "The film described a terrible period of our history when a lot of people died and a lot of cities were destroyed."}]}]}, {"word": "determine", "poses": [{"pos": "verb", "senses": [{"sense": "to discover the facts or truth about something", "level": "C1", "dict_examp": "The doctors are still unable to determine what is wrong.", "lear_examp": "Our feelings about the issue led our class to direct a survey among local residents in Fordham, in order to determine statistically how often the latter use Greendale Park."}, {"sense": "to decide what will happen", "level": "C1", "dict_examp": "Her test scores will determine which class she is assigned to.", "lear_examp": "It considers the reasons for these developments and highlights the trends which will determine the future of the job market."}]}]}, {"word": "designer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who draws and plans how something will be made", "level": "B1", "dict_examp": "a fashion/software designer", "lear_examp": "After five months, she was working as a co-designer with the best Italian designer, although she was just a student."}]}, {"pos": "adjective", "senses": [{"sense": "made by a famous or fashionable designer", "level": "B2", "dict_examp": "designer jeans/sunglasses", "lear_examp": "People like designer clothes like Armani, Chanel and so on."}]}]}, {"word": "detailed", "poses": [{"pos": "adjective", "senses": [{"sense": "giving a lot of information", "level": "B2", "dict_examp": "A witness gave a detailed description of the man.", "lear_examp": "We ran until we arrived at the police station where we gave a detailed description of that man and what had happened."}]}]}, {"word": "desktop", "poses": [{"pos": "noun", "senses": [{"sense": "a computer screen  that contains icons that represent files, programs and other features of the computer", "level": "B2", "dict_examp": "A shortcut to the program will be created on your desktop.", "lear_examp": ""}, {"sense": "a computer that fits on the top of a desk but is too large to carry around", "level": "B2", "dict_examp": "I can download e-mail from my desktop to my smartphone.", "lear_examp": "The computer I bought is a beautiful, new, white desktop."}]}]}, {"word": "detrimental", "poses": [{"pos": "adjective", "senses": [{"sense": "harmful or damaging", "level": "C2", "dict_examp": "a detrimental effect", "lear_examp": "This could have a detrimental effect on our city and, to be more specific, on tourism."}]}]}, {"word": "develop", "poses": [{"pos": "verb", "senses": [{"sense": "to (cause something to) grow or change and become more advanced", "level": "B1", "dict_examp": "The baby develops inside the mother for nine months.", "lear_examp": "Therefore it's an important tool that is used to develop new friendships."}, {"sense": "to make something new such as a product", "level": "B1", "dict_examp": "Scientists are developing new drugs all the time.", "lear_examp": "With more free time we can develop new technology, learn more about ourselves and the world that surrounds us."}, {"sense": "If you develop an illness or problem, or if it develops, you start to suffer from it.", "level": "B2", "dict_examp": "The study showed that one in twelve women is likely to develop breast cancer.", "lear_examp": "They often developed the same symptoms as can be seen among mentally disturbed human beings."}, {"sense": "to start to happen or exist", "level": "C2", "dict_examp": "Further problems may develop if you do not deal with this now.", "lear_examp": "But it's not only financial problems which can develop as a result of more people living longer in a society."}]}]}, {"word": "deterrent", "poses": [{"pos": "noun", "senses": [{"sense": "something that stops people doing something because they are afraid of what will happen if they do", "level": "C2", "dict_examp": "They've installed a security camera as a deterrent to thieves.", "lear_examp": "I also think that the assistance that the state provides acts as a deterrent in the sense that, in Britain for example, the income support or family credit can actually be higher than what some people can earn in a week of hard work: so, what is the point of working?"}]}]}, {"word": "desire", "poses": [{"pos": "noun", "senses": [{"sense": "a strong feeling that you want something", "level": "B2", "dict_examp": "I really have no desire for wealth.", "lear_examp": "I think this is the right job I was looking for because it is an opportunity to travel to the USA, which is my great desire."}]}, {"pos": "verb", "senses": [{"sense": "to want something", "level": "C1", "dict_examp": "You can have whatever you desire.", "lear_examp": "Indeed, the location of this hotel will allow all of us to do whatever we desire."}]}]}, {"word": "detect", "poses": [{"pos": "verb", "senses": [{"sense": "to discover or notice something, especially something that is difficult to see, hear, smell, etc.", "level": "C1", "dict_examp": "Some sounds cannot be detected by the human ear.", "lear_examp": "The kind of contamination that can be detected and observed most easily is the air pollution."}]}]}, {"word": "determination", "poses": [{"pos": "noun", "senses": [{"sense": "when someone  continues trying to do something, although it is very difficult", "level": "B2", "dict_examp": "Andy Murray will need great determination and skill to win this match.", "lear_examp": "Mandela tried to better the political situation of South Africa - he was strong enough to fight, he had determination."}]}]}, {"word": "determined", "poses": [{"pos": "adjective", "senses": [{"sense": "wanting to do something very much, and not letting anyone stop you", "level": "B2", "dict_examp": "I'm determined to get this piece of work finished today.", "lear_examp": "I am determined to study computer engineering and pursue my education overseas."}]}]}, {"word": "devastating", "poses": [{"pos": "adjective", "senses": [{"sense": "making someone very shocked and upset", "level": "C1", "dict_examp": "Despite the devastating news, no one is giving up hope.", "lear_examp": "It can be really devastating for such a person to experience it."}, {"sense": "causing a lot of damage or destruction", "level": "C2", "dict_examp": "The fire has had a devastating effect on the local wildlife.", "lear_examp": "We are all aware of the devastating impact that factories have on the environment, not to mention the cars whose numbers multiply day-by-day."}]}]}, {"word": "device", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment that is used for a particular purpose", "level": "B2", "dict_examp": "an electronic device", "lear_examp": "I have much more time for many other things during the day thanks to the devices modern technology offers us."}, {"sense": "to leave someone to do what they want to do", "level": "C2", "dict_examp": "With both parents out at work, the kids were often left to their own devices.", "lear_examp": "The moment teenagers leave school, they are left to their own devices."}]}]}, {"word": "developed", "poses": [{"pos": "adjective", "senses": [{"sense": "describes a country or region of the world with an advanced level of technology, industry, etc.", "level": "B2", "dict_examp": "a developed country/nation", "lear_examp": "To conclude I would like to say that the governments of all developed countries wouldn't have been so concerned about the so-called \"problem 2000\" if the computer had not been so important for modern society."}]}]}, {"word": "difference", "poses": [{"pos": "noun", "senses": [{"sense": "the way in which two people or things are not the same", "level": "A2", "dict_examp": "What's the difference between an ape and a monkey?", "lear_examp": "I will not find the same one and of course John will notice the difference."}, {"sense": "the amount by which one thing is different from another", "level": "B1", "dict_examp": "a(n) age/price/temperature difference", "lear_examp": "This age difference was too big!"}, {"sense": "to improve a situation (a lot)", "level": "B2", "dict_examp": "Exercise can make a big difference to your health.", "lear_examp": "It wouldn't make a big difference in my life, but it would be good."}, {"sense": "to not be important or change a situation", "level": "B2", "dict_examp": "You can ask him again if you like, but it won't make any difference - he'll still say no.", "lear_examp": "Does it make any difference, some might ask?"}, {"sense": "to notice a difference between two things", "level": "C1", "dict_examp": "I can't tell the difference between an American and a Canadian accent.", "lear_examp": "Not only will their critical sense atrophy but also they will not be able to tell the difference between what is right and wrong."}, {"sense": "a disagreement or different opinion", "level": "C2", "dict_examp": "They must try to resolve their differences peacefully.", "lear_examp": "Music has also the power to unite people, to make them forget their negative feelings and to make them forget their differences."}]}]}, {"word": "diarrhea", "poses": [{"pos": "noun", "senses": [{"sense": "an illness in which your solid waste is more liquid than usual, and comes out of your body more often", "level": "C2", "dict_examp": "She has diarrhea.", "lear_examp": "In the end, however, we need to listen to our own body and make sure that the nutrition suggested by nutritionists and doctors is also accepted by our metabolism, i.e., not greeted with diarrhea, nausea, etc."}]}]}, {"word": "diary", "poses": [{"pos": "noun", "senses": [{"sense": "a book in which a person writes a private record of events, thoughts, feelings, etc.", "level": "A2", "dict_examp": "I write down my thoughts in my diary every night.", "lear_examp": "The best one is a diary: my aunt gave it to me. It like it because I can write my feelings in it."}]}]}, {"word": "diet", "poses": [{"pos": "noun", "senses": [{"sense": "the type of food that someone usually eats", "level": "B1", "dict_examp": "a healthy/balanced diet", "lear_examp": "You can try our fresh farm food, which is very good for your diet."}, {"sense": "when someone eats less food, or only particular types of food, because they want to become thinner or for medical reasons", "level": "B1", "dict_examp": "I'm going on a diet next week and hope to lose five pounds before Christmas.", "lear_examp": "I'm on a serious diet, and I have to exercise."}]}]}, {"word": "diamond", "poses": [{"pos": "noun", "senses": [{"sense": "an extremely hard valuable stone which is used in jewelry, and in industry for cutting hard things", "level": "B2", "dict_examp": "a diamond ring/necklace", "lear_examp": "She found a gorgeous diamond ring on her finger."}, {"sense": "a shape with four straight sides of equal length, forming two opposite angles which are wide and two which are narrow", "level": "B2", "dict_examp": "Joe's socks had diamond patterns on them.", "lear_examp": ""}]}]}, {"word": "dial", "poses": [{"pos": "verb", "senses": [{"sense": "to make a telephone call to a particular number", "level": "B1", "dict_examp": "Can I dial this number direct, or do I have to go through the operator?", "lear_examp": "Wouldn't it be better to prepare the shopping list instead of dialing home to ask which salad to buy."}]}]}, {"word": "diagram", "poses": [{"pos": "noun", "senses": [{"sense": "a simple picture showing what something looks like or explaining something", "level": "B1", "dict_examp": "The teacher drew a diagram showing how the blood flows through the heart.", "lear_examp": "The diagram shows the system of production by which bricks are produced for the building industry."}]}]}, {"word": "developing", "poses": [{"pos": "adjective", "senses": [{"sense": "describes a country or region of the world which is poor and has few industries", "level": "B2", "dict_examp": "the developing world/countries/nations", "lear_examp": "Nowadays, both developed and developing countries spend a lot of money on computerization."}]}]}, {"word": "devoted", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely loving or caring very much about someone or something", "level": "B2", "dict_examp": "a devoted fan/husband/wife", "lear_examp": "I am devoted to reading and I can say this book is wonderful."}]}]}, {"word": "die", "poses": [{"pos": "verb", "senses": [{"sense": "to stop living or existing", "level": "A1", "dict_examp": "Twelve people died in the accident.", "lear_examp": "The pen is very important for me because my grandfather gave it to me before he died."}, {"sense": "to be extremely eager to have or do something", "level": "B1", "dict_examp": "I'm dying to hear your news.", "lear_examp": "Now I have to leave you because I'm dying for a pizza!"}, {"sense": "If something, especially noise or excitement, dies down, it gradually becomes less loud or strong until it stops.", "level": "C2", "dict_examp": "She waited for the laughter to die down before she spoke.", "lear_examp": "Even the best materials wouldn't be able to avoid the deafening noise which does not ever die down."}, {"sense": "to become more and more rare and then disappear completely", "level": "B2", "dict_examp": "Dinosaurs died out about 65 million years ago.", "lear_examp": "A second point is that a lot of animals are going to die out because of pollution."}]}]}, {"word": "development", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something grows or changes and becomes more advanced", "level": "B1", "dict_examp": "healthy growth and development", "lear_examp": "There are some machines which have helped in my development, and others which help to make my life easier."}, {"sense": "the process of developing something new", "level": "B1", "dict_examp": "the development  of new drugs", "lear_examp": "Owing to the great speed of technological development, people need to lead a faster life."}, {"sense": "something new that happens and changes a situation", "level": "B2", "dict_examp": "an important development in the fuel crisis", "lear_examp": "There have been impressive developments in technology lately."}, {"sense": "when something starts to happen or exist", "level": "C2", "dict_examp": "New vacccines may prevent the development of some cancers.", "lear_examp": "The aims taken into account in the establishment of the \"Health fund\" are varied and cover different areas such as the education of the general public on the issues of health itself, and the threat posed by the development of cancer and Aids, etc."}]}]}, {"word": "dictionary", "poses": [{"pos": "noun", "senses": [{"sense": "a book that contains a list of words in alphabetical order with their meanings explained or written in another language, or a similar product for use on a computer", "level": "A1", "dict_examp": "a French-English/English-French dictionary", "lear_examp": "Andrew, I think I left my new dictionary in your house last night."}]}]}, {"word": "different", "poses": [{"pos": "adjective", "senses": [{"sense": "not the same", "level": "A1", "dict_examp": "She seems to wear something different every day.", "lear_examp": "My friends gave me different gifts."}, {"sense": "used to talk about separate things or people of the same type", "level": "B1", "dict_examp": "I had to go to three different bookstores to find that book she wanted.", "lear_examp": "I have three different teachers for three different things, one for the grammar, another for the listening and finally one for my writing."}]}]}, {"word": "dialect", "poses": [{"pos": "noun", "senses": [{"sense": "a form of a language that people speak in a particular part of a country", "level": "C2", "dict_examp": "They're speaking a local dialect.", "lear_examp": "Mrs Haefele, the owner and cook of this inn, serves the meals personally and if you are lucky, you may understand a bit of her Swabian dialect."}]}]}, {"word": "differentiate", "poses": [{"pos": "verb", "senses": [{"sense": "to understand or notice how two things or people are different from each other", "level": "C1", "dict_examp": "He can't differentiate between blue and green.", "lear_examp": "The person would learn how to differentiate his needs from his wants and would value hard work."}, {"sense": "to make someone or something different", "level": "C2", "dict_examp": "We need to differentiate ourselves from the competition.", "lear_examp": "Consumerism is reflected through this need, leading to a non-stop purchasing of products and services which will differentiate us from the mass."}]}]}, {"word": "dice", "poses": [{"pos": "noun", "senses": [{"sense": "two small objects each with six equal square sides that have between one and six spots on them, used in games", "level": "C2", "dict_examp": "Roll the dice to see who starts the game.", "lear_examp": "The dice were rolling and my luck was in."}]}, {"pos": "verb", "senses": [{"sense": "to cut food into small, square pieces", "level": "C2", "dict_examp": "diced onions", "lear_examp": "There are trays of cut lettuce, leaf lettuce, cut tomato, diced tomato, all kinds of relishes, cheese with bacon spread, barbecue, or whatever you like."}]}]}, {"word": "dialogue", "poses": [{"pos": "noun", "senses": [{"sense": "(a) conversation that is written for a book, play, movie, etc.", "level": "B2", "dict_examp": "The play contained some very funny dialogue.", "lear_examp": "However, she shows her courage during her first dialogue with Joss."}, {"sense": "a formal discussion between countries or groups of people", "level": "C2", "dict_examp": "We need to enter into a dialogue with these people.", "lear_examp": "The way I see it, history has proven that authority without dialogue leads to rebellion, and I do not see rebellion as a way to improvement, but as a symbol of failure."}]}]}, {"word": "diagnosis", "poses": [{"pos": "noun", "senses": [{"sense": "when a doctor says what is wrong with someone who is ill", "level": "C2", "dict_examp": "What's the diagnosis?", "lear_examp": "Lung cancer was the diagnosis."}]}]}, {"word": "diagnose", "poses": [{"pos": "verb", "senses": [{"sense": "to say what is wrong with someone who is ill", "level": "C2", "dict_examp": "She was diagnosed with cancer last year.", "lear_examp": "I wasn't prepared at all when my parents sat me down to tell me that my mother had been diagnosed with cancer."}]}]}, {"word": "dictate", "poses": [{"pos": "verb", "senses": [{"sense": "to decide or control what happens", "level": "C1", "dict_examp": "The weather will dictate where we hold the party.", "lear_examp": "Since the dawn of time people of all religions have considered that there is a higher power that dictates their destiny."}]}]}, {"word": "develop", "poses": [{"pos": "verb", "senses": [{"sense": "to (cause something to) grow or change and become more advanced", "level": "B1", "dict_examp": "The baby develops inside the mother for nine months.", "lear_examp": "Therefore it's an important tool that is used to develop new friendships."}, {"sense": "to make something new such as a product", "level": "B1", "dict_examp": "Scientists are developing new drugs all the time.", "lear_examp": "With more free time we can develop new technology, learn more about ourselves and the world that surrounds us."}, {"sense": "If you develop an illness or problem, or if it develops, you start to suffer from it.", "level": "B2", "dict_examp": "The study showed that one in twelve women is likely to develop breast cancer.", "lear_examp": "They often developed the same symptoms as can be seen among mentally disturbed human beings."}, {"sense": "to start to happen or exist", "level": "C2", "dict_examp": "Further problems may develop if you do not deal with this now.", "lear_examp": "But it's not only financial problems which can develop as a result of more people living longer in a society."}]}]}, {"word": "devil", "poses": [{"pos": "noun", "senses": [{"sense": "an evil being, often represented in human form but with a tail and horns", "level": "B2", "dict_examp": "", "lear_examp": "This film is about a devil who meets a priest."}, {"sense": "someone who behaves badly", "level": "C2", "dict_examp": "He's an absolute devil!", "lear_examp": "It must be with my younger brother, that little devil, Diana thought, so she went to his room and opened every drawer, but she could find nothing."}]}]}, {"word": "diesel", "poses": [{"pos": "noun", "senses": [{"sense": "fuel used in the engines of some vehicles, especially buses and trucks, or a vehicle that uses this fuel", "level": "C1", "dict_examp": "My new car uses diesel.", "lear_examp": "I think that our government should spend more money to find other sources of fuel, which could replace the diesel and gas."}]}]}, {"word": "differ", "poses": [{"pos": "verb", "senses": [{"sense": "to be not like something or someone else, either physically or in another way", "level": "B2", "dict_examp": "The twins look alike, but they differ in other ways.", "lear_examp": "People's opinions on this matter differ widely."}]}]}, {"word": "developer", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to create new products, especially computer products such as software", "level": "C1", "dict_examp": "We mostly use developers based in India.", "lear_examp": "For example, we may have the top website developers in China, but quite often their skills are restricted by poor IT infrastructures."}, {"sense": "someone who buys land or buildings to improve them and sell them for more money", "level": "C2", "dict_examp": "All the land was bought up by developers.", "lear_examp": "I figured it out that the landlord would sell sooner or later to make a profit, since he is a property developer."}]}]}, {"word": "devise", "poses": [{"pos": "verb", "senses": [{"sense": "to design or invent something such as a system, plan, idea, piece of equipment, etc.", "level": "C2", "dict_examp": "She devised a plan to make money.", "lear_examp": "On the other hand, I can't devise on the spot the job that would give you all the above-mentioned things, i.e., money and job satisfaction, and leave you plenty of free time simultaneously."}]}]}, {"word": "devote", "poses": [{"pos": "verb", "senses": [{"sense": "to use time, energy, etc. for a particular purpose", "level": "B2", "dict_examp": "He resigned from his job to devote more time to his family.", "lear_examp": "At that time, everyone should have devoted their life to the nation."}, {"sense": "to use a space or area for a particular purpose", "level": "B2", "dict_examp": "Most of the magazine was devoted to celebrity gossip.", "lear_examp": "This report was devoted to the Westfield Music Festival."}, {"sense": "to spend all your time or energy doing something that you think is important", "level": "C1", "dict_examp": "He retired in 1814 to devote himself to social reforms.", "lear_examp": "The current situations or problems in the world will stimulate young people to devote themselves to some community/charity work or contribute to national affairs."}]}]}, {"word": "direction", "poses": [{"pos": "noun", "senses": [{"sense": "the way  that someone or something is moving or facing", "level": "B1", "dict_examp": "\"No, go that way,\" I said, pointing in the opposite direction.", "lear_examp": "I walked for hours in the same direction I had walked before."}, {"sense": "toward someone", "level": "B2", "dict_examp": "She keeps looking in my direction.", "lear_examp": "I didn't know why she was talking to me but suddenly she walked in my direction and told me: \"I need to know your name\"."}, {"sense": "control or instructions", "level": "C1", "dict_examp": "Under his direction, the company has doubled its profits.", "lear_examp": "I am writing to you on behalf of the Social Club of our language school to express some complaints that we had from several students concerning our recent visit to the Science and Technology Museum which is under your direction."}, {"sense": "the way that someone or something changes or develops", "level": "C2", "dict_examp": "Our careers have gone in very different directions.", "lear_examp": "At school and at home young people are supposed to take responsibility for their actions and choose a direction for their life."}]}]}, {"word": "digital camera", "poses": [{"pos": "noun", "senses": [{"sense": "a type of camera that records images that you can use and store on  a computer", "level": "A2", "dict_examp": "These days almost everyone uses a digital camera.", "lear_examp": "I got lots of gifts, including a digital camera!"}]}]}, {"word": "diminish", "poses": [{"pos": "verb", "senses": [{"sense": "to become less, or to make something become less", "level": "C1", "dict_examp": "Your pain should diminish gradually over the next two or three hours.", "lear_examp": "As one student I've asked said, if we manage to keep cars out of town, air pollution will considerably diminish."}]}]}, {"word": "dining room", "poses": [{"pos": "noun", "senses": [{"sense": "a room in which meals are eaten", "level": "A1", "dict_examp": "We ate in the dining room.", "lear_examp": "I think I left it in the dining room."}]}]}, {"word": "diplomacy", "poses": [{"pos": "noun", "senses": [{"sense": "dealing with the relationships between governments", "level": "C2", "dict_examp": "international diplomacy", "lear_examp": "I studied International Relations and Diplomacy."}, {"sense": "skill in dealing with people well and not upsetting them", "level": "C2", "dict_examp": "She showed great tact and diplomacy in the meeting.", "lear_examp": "And if a dispute arose, he managed to solve it with great diplomacy and with the result that nobody in the end felt offended."}]}]}, {"word": "diploma", "poses": [{"pos": "noun", "senses": [{"sense": "an official document showing that someone has completed a course of study", "level": "A2", "dict_examp": "a high school/college  diploma", "lear_examp": "My best present was a diploma from the University of Cambridge."}]}]}, {"word": "dimension", "poses": [{"pos": "noun", "senses": [{"sense": "a particular part of a situation, especially something that affects how you think or feel", "level": "B2", "dict_examp": "Music has added a new dimension to my life.", "lear_examp": "I had never felt this way before, it was like being part of another life, another dimension!"}, {"sense": "a measurement of the length, width, or height of something", "level": "B2", "dict_examp": "The dimensions of the photo should be no larger than 30cm by 20cm.", "lear_examp": "Also I want to take a big mirror, the dimensions are 0.70 x 1.20 m."}]}]}, {"word": "dignity", "poses": [{"pos": "noun", "senses": [{"sense": "calm and serious behavior that makes people respect you", "level": "C2", "dict_examp": "He behaved with great dignity and courage.", "lear_examp": "He is a caring person with a sense of responsibility and dignity."}]}]}, {"word": "differently", "poses": [{"pos": "adverb", "senses": [{"sense": "in a different way", "level": "B1", "dict_examp": "We want to do things differently.", "lear_examp": "I had always pictured it quite differently."}]}]}, {"word": "direct", "poses": [{"pos": "adjective", "senses": [{"sense": "going straight from one place to another without stopping or changing direction", "level": "B1", "dict_examp": "a direct route/line", "lear_examp": "I'm looking for a direct flight from Zurich to Botswana."}, {"sense": "with no other person or thing involved or between", "level": "B2", "dict_examp": "She decided to take direct control of the project.", "lear_examp": "I think that there are huge dangers today such as war, violence, crime, pollution, etc. that have a direct influence on our lives."}, {"sense": "saying clearly and honestly what you think", "level": "C1", "dict_examp": "a direct answer", "lear_examp": "He preferred to give me a hint rather than a direct answer."}]}, {"pos": "verb", "senses": [{"sense": "to tell the actors in a film or play what to do", "level": "B1", "dict_examp": "He wanted to give up acting and start directing (his own films).", "lear_examp": "We plan to see an action film which was directed by Tarantino."}, {"sense": "to show or tell someone how to get to a place", "level": "B1", "dict_examp": "Can you direct me to the manager's office please?", "lear_examp": "He directed me to a room where other guests were waiting."}, {"sense": "to aim something at someone or something", "level": "C1", "dict_examp": "His criticism was directed at everybody who disagreed with him.", "lear_examp": "In these circumstances it is important, however, that alternative options are provided (e.g., efficient and affordable train services) and that economic measures (such as increased prices) are directed at those who really cause the most environmental costs."}, {"sense": "to organize and control the way something is done", "level": "C1", "dict_examp": "He directed the building of the new art gallery.", "lear_examp": "Obviously they will work in the commercial department, under the supervision of Lorenzo Soboli, the person who is in charge of directing that section."}]}]}, {"word": "dime", "poses": [{"pos": "noun", "senses": [{"sense": "a US or Canadian coin with a value of 10 cents", "level": "C1", "dict_examp": "Can I borrow a dime - the machine only takes coins.", "lear_examp": ""}]}]}, {"word": "digestion", "poses": [{"pos": "noun", "senses": [{"sense": "when your body changes food in your stomach into substances that it can use", "level": "C1", "dict_examp": "He has problems with digestion.", "lear_examp": "They do not spend time preparing and eating the food and that is not very good for the digestion process."}]}]}, {"word": "dilemma", "poses": [{"pos": "noun", "senses": [{"sense": "a situation in which a difficult choice has to be made between two different things you could do", "level": "B2", "dict_examp": "The President is clearly in a dilemma about/over how to tackle the crisis.", "lear_examp": "Actually I think it's a typical female dilemma: we try to do many things by ourselves and at the same time!"}]}]}, {"word": "diplomat", "poses": [{"pos": "noun", "senses": [{"sense": "an official whose job is to represent one country in another, and who usually works in an embassy", "level": "B2", "dict_examp": "a Spanish/British diplomat", "lear_examp": "The owner of the restaurant was a diplomat, and he invited the refugees to eat at the restaurant."}]}]}, {"word": "dig", "poses": [{"pos": "verb", "senses": [{"sense": "to break up and move soil using a tool, a machine or your hands", "level": "B1", "dict_examp": "Digging (in) the garden is good exercise.", "lear_examp": "I started digging, but it was useless."}, {"sense": "to form a hole by moving soil", "level": "B2", "dict_examp": "The tunnel was dug with the aid of heavy machinery.", "lear_examp": "I was ready to dig a hole and jump into it, because when you are at that age and your best friend's father sees you kissing your boyfriend in the dark, it is just the most embarrassing thing which can happen to you."}]}]}, {"word": "directly", "poses": [{"pos": "adverb", "senses": [{"sense": "with no other person or thing involved or in between", "level": "B1", "dict_examp": "Our hotel room was directly above a building site.", "lear_examp": "The Youth Hostel was directly beside the sea."}, {"sense": "clearly and honestly", "level": "B2", "dict_examp": "Let me answer that question directly.", "lear_examp": "While being interviewed, try to answer the questions directly and look into the interviewer's eyes."}]}]}, {"word": "differentiate", "poses": [{"pos": "verb", "senses": [{"sense": "to understand or notice how two things or people are different from each other", "level": "C1", "dict_examp": "He can't differentiate between blue and green.", "lear_examp": "The person would learn how to differentiate his needs from his wants and would value hard work."}, {"sense": "to make someone or something different", "level": "C2", "dict_examp": "We need to differentiate ourselves from the competition.", "lear_examp": "Consumerism is reflected through this need, leading to a non-stop purchasing of products and services which will differentiate us from the mass."}]}]}, {"word": "dim", "poses": [{"pos": "adjective", "senses": [{"sense": "not bright or clear", "level": "C2", "dict_examp": "He could hardly see her in the dim light.", "lear_examp": "As well as such drawbacks, the lighting is too dim to browse around and some light tubes are permanently off."}, {"sense": "when you can remember something slightly, but not very well", "level": "C2", "dict_examp": "I have a dim memory of meeting her at a party.", "lear_examp": "I really regret having lost it for now I have only dim recollections of my past."}]}, {"pos": "verb", "senses": [{"sense": "to become less bright, or to make something become less bright", "level": "C2", "dict_examp": "He dimmed the lights and turned up the music.", "lear_examp": "The light was carefully dimmed by the waiter as they ordered their food: they both chose their special enchiladas."}]}]}, {"word": "directions", "poses": [{"pos": "noun", "senses": [{"sense": "instructions that tell you how to get to a particular place, or how to do something", "level": "A2", "dict_examp": "Can you give me directions to your house?", "lear_examp": "I didn't know where the College was, and  most of the people gave me wrong directions."}]}]}, {"word": "dip", "poses": [{"pos": "verb", "senses": [{"sense": "to put something into a liquid for a short time", "level": "B2", "dict_examp": "Dip the fish in the batter, then drop it into the hot oil.", "lear_examp": "I recommend little sandwiches, chips and other things to dip into sauces."}, {"sense": "to become lower in level or amount", "level": "B2", "dict_examp": "The number of students taking classes in the sciences has dipped sharply.", "lear_examp": ""}]}]}, {"word": "dinner", "poses": [{"pos": "noun", "senses": [{"sense": "the main meal of the day that people usually eat in the evening", "level": "A1", "dict_examp": "We were just having (our) dinner.", "lear_examp": "I can come to dinner tomorrow at 7 o'clock."}]}]}, {"word": "diplomatic", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to diplomacy or diplomats", "level": "C1", "dict_examp": "diplomatic relations", "lear_examp": "The price has been arranged by the Argentine and English Governments, that have now entered diplomatic relations."}, {"sense": "good at dealing with people without upsetting them", "level": "C2", "dict_examp": "That's a very diplomatic answer.", "lear_examp": "We may have to be diplomatic and tactful, but we also must be honest and firm."}]}]}, {"word": "digital", "poses": [{"pos": "adjective", "senses": [{"sense": "using an electronic system that changes sounds or images into signals in the form of numbers before it stores them or sends them", "level": "A2", "dict_examp": "digital data", "lear_examp": "It has amazing digital effects."}, {"sense": "showing information in the form of an electronic image", "level": "B1", "dict_examp": "a digital clock/display", "lear_examp": "The alarm clock was flashing with the annoying digital zeros."}]}]}, {"word": "dinosaur", "poses": [{"pos": "noun", "senses": [{"sense": "a very large animal that used to live millions of years ago", "level": "A2", "dict_examp": "So why did the dinosaurs die out?", "lear_examp": "It was attacked by an enormous dinosaur and died."}]}]}, {"word": "dignified", "poses": [{"pos": "adjective", "senses": [{"sense": "calm, serious, and behaving in a way that makes people respect you", "level": "C2", "dict_examp": "a quiet, dignified woman", "lear_examp": "In the book \"The remains of the day\" we get to know the very dignified butler, Stevens, and his relationship with Miss Kenton."}]}]}, {"word": "digest", "poses": [{"pos": "verb", "senses": [{"sense": "to change food in your stomach into substances that your body can use", "level": "C1", "dict_examp": "I need some time to digest my dinner.", "lear_examp": "Most families are also trying to eat a bit less meat, because meat is very hard to digest."}, {"sense": "to think about new information carefully in order to understand it", "level": "C1", "dict_examp": "You need to give me time to digest this report.", "lear_examp": "Also I found the lectures about how to write CVs very useful although if the groups were smaller, it would have made the information easier to digest."}]}]}, {"word": "difficult", "poses": [{"pos": "adjective", "senses": [{"sense": "when something is not easy to do or understand", "level": "A1", "dict_examp": "a difficult problem/choice/task", "lear_examp": "This book is very important because I have a difficult exam next Friday."}, {"sense": "not friendly or easy to deal with", "level": "B1", "dict_examp": "The manager is difficult to deal with/a difficult person to deal with.", "lear_examp": "I'm not a difficult person and I can cook very well."}, {"sense": "to cause someone to be in a difficult situation", "level": "C1", "dict_examp": "When two of your best friends argue it puts you in a very difficult position.", "lear_examp": "I know that I will put you in a difficult position with my absence but I must leave."}]}]}, {"word": "difficulty", "poses": [{"pos": "noun", "senses": [{"sense": "when something is not easy to do or understand", "level": "B1", "dict_examp": "We finished the job, but only with great difficulty.", "lear_examp": "They would have difficulty in sleeping outdoors."}, {"sense": "something that is not easy to deal with", "level": "B2", "dict_examp": "financial difficulties", "lear_examp": "As you know my family has financial difficulties and we can't afford this."}]}]}, {"word": "diplomatically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that deals well with people without upsetting them", "level": "C2", "dict_examp": "He phrased his question very diplomatically.", "lear_examp": "Even though this issue is usually settled diplomatically, there still remains a considerable amount of criticism to be faced."}]}]}, {"word": "director", "poses": [{"pos": "noun", "senses": [{"sense": "an important manager in an organization or company", "level": "B1", "dict_examp": "the board of directors", "lear_examp": "It was from my school teacher and she was saying the most horrible things about the school, the director and other teachers."}, {"sense": "someone who  tells the actors in a movie or play what to do", "level": "B1", "dict_examp": "a famous film/movie director", "lear_examp": "Chan-wook Park is one of the most famous movie directors in Korea, also he has made a lot of money from his amazing movies."}]}]}, {"word": "discontent", "poses": [{"pos": "noun", "senses": [{"sense": "unhappiness about a situation", "level": "C1", "dict_examp": "There is growing discontent with governor's budget proposal.", "lear_examp": "You must know that this is a delicate moment for the Italian economy, because of the recession and unemployment problems, and the discontent with government policy has pushed many workers to go on strike."}]}]}, {"word": "disappoint", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone feel unhappy because someone or something was not as good as they had expected", "level": "B1", "dict_examp": "I'm sorry to disappoint you, but I'm afraid I can't come after all.", "lear_examp": "I've always got along very well with little kids and I'm sure I won't disappoint you."}]}]}, {"word": "discipline", "poses": [{"pos": "noun", "senses": [{"sense": "when people's behavior is controlled using rules and punishments", "level": "B2", "dict_examp": "military/school discipline", "lear_examp": "I don't know if that is because of their age, but whatever it is, I think teachers should change the methods of discipline they use."}, {"sense": "when you can control your own behavior carefully", "level": "C1", "dict_examp": "I don't have enough discipline to save money.", "lear_examp": "He's an example to be followed not only as an athlete, but also as a person who is a symbol of discipline, maturity, humility."}, {"sense": "a particular subject of study", "level": "C2", "dict_examp": "the scientific disciplines", "lear_examp": "Amongst the newly employed, people with a background in education score the highest with 79%, almost 20% more than the other two disciplines."}]}]}, {"word": "disappointed", "poses": [{"pos": "adjective", "senses": [{"sense": "unhappy because someone or something was not as good as you hoped or expected, or because something did not happen", "level": "B1", "dict_examp": "She was disappointed (that) they hadn't phoned.", "lear_examp": "I feel so disappointed."}]}]}, {"word": "disappointment", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being disappointed", "level": "B1", "dict_examp": "Book early to avoid disappointment.", "lear_examp": "However, to my disappointment, the restaurant was closed because it was being redecorated."}, {"sense": "something or someone that disappoints you", "level": "B1", "dict_examp": "The party turned out to be a big / huge / great disappointment.", "lear_examp": "It was all a big disappointment!"}]}]}, {"word": "disclose", "poses": [{"pos": "verb", "senses": [{"sense": "to give new or secret information to someone", "level": "C2", "dict_examp": "He refused to disclose details of the report.", "lear_examp": "There are so many doors left unopened and so many secrets to be disclosed!"}]}]}, {"word": "discreet", "poses": [{"pos": "adjective", "senses": [{"sense": "careful not to cause embarrassment or attract too much attention", "level": "C2", "dict_examp": "Can I trust you to be discreet?", "lear_examp": "Though he seems to keep an eye on us, he is very discreet and never impinges on our privacy."}]}]}, {"word": "discount", "poses": [{"pos": "noun", "senses": [{"sense": "a reduction in price", "level": "A2", "dict_examp": "They usually give you a discount if you buy multiple copies.", "lear_examp": "The staff get discounts on books and CDs!"}]}]}, {"word": "disadvantage", "poses": [{"pos": "noun", "senses": [{"sense": "something which makes a situation more difficult, or makes you less likely to succeed", "level": "B1", "dict_examp": "One disadvantage of living in the town is the lack of safe places for the children to play.", "lear_examp": "After that we discussed the advantages and disadvantages of public transport."}, {"sense": "having problems that other people do not have", "level": "C2", "dict_examp": "Being shy puts him at a disadvantage.", "lear_examp": "These children are also at a disadvantage in terms of education, they may not be able to go to good school, engage in extracurricular activities like sports and music which can be quite expensive if you are living on a budget."}]}]}, {"word": "disappear", "poses": [{"pos": "verb", "senses": [{"sense": "to become impossible to see", "level": "B1", "dict_examp": "The sun disappeared behind a cloud.", "lear_examp": "They saw my mother's shadow on the stairs and disappeared."}, {"sense": "to become impossible to find", "level": "B1", "dict_examp": "She disappeared from her home over a month ago.", "lear_examp": "I noticed that my wallet had disappeared."}, {"sense": "to no longer exist", "level": "B2", "dict_examp": "These flowers are disappearing from our countryside.", "lear_examp": "It seems that the decorative role of clothes will have disappeared by the year 2050."}]}]}, {"word": "directly", "poses": [{"pos": "adverb", "senses": [{"sense": "with no other person or thing involved or in between", "level": "B1", "dict_examp": "Our hotel room was directly above a building site.", "lear_examp": "The Youth Hostel was directly beside the sea."}, {"sense": "clearly and honestly", "level": "B2", "dict_examp": "Let me answer that question directly.", "lear_examp": "While being interviewed, try to answer the questions directly and look into the interviewer's eyes."}]}]}, {"word": "disapprove", "poses": [{"pos": "verb", "senses": [{"sense": "to feel that something or someone is bad or wrong", "level": "B2", "dict_examp": "The survey showed that 32% of respondents approve, 54% disapprove and the rest are undecided.", "lear_examp": "Since the system has more disadvantages than advantages, I disapprove of  the \"open 24 hours a day, seven days a week\" system."}]}]}, {"word": "disastrous", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely bad", "level": "C1", "dict_examp": "disastrous consequences", "lear_examp": "Some may altogether give up their studies, which I think is a disastrous move."}]}]}, {"word": "discourage", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone less confident or enthusiastic about something", "level": "B2", "dict_examp": "The thought of how much work she had to do discouraged her.", "lear_examp": "It should include the prices of the tickets. If not, it will discourage people."}, {"sense": "to try to persuade someone not to do something", "level": "B2", "dict_examp": "We tried to discourage him from spending so much money.", "lear_examp": "I believe this kind of comments and incorrect information will discourage people from attending cultural events."}, {"sense": "to try to prevent something from happening", "level": "C2", "dict_examp": "Higher taxes could discourage business investment.", "lear_examp": "The truth their argument holds is overshadowed by the deteriorating conditions of living in the cities where frequent police patrols or stricter laws don't seem to discourage thefts."}]}]}, {"word": "disadvantaged", "poses": [{"pos": "adjective", "senses": [{"sense": "Disadvantaged people are poor and do not have many opportunities.", "level": "C1", "dict_examp": "economically disadvantaged children", "lear_examp": "Therefore, there are several ways in which these people are becoming more and more disadvantaged."}]}]}, {"word": "disagreement", "poses": [{"pos": "noun", "senses": [{"sense": "when people have a different opinion about something or have an argument", "level": "B2", "dict_examp": "They had a disagreement about/over money.", "lear_examp": "I am writing to express my disagreement with your article \"Failure of Festival\", as I attended the festival last weekend."}]}]}, {"word": "disapproval", "poses": [{"pos": "noun", "senses": [{"sense": "when you think that someone or something is bad or wrong", "level": "C1", "dict_examp": "I could sense their disapproval.", "lear_examp": "I am writing to express my disapproval of the deplorable service experienced in your museum."}]}]}, {"word": "disaster", "poses": [{"pos": "noun", "senses": [{"sense": "something that causes great harm or damage", "level": "B2", "dict_examp": "An investigation was ordered into the recent train disaster.", "lear_examp": "Secondly, we have to save our planet from disaster."}, {"sense": "something that is a failure or has a negative result", "level": "B2", "dict_examp": "His idea was a total disaster.", "lear_examp": "We were freezing. And this combined with the rain made the last day a complete disaster."}]}]}, {"word": "disappointing", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel disappointed", "level": "B1", "dict_examp": "What a disappointing performance/conclusion!", "lear_examp": "I started my new English class last week, which was a really disappointing experience since the teacher was not a native speaker."}]}]}, {"word": "dirty", "poses": [{"pos": "adjective", "senses": [{"sense": "not clean", "level": "A2", "dict_examp": "Her face was dirty and tear stained.", "lear_examp": "Please bring two aprons or our clothes will get dirty."}]}]}, {"word": "disappearance", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something disappears", "level": "B2", "dict_examp": "A man was being questioned in connection with her disappearance.", "lear_examp": "After his disappearance lots of people were looking for him and in the end they tracked him down!"}]}]}, {"word": "disc jockey", "poses": [{"pos": "noun", "senses": [{"sense": "someone who plays music on the radio or at live events", "level": "B1", "dict_examp": "a radio disc jockey", "lear_examp": "I found out that there would be a special event with disc jockeys like DJ Quicksilver."}]}]}, {"word": "dirt", "poses": [{"pos": "noun", "senses": [{"sense": "dust, soil or any substance that makes a surface not clean", "level": "B1", "dict_examp": "His coat was covered with dirt.", "lear_examp": "Maybe in the future they'll find a new fabric which protects you from dirt and dangerous sunshine."}]}]}, {"word": "disabled", "poses": [{"pos": "adjective", "senses": [{"sense": "having an illness, injury or condition that makes it difficult to do the things that most people do", "level": "B1", "dict_examp": "The accident left him severely disabled.", "lear_examp": "I have done a lot of work looking after disabled people in the local area."}]}]}, {"word": "directory", "poses": [{"pos": "noun", "senses": [{"sense": "a book or list of names, numbers, or other facts", "level": "C1", "dict_examp": "I found your address in the school directory.", "lear_examp": "If you'd like to know more, look at the phone book (directory); you'll find 3 or 4 pages about how to phone, how to dial, how to get numbers etc. in English."}]}]}, {"word": "discomfort", "poses": [{"pos": "noun", "senses": [{"sense": "a physically uncomfortable situation", "level": "C1", "dict_examp": "They traveled in great discomfort.", "lear_examp": "In view of this, I expect full reimbursement of the cost. and compensation for the discomfort the students suffered."}, {"sense": "slight pain", "level": "C2", "dict_examp": "You may feel some discomfort for a few days.", "lear_examp": "As we live longer, the natural weakening of our bodies causes us increasing discomfort and pain, restricting our abilities."}, {"sense": "when you feel slightly embarrassed or anxious", "level": "C2", "dict_examp": "I could see that the talk of divorce was causing her some discomfort.", "lear_examp": "A feeling of discomfort is emerging in society, where the homeless feel upset and the rich feel guilty for spending their money on luxurious things."}]}]}, {"word": "discrimination", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is treated unfairly because of their sex, race, religion, etc.", "level": "C1", "dict_examp": "racial/age/gender discrimination", "lear_examp": "I firmly believe that gender discrimination should be avoided and children should attend a mixed schools."}]}]}, {"word": "discuss", "poses": [{"pos": "verb", "senses": [{"sense": "to talk about something with someone and tell each other your ideas or opinions", "level": "A2", "dict_examp": "Have you discussed this matter with anyone else?", "lear_examp": "When we meet, we usually watch a science fiction film, then we discuss it."}]}]}, {"word": "discretion", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is careful not to cause embarrassment or attract too much attention, especially by keeping something secret", "level": "C2", "dict_examp": "You can rely on my discretion.", "lear_examp": "While it's their right to make the most of what they get, TV companies should also exercise a reasonable amount of discretion and tact."}]}]}, {"word": "disagree", "poses": [{"pos": "verb", "senses": [{"sense": "to have a different opinion than someone else about something", "level": "B1", "dict_examp": "I disagree with most of what he said.", "lear_examp": "We saw \"Harry Potter\" and the film was good but I think the book is better. Carlos disagreed with me."}]}]}, {"word": "discover", "poses": [{"pos": "verb", "senses": [{"sense": "to find out something or to find a place or an object, especially for the first time", "level": "B1", "dict_examp": "Who discovered America?", "lear_examp": "I have discovered that horses are wonderful animals."}]}]}, {"word": "disco", "poses": [{"pos": "noun", "senses": [{"sense": "a place or event where people dance to pop music", "level": "A2", "dict_examp": "disco lights", "lear_examp": "I think Saturday will be the best for me and then we can go to a disco."}]}]}, {"word": "discriminate", "poses": [{"pos": "verb", "senses": [{"sense": "to treat someone unfairly because of their sex, race, religion, etc.", "level": "C1", "dict_examp": "The company was accused of discriminating against people on the basis of age.", "lear_examp": "Firstly, the disadvantage of this policy is that it discriminates against the poor."}, {"sense": "to notice a difference between two things", "level": "C2", "dict_examp": "Police dogs are very good at discriminating between different smells.", "lear_examp": "Others do not discriminate between different types of knowledge, but rather read anything that could intellectually increase their perception of the world around them."}]}]}, {"word": "disability", "poses": [{"pos": "noun", "senses": [{"sense": "an illness, injury or condition that makes it difficult for someone to do the things that other people do", "level": "B2", "dict_examp": "a physical/learning disability", "lear_examp": "Such problems as cancer, heart attack, or mental disability are very likely to bother you in the future."}]}]}, {"word": "discovery", "poses": [{"pos": "noun", "senses": [{"sense": "when someone discovers something", "level": "B2", "dict_examp": "the discovery of electricity", "lear_examp": "How will this affect our lifestyles and homes in the future if scientists go on making new discoveries?"}, {"sense": "something or someone that is discovered", "level": "C1", "dict_examp": "I've made a great discovery!", "lear_examp": "My second discovery is a more serious one. After thirty years since its premiere, \"Macbeth\" sees its first release on video."}]}]}, {"word": "dismissal", "poses": [{"pos": "noun", "senses": [{"sense": "when someone refuses to consider an idea or opinion", "level": "C1", "dict_examp": "I was angered by his dismissal of my worries.", "lear_examp": "Their dismissal of our proposal was essentially because of our lack of worldwide investments; as everybody knows, we fundamentally concentrate our assets inside the European Union boundaries."}, {"sense": "when an employer officially makes someone leave their job", "level": "C1", "dict_examp": "a letter of dismissal", "lear_examp": "Another episode of this sort is when Miss K. threatens to leave Darlington Hall because of the dismissal of the two Jewish maids."}]}]}, {"word": "disposable income", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of money that you have available to spend after tax, rent and other basic things that you must pay", "level": "C2", "dict_examp": "Most of our customers have a large disposable income.", "lear_examp": "It's true that people have more disposable income than ever, but surprisingly, people also have more debts."}]}]}, {"word": "disk", "poses": [{"pos": "noun", "senses": [{"sense": "a CD", "level": "B1", "dict_examp": "Both songs are on their latest disk.", "lear_examp": "At last would you tell us which is the best present for him a compact disk or a book."}, {"sense": "a piece of computer equipment that records and stores information electronically", "level": "B1", "dict_examp": "the hard disk", "lear_examp": "I bought a brand new, state of the art computer which is equipped with a 300 Mhz PENTIUM Processor, a 300 GB hard disk, a 17\" monitor and so on."}, {"sense": "a flat, round shape or object", "level": "B2", "dict_examp": "The dog had a small, metal disk attached to its collar.", "lear_examp": ""}, {"sense": "a piece of cartilage  between the bones in your back", "level": "C2", "dict_examp": "a slipped disk", "lear_examp": "As a matter of fact, living off sports is rather precarious, as you cannot predict when, due to a torn ligament or a slipped disk, you will be doomed to sink into oblivion."}]}]}, {"word": "dishwasher", "poses": [{"pos": "noun", "senses": [{"sense": "a machine that washes dirty plates, cups, forks, etc.", "level": "B1", "dict_examp": "I was just loading the dishwasher.", "lear_examp": "Finally, modern technology has changed my way of spending the free time that is provided by household appliances such as the dishwasher and the washing machine."}]}]}, {"word": "displace", "poses": [{"pos": "verb", "senses": [{"sense": "to take the place of someone or something", "level": "C1", "dict_examp": "Many of these workers will be displaced by modern technology.", "lear_examp": "Mexico was traditionally the land of the tortilla and the beans, but every day, this seems to be changing ever more rapidly, displaced by the heavy advertising campaigns and Americanized habits."}]}]}, {"word": "disorganized", "poses": [{"pos": "adjective", "senses": [{"sense": "not planned or organized well", "level": "B2", "dict_examp": "The whole conference was totally disorganized - nobody knew what they were supposed to be doing.", "lear_examp": "Even though it was rather disorganized, most of the audience seemed to be pleased with it."}, {"sense": "not good at planning or organizing things", "level": "B2", "dict_examp": "He's impossible to work for - he's so disorganized.", "lear_examp": "People get disorganized in their financial budgeting because of too much shopping."}]}]}, {"word": "displacement", "poses": [{"pos": "noun", "senses": [{"sense": "the act of displacing something", "level": "C1", "dict_examp": "Widespread flooding has led to the displacement of thousands of people.", "lear_examp": "Apart from the fact that population growth is also playing its role, the reason for the enormously increased size of cities is the displacement of people from rural areas to the cities."}]}]}, {"word": "disease", "poses": [{"pos": "noun", "senses": [{"sense": "(an) illness caused by infection or by a failure of health rather than by an accident", "level": "B1", "dict_examp": "heart disease", "lear_examp": "I was worried about her incurable disease."}]}]}, {"word": "dishonesty", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is not honest", "level": "B2", "dict_examp": "Her dishonesty landed her in prison.", "lear_examp": "He  is so open in his dishonesty that Mary can't be angry with him."}]}]}, {"word": "dismay", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of unhappiness and disappointment", "level": "C2", "dict_examp": "To our dismay, it started raining.", "lear_examp": "Much to our dismay, we could not find either his mother or his father."}]}]}, {"word": "discussion", "poses": [{"pos": "noun", "senses": [{"sense": "when people talk about something and tell each other their ideas or opinions", "level": "B1", "dict_examp": "They were having a discussion about football.", "lear_examp": "Jane told us something about the Civil War and after that we had a discussion about the rights of black people in those days."}]}]}, {"word": "display", "poses": [{"pos": "noun", "senses": [{"sense": "a collection of objects or pictures arranged for people to look at", "level": "B1", "dict_examp": "a display of children's paintings", "lear_examp": "I decided to visit a museum which has a special display on Friday."}, {"sense": "If something is on display, it is there for people to look at.", "level": "B1", "dict_examp": "Many old airplanes are on display at the museum.", "lear_examp": "There were some new musical instruments on display."}, {"sense": "when something is shown electronically such as on a computer screen", "level": "B1", "dict_examp": "The display problems might be due to a shortage of disk space.", "lear_examp": "The phone has many facilities like games and color display."}, {"sense": "a performance or show for people to watch", "level": "B2", "dict_examp": "a fireworks display", "lear_examp": "Lastly, the fireworks display was wonderful and there were more than 5000 spectators who enjoyed themselves."}, {"sense": "when someone behaves in a way that shows they have a particular feeling or attitude", "level": "C2", "dict_examp": "The politicians shook hands in a display of unity for the media.", "lear_examp": "That is the reason why Charles is annoyed by her occasional urgent displays of affection."}]}, {"pos": "verb", "senses": [{"sense": "to arrange something somewhere so that people can see it", "level": "B1", "dict_examp": "Family photographs were displayed on the wall.", "lear_examp": "The problem with some museums is that the way in which the pieces of art are displayed is not right."}, {"sense": "to show something electronically such as on a computer screen", "level": "B2", "dict_examp": "The text can be displayed and edited on screen.", "lear_examp": "The timetable is hidden somewhere in a submenu which, I think, should be displayed on the main page."}, {"sense": "to show how you feel by your expression or behavior", "level": "C2", "dict_examp": "He doesn’t display much emotion.", "lear_examp": "The above feeling demonstrates about Okonkwo his constant anxiety to demonstrate - he and his son - constant manliness and to not display any feeling of love, gentleness and support even to his own children."}]}]}, {"word": "disloyal", "poses": [{"pos": "adjective", "senses": [{"sense": "not loyal or not supporting someone who you should support", "level": "C2", "dict_examp": "I don't want to be disloyal to my friend.", "lear_examp": "These stories always have a happy ending: those who are faithful and reliable are rewarded but those who cause pain or are disloyal are punished."}]}]}, {"word": "disgust", "poses": [{"pos": "noun", "senses": [{"sense": "a very strong feeling of dislike or disapproval", "level": "C2", "dict_examp": "She walked out in disgust.", "lear_examp": "But even real game lovers regularly express their disgust about the lack of interest with which many heavily overpaid players hang around on the field during a match."}]}]}, {"word": "disgusted", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling extreme dislike or disapproval of something", "level": "C1", "dict_examp": "I'm totally disgusted with your behavior.", "lear_examp": "They are often disappointed or even disgusted with the kind of jobs they were made do, like washing dishes or working on the farm."}]}]}, {"word": "disgusting", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely unpleasant or unacceptable", "level": "B1", "dict_examp": "It's disgusting that there are no schools or hospitals for these people.", "lear_examp": "Personally I don't like the special food that they do sometimes, because it's disgusting."}]}]}, {"word": "dishonestly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a dishonest way", "level": "C1", "dict_examp": "She acted dishonestly.", "lear_examp": "The prize is valueless if achieved dishonestly."}]}]}, {"word": "dish", "poses": [{"pos": "noun", "senses": [{"sense": "a curved container for eating and serving food from", "level": "A2", "dict_examp": "an oven-proof dish", "lear_examp": "You should be able to serve it in dishes or glasses."}, {"sense": "food prepared in a particular way as part of a meal", "level": "A2", "dict_examp": "a chicken/vegetarian dish", "lear_examp": "I like rice and sweet dishes."}, {"sense": "dirty plates, bowls and other objects that have been used for cooking or eating food", "level": "A2", "dict_examp": "Who's going to do/wash the dishes?", "lear_examp": "Because after dinner I washed the dishes, so I put my ring on the table."}]}]}, {"word": "disgrace", "poses": [{"pos": "noun", "senses": [{"sense": "when someone does something very bad that makes people stop respecting them or their family, team, etc.", "level": "B2", "dict_examp": "They were sent home in disgrace.", "lear_examp": "When we came back, it felt like we were sinking into a miserable life, full of disgrace."}, {"sense": "to be very bad", "level": "B2", "dict_examp": "It's a disgrace that money is being wasted like this.", "lear_examp": "The park is really a disgrace."}, {"sense": "to be so bad or unacceptable that you make people stop respecting a particular group, activity, etc.", "level": "C2", "dict_examp": "You are a disgrace to your profession.", "lear_examp": "It's a disgrace to mankind!"}]}]}, {"word": "dislike", "poses": [{"pos": "verb", "senses": [{"sense": "to not like someone or something", "level": "B1", "dict_examp": "Why do you dislike her so much?", "lear_examp": "I generally prefer reading newspapers, but I don't dislike books."}]}, {"pos": "noun", "senses": [{"sense": "things that you do and do not like", "level": "B1", "dict_examp": "What are your top five likes and dislikes?", "lear_examp": "The teacher asked about our families, friends, and likes and dislikes and then the lesson finished."}, {"sense": "when you do not like someone or something", "level": "B2", "dict_examp": "a dislike of cold weather", "lear_examp": "The main reason for my dislike is that it's so unnatural."}]}]}, {"word": "disguise", "poses": [{"pos": "noun", "senses": [{"sense": "clothes and other things that you wear to change the way you look so that people cannot recognize you", "level": "B2", "dict_examp": "She usually goes out in disguise to avoid being bothered by the public.", "lear_examp": "There will be a big parade in the first week of the month with people in disguise."}]}, {"pos": "verb", "senses": [{"sense": "to give a new appearance to a person or thing, especially in order to hide its true form", "level": "B2", "dict_examp": "He disguised himself by shaving his head and wearing a false beard.", "lear_examp": "This writer that we are going to welcome is a brilliant woman, because she had the courage to disguise herself as an immigrant to see and to feel how those poor and miserable Turkish immigrants live in Germany."}, {"sense": "to hide something such as a feeling or opinion", "level": "C2", "dict_examp": "She couldn't disguise her disappointment.", "lear_examp": "She started as a secretary, carefully disguising her talent and energy, just to land the job."}]}]}, {"word": "dishonest", "poses": [{"pos": "adjective", "senses": [{"sense": "not honest and likely to lie or do something illegal", "level": "B2", "dict_examp": "a dishonest lawyer", "lear_examp": "Both of them are dishonest men: Joss organizes the smuggling,  and Jem is a horse-thief."}]}]}, {"word": "disillusioned", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling disappointed because something is not as good as you thought it was", "level": "C2", "dict_examp": "She says she's disillusioned with the music business.", "lear_examp": "They were disappointed and disillusioned."}]}]}, {"word": "disorder", "poses": [{"pos": "noun", "senses": [{"sense": "an illness or medical condition", "level": "C1", "dict_examp": "a mental/physical disorder", "lear_examp": "We should react at an early stage of an eating disorder by watching ourselves, consulting a doctor and going to the fitness center."}, {"sense": "uncontrolled, bad behavior, especially by large groups of people", "level": "C1", "dict_examp": "crime and disorder", "lear_examp": "Although the transport facilities are good, the neighborhood has become increasingly dangerous, with numerous incidents of attacks and public disorder."}, {"sense": "when things are untidy or confused and not organized", "level": "C2", "dict_examp": "His finances are in complete disorder.", "lear_examp": "My home might, to an outsider, give the feeling of complete disorder, not to say craziness, but I can assure you that it was not true at all."}]}]}, {"word": "disposable", "poses": [{"pos": "adjective", "senses": [{"sense": "intended to be used only once and then thrown away", "level": "C2", "dict_examp": "a disposable camera/razor", "lear_examp": "One drawback is the usage of disposable knives, forks and plates, which shouldn't be used nowadays."}]}]}, {"word": "disposal", "poses": [{"pos": "noun", "senses": [{"sense": "when you get rid of something, especially by throwing it away", "level": "B2", "dict_examp": "waste disposal", "lear_examp": "Nowadays waste disposal and environmental protection has become one of the most important questions of our life in a world with environmental catastrophes."}, {"sense": "available for you to use at any time", "level": "B2", "dict_examp": "We will have a car at our disposal for the whole trip.", "lear_examp": "But on Wednesday morning I'm at your disposal."}]}]}, {"word": "dismiss", "poses": [{"pos": "verb", "senses": [{"sense": "to refuse to consider an idea or opinion", "level": "C1", "dict_examp": "Let’s not dismiss the idea without discussing it.", "lear_examp": "That is why I would dismiss this facility: there is already a small video room in our school which is hardly ever used."}, {"sense": "to officially make someone leave their job", "level": "C1", "dict_examp": "He arrived late every day and was eventually dismissed.", "lear_examp": "What's more, every day hundreds of workmen are dismissed and thereby the ratio of unemployment still increases."}]}]}, {"word": "dissatisfied", "poses": [{"pos": "adjective", "senses": [{"sense": "not pleased or happy with something", "level": "B2", "dict_examp": "If you're dissatisfied with the service, why don't you complain to the hotel manager?", "lear_examp": "However, I must say that museums are really useful, to understand the history of the world, and that's why people keep going there even though they're sometimes dissatisfied."}]}]}, {"word": "disturb", "poses": [{"pos": "verb", "senses": [{"sense": "to interrupt what someone is doing by making noise or annoying them", "level": "B2", "dict_examp": "Please don't disturb Georgina - she's trying to do her homework.", "lear_examp": "If we go outdoors we won't disturb my parents."}, {"sense": "to make someone feel anxious or upset", "level": "C2", "dict_examp": "Some scenes are violent and may disturb younger viewers.", "lear_examp": "What disturbed me, and made me stop cleaning all together, was when one of them said, quote: \"I want to earn lots of money - that's all I care about,\" end quote."}]}]}, {"word": "district", "poses": [{"pos": "noun", "senses": [{"sense": "a part of a city or country, either an official area or one that is known for having a particular feature or characteristic", "level": "B1", "dict_examp": "the 23rd Congressional District Council", "lear_examp": "I recommend you go from one district to another by public transport."}]}]}, {"word": "disturbed", "poses": [{"pos": "adjective", "senses": [{"sense": "not thinking or behaving normally because of mental or emotional problems", "level": "C2", "dict_examp": "He is a very disturbed child.", "lear_examp": "James tore at his neatly trimmed hair, revealing how disturbed he was."}]}]}, {"word": "disrespectful", "poses": [{"pos": "adjective", "senses": [{"sense": "being rude and not showing any respect", "level": "C2", "dict_examp": "Don't be disrespectful to your mother.", "lear_examp": "I am afraid I totally disagree since this attitude is disrespectful toward our architecture."}]}]}, {"word": "disrespect", "poses": [{"pos": "noun", "senses": [{"sense": "when someone does not show respect or behave politely toward someone or something", "level": "C1", "dict_examp": "She apologized for not responding to the letter and said she had meant no disrespect.", "lear_examp": "Sometimes competition leads to fights and disrespect."}]}]}, {"word": "distinguished", "poses": [{"pos": "adjective", "senses": [{"sense": "famous, praised, or admired", "level": "B2", "dict_examp": "a distinguished writer", "lear_examp": "One of HuXin Ting's most distinguished visitors in recent times was Queen Elizabeth II, whose tour of Shanghai included a stop here and a cup of tea."}]}]}, {"word": "distinctive", "poses": [{"pos": "adjective", "senses": [{"sense": "Something that is distinctive is easy to recognize because it is different from other things.", "level": "C1", "dict_examp": "a distinctive style of writing", "lear_examp": "But their most distinctive feature is their carefree manner of walking, taking their time and actually looking at the buildings, the people, the landscapes."}]}]}, {"word": "disqualify", "poses": [{"pos": "verb", "senses": [{"sense": "to stop someone from being in a competition or doing some other activity because they have done something wrong", "level": "C2", "dict_examp": "She was disqualified from the race after a drugs test.", "lear_examp": "Also a member who is not paying the contributions to the SOE club will be disqualified from it."}]}]}, {"word": "distort", "poses": [{"pos": "verb", "senses": [{"sense": "to change information so that it is not true or realistic", "level": "C1", "dict_examp": "Newspapers distorted the truth about their marriage.", "lear_examp": "The report distorted this figure to \"less than 60%\"."}]}]}, {"word": "distance", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of space between two places", "level": "B1", "dict_examp": "What's the distance between Madrid and Barcelona/from Madrid to Barcelona?", "lear_examp": "There are also caves to explore a short distance away."}, {"sense": "somewhere that is far away, but close enough for you to see or hear the things that are there", "level": "B2", "dict_examp": "I could see Mary in the distance.", "lear_examp": "Far in the distance they spotted another ship."}]}]}, {"word": "distinction", "poses": [{"pos": "noun", "senses": [{"sense": "a difference between two similar things", "level": "B2", "dict_examp": "the distinction between spoken and written language", "lear_examp": "You must be able to make a distinction between wild and ferocious species and small animals."}, {"sense": "a quality or fact that makes someone or something special or different", "level": "C2", "dict_examp": "He is a scientist of great distinction.", "lear_examp": "In the end what really made her so successful was her famous Tailleur sign of elegance and distinction and her well-known perfume, Chanel no. 5."}]}]}, {"word": "distant", "poses": [{"pos": "adjective", "senses": [{"sense": "far away", "level": "B2", "dict_examp": "a distant country", "lear_examp": "A distant rumbling could be heard through the thick layers of rock that she was under."}, {"sense": "not friendly", "level": "C1", "dict_examp": "She seemed cold and distant.", "lear_examp": "I like the idea of joining a lively team; being a gregarious person I need a change from the cold and distant treatment which is usual in the big department stores."}, {"sense": "A distant relative is not very closely related to you.", "level": "C2", "dict_examp": "a distant cousin", "lear_examp": "Sometimes it's difficult to welcome a distant cousin who we've never heard of before, even though our mother remembers him perfectly."}]}]}, {"word": "disturbance", "poses": [{"pos": "noun", "senses": [{"sense": "something that interrupts what you are doing, especially something loud or annoying", "level": "C1", "dict_examp": "I don't want any disturbances this morning.", "lear_examp": "I think the provision of a children's section will also solve, or at least minimize, the disturbance caused by the kids."}, {"sense": "when people fight or shout", "level": "C2", "dict_examp": "A man was hurt during a disturbance outside city hall.", "lear_examp": "Social disturbances are also a result of unemployment."}]}]}, {"word": "distressed", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely upset or worried", "level": "C1", "dict_examp": "They were very distressed to learn of her death.", "lear_examp": "I was distressed to discover that your advertisement was inaccurate."}]}]}, {"word": "disposed", "poses": [{"pos": "adjective", "senses": [{"sense": "to be willing or likely to do something", "level": "C2", "dict_examp": "I tried to tell her but she didn't seem disposed to listen.", "lear_examp": "In my opinion, it is very important to make young children respect rules strictly, but, on the other hand, I would always be disposed to explain the rules of society to my children as they grow older."}]}]}, {"word": "distribution", "poses": [{"pos": "noun", "senses": [{"sense": "when something is supplied or given out to people or places", "level": "C1", "dict_examp": "the sale and distribution of electronic equipment", "lear_examp": "During the economic slowdown throughout the 1980s, the use of railroads for goods transport dropped significantly (about 50%) while terrestrial and water transport provided cheaper and more effective means of distribution."}, {"sense": "the way something is divided and shared in a group or area", "level": "C1", "dict_examp": "the distribution of wealth", "lear_examp": "Poverty, domestic problems and an uneven distribution of wealth in the community make such children bitter and instead of working hard, they become rebellious and try to look for short cuts to gain money and comfort."}]}]}, {"word": "disposition", "poses": [{"pos": "noun", "senses": [{"sense": "the type of character someone has", "level": "C2", "dict_examp": "a cheerful/nervous disposition", "lear_examp": "She is a really special girl with personal values and a really sweet disposition."}]}]}, {"word": "dispose", "poses": [{"pos": "verb", "senses": [{"sense": "to get rid of something, especially by throwing it away", "level": "C1", "dict_examp": "I need to dispose of these old clothes.", "lear_examp": "I would like to suggest topics on effective waste management or on how we should properly dispose of our garbage."}]}]}, {"word": "dissolve", "poses": [{"pos": "verb", "senses": [{"sense": "to end an organization or official arrangement", "level": "C1", "dict_examp": "Their marriage was dissolved in 1996.", "lear_examp": "Now, the Parliament is dissolved and we are waiting for new elections."}, {"sense": "If a solid dissolves, it becomes part of a liquid, and if you dissolve it, you make it become part of a liquid.", "level": "C2", "dict_examp": "These tablets dissolve in water.", "lear_examp": ""}]}]}, {"word": "distraction", "poses": [{"pos": "noun", "senses": [{"sense": "something that makes you stop giving your attention to something else", "level": "C1", "dict_examp": "The phone calls were a constant distraction.", "lear_examp": "This would have the additional advantage of helping them to concentrate on their job without any distraction."}, {"sense": "an activity you can do for fun or entertainment", "level": "C1", "dict_examp": "He is studying too much and needs some distractions.", "lear_examp": "Swiss people are workaholics; they sacrifice their free time to earn money, although occasionally they need some kind of distraction."}]}]}, {"word": "distribute", "poses": [{"pos": "verb", "senses": [{"sense": "to give something out to several people", "level": "B2", "dict_examp": "The books will be distributed free to local schools.", "lear_examp": "I also had to distribute the flyers at the concert."}, {"sense": "to supply goods to shops and companies", "level": "C1", "dict_examp": "The company manufactures and distributes computer equipment worldwide.", "lear_examp": "Our company imports all the merchandise from the Far East and then distributes those products in high quantities to different customers."}]}]}, {"word": "distinguish", "poses": [{"pos": "verb", "senses": [{"sense": "to recognize the differences between two people, ideas or things", "level": "B2", "dict_examp": "He's colorblind and can't distinguish (the difference) between red and green easily.", "lear_examp": "This is the scene where in a card game between pig Napoleon and human Pilkington, the other animals, who secretly watch the game through the window, find it impossible to distinguish between pigs and humans."}, {"sense": "to make one person or thing seem different from another", "level": "B2", "dict_examp": "His great skill distinguishes him from the rest of the team.", "lear_examp": "A person distinguishes himself from others by different tastes, manners, characters."}, {"sense": "to be able to see, hear or understand something", "level": "B2", "dict_examp": "I couldn't distinguish anything in the darkness.", "lear_examp": "I could distinguish nothing in the darkness and was scared to death."}]}]}, {"word": "dispute", "poses": [{"pos": "noun", "senses": [{"sense": "a disagreement, especially one that lasts a long time", "level": "C2", "dict_examp": "He and his neighbor have a long-running dispute over noise.", "lear_examp": "In former times these territorial and religious disputes resulted in a decrease in population."}]}, {"pos": "verb", "senses": [{"sense": "to disagree with something someone says", "level": "C2", "dict_examp": "I don’t dispute that his films are entertaining.", "lear_examp": "Nobody disputes nowadays the importance of learning another language and the advantages that this knowledge provides in adult life."}]}]}, {"word": "distract", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone stop giving their attention to something", "level": "B2", "dict_examp": "Don't distract her from her studies.", "lear_examp": "Television is not always useful because it distracts our mind from other things."}]}]}, {"word": "dissertation", "poses": [{"pos": "noun", "senses": [{"sense": "a very long piece of writing done as part of a course of study", "level": "C1", "dict_examp": "She's writing a dissertation on American poetry.", "lear_examp": "I have completed my dissertation work on antifungal studies."}]}]}, {"word": "disruption", "poses": [{"pos": "noun", "senses": [{"sense": "when something is stopped from happening as it should", "level": "C1", "dict_examp": "a disruption of services", "lear_examp": "Please also advise if there are evening or weekend courses, so I can attend them without any disruption to my main work."}]}]}, {"word": "distinct", "poses": [{"pos": "adjective", "senses": [{"sense": "different and separate", "level": "C1", "dict_examp": "This word has three distinct meanings.", "lear_examp": "However, two distinct groups of employees, namely the molecular dynamics simulation group and the Drawing Section, are indeed hampered in their daily work due to old equipment."}, {"sense": "clear and certain", "level": "C1", "dict_examp": "There's been a distinct improvement in your work.", "lear_examp": "So, getting married, either in your thirties or when younger, has distinct advantages."}, {"sense": "easy to hear, see, or smell", "level": "C2", "dict_examp": "The voices gradually became louder and more distinct.", "lear_examp": "On these occasions it is quite possible to distinguish a distinct smell of kerosene."}]}]}, {"word": "distress", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being extremely upset or worried", "level": "C1", "dict_examp": "The newspaper reports caused her a great deal of distress.", "lear_examp": "I am constantly praised for the quality of my work and I get personal satisfaction helping people in emotional distress."}, {"sense": "when someone or something is in danger and needs help", "level": "C2", "dict_examp": "a ship in   distress", "lear_examp": "Let's start this process by helping and caring for the people in distress and providing them with what we can."}]}]}, {"word": "distressing", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel extremely worried or upset", "level": "B2", "dict_examp": "distressing news", "lear_examp": "If you confront a distressing situation try to compensate for it with a relaxing activity."}]}]}, {"word": "disposal", "poses": [{"pos": "noun", "senses": [{"sense": "when you get rid of something, especially by throwing it away", "level": "B2", "dict_examp": "waste disposal", "lear_examp": "Nowadays waste disposal and environmental protection has become one of the most important questions of our life in a world with environmental catastrophes."}, {"sense": "available for you to use at any time", "level": "B2", "dict_examp": "We will have a car at our disposal for the whole trip.", "lear_examp": "But on Wednesday morning I'm at your disposal."}]}]}, {"word": "dissatisfaction", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is dissatisfied", "level": "B2", "dict_examp": "At the moment she's experiencing a lot of dissatisfaction with                         her job.", "lear_examp": "I expect a full refund plus compensation for my dissatisfaction and discomfort which I suffered."}]}]}, {"word": "disrupt", "poses": [{"pos": "verb", "senses": [{"sense": "to interrupt something and stop it continuing as it should", "level": "B2", "dict_examp": "A heavy snowfall had disrupted the city's transportation system.", "lear_examp": "Tea and coffee disrupt The Nerve System."}]}]}, {"word": "disruptive", "poses": [{"pos": "adjective", "senses": [{"sense": "causing problems that interrupt something and stop it continuing as it should", "level": "C2", "dict_examp": "disruptive behavior", "lear_examp": "It can be very disruptive for families with children if one of the parents moves abroad for several months, maybe only coming home every other weekend or so."}]}]}, {"word": "DNA", "poses": [{"pos": "noun", "senses": [{"sense": "deoxyribonucleic acid; a chemical in the cells of living things which contains genetic information", "level": "C2", "dict_examp": "DNA evidence led to her arrest.", "lear_examp": "All these things have a common root: the discovery of the structure of the DNA by Watson and Crick."}]}]}, {"word": "dive", "poses": [{"pos": "verb", "senses": [{"sense": "If you dive into water, you enter it headfirst with your arms held out above your head.", "level": "B1", "dict_examp": "They ran to the pool, dove in, and swam to the other side.", "lear_examp": "I know how to swim and dive from high places."}, {"sense": "to swim under water, usually with breathing equipment", "level": "B1", "dict_examp": "I like to go somewhere on vacation where I can dive.", "lear_examp": "I'm sure that she will be a wonderful guide. I'll ask her to take me to shop, to dive, and to surf."}, {"sense": "to start doing something suddenly and energetically, often without stopping to think", "level": "C2", "dict_examp": "Unfortunately, I dove into the discussion without being fully informed.", "lear_examp": "Firstly, it is possible for me to dive into a whole new world - personally, socially and professionally - without losing myself."}]}, {"pos": "noun", "senses": [{"sense": "when you enter water headfirst with your arms held out above your head", "level": "B2", "dict_examp": "He entered the pool with a neat dive.", "lear_examp": ""}, {"sense": "when you spend some time swimming under water", "level": "B2", "dict_examp": "The center also offers night dives, which I highly recommend.", "lear_examp": "It will start with a medical test, a few hours of theory, some training dives in a swimming pool and, at last, two dives on the reef."}]}]}, {"word": "diverse", "poses": [{"pos": "adjective", "senses": [{"sense": "varied or different", "level": "B2", "dict_examp": "Students from countries as diverse as Colombia and Lithuania use Cambridge textbooks.", "lear_examp": "I am a sociable person who has been exposed to diverse social circumstances."}]}]}, {"word": "diver", "poses": [{"pos": "noun", "senses": [{"sense": "someone who swims under water, usually with breathing equipment", "level": "B1", "dict_examp": "a deep-sea diver", "lear_examp": "I've got the qualification of \"open water diver''."}]}]}, {"word": "dizzy", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling as if everything is turning round, so that you feel ill or as if you might fall", "level": "B2", "dict_examp": "Going without sleep for a long time makes me feel dizzy and lightheaded.", "lear_examp": "She felt a little bit dizzy."}]}]}, {"word": "divorced", "poses": [{"pos": "adjective", "senses": [{"sense": "married in the past but not now married", "level": "B1", "dict_examp": "She's divorced.", "lear_examp": "My best friend Petra is getting divorced."}]}]}, {"word": "division", "poses": [{"pos": "noun", "senses": [{"sense": "when something is separated into parts or groups, or the way that it is separated", "level": "B2", "dict_examp": "the division of responsibilities among workers", "lear_examp": "Suddenly all the atomic missiles of the defensive system rose up in the sky, and so did the Russian ones, not turned off after the division of the ex-USSR."}, {"sense": "one of the groups in a business or organization", "level": "B2", "dict_examp": "the sales division", "lear_examp": "Being a lucky guy, I had the chance to work at the Disneyland Hotel, which is a division of the famous Walt Disney Company."}, {"sense": "one of the groups of teams in a league", "level": "B2", "dict_examp": "the Eastern Division", "lear_examp": "At the moment I am twenty-one years old and I'm playing in the third division of the Belgian Soccer Association."}]}]}, {"word": "divided", "poses": [{"pos": "adjective", "senses": [{"sense": "If a group, organization or country is divided, there are disagreements among the people in it.", "level": "B2", "dict_examp": "Board members are divided over the plans for the new stadium.", "lear_examp": "Opinions are divided."}]}]}, {"word": "divide", "poses": [{"pos": "verb", "senses": [{"sense": "to separate into parts or groups or to make people or things do this", "level": "B1", "dict_examp": "At the end of the lecture, I'd like all the students to divide into small discussion groups.", "lear_examp": "The class was divided into two groups."}, {"sense": "to separate a place into two areas", "level": "B2", "dict_examp": "There's a narrow alley which divides our house from the one next door.", "lear_examp": "The city is divided into two parts by the River Danube: Buda and Pest."}, {"sense": "to separate something into parts and give a part to each person in a group", "level": "C1", "dict_examp": "The prize money will be divided equally among the winners.", "lear_examp": "As women start to work outside the home more, the housework has to be divided among all the family members."}, {"sense": "to calculate how many times a number can go into another number", "level": "C1", "dict_examp": "12 divided by 6 equals 2.", "lear_examp": ""}, {"sense": "to cause people to disagree about something", "level": "C1", "dict_examp": "The city council was divided over plans to build a new stadium.", "lear_examp": "It is certainly clear to all that cars cannot continue to enter the city as they are currently doing, but this is a polemic subject and citizens are bound to be divided."}]}, {"pos": "noun", "senses": [{"sense": "a difference or separation", "level": "C1", "dict_examp": "Because of debt repayments, the divide between rich and poor countries is continuing to grow.", "lear_examp": "Certainly, there are a lot of exceptions but this system can be considered as a kind of social divide."}]}]}, {"word": "disturbing", "poses": [{"pos": "adjective", "senses": [{"sense": "unpleasant in a way that makes people feel anxious or upset", "level": "C2", "dict_examp": "disturbing images", "lear_examp": "Still, I find Edmund's character disturbing and I do not believe that his background alone could have created such an evil human being."}]}]}, {"word": "do", "poses": [{"pos": "auxiliary verb", "senses": [{"sense": "used with another verb to form questions and negative phrases", "level": "A1", "dict_examp": "Do you speak English?", "lear_examp": "What did you do at the party?"}, {"sense": "used in a phrase at the end of a sentence to make the sentence a question", "level": "A2", "dict_examp": "You like her, don't you?", "lear_examp": "You love watching tv, don't you?!"}, {"sense": "something you say when politely asking if you can do something, or when asking someone else to do something", "level": "A2", "dict_examp": "Do you mind if  I turn on the television?", "lear_examp": "Do you mind if I bring a friend?"}, {"sense": "to be unsuccessful/successful", "level": "B1", "dict_examp": "Sam did very well in her exams.", "lear_examp": "I had done badly in my last exam and my teacher said she would talk to my mother."}, {"sense": "used to avoid repeating a verb that has just been used", "level": "B1", "dict_examp": "She runs much faster than he does.", "lear_examp": "I like Brad Pitt a lot, and so does she."}, {"sense": "used to give extra force to the main verb", "level": "B2", "dict_examp": "Do let me know if you need anything.", "lear_examp": "I really do love to be a volunteer, to help people as much as I can."}]}, {"pos": "verb", "senses": [{"sense": "to perform an action", "level": "A1", "dict_examp": "What should we do?", "lear_examp": "I have nothing to do."}, {"sense": "to perform a job in the house", "level": "A1", "dict_examp": "I do the cooking but Joe does most of the cleaning.", "lear_examp": "She likes to do the cooking."}, {"sense": "used to ask what someone's job is", "level": "A1", "dict_examp": "\"What do you do (for a living)?\" \"I'm a doctor.\"", "lear_examp": "What does Angie do?"}, {"sense": "to make or produce something", "level": "A2", "dict_examp": "I've done 20 copies of the handout.", "lear_examp": "On any special day like Devali they do some special sweet food."}, {"sense": "used for talking or asking about someone and whether they are healthy, happy, or succeeding", "level": "A2", "dict_examp": "Hi, how are you doing?", "lear_examp": "I'm doing fine."}, {"sense": "to perform a sports activity", "level": "A2", "dict_examp": "She does yoga in her spare time.", "lear_examp": "At the club, I can swim, do karate or yoga, play soccer, tennis, squash and table-tennis."}, {"sense": "to make your hair/makeup, etc. look nice", "level": "B1", "dict_examp": "It takes him half an hour to do his hair in the morning.", "lear_examp": "I was the assistant of the person responsible for the clothes and make-up of the pop-group, and I was asked to do their make-up on my own."}, {"sense": "to make the greatest effort possible", "level": "B1", "dict_examp": "I did my best to persuade him.", "lear_examp": "I'll do my best to cover the work."}, {"sense": "to have a good effect on someone", "level": "B2", "dict_examp": "A break from this would do us all good.", "lear_examp": "I must admit that my stay in your nice home did me good."}, {"sense": "to cause damage/harm, etc.", "level": "B2", "dict_examp": "The fire did a lot of structural damage to the building.", "lear_examp": "I promise not to do any damage!"}, {"sense": "to be related to something", "level": "B2", "dict_examp": "She lacks confidence and I think that has to do with her childhood.", "lear_examp": "I think that is nothing to do with my accident."}, {"sense": "used to say that something seems like a good idea but it would be difficult to do", "level": "C1", "dict_examp": "I want to ask her out, but it's easier said than done.", "lear_examp": "I know it's easier said than done but you have to try."}, {"sense": "to try as hard as you can to do something", "level": "C1", "dict_examp": "We did our utmost to finish the project on time.", "lear_examp": "In addition, we live in a materialistic society where we all do our utmost in order to make ends meet, but we are never satisfied."}, {"sense": "If something does the job, it achieves the desired result.", "level": "C2", "dict_examp": "I need somewhere to keep these papers – this folder should do the job.", "lear_examp": "Allow them to bring home friends and therefore develop social skills. In my opinion, that should do the job."}, {"sense": "to use something that is less good than you would like", "level": "C2", "dict_examp": "If we can't get a bigger room we'll have to make do with this.", "lear_examp": "Very calmly, he said \"I am not going to put up with this. You might say that I am being too emotional, overreacting, whatever. But I will not come back until my piano has been returned.  And let me make very clear that I will not make do with another instrument.\""}, {"sense": "If something does the trick, it solves a problem or has the result you want.", "level": "C2", "dict_examp": "If you have a headache, an aspirin will usually do the trick.", "lear_examp": "Using aromatherapy oil and scented candles always did the trick when she wanted to relax."}, {"sense": "to repair or decorate a building so that it looks attractive", "level": "B2", "dict_examp": "He does up old houses and then sells them.", "lear_examp": "I think we could do up some of our old buildings that are nice but which the dirt and the pollution  don't let us see."}, {"sense": "to manage without having something", "level": "B2", "dict_examp": "Andrew's our best player - we can't really do without him.", "lear_examp": "We can't stand doing without the car."}, {"sense": "to get rid of something or stop using something", "level": "C1", "dict_examp": "We may do away with the school uniform soon.", "lear_examp": "Argentinians seem to be doing away with fried food and baking, boiling and steaming are now the most common ways of cooking."}]}]}, {"word": "DJ", "poses": [{"pos": "noun", "senses": [{"sense": "someone who plays music on the radio or at live events", "level": "B1", "dict_examp": "He's a DJ on Radio 1.", "lear_examp": "I found out that there would be a special event with disc jockeys like DJ Quicksilver."}]}]}, {"word": "diving", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of swimming under water, usually with breathing equipment", "level": "B1", "dict_examp": "I want to go diving in Malta.", "lear_examp": "We can go fishing, diving or windsurfing, it depends on how you would like to spend your time."}]}]}, {"word": "divorce", "poses": [{"pos": "noun", "senses": [{"sense": "when two people officially stop being married", "level": "B1", "dict_examp": "The last I heard they were getting a divorce.", "lear_examp": "After her divorce, she had two boyfriends."}]}, {"pos": "verb", "senses": [{"sense": "to end a marriage by an official or legal process", "level": "B2", "dict_examp": "She's divorcing her husband.", "lear_examp": "I asked Vina, \"If I divorce my wife, will you marry me?\""}]}]}, {"word": "divert", "poses": [{"pos": "verb", "senses": [{"sense": "to take someone's attention away from something", "level": "C1", "dict_examp": "A movement outside the window diverted my attention.", "lear_examp": "For example, when I feel sad or depressed, shopping can help me temporarily forget those negative feelings by diverting my attention to something which I really love doing."}, {"sense": "to send someone or something somewhere different from where they were expecting to go", "level": "C2", "dict_examp": "The plane was diverted to Stansted because of engine trouble.", "lear_examp": "There are certainly easy solutions to this problem, e.g., the night traffic could be diverted to the airport in Vennes as there are no houses nearby."}]}]}, {"word": "diversity", "poses": [{"pos": "noun", "senses": [{"sense": "when many different types of things or people are included in something", "level": "C1", "dict_examp": "Does television adequately reflect the ethnic and cultural diversity of the country?", "lear_examp": "On the other hand, the fact that all the people buy the same goods and live in similar ways may threaten the cultural diversity."}]}]}, {"word": "dog", "poses": [{"pos": "noun", "senses": [{"sense": "an animal with fur, four legs and a tail, especially kept by people as a pet or to hunt or guard buildings", "level": "A1", "dict_examp": "my pet dog", "lear_examp": "She likes going to the park in her free time for a walk with her dog."}]}]}, {"word": "dole", "poses": [{"pos": "verb", "senses": [{"sense": "to give something, especially money, to several people or in large amounts", "level": "C2", "dict_examp": "I've had to dole out nearly $500 this month.", "lear_examp": "But still, doling out money does not make the people that receive it happy."}]}]}, {"word": "dominance", "poses": [{"pos": "noun", "senses": [{"sense": "power, influence, and control", "level": "C2", "dict_examp": "the company's dominance in the software industry", "lear_examp": "The past taught us that progress and maturity are defined by leaving behind selfishness and extreme individualism, the need for control, and dominance."}]}]}, {"word": "donkey", "poses": [{"pos": "noun", "senses": [{"sense": "an animal like a small horse with long ears", "level": "B1", "dict_examp": "The donkey struggled with its heavy burden.", "lear_examp": "You can use animals like donkeys for transportation."}]}]}, {"word": "door", "poses": [{"pos": "noun", "senses": [{"sense": "a flat object, often fixed at one edge, that is used to close the entrance of something such as a room or building, or the entrance itself", "level": "A1", "dict_examp": "the front door", "lear_examp": "There is a garden outside the back door but it isn't big."}, {"sense": "privately and not in public", "level": "C2", "dict_examp": "Most of the deals were made behind closed doors.", "lear_examp": "Decisions which affect the whole world are made behind closed doors and are top secret."}]}]}, {"word": "donor", "poses": [{"pos": "noun", "senses": [{"sense": "someone who gives some of their blood or part of their body to be used for medical purposes", "level": "C2", "dict_examp": "She is a regular blood donor.", "lear_examp": "In this group we can include responsible authorities, sympathetic doctors, organ donors, good teachers and many other unknown people who devote their lives to a generous cause."}, {"sense": "someone who gives money or goods to a person or organization that needs help", "level": "C2", "dict_examp": "Ten thousand dollars was given by an anonymous donor.", "lear_examp": "Private donors raised some funds to prevent the hospital from closure."}]}]}, {"word": "dominate", "poses": [{"pos": "verb", "senses": [{"sense": "to have control over a place or a person", "level": "B2", "dict_examp": "He refuses to let others speak and dominates every meeting.", "lear_examp": "For instance, in banks, schools, hospitals, and airports we are absolutely dominated by computers, aren't we?"}, {"sense": "to be the largest, most important, or most noticeable part of something", "level": "C1", "dict_examp": "The subject of pay dominated their discussions.", "lear_examp": "The religious values that dominated every aspect of life are slowly being replaced by new ones and the outcome of this metamorphosis has yet to be examined."}]}]}, {"word": "donation", "poses": [{"pos": "noun", "senses": [{"sense": "when money or goods are given to help a person or organization", "level": "B2", "dict_examp": "donations of food and money", "lear_examp": "First of all, I would like to say that I and my friends are very happy because of Mr Maitland's donation."}]}]}, {"word": "donate", "poses": [{"pos": "verb", "senses": [{"sense": "to give money or goods to help a person or organization", "level": "B2", "dict_examp": "An anonymous businesswoman donated one million dollars to the charity.", "lear_examp": "You don't have to pay for it but you can donate some money if you wish."}, {"sense": "to allow some of your blood or part of your body to be used for medical purposes", "level": "C1", "dict_examp": "He donated a kidney to his sister.", "lear_examp": "For example, he once saved my life, putting his in danger by donating a large quantity of blood."}]}]}, {"word": "dollar", "poses": [{"pos": "noun", "senses": [{"sense": "the unit of money used in the US, Canada, Australia, New Zealand and some other countries", "level": "A1", "dict_examp": "Can I borrow ten dollars?", "lear_examp": "Eugene gave me twenty dollars."}]}]}, {"word": "double", "poses": [{"pos": "adjective", "senses": [{"sense": "twice the size, amount, price, etc., or consisting of two similar things together", "level": "A2", "dict_examp": "I'd like to book a double room.", "lear_examp": "I'm going to buy a double bed, that is why I need to sell the single one."}]}, {"pos": "determiner", "senses": [{"sense": "twice as much or as many", "level": "B1", "dict_examp": "Our new house is double the size of the old one.", "lear_examp": "There has been an increase of 15% in the number of old people that live alone, and in the case of living in a care home, the percentage is double (50%) that of 1976."}]}, {"pos": "verb", "senses": [{"sense": "to become twice the original size or amount, or to make something do this", "level": "B2", "dict_examp": "The government aims to double the number of students in higher education within 25 years.", "lear_examp": "Please repair it today and I will double your salary."}]}]}, {"word": "dose", "poses": [{"pos": "noun", "senses": [{"sense": "a measured amount of something such as medicine", "level": "B2", "dict_examp": "a high/low dose", "lear_examp": "It is important to me because I have asthma and cannot miss even one dose of it."}, {"sense": "an amount of something, often something unpleasant", "level": "B2", "dict_examp": "a dose of bad news", "lear_examp": "You ought to plan your work and mainly learn in the morning when your brain is ready to accept a great dose of knowledge."}]}]}, {"word": "doubt", "poses": [{"pos": "noun", "senses": [{"sense": "when you are not certain about something, or do not trust someone or something", "level": "B1", "dict_examp": "I'm having doubts about his ability to do the job.", "lear_examp": "If you have any doubt, send me an e-mail."}, {"sense": "to be certain", "level": "B1", "dict_examp": "I have no doubt (that) I made the right decision.", "lear_examp": "Maria went with me, and I have no doubt she loved the lake like I did."}, {"sense": "it is certain", "level": "B1", "dict_examp": "There is no doubt (that) he's a good player.", "lear_examp": "However, there is no doubt that it is a nice one."}, {"sense": "to not be certain", "level": "B2", "dict_examp": "The future of the project is in doubt.", "lear_examp": "If you don't know the difference, or if you are in doubt, keep on reading."}, {"sense": "certainly", "level": "B2", "dict_examp": "She is without doubt a great writer.", "lear_examp": "Without a doubt we all are influenced by fashion in a number of ways."}, {"sense": "used to say that something is very likely", "level": "C1", "dict_examp": "No doubt she'll spend the money on new clothes.", "lear_examp": "No doubt I will find the skills acquired during the course, especially speaking skills, most useful in my future contacts with clients from English-speaking countries."}, {"sense": "to make people feel uncertain about someone or something", "level": "C2", "dict_examp": "Witnesses have cast doubt on the suspect's innocence.", "lear_examp": "Wars lead to suffering, tears and the death of many people. They cast doubt on our humanity and values, especially in countries where the right to live is the principal one."}, {"sense": "completely certain and without any doubt", "level": "C2", "dict_examp": "It is beyond doubt that she the best students I’ve ever taught.", "lear_examp": "What I would regard as being my most treasured possession is beyond doubt my precious collection of books."}, {"sense": "If something is true beyond a shadow of a doubt, it is certainly true.", "level": "C2", "dict_examp": "He convinced me , but it hasn't been proved beyond the shadow of a doubt.", "lear_examp": "It has been established beyond a shadow of a doubt that the growth in world population is one of the most compelling problems the Earth is facing."}, {"sense": "to choose to believe what someone tells you even though it may be wrong or a lie", "level": "C2", "dict_examp": "She says her train was late, so I suppose we'd better give her the benefit of the doubt.", "lear_examp": "Every time our parents tell us \".. have you thought about it, are you sure you are not making a mistake?\" we just answer \"sure I have, no problem.\" Next time they do, let's give them the benefit of the doubt and let's think twice about the subject."}]}, {"pos": "verb", "senses": [{"sense": "to feel uncertain about something or to think that something is not probable", "level": "B2", "dict_examp": "I doubt whether/if I can finish the work on time.", "lear_examp": "She doubted if she could manage it at all."}, {"sense": "to not believe someone or something", "level": "C1", "dict_examp": "Do you have any reason to doubt her?", "lear_examp": "After I had closed that window again, I doubted my senses."}]}]}, {"word": "do", "poses": [{"pos": "auxiliary verb", "senses": [{"sense": "used with another verb to form questions and negative phrases", "level": "A1", "dict_examp": "Do you speak English?", "lear_examp": "What did you do at the party?"}, {"sense": "used in a phrase at the end of a sentence to make the sentence a question", "level": "A2", "dict_examp": "You like her, don't you?", "lear_examp": "You love watching tv, don't you?!"}, {"sense": "something you say when politely asking if you can do something, or when asking someone else to do something", "level": "A2", "dict_examp": "Do you mind if  I turn on the television?", "lear_examp": "Do you mind if I bring a friend?"}, {"sense": "to be unsuccessful/successful", "level": "B1", "dict_examp": "Sam did very well in her exams.", "lear_examp": "I had done badly in my last exam and my teacher said she would talk to my mother."}, {"sense": "used to avoid repeating a verb that has just been used", "level": "B1", "dict_examp": "She runs much faster than he does.", "lear_examp": "I like Brad Pitt a lot, and so does she."}, {"sense": "used to give extra force to the main verb", "level": "B2", "dict_examp": "Do let me know if you need anything.", "lear_examp": "I really do love to be a volunteer, to help people as much as I can."}]}, {"pos": "verb", "senses": [{"sense": "to perform an action", "level": "A1", "dict_examp": "What should we do?", "lear_examp": "I have nothing to do."}, {"sense": "to perform a job in the house", "level": "A1", "dict_examp": "I do the cooking but Joe does most of the cleaning.", "lear_examp": "She likes to do the cooking."}, {"sense": "used to ask what someone's job is", "level": "A1", "dict_examp": "\"What do you do (for a living)?\" \"I'm a doctor.\"", "lear_examp": "What does Angie do?"}, {"sense": "to make or produce something", "level": "A2", "dict_examp": "I've done 20 copies of the handout.", "lear_examp": "On any special day like Devali they do some special sweet food."}, {"sense": "used for talking or asking about someone and whether they are healthy, happy, or succeeding", "level": "A2", "dict_examp": "Hi, how are you doing?", "lear_examp": "I'm doing fine."}, {"sense": "to perform a sports activity", "level": "A2", "dict_examp": "She does yoga in her spare time.", "lear_examp": "At the club, I can swim, do karate or yoga, play soccer, tennis, squash and table-tennis."}, {"sense": "to make your hair/makeup, etc. look nice", "level": "B1", "dict_examp": "It takes him half an hour to do his hair in the morning.", "lear_examp": "I was the assistant of the person responsible for the clothes and make-up of the pop-group, and I was asked to do their make-up on my own."}, {"sense": "to make the greatest effort possible", "level": "B1", "dict_examp": "I did my best to persuade him.", "lear_examp": "I'll do my best to cover the work."}, {"sense": "to have a good effect on someone", "level": "B2", "dict_examp": "A break from this would do us all good.", "lear_examp": "I must admit that my stay in your nice home did me good."}, {"sense": "to cause damage/harm, etc.", "level": "B2", "dict_examp": "The fire did a lot of structural damage to the building.", "lear_examp": "I promise not to do any damage!"}, {"sense": "to be related to something", "level": "B2", "dict_examp": "She lacks confidence and I think that has to do with her childhood.", "lear_examp": "I think that is nothing to do with my accident."}, {"sense": "used to say that something seems like a good idea but it would be difficult to do", "level": "C1", "dict_examp": "I want to ask her out, but it's easier said than done.", "lear_examp": "I know it's easier said than done but you have to try."}, {"sense": "to try as hard as you can to do something", "level": "C1", "dict_examp": "We did our utmost to finish the project on time.", "lear_examp": "In addition, we live in a materialistic society where we all do our utmost in order to make ends meet, but we are never satisfied."}, {"sense": "If something does the job, it achieves the desired result.", "level": "C2", "dict_examp": "I need somewhere to keep these papers – this folder should do the job.", "lear_examp": "Allow them to bring home friends and therefore develop social skills. In my opinion, that should do the job."}, {"sense": "to use something that is less good than you would like", "level": "C2", "dict_examp": "If we can't get a bigger room we'll have to make do with this.", "lear_examp": "Very calmly, he said \"I am not going to put up with this. You might say that I am being too emotional, overreacting, whatever. But I will not come back until my piano has been returned.  And let me make very clear that I will not make do with another instrument.\""}, {"sense": "If something does the trick, it solves a problem or has the result you want.", "level": "C2", "dict_examp": "If you have a headache, an aspirin will usually do the trick.", "lear_examp": "Using aromatherapy oil and scented candles always did the trick when she wanted to relax."}, {"sense": "to repair or decorate a building so that it looks attractive", "level": "B2", "dict_examp": "He does up old houses and then sells them.", "lear_examp": "I think we could do up some of our old buildings that are nice but which the dirt and the pollution  don't let us see."}, {"sense": "to manage without having something", "level": "B2", "dict_examp": "Andrew's our best player - we can't really do without him.", "lear_examp": "We can't stand doing without the car."}, {"sense": "to get rid of something or stop using something", "level": "C1", "dict_examp": "We may do away with the school uniform soon.", "lear_examp": "Argentinians seem to be doing away with fried food and baking, boiling and steaming are now the most common ways of cooking."}]}]}, {"word": "dock", "poses": [{"pos": "noun", "senses": [{"sense": "the place where ships stop and goods are taken off or put on", "level": "C1", "dict_examp": "We went to the dock to see the ship leave.", "lear_examp": "I would like to take them with me to a very typical restaurant near the docks: Mummie's House 25 Harbour Street 2 Tel. 070 321 26 33."}]}]}, {"word": "doll", "poses": [{"pos": "noun", "senses": [{"sense": "a child's toy that looks like a small person or baby", "level": "A1", "dict_examp": "Lara loves playing with her dolls.", "lear_examp": "I've got a cute doll."}]}]}, {"word": "dot", "poses": [{"pos": "noun", "senses": [{"sense": "the spoken form of a period in an Internet or e-mail address, or some computer files", "level": "B1", "dict_examp": "\"What's the web address?\" \"www dot cambridge dot org.\"", "lear_examp": ""}, {"sense": "a very small round mark", "level": "B2", "dict_examp": "The period at the end of this sentence is a dot.", "lear_examp": "On the map we have marked a black dot on the place where you will find the hotel."}, {"sense": "at that exact time", "level": "C2", "dict_examp": "We have to leave at 7:30 on the dot.", "lear_examp": "He gave him an address and told him to be there at six on the dot."}]}]}, {"word": "domination", "poses": [{"pos": "noun", "senses": [{"sense": "great power and control over someone or something else", "level": "C1", "dict_examp": "world domination", "lear_examp": "A more serious argument is that the domination of huge multinationals suppresses local creativity and forces the local traditions to fade away."}]}]}, {"word": "doorway", "poses": [{"pos": "noun", "senses": [{"sense": "an entrance to a building or room through a door", "level": "C2", "dict_examp": "She waited in the doorway while I ran back inside.", "lear_examp": "They sleep in doorways and beg in the street."}]}]}, {"word": "documentary", "poses": [{"pos": "noun", "senses": [{"sense": "a film, television or radio program that gives facts and information about a subject", "level": "B1", "dict_examp": "The documentary took a fresh look at the life of Darwin.", "lear_examp": "It's supposed to be a documentary about a man who lives with his wife and dogs in The Rockies, in Canada."}]}]}, {"word": "dolphin", "poses": [{"pos": "noun", "senses": [{"sense": "an intelligent animal that lives in the sea, breathes air and looks like a large, smooth, gray fish", "level": "B1", "dict_examp": "They swam with dolphins on holiday.", "lear_examp": "I saw a dolphin jumping in the air."}]}]}, {"word": "domestic", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging or relating to the home, house or family", "level": "B2", "dict_examp": "domestic chores/duties/arrangements", "lear_examp": "All domestic appliances such as showers, kettles, lights, TV and curtains may be voice activated."}, {"sense": "relating to a person's own country", "level": "B2", "dict_examp": "domestic airlines/flights", "lear_examp": "We should advertise all the good points of our city in the domestic and foreign mass-media."}]}]}, {"word": "doctor", "poses": [{"pos": "noun", "senses": [{"sense": "a person whose job is to treat people who are ill or hurt", "level": "A1", "dict_examp": "You should see a doctor about that cough.", "lear_examp": "I'm going to start on Saturday, because on Friday I have to go to the doctor with my grandmother."}]}]}, {"word": "domain", "poses": [{"pos": "noun", "senses": [{"sense": "a particular area, activity, or subject that someone controls or deals with", "level": "C1", "dict_examp": "The garden is his domain.", "lear_examp": "I also believe that robots will prevail in the domain of health, as they will take the place of doctors and surgeons."}]}]}, {"word": "dominant", "poses": [{"pos": "adjective", "senses": [{"sense": "main or most important", "level": "C1", "dict_examp": "Unemployment will be a dominant issue at the next election.", "lear_examp": "Looking back on the ongoing discussion about women's role in modern German society, there is one dominant impression: women have to enlarge, improve, intensify, etc.... they have to enlarge their horizon, to improve their professional skills, to intensify their involvement in politics and so on ...."}, {"sense": "strongest and wanting to take control", "level": "C2", "dict_examp": "a dominant older brother", "lear_examp": "He was a very dominant boy and I was afraid of him."}]}]}, {"word": "document", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of paper with official information on it", "level": "A2", "dict_examp": "official/confidential/legal documents", "lear_examp": "My credit cards and official documents are inside."}, {"sense": "a piece of text produced electronically on a computer", "level": "B1", "dict_examp": "I'll send you the document by email.", "lear_examp": "That document was a \"virus\" and erased all my documents on my computer."}]}]}, {"word": "doom", "poses": [{"pos": "noun", "senses": [{"sense": "death, destruction, and other unpleasant events that cannot be avoided", "level": "C2", "dict_examp": "a horrible sense of doom", "lear_examp": "Men were not only humans but warriors who represented the army of immortals whose fate was to defend the Earth from the evil spirits of doom."}, {"sense": "unhappiness and feeling no hope for the future", "level": "C2", "dict_examp": "Life's not all doom and gloom, you know.", "lear_examp": "To sum up, experts can stop their doom and gloom statements about our uncertain future and the possible global crisis."}]}]}, {"word": "doubtful", "poses": [{"pos": "adjective", "senses": [{"sense": "not probable", "level": "B2", "dict_examp": "It is doubtful whether/if he'll be able to come.", "lear_examp": "It is certainly doubtful to say that the characteristics we are born with have much more influence on our personality than any experiences we may have in our life."}, {"sense": "not feeling certain about something", "level": "B2", "dict_examp": "The teacher is doubtful about having parents working as classroom assistants.", "lear_examp": "I am very doubtful about whether you were there when it was held."}]}]}, {"word": "downside", "poses": [{"pos": "noun", "senses": [{"sense": "the disadvantage of a situation", "level": "C1", "dict_examp": "The downside of living in a city is all the pollution.", "lear_examp": "However, there is a downside to it as more and more products are exported/imported, domestic economies lose a lot trying - and usually failing - to face the competition that is coming from other countries."}]}]}, {"word": "Dr.", "poses": [{"pos": "noun", "senses": [{"sense": "a title for someone who is a medical doctor or a Doctor of Philosophy", "level": "A2", "dict_examp": "I have an appointment with Dr. Tay.", "lear_examp": "Dr. Ahuja has placed a virus in a suitcase."}]}]}, {"word": "doubt", "poses": [{"pos": "noun", "senses": [{"sense": "when you are not certain about something, or do not trust someone or something", "level": "B1", "dict_examp": "I'm having doubts about his ability to do the job.", "lear_examp": "If you have any doubt, send me an e-mail."}, {"sense": "to be certain", "level": "B1", "dict_examp": "I have no doubt (that) I made the right decision.", "lear_examp": "Maria went with me, and I have no doubt she loved the lake like I did."}, {"sense": "it is certain", "level": "B1", "dict_examp": "There is no doubt (that) he's a good player.", "lear_examp": "However, there is no doubt that it is a nice one."}, {"sense": "to not be certain", "level": "B2", "dict_examp": "The future of the project is in doubt.", "lear_examp": "If you don't know the difference, or if you are in doubt, keep on reading."}, {"sense": "certainly", "level": "B2", "dict_examp": "She is without doubt a great writer.", "lear_examp": "Without a doubt we all are influenced by fashion in a number of ways."}, {"sense": "used to say that something is very likely", "level": "C1", "dict_examp": "No doubt she'll spend the money on new clothes.", "lear_examp": "No doubt I will find the skills acquired during the course, especially speaking skills, most useful in my future contacts with clients from English-speaking countries."}, {"sense": "to make people feel uncertain about someone or something", "level": "C2", "dict_examp": "Witnesses have cast doubt on the suspect's innocence.", "lear_examp": "Wars lead to suffering, tears and the death of many people. They cast doubt on our humanity and values, especially in countries where the right to live is the principal one."}, {"sense": "completely certain and without any doubt", "level": "C2", "dict_examp": "It is beyond doubt that she the best students I’ve ever taught.", "lear_examp": "What I would regard as being my most treasured possession is beyond doubt my precious collection of books."}, {"sense": "If something is true beyond a shadow of a doubt, it is certainly true.", "level": "C2", "dict_examp": "He convinced me , but it hasn't been proved beyond the shadow of a doubt.", "lear_examp": "It has been established beyond a shadow of a doubt that the growth in world population is one of the most compelling problems the Earth is facing."}, {"sense": "to choose to believe what someone tells you even though it may be wrong or a lie", "level": "C2", "dict_examp": "She says her train was late, so I suppose we'd better give her the benefit of the doubt.", "lear_examp": "Every time our parents tell us \".. have you thought about it, are you sure you are not making a mistake?\" we just answer \"sure I have, no problem.\" Next time they do, let's give them the benefit of the doubt and let's think twice about the subject."}]}, {"pos": "verb", "senses": [{"sense": "to feel uncertain about something or to think that something is not probable", "level": "B2", "dict_examp": "I doubt whether/if I can finish the work on time.", "lear_examp": "She doubted if she could manage it at all."}, {"sense": "to not believe someone or something", "level": "C1", "dict_examp": "Do you have any reason to doubt her?", "lear_examp": "After I had closed that window again, I doubted my senses."}]}]}, {"word": "dozen", "poses": [{"pos": "noun", "senses": [{"sense": "twelve", "level": "B1", "dict_examp": "a dozen eggs", "lear_examp": "We were a dozen people."}, {"sense": "a lot", "level": "C1", "dict_examp": "She's got dozens of friends.", "lear_examp": "There are, as well, dozens of robots able to handle any kind of work in our homes."}]}]}, {"word": "drama", "poses": [{"pos": "noun", "senses": [{"sense": "a play in a theater or on television or radio, or plays and acting generally", "level": "B1", "dict_examp": "She's been in several television dramas.", "lear_examp": "It was a drama club."}, {"sense": "an event or situation, especially an unexpected one, in which there is worry or excitement and usually a lot of action", "level": "B1", "dict_examp": "We had a little drama last night when the oil in the pan caught fire.", "lear_examp": "Fortunately he found my ring. How happy I was! The drama was over!"}]}]}, {"word": "downstairs", "poses": [{"pos": "adverb", "senses": [{"sense": "to or on a lower floor of a building, especially the ground floor", "level": "A2", "dict_examp": "I ran downstairs to see who was at the door.", "lear_examp": "While I was in your house, your mom called me to help her carry some stuff, so I left my purse on your bed, and went downstairs to help her."}]}, {"pos": "adjective", "senses": [{"sense": "on or at a lower floor of a building, especially the ground floor", "level": "B1", "dict_examp": "The burglars got in through a downstairs window.", "lear_examp": "Every year when winter comes, our heating doesn't work very well. The upstairs rooms are ok, but the downstairs rooms are cold."}]}]}, {"word": "draft", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of writing or a plan that is not yet in its finished form", "level": "B2", "dict_examp": "This is only a rough draft - the finished article will have pictures as well.", "lear_examp": "Now I can use my computer for making monthly reports at home and making different kinds of project drafts."}, {"sense": "a current of cold air in a room", "level": "C1", "dict_examp": "I felt a cold draft every time the door opened.", "lear_examp": "Also, there is a draft in the house, because wind is blowing around the house, which makes us feel cold, which is harmful for my child especially."}]}, {"pos": "verb", "senses": [{"sense": "to produce a piece of writing or a plan that you intend to change later", "level": "C1", "dict_examp": "to draft a letter", "lear_examp": "My job is to present an advertising material draft that will be edited by our customer's representative."}]}]}, {"word": "down-to-earth", "poses": [{"pos": "adjective", "senses": [{"sense": "Down-to-earth people or ideas are practical and work well.", "level": "C1", "dict_examp": "I like your down-to-earth approach to problem-solving.", "lear_examp": "His huge popularity mainly lies in his down-to-earth attitude."}]}]}, {"word": "downhill", "poses": [{"pos": "adverb", "senses": [{"sense": "toward the bottom of a hill or slope", "level": "C2", "dict_examp": "It's much easier to go downhill on a bike.", "lear_examp": "Skiing downhill in deep snow is the most rewarding experience."}, {"sense": "to gradually become worse", "level": "C2", "dict_examp": "After his wife died, his health started to go downhill.", "lear_examp": "He had been going downhill in the last few days and so his death came as no surprise."}]}]}, {"word": "downtown", "poses": [{"pos": "adverb", "senses": [{"sense": "to the central part or main business area of a city", "level": "A2", "dict_examp": "If we go downtown we can take the bus.", "lear_examp": "Yesterday I went downtown to buy some clothes."}]}, {"pos": "adjective", "senses": [{"sense": "in or at the central part or main business area of a city", "level": "B1", "dict_examp": "downtown Chicago", "lear_examp": "I will be waiting for you at the new downtown restaurant, don't forget that!"}]}]}, {"word": "download", "poses": [{"pos": "verb", "senses": [{"sense": "to copy computer programs, music or other information electronically, especially from the Internet or a larger computer", "level": "A2", "dict_examp": "I've downloaded the program.", "lear_examp": "I left my computer in your sister's room as she wanted to download some songs from it to her laptop."}]}, {"pos": "noun", "senses": [{"sense": "a computer program, music or other information that has been or can be downloaded", "level": "B1", "dict_examp": "a free download", "lear_examp": ""}]}]}, {"word": "downward", "poses": [{"pos": "adjective", "senses": [{"sense": "moving toward a lower position", "level": "C1", "dict_examp": "a downward trend", "lear_examp": "Company B's profit marks a downward tendency from 1990 to 2000, going from a 2 million dollar profit to the extreme result of no profit at all."}, {"sense": "a situation which is getting worse very quickly, and which is difficult to control", "level": "C2", "dict_examp": "After his death, the family went into a downward spiral.", "lear_examp": "Unemployment is one of the major problems of our society. It is the first step of a downward spiral."}]}, {"pos": "adverb", "senses": [{"sense": "toward a lower place or level", "level": "C1", "dict_examp": "The road slopes downward to the river.", "lear_examp": "Water runs downward into the turbine when the valve is open."}]}]}, {"word": "down", "poses": [{"pos": "adverb", "senses": [{"sense": "moving from above and onto a surface", "level": "A1", "dict_examp": "Just as I was sitting down to watch TV, the phone rang.", "lear_examp": "So I sat down to write the answer."}, {"sense": "toward or in a low or lower position, from a higher one", "level": "A2", "dict_examp": "Is this elevator going down?", "lear_examp": "All the mountains were colored when the sun was going down."}, {"sense": "in writing or on paper", "level": "B1", "dict_examp": "Do you have it down in writing/on paper, or was it just a verbal agreement?", "lear_examp": "You have to bring a pen and paper to write down the teacher's notes."}, {"sense": "used, especially with prepositions, to emphasize that a place is far from you or from somewhere considered to be central", "level": "B1", "dict_examp": "I'll meet you down at the gym after work.", "lear_examp": "As soon as we drove down from the hills, I heard the noise from the town and I didn't like that."}, {"sense": "to be unhappy", "level": "C2", "dict_examp": "He looks a bit down in the dumps.", "lear_examp": "She felt happy when I was down in the dumps or in a fix and kept on being jealous of me concerning trivial matters."}]}, {"pos": "preposition", "senses": [{"sense": "in or toward a low or lower position, from a higher one", "level": "A2", "dict_examp": "I slid down the hill.", "lear_examp": "I was the first to go down the hill."}, {"sense": "along or further along", "level": "A2", "dict_examp": "We drove down the highway as far as Cape May.", "lear_examp": "Then we went down the Nile by boat."}, {"sense": "If money or work goes down the drain, it is wasted.", "level": "C2", "dict_examp": "If you leave the school now, all your hard work will go down the drain.", "lear_examp": "All those evening conversations and the investment of 100,000 yen went down the drain, I thought."}, {"sense": "in the future", "level": "C2", "dict_examp": "Lots of things will have changed a few years down the road.", "lear_examp": "For that very reason it seemed natural for Laura and John to take her in, and further down the line they would adopt her."}]}, {"pos": "adjective", "senses": [{"sense": "unhappy or unable to feel excited or energetic about anything", "level": "B2", "dict_examp": "She's been really down since her husband died.", "lear_examp": "If you are feeling down or depressed, what do you do?"}, {"sense": "If a computer or machine is down, it is temporarily not working.", "level": "C1", "dict_examp": "The network was down all morning.", "lear_examp": "If other departments use the online system, it seems to be down for a while."}, {"sense": "having no money, no luck and no opportunities", "level": "C2", "dict_examp": "Nobody loves you when you're down and out.", "lear_examp": "The neglect of social security as a vital point in state policies leaves homeless people down and out, with little chance for improving their bleak prospects."}]}]}, {"word": "drag", "poses": [{"pos": "verb", "senses": [{"sense": "to move something on a computer screen using a mouse", "level": "B1", "dict_examp": "Drag the highlighted text to the new window.", "lear_examp": ""}, {"sense": "to move something on  a computer screen using a mouse and place it where you want it to be", "level": "B1", "dict_examp": "drag and drop exercises", "lear_examp": ""}, {"sense": "to pull someone or something along the ground, usually with difficulty", "level": "B2", "dict_examp": "Pick the chair up instead of dragging it behind you!", "lear_examp": "Another man approached the agent, both watching as officers dragged the man to a nearby car."}, {"sense": "to make someone go somewhere they do not want to go", "level": "C2", "dict_examp": "She dragged me along to look at shoes with her.", "lear_examp": "When she first saw him, speaking his radical views at some sort of political meeting she had been dragged along to by a friend, she was at first scared but later enchanted."}, {"sense": "to continue for too much time in a boring way", "level": "C2", "dict_examp": "The play dragged during the second act.", "lear_examp": "The afternoon dragged on interminably, and I suddenly felt like going out."}]}]}, {"word": "drain", "poses": [{"pos": "verb", "senses": [{"sense": "to remove the liquid from something, usually by pouring it away or allowing it to flow away", "level": "C2", "dict_examp": "Drain the pasta and add the sauce.", "lear_examp": "Peter the Great ordered the swampy lands to be drained."}, {"sense": "If something drains, liquid flows away or out of it.", "level": "C2", "dict_examp": "Don't bother drying the pans - just leave them to drain.", "lear_examp": "The sink doesn't drain, which is a major problem for me."}, {"sense": "to reduce or cause something to reduce", "level": "C2", "dict_examp": "The long war had drained the resources of both countries.", "lear_examp": "These people drain government funds that can be used to deal with unemployment."}, {"sense": "to make someone very tired", "level": "C2", "dict_examp": "The long journey drained him.", "lear_examp": "Especially when you've had a hard day at work, when the constant high temperature drains the energy from you, or when you're not feeling well because of any other reason, you need that comforting phone call from your best friend more than ever."}]}, {"pos": "noun", "senses": [{"sense": "a pipe or hole that takes away waste liquids or water", "level": "C2", "dict_examp": "She poured the dirty water down the drain.", "lear_examp": "I wish to put forward some ideas, which I think can help:   checking the area and surroundings, making sure there is no garbage lying around; cleaning the fallen leaves etc. from the drains."}, {"sense": "something that uses a lot of money or energy", "level": "C2", "dict_examp": "Taking care of his sick mother was quite a drain on him.", "lear_examp": "This need results in an ever increasing drain on the country's resources."}, {"sense": "If money or work goes down the drain, it is wasted.", "level": "C2", "dict_examp": "If you leave the school now, all your hard work will go down the drain.", "lear_examp": "All those evening conversations and the investment of 100,000 yen went down the drain, I thought."}]}]}, {"word": "dramatically", "poses": [{"pos": "adverb", "senses": [{"sense": "suddenly or obviously", "level": "B2", "dict_examp": "Your life changes dramatically when you have a baby.", "lear_examp": "She fell dramatically to the floor."}]}]}, {"word": "dress", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of clothing for women or girls which covers the top half of the body and hangs down over the legs", "level": "A1", "dict_examp": "a long/short dress", "lear_examp": "I wore a new dress."}]}, {"pos": "verb", "senses": [{"sense": "to put clothes on yourself or someone else, especially a child", "level": "A2", "dict_examp": "My husband dresses the children while I make breakfast.", "lear_examp": "Maria started to dress, but her suit was not there!"}, {"sense": "to wear a particular type of clothes", "level": "B1", "dict_examp": "I have to dress nicely for work.", "lear_examp": "The waiters dress in national clothes and are very kind."}]}]}, {"word": "drive", "poses": [{"pos": "verb", "senses": [{"sense": "to move or travel on land in a motor vehicle, especially as the person controlling the vehicle's movement", "level": "A1", "dict_examp": "I'm learning to drive.", "lear_examp": "I need them to drive my car."}, {"sense": "to make someone extremely annoyed", "level": "B2", "dict_examp": "My mother-in-law has been staying with us this past week and she's driving me crazy.", "lear_examp": "It drove me crazy."}, {"sense": "to make someone have a bad feeling or do something bad", "level": "C1", "dict_examp": "The arguments drove her to leave home.", "lear_examp": "She would discover all about her affair with Lorraine's husband and the real cause that drove him to commit suicide."}, {"sense": "to provide the power or energy that makes someone or something work", "level": "C2", "dict_examp": "She was driven by greed and ambition.", "lear_examp": "On the other hand, we are reassured by large international corporations that everything is under control, but it is common knowledge that these capitalistic monsters are so driven by greed for money and power that they would say anything to calm down the public."}, {"sense": "to force someone or something to leave a place", "level": "C2", "dict_examp": "The supermarket has driven many small shops out of the area.", "lear_examp": "Unfortunately that kind of thinking led to many people being killed, wounded and made homeless and moreover driven out of their homeland."}]}, {"pos": "noun", "senses": [{"sense": "a journey in a car", "level": "B1", "dict_examp": "The drive from Boston to New York took four hours.", "lear_examp": "This restaurant is about a 1 hour drive from my home."}, {"sense": "a part of a computer that can read or store information", "level": "B1", "dict_examp": "Save your work on the C drive.", "lear_examp": "Then we learned how to install components like a Soundboard or a CD-Rom drive."}, {"sense": "energy and determination to achieve things", "level": "C1", "dict_examp": "She has drive and ambition.", "lear_examp": "They definitely have the drive and motivation to succeed."}]}]}, {"word": "dread", "poses": [{"pos": "verb", "senses": [{"sense": "to feel worried or frightened about something that has not happened yet", "level": "C2", "dict_examp": "I'm dreading the first day at my new school.", "lear_examp": "You could go through life regretting the past and dreading the future, and become a grumpy old man, or you could take it all as it comes, and enjoy every single moment."}]}]}, {"word": "drink", "poses": [{"pos": "noun", "senses": [{"sense": "a liquid or an amount of liquid which is taken into the body through the mouth", "level": "A1", "dict_examp": "Would you like a drink of water/tea/juice?", "lear_examp": "I would like to have a drink."}, {"sense": "alcoholic liquid", "level": "A2", "dict_examp": "Whose turn is it to buy the drinks?", "lear_examp": "After the film we go and have a drink."}, {"sense": "a strong alcoholic drink", "level": "C2", "dict_examp": "I thought he could use a stiff drink after that car almost hit him.", "lear_examp": "Then, she prepared herself a stiff drink: gin and tonic with some ice, the very same one she used to have when Jack was there."}]}, {"pos": "verb", "senses": [{"sense": "to take liquid into the body through the mouth", "level": "A1", "dict_examp": "He drank three glasses of water.", "lear_examp": "You do not have to bring any food, but I'd be pleased if you could bring something to drink: wine, coke or something."}, {"sense": "to drink alcohol", "level": "A2", "dict_examp": "\"Would you like a glass of wine?\" \"No thanks, I don't drink.\"", "lear_examp": "Did you drink or dance at the party?"}]}]}, {"word": "draw", "poses": [{"pos": "verb", "senses": [{"sense": "to make a picture of something or someone with a pencil or pen", "level": "A1", "dict_examp": "Jonathan can draw beautifully.", "lear_examp": "You have to bring pencils and sheets of paper to draw on."}, {"sense": "to move in a particular direction, especially in a vehicle", "level": "B2", "dict_examp": "The train slowly drew into the station/drew in.", "lear_examp": "I drew up at the gate of the house; the inside was in darkness and nobody seemed to be there."}, {"sense": "to attract someone to a place or person", "level": "B2", "dict_examp": "He's an excellent speaker who always draws a crowd.", "lear_examp": "Finally, I am sure that opening a swimming pool again would help to draw people living in the nearest villages to our town."}, {"sense": "to make someone notice something or someone", "level": "B2", "dict_examp": "Could I draw your attention to item number three on the agenda?", "lear_examp": "Thank you very much for drawing attention to this letter."}, {"sense": "to consider the facts of a situation and make a decision about what is true, correct, likely to happen, etc.", "level": "B2", "dict_examp": "I'd seen them together so often I drew the logical conclusion that they were husband and wife.", "lear_examp": "Since nobody ever heard from them again, we all drew the sad conclusion that they must be dead."}, {"sense": "to become nearer in space or time", "level": "B2", "dict_examp": "Her birthday's drawing nearer every day.", "lear_examp": "After two seconds he heard a door opening and his mother drawing near."}, {"sense": "to pull something or someone gently in a particular direction", "level": "C2", "dict_examp": "He took her hand and drew her toward her sister.", "lear_examp": "As she drew me into the house she would tell me a story about Dari's absence and the newly born puppies of Dari's, almost whispering into my ears as my eyes welled up with tears."}, {"sense": "to be almost finished", "level": "C2", "dict_examp": "At last the concert drew to a close.", "lear_examp": "As the dinner drew to an end, our weariness became all too clear."}, {"sense": "to say that there is a similarity or difference between two things", "level": "C2", "dict_examp": "We need to draw a distinction between criticism and insults.", "lear_examp": "A country should not be visited only to enable the tourist to draw a comparison between his country and the foreign one."}, {"sense": "If someone says they know where to draw the line, they are talking about knowing at what point an activity or situation becomes unacceptable because it is wrong or too extreme", "level": "C2", "dict_examp": "I’ll do what I can to help a friend, but I draw the line when someone asks me to lie for them.", "lear_examp": "For these parents, drawing the line at certain behaviors became a synonym for lack of democracy, and a source of struggle at home."}, {"sense": "to use information or your knowledge or experience of something to help you do something", "level": "C1", "dict_examp": "His novels draw heavily on his childhood.", "lear_examp": "This report looks at the changes in eating habits in Italy, drawing on personal experience, magazine and newspaper articles and interviews with local people of different ages."}, {"sense": "to prepare something, usually a plan, list, or an official agreement, by writing it", "level": "C1", "dict_examp": "She drew up a list of contestants.", "lear_examp": "Government bodies have drawn up plans to educate people and explain to them why it is so important to keep our planet safe and clean."}]}]}, {"word": "drawback", "poses": [{"pos": "noun", "senses": [{"sense": "a problem or disadvantage", "level": "C1", "dict_examp": "The only drawback to this camera is its price.", "lear_examp": "Both perspectives are important, but, overall, the advantages of proper in-house teaching outweigh the drawbacks."}]}]}, {"word": "drawing", "poses": [{"pos": "noun", "senses": [{"sense": "the act of making a picture with a pencil or pen, or a picture made in this way", "level": "A2", "dict_examp": "Rosie loves drawing.", "lear_examp": "My hobbies are singing, dancing, drawing, writing, reading and so on."}]}]}, {"word": "dreadful", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely bad or unpleasant", "level": "B2", "dict_examp": "The food was bad and the service was dreadful.", "lear_examp": "What a dreadful nightmare!"}]}]}, {"word": "dream", "poses": [{"pos": "noun", "senses": [{"sense": "a series of events or images that happen in your mind when you are sleeping", "level": "A2", "dict_examp": "a bad dream", "lear_examp": "I thought it was a very strange dream but her dream wasn't strange it was nice."}, {"sense": "something that you want to happen very much but that is not very likely", "level": "B1", "dict_examp": "It's always been my dream to take flying lessons.", "lear_examp": "My dream was to become a professional singer."}, {"sense": "to not notice things that are around you because you are thinking about something else", "level": "B2", "dict_examp": "", "lear_examp": "The first time I saw a fashion  show, I was 10 years old and I was in a dream during the whole show."}, {"sense": "bigger or better than anything you could imagine or hope for", "level": "C2", "dict_examp": "The house was beyond my wildest dreams.", "lear_examp": "It was beyond my wildest dreams."}, {"sense": "used to say that something is better than anything you could imagine or hope for", "level": "C2", "dict_examp": "Never in my wildest dreams had I thought I would be offered a starring role in a Hollywood movie.", "lear_examp": "Not even in my wildest dreams could I have imagined that finding a diary was to have such fortunate consequences for me."}]}, {"pos": "verb", "senses": [{"sense": "to experience events and images in your mind while you are sleeping", "level": "A2", "dict_examp": "What did you dream about last night?", "lear_examp": "It ran, ran, and I screamed - I was dreaming, but it was very real."}, {"sense": "to imagine something that you would like to happen", "level": "B1", "dict_examp": "He never dreamed that one day he would become President.", "lear_examp": "I have always dreamed of becoming a famous tennis player."}, {"sense": "used to say that you would not do something because you think it is wrong or silly", "level": "C2", "dict_examp": "I wouldn't dream of asking him for a loan.", "lear_examp": "Many people wouldn't dream of spending hours in a kitchen preparing a complex meal."}]}]}, {"word": "drawer", "poses": [{"pos": "noun", "senses": [{"sense": "a box-shaped container without a top which is part of a piece of furniture. It slides in and out to open and close and is used for keeping things in.", "level": "A2", "dict_examp": "I keep my socks in the bottom drawer.", "lear_examp": "I think I left it in your drawer in the living room."}]}]}, {"word": "drastic", "poses": [{"pos": "adjective", "senses": [{"sense": "severe and sudden or having very noticeable effects", "level": "C1", "dict_examp": "drastic measures", "lear_examp": "If within 30 days I don't receive any kind of compensation (preferably money), I may have to take drastic measures."}]}]}, {"word": "dramatic", "poses": [{"pos": "adjective", "senses": [{"sense": "very sudden or noticeable, or full of action and excitement", "level": "B2", "dict_examp": "a dramatic change/improvement", "lear_examp": "His suicide at the end of the book was the most dramatic event in this story and has touched me deeply."}]}]}, {"word": "drift", "poses": [{"pos": "verb", "senses": [{"sense": "to be moved slowly somewhere by currents of wind or water", "level": "C2", "dict_examp": "Smoke drifted across the rooftops.", "lear_examp": "As the clouds drifted past it, the light slowly returned."}, {"sense": "to get into a situation or job without having any particular plan", "level": "C2", "dict_examp": "He drifted into acting after college.", "lear_examp": "But once Stevens had noticed their working relationship was slowly drifting into a kind of love affair, he proposed to stop these evening meetings on account of their being not useful in a professional sense any more."}, {"sense": "If two people drift apart, they gradually become less friendly and the relationship ends.", "level": "C2", "dict_examp": "Roz used to be one of my closest friends, but we've drifted apart.", "lear_examp": "Later on in our relationship we started to drift apart because, being a student from Canada, I had a lot of problems with Portuguese which led to my failure at the end of the school year."}, {"sense": "to gradually start to sleep", "level": "C2", "dict_examp": "I drifted off during the lecture.", "lear_examp": "She unwillingly let her mind drift off to her business trip in Milano."}]}]}, {"word": "dresser", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of furniture with drawers for keeping clothes in", "level": "A2", "dict_examp": "I keep my socks in the top drawer of the dresser.", "lear_examp": "I think I have left my notebook in your house. It's probably in your bedroom on the dresser."}]}]}, {"word": "dressed", "poses": [{"pos": "adjective", "senses": [{"sense": "wearing clothes and not naked", "level": "A2", "dict_examp": "I usually get dressed before I eat breakfast.", "lear_examp": "While I got dressed he started to cook the dinner."}, {"sense": "wearing clothing of a particular type", "level": "B1", "dict_examp": "a well-dressed/casually dressed man", "lear_examp": "Last Saturday, there was a big party and everyone was well dressed."}]}]}, {"word": "drastically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a drastic way", "level": "C1", "dict_examp": "The number of bees has drastically declined due to a combination of factors.", "lear_examp": "Conditions have changed drastically after the reunification."}]}]}, {"word": "duck", "poses": [{"pos": "noun", "senses": [{"sense": "a bird that lives by water, has webbed feet, a short neck and a large beak", "level": "A2", "dict_examp": "We took some bread to feed the ducks.", "lear_examp": "There was a big lake, with a lot of ducks."}, {"sense": "If criticisms, insults, etc. are like water off a duck's back to you, they do not affect you at all.", "level": "C2", "dict_examp": "She calls him lazy and useless, but it's like water off a duck's back.", "lear_examp": "The main lesson I have learned is by looking at some people who have lived alone for most of their life and faced with neither contradiction nor argument, they stay in their ivory tower, so sure of their opinions that whatever you say is like water off a duck's back."}]}]}, {"word": "drive", "poses": [{"pos": "verb", "senses": [{"sense": "to move or travel on land in a motor vehicle, especially as the person controlling the vehicle's movement", "level": "A1", "dict_examp": "I'm learning to drive.", "lear_examp": "I need them to drive my car."}, {"sense": "to make someone extremely annoyed", "level": "B2", "dict_examp": "My mother-in-law has been staying with us this past week and she's driving me crazy.", "lear_examp": "It drove me crazy."}, {"sense": "to make someone have a bad feeling or do something bad", "level": "C1", "dict_examp": "The arguments drove her to leave home.", "lear_examp": "She would discover all about her affair with Lorraine's husband and the real cause that drove him to commit suicide."}, {"sense": "to provide the power or energy that makes someone or something work", "level": "C2", "dict_examp": "She was driven by greed and ambition.", "lear_examp": "On the other hand, we are reassured by large international corporations that everything is under control, but it is common knowledge that these capitalistic monsters are so driven by greed for money and power that they would say anything to calm down the public."}, {"sense": "to force someone or something to leave a place", "level": "C2", "dict_examp": "The supermarket has driven many small shops out of the area.", "lear_examp": "Unfortunately that kind of thinking led to many people being killed, wounded and made homeless and moreover driven out of their homeland."}]}, {"pos": "noun", "senses": [{"sense": "a journey in a car", "level": "B1", "dict_examp": "The drive from Boston to New York took four hours.", "lear_examp": "This restaurant is about a 1 hour drive from my home."}, {"sense": "a part of a computer that can read or store information", "level": "B1", "dict_examp": "Save your work on the C drive.", "lear_examp": "Then we learned how to install components like a Soundboard or a CD-Rom drive."}, {"sense": "energy and determination to achieve things", "level": "C1", "dict_examp": "She has drive and ambition.", "lear_examp": "They definitely have the drive and motivation to succeed."}]}]}, {"word": "dump", "poses": [{"pos": "verb", "senses": [{"sense": "to put something somewhere to get rid of it, especially in a place where you should not put it", "level": "C1", "dict_examp": "The company was fined for illegally dumping toxic chemicals.", "lear_examp": "In addition, society might be affected negatively by the refuse and garbage dumped by people."}, {"sense": "to put something somewhere quickly and carelessly", "level": "C2", "dict_examp": "Henry dumped his bag on the table and went upstairs.", "lear_examp": "Annabel dumped her school bag on the floor and threw herself onto her bed."}, {"sense": "to suddenly end a romantic relationship", "level": "C2", "dict_examp": "If he's so awful, why don't you just dump him?", "lear_examp": "I had just been dumped by a guy I thought I was in love with."}]}, {"pos": "noun", "senses": [{"sense": "a place where people take things that they do not want", "level": "C1", "dict_examp": "We took our old mattress to the dump.", "lear_examp": "We all took turns loading it and driving it off to the city dump, in our private cars."}, {"sense": "a place that is dirty and messy", "level": "C2", "dict_examp": "His room is a dump.", "lear_examp": ""}, {"sense": "to be unhappy", "level": "C2", "dict_examp": "He looks a bit down in the dumps.", "lear_examp": "She felt happy when I was down in the dumps or in a fix and kept on being jealous of me concerning trivial matters."}]}]}, {"word": "driver's license", "poses": [{"pos": "noun", "senses": [{"sense": "official permission for someone to drive a car, received after passing a driving test, or a document showing this", "level": "A2", "dict_examp": "I have a clean driving licence.", "lear_examp": "At first we were scared that we won't be allowed to come in the club cause the club is aged by 18 years and normally you had to show your driver's license."}]}]}, {"word": "dubious", "poses": [{"pos": "adjective", "senses": [{"sense": "thought not to be completely true, honest, or legal", "level": "C2", "dict_examp": "dubious evidence", "lear_examp": "He was blackmailed, his children were twice kidnapped and his wife was badly injured in mysterious and dubious circumstances."}, {"sense": "not certain that something is good or true", "level": "C2", "dict_examp": "He's dubious about the benefits of acupuncture.", "lear_examp": "As far as entertainers are concerned, I am rather dubious about their contribution to a better world."}]}]}, {"word": "drop", "poses": [{"pos": "verb", "senses": [{"sense": "to fall or to allow something to fall", "level": "B1", "dict_examp": "She dropped her keys.", "lear_examp": "Maybe this is the reason why I dropped my cup of tea."}, {"sense": "to move something on  a computer screen using a mouse and place it where you want it to be", "level": "B1", "dict_examp": "drag and drop exercises", "lear_examp": "With simple mouse-clicks and by means of the well-known \"drag-and-drop\" method, this programme will enable you to select a fabric from the catalogue and \"drop\" it on a chair or couch, to see what they look like."}, {"sense": "to move to a lower level, or cause something to move to a lower level", "level": "B2", "dict_examp": "The water level in the flooded region has finally begun to drop.", "lear_examp": "Especially if you imagine that the number of heart-attacks was about 40% per year and for the last 3 years dropped down to 23%."}, {"sense": "to stop doing or planning something, especially an activity", "level": "B2", "dict_examp": "I'm going to drop yoga and do aerobics instead.", "lear_examp": "I think you shouldn't drop sports but on the other hand, if you drop sports and do music, it would be quite good as well."}, {"sense": "to take someone or something to a place, usually by car as you travel somewhere else", "level": "C1", "dict_examp": "I can drop you at the station on my way to work.", "lear_examp": "You had better hire a car or get to know somebody who can drop you there."}, {"sense": "to stop talking about something, especially because it is annoying or upsetting someone", "level": "C2", "dict_examp": "I don't want to talk about it any more - let's drop the subject.", "lear_examp": ""}, {"sense": "to die very suddenly", "level": "C2", "dict_examp": "He just dropped dead.", "lear_examp": "We can enjoy our longer lives because we don't have to work until we drop dead."}]}, {"pos": "noun", "senses": [{"sense": "a small round-shaped amount of liquid", "level": "B1", "dict_examp": "I thought I felt a drop of rain.", "lear_examp": "I could only hear the drops against the window-pane."}, {"sense": "a reduction in the amount or level of something", "level": "B2", "dict_examp": "a drop in crime", "lear_examp": "It maintained the same level between 1998 and 2008 after a drop from 1996 to 1998."}, {"sense": "a vertical distance down from somewhere to the ground", "level": "C1", "dict_examp": "It's a drop of about 50 feet from the top of the cliff.", "lear_examp": ""}, {"sense": "a very small amount compared to the amount needed", "level": "C2", "dict_examp": "My letter of protest was just a drop in the ocean.", "lear_examp": "I know I am a drop in the ocean, but I'm convinced it's the only way, my way, of contributing to improve education in Mexico."}]}]}, {"word": "dry", "poses": [{"pos": "adjective", "senses": [{"sense": "describes something that has no water or other liquid in, on, or around it", "level": "A2", "dict_examp": "My hat kept my hair dry.", "lear_examp": "So when the clothes were dry, I called a taxi."}, {"sense": "with no or not much rain", "level": "A2", "dict_examp": "a dry summer", "lear_examp": "It said: \"My sweet darling, the weather here in Africa is hot and dry, but the nights are cold and lonely without you.\""}, {"sense": "Dry wine is not sweet.", "level": "C1", "dict_examp": "I'd like a glass of dry white wine.", "lear_examp": "The only wine sold - a dry white wine of a very good quality - is the one made by the owners of the restaurant and I can assure you that it's worth trying it."}, {"sense": "Dry skin or hair does not feel soft or smooth.", "level": "C1", "dict_examp": "My lips feel really dry.", "lear_examp": "She looked old, her skin was dry and her eyes so lucid... ."}, {"sense": "If a book, talk, or subject is dry, it is not interesting.", "level": "C2", "dict_examp": "His writing is always so dry and dull.", "lear_examp": "Facts and dates are dry and empty if teachers are not able to bring them to life."}]}, {"pos": "verb", "senses": [{"sense": "to become dry, or to make something become dry", "level": "A2", "dict_examp": "Will this paint dry by tomorrow?", "lear_examp": "I invited him to come inside and dry his clothes and have a cup of tea."}, {"sense": "If a supply of something dries up, it ends.", "level": "C2", "dict_examp": "The work dried up and he went out of business.", "lear_examp": "Nevertheless we must consider that a society with many people over sixty has its problems, such as retirement funds which have dried up."}]}]}, {"word": "due", "poses": [{"pos": "adjective", "senses": [{"sense": "expected to happen, arrive, etc. at a particular time", "level": "B1", "dict_examp": "What time is the next bus due?", "lear_examp": "It is my science assignment which is due on Tuesday, so I have no time to research and write it again."}, {"sense": "because of", "level": "B1", "dict_examp": "A lot of her unhappiness is due to boredom.", "lear_examp": "First of all, I want to say that France is the best place to cycle, due to its mountains and fantastic forests."}, {"sense": "at a suitable time in the future", "level": "B2", "dict_examp": "The results will be sent to you in due course.", "lear_examp": "I look forward to hearing from you in due course."}, {"sense": "If you are due for something, it should happen very soon.", "level": "C1", "dict_examp": "I'm due for a check-up at the dentist's.", "lear_examp": "The facilities and canteen are due for improvement too."}, {"sense": "used to politely disagree with or give a negative opinion about something", "level": "C1", "dict_examp": "I’ve been thinking about what you said and, with all due respect, I think you’re mistaken.", "lear_examp": "Finally we would like to point out two things that should be improved. The first one is entertainment, which, with all due respect, is very poor."}, {"sense": "Something that is due to you is something that is owed to you or something you deserve.", "level": "C2", "dict_examp": "He didn't get the praise and recognition that was due to him.", "lear_examp": "Slowly she walked into the living room, knowing that a big apology was due to her."}, {"sense": "correct and suitable", "level": "C2", "dict_examp": "He was fined for driving without due care and attention.", "lear_examp": "However, we should take due care not to make wrong assumptions and be prejudicial to others as a consequence."}]}]}, {"word": "drunk", "poses": [{"pos": "adjective", "senses": [{"sense": "unable to behave or speak normally because of having had too much alcohol", "level": "B2", "dict_examp": "He got very drunk at my sister's wedding.", "lear_examp": "So, I just sat down watching Julie and her monstrous friends drinking and acting like animals - they were all blind drunk!"}]}]}, {"word": "dual", "poses": [{"pos": "adjective", "senses": [{"sense": "having two parts, or having two of something", "level": "C1", "dict_examp": "dual nationality", "lear_examp": "I have dual nationality."}]}]}, {"word": "drum", "poses": [{"pos": "noun", "senses": [{"sense": "a round, hollow musical instrument that you hit with your hand or a stick", "level": "A2", "dict_examp": "a bass/snare/kettle drum", "lear_examp": "I am a very good drummer because I have played the drums for six years."}]}]}, {"word": "drought", "poses": [{"pos": "noun", "senses": [{"sense": "a long period when there is no rain and people do not have enough water", "level": "C2", "dict_examp": "A severe drought ruined the crops.", "lear_examp": "We have wars, revolutions, political unrest, famine, drought, pollution, etc. Some of our problems are difficult to solve."}]}]}, {"word": "dull", "poses": [{"pos": "adjective", "senses": [{"sense": "not interesting or exciting in any way; boring", "level": "B1", "dict_examp": "She wrote dull, respectable articles for the local newspaper.", "lear_examp": "In my opinion the film was very boring because the story was poor and dull."}, {"sense": "not bright", "level": "C1", "dict_examp": "dull colors", "lear_examp": "The color of our house from an outside view is dull yellow, and every time I look at it, it reminds me of the past so I would have it painted something brighter so that I would not feel bad."}]}]}, {"word": "dumb", "poses": [{"pos": "adjective", "senses": [{"sense": "stupid", "level": "B2", "dict_examp": "a dumb idea/question", "lear_examp": "Please forgive me, I can be so dumb sometimes!"}, {"sense": "physically unable to talk", "level": "C1", "dict_examp": "The child is deaf and dumb.", "lear_examp": "The first one is \"Lessons of Piano\". It is the story of a dumb woman who uses a piano to express her feelings and moods."}]}]}, {"word": "drug", "poses": [{"pos": "noun", "senses": [{"sense": "any natural or artificially made chemical which is used as a medicine", "level": "B2", "dict_examp": "anti-cancer/fertility/pain-killing drugs", "lear_examp": "A great many drug companies all over the world have reduced input of dangerous chemicals into rivers, lakes and seas."}, {"sense": "any natural or artificially made chemical which is taken for pleasure, to improve someone's performance of an activity, or because a person cannot stop using it", "level": "B2", "dict_examp": "illegal drugs", "lear_examp": "Of course, I have never taken drugs."}]}]}, {"word": "drown", "poses": [{"pos": "verb", "senses": [{"sense": "to die because you are under water and cannot breathe, or to kill someone in this way", "level": "B2", "dict_examp": "Two people drowned in a boating accident yesterday.", "lear_examp": "Those days we spent in Brazil were full of excitement and I certainly wouldn't mind doing it again - well, except for the episode in which you almost drowned when we went water-skiing."}, {"sense": "If a loud noise drowns the sound of something else, it prevents that sound from being heard.", "level": "C2", "dict_examp": "His voice was drowned out by the traffic.", "lear_examp": "It is furthermore impossible to listen to music as it is drowned by the noise."}]}]}, {"word": "driver", "poses": [{"pos": "noun", "senses": [{"sense": "someone who drives a vehicle", "level": "A2", "dict_examp": "a bus/truck/taxi driver", "lear_examp": "If you don't know the place exactly ask the driver."}]}]}, {"word": "drugstore", "poses": [{"pos": "noun", "senses": [{"sense": "a store where you can buy medicines, other health products, make-up and products used for washing yourself", "level": "B1", "dict_examp": "I can pick up the shampoo while I'm at the drugstore.", "lear_examp": ""}]}]}, {"word": "during", "poses": [{"pos": "preposition", "senses": [{"sense": "for the whole of a period of time", "level": "A2", "dict_examp": "They work during the night and sleep during the day.", "lear_examp": "We sat together during the lesson."}, {"sense": "at some time between the beginning and the end of a period", "level": "A2", "dict_examp": "I woke up several times during the night.", "lear_examp": "Last year, the strangest thing happened to me during the Christmas period."}]}]}, {"word": "dump", "poses": [{"pos": "verb", "senses": [{"sense": "to put something somewhere to get rid of it, especially in a place where you should not put it", "level": "C1", "dict_examp": "The company was fined for illegally dumping toxic chemicals.", "lear_examp": "In addition, society might be affected negatively by the refuse and garbage dumped by people."}, {"sense": "to put something somewhere quickly and carelessly", "level": "C2", "dict_examp": "Henry dumped his bag on the table and went upstairs.", "lear_examp": "Annabel dumped her school bag on the floor and threw herself onto her bed."}, {"sense": "to suddenly end a romantic relationship", "level": "C2", "dict_examp": "If he's so awful, why don't you just dump him?", "lear_examp": "I had just been dumped by a guy I thought I was in love with."}]}, {"pos": "noun", "senses": [{"sense": "a place where people take things that they do not want", "level": "C1", "dict_examp": "We took our old mattress to the dump.", "lear_examp": "We all took turns loading it and driving it off to the city dump, in our private cars."}, {"sense": "a place that is dirty and messy", "level": "C2", "dict_examp": "His room is a dump.", "lear_examp": ""}, {"sense": "to be unhappy", "level": "C2", "dict_examp": "He looks a bit down in the dumps.", "lear_examp": "She felt happy when I was down in the dumps or in a fix and kept on being jealous of me concerning trivial matters."}]}]}, {"word": "dwell", "poses": [{"pos": "verb", "senses": [{"sense": "to keep thinking or talking about something, especially something bad or unpleasant", "level": "C1", "dict_examp": "I don't want to dwell on the past.", "lear_examp": "Considering this astonishing technical feature, I do not wish to dwell too long upon the subject."}]}]}, {"word": "duty-free", "poses": [{"pos": "adjective", "senses": [{"sense": "Duty-free goods are things you can buy and bring into a country without paying tax.", "level": "B1", "dict_examp": "I bought some duty-free perfume at the airport.", "lear_examp": "We went to get some alcohol in a duty-free shop."}]}]}, {"word": "DVD", "poses": [{"pos": "noun", "senses": [{"sense": "digital versatile disc or digital video disc: a disc used for storing and playing music, films or information", "level": "A1", "dict_examp": "I've got a DVD of the first series.", "lear_examp": "ALL our friends were there and I got a new DVD!"}]}]}, {"word": "duration", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of time that something lasts", "level": "C1", "dict_examp": "The singer remained in the hotel for the duration of his stay in the UK.", "lear_examp": "If you are between 18 and 30 years old, we offer you a wide range of jobs with a duration varying from two weeks to three months."}]}]}, {"word": "dynamic", "poses": [{"pos": "adjective", "senses": [{"sense": "full of ideas, energy and enthusiasm", "level": "B2", "dict_examp": "She's young and dynamic and will be a great addition to the team.", "lear_examp": "I am a cheerful, dynamic and hardworking person."}, {"sense": "continuously changing or moving", "level": "C2", "dict_examp": "a dynamic economy", "lear_examp": "Consequently, the country has a less dynamic economy."}]}]}, {"word": "dusty", "poses": [{"pos": "adjective", "senses": [{"sense": "covered with dust", "level": "B1", "dict_examp": "a dusty old chair", "lear_examp": "Not a sound could be heard in the dusty street except for the continuous roar of my almost useless pick-up."}]}]}, {"word": "duty", "poses": [{"pos": "noun", "senses": [{"sense": "something that you have to do because it is part of your job, or something that you feel is the right thing to do", "level": "B1", "dict_examp": "I felt it was my duty to tell them the truth.", "lear_examp": "It is not enjoyable if you look at it as a duty."}, {"sense": "something you do as part of your job or because of your position", "level": "B2", "dict_examp": "professional/official duties", "lear_examp": "And it is the most important duty of the local police to keep an eye on hooligans."}, {"sense": "If someone such as a doctor or a soldier is on duty, they are working, and if they are off duty, they are not working.", "level": "B2", "dict_examp": "What time are you off/on duty tomorrow?", "lear_examp": "I was on duty in front of the major's house with another soldier."}]}]}, {"word": "dust", "poses": [{"pos": "noun", "senses": [{"sense": "dry dirt in the form of powder that covers surfaces inside a building, or very small dry pieces of soil, sand or other substances", "level": "B1", "dict_examp": "The furniture was covered in dust.", "lear_examp": "Also, in the countryside there are more bugs and dust than in the city."}]}]}]