[{"word": "earnings", "poses": [{"pos": "noun", "senses": [{"sense": "money that you get for working", "level": "B2", "dict_examp": "Average earnings for skilled workers are rising.", "lear_examp": "Finally, I think that publishers are so worried about their earnings that they don't pay attention to new writers."}]}]}, {"word": "eagle", "poses": [{"pos": "noun", "senses": [{"sense": "a large, strong bird with a curved beak that hunts smaller animals", "level": "B2", "dict_examp": "", "lear_examp": "For many animals zoos are the only hope for survival: for example the Chinese panda or white eagle."}]}]}, {"word": "eager", "poses": [{"pos": "adjective", "senses": [{"sense": "wanting to do or have something very much", "level": "B2", "dict_examp": "She sounded very eager to meet you.", "lear_examp": "We are six Italian teenagers eager to meet new people."}]}]}, {"word": "eastern", "poses": [{"pos": "adjective", "senses": [{"sense": "in or from the east part of an area", "level": "B1", "dict_examp": "The eastern part of the country is very mountainous.", "lear_examp": "After that you can catch a train which takes you to the eastern part of Switzerland."}, {"sense": "in or from the countries of Asia", "level": "B2", "dict_examp": "Buddhism and other Eastern religions fascinate me.", "lear_examp": "I would like to know if the restaurant has Eastern or Asian food?"}]}]}, {"word": "early", "poses": [{"pos": "adverb", "senses": [{"sense": "near the beginning of a period of time, process, etc.", "level": "A1", "dict_examp": "I get up early during the week.", "lear_examp": "He loves to get up early in the morning."}, {"sense": "before the usual time or the time that was arranged", "level": "A2", "dict_examp": "If you finish early, you can go home.", "lear_examp": "We'll finish it early."}]}, {"pos": "adjective", "senses": [{"sense": "near the beginning of a period of time, process, etc.", "level": "A2", "dict_examp": "the early 1980s", "lear_examp": "Tomorrow please come in the early morning."}, {"sense": "before the usual time or the time that was arranged", "level": "B1", "dict_examp": "I'm going to have an early night.", "lear_examp": "I have been thinking about early retirement."}, {"sense": "in the first stage or part of something", "level": "C2", "dict_examp": "It was a great race for Neil, who took the lead early on.", "lear_examp": "What luck that I found such a yardstick early on in my childhood."}]}]}, {"word": "earthquake", "poses": [{"pos": "noun", "senses": [{"sense": "a sudden movement of the Earth's surface, often causing severe damage", "level": "B2", "dict_examp": "A powerful earthquake struck eastern Turkey last night.", "lear_examp": "Human beings are afraid of dangers such as a tornado or earthquake."}]}]}, {"word": "eagerness", "poses": [{"pos": "noun", "senses": [{"sense": "when you are eager to do something", "level": "B2", "dict_examp": "In their eagerness to find a solution, they have overlooked certain difficulties.", "lear_examp": "I really admire your stamina, your commitment and your eagerness to pursue a career as one of the youngest vice presidents ever in the company, but is it really worth it?"}]}]}, {"word": "each", "poses": [{"pos": "pronoun", "senses": [{"sense": "every one  in a group of two or more things or people when they are considered separately", "level": "A1", "dict_examp": "There are five different leaflets - please take one of each.", "lear_examp": "I'm selling them for £5 each."}, {"sense": "used to show that each person in a group of two or more people does something to the others", "level": "A2", "dict_examp": "They kept looking at each other and smiling.", "lear_examp": "We can write to each other once a month."}]}, {"pos": "determiner", "senses": [{"sense": "referring to every one  in a group of two or more things or people when they are considered separately", "level": "A1", "dict_examp": "Each apartment has its own balcony.", "lear_examp": "I'm free each afternoon after 4:00 p.m."}]}]}, {"word": "earache", "poses": [{"pos": "noun", "senses": [{"sense": "pain in your ear", "level": "B1", "dict_examp": "He was suffering from earache.", "lear_examp": "I feel ill and I've got earache."}]}]}, {"word": "earring", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of jewelry that you wear on or through your ear", "level": "A2", "dict_examp": "gold/silver earrings", "lear_examp": "It is a gold earring and it is on the table I think."}]}]}, {"word": "east", "poses": [{"pos": "noun", "senses": [{"sense": "the direction that you face to see the sun rise, opposite the west", "level": "A2", "dict_examp": "The points of the compass are North, South, East and West.", "lear_examp": ""}, {"sense": "the part of an area that is further toward the east than the rest", "level": "A2", "dict_examp": "Her home is in the east of France.", "lear_examp": "You can visit the east of the town."}, {"sense": "the countries of Asia", "level": "B2", "dict_examp": "She spent her childhood in the East - mostly in China and Japan.", "lear_examp": ""}]}, {"pos": "adjective", "senses": [{"sense": "in or forming the east part of something", "level": "A2", "dict_examp": "New York is east of Chicago.", "lear_examp": "I'll visit the romantic Robin Hood's Bay on the east coast of England."}]}, {"pos": "adverb", "senses": [{"sense": "toward the east", "level": "A2", "dict_examp": "They sailed further east.", "lear_examp": "We went east to Oslo."}]}]}, {"word": "ease", "poses": [{"pos": "noun", "senses": [{"sense": "If you do something with ease, it is easy for you to do it.", "level": "B2", "dict_examp": "She won the 400m race with ease.", "lear_examp": "She finally left the small village in the pursuit of her goal, which she achieved with relative ease."}, {"sense": "feeling relaxed and comfortable", "level": "B2", "dict_examp": "I felt completely at ease with him.", "lear_examp": "You and uncle James made me feel at ease when I was there."}, {"sense": "to say something that will help someone to stop worrying", "level": "C1", "dict_examp": "I was worried about the test, but the nurse explained everything and put my mind at ease.", "lear_examp": "To drive, even though only for 30 minutes, might give you confidence for the driving test and put your mind at ease."}, {"sense": "feeling anxious and not relaxed", "level": "C2", "dict_examp": "He looked ill at ease in the room full of reporters.", "lear_examp": "I was a bit annoyed, or rather, ill at ease at first; but his kindness soon made me feel relaxed in his company."}]}]}, {"word": "eagerly", "poses": [{"pos": "adverb", "senses": [{"sense": "in an eager way", "level": "B2", "dict_examp": "an eagerly awaited announcement", "lear_examp": "I'm eagerly waiting for your reply."}]}]}, {"word": "ear", "poses": [{"pos": "noun", "senses": [{"sense": "one  of the two body parts on your head that you hear with", "level": "A1", "dict_examp": "She leaned over and whispered something in his ear.", "lear_examp": "My friend Maria gave me a dog. It's a cocker and has long ears."}, {"sense": "to be very surprised when you hear what someone says", "level": "B2", "dict_examp": "I couldn't believe my ears when Dan said they were getting married.", "lear_examp": "I couldn't believe my ears. All my wishes had come true."}, {"sense": "to be good at hearing, repeating, or understanding a particular type of sound", "level": "C1", "dict_examp": "He has no ear for music.", "lear_examp": "In terms of communication I believe that I have an ear for languages."}, {"sense": "to play a piece of music by remembering the notes", "level": "C2", "dict_examp": "She played all the songs by ear.", "lear_examp": "As the years went by, she found it hard to cope with her slow headway in classical piano and her endlessly unfinished songs played by ear."}, {"sense": "to decide how to deal with a situation as it develops", "level": "C2", "dict_examp": "I'm not sure what to tell Dad - I'll just have to play it by ear.", "lear_examp": "On the way to Cambridge, I had made up my mind to play it by ear."}, {"sense": "If advice or a request falls on deaf ears, people ignore it.", "level": "C2", "dict_examp": "Our pleas for help fell on deaf ears.", "lear_examp": "His cry for help and for a more meaningful relationship between himself and Mildred invariably fell on deaf ears."}]}]}, {"word": "easy", "poses": [{"pos": "adjective", "senses": [{"sense": "not difficult", "level": "A1", "dict_examp": "an easy exam", "lear_examp": "It's very easy."}, {"sense": "to do what is easiest in a difficult situation", "level": "C1", "dict_examp": "I know you don't approve of his working methods, but why not take the easy way out this time and agree to his request?", "lear_examp": "On the other hand you cannot survive without your pay-check and to be able to both make a career and have the time to be green, sometimes you just have to take the easy way out."}]}, {"pos": "adverb", "senses": [{"sense": "to relax and not use too much energy", "level": "B1", "dict_examp": "After his heart attack, he had to take things easy for a while.", "lear_examp": "Take it easy and see you soon."}, {"sense": "used to say that something seems like a good idea but it would be difficult to do", "level": "C1", "dict_examp": "I want to ask her out, but it's easier said than done.", "lear_examp": "I know it's easier said than done but you have to try."}]}]}, {"word": "eat", "poses": [{"pos": "verb", "senses": [{"sense": "to put food into your mouth and then swallow it", "level": "A1", "dict_examp": "Who ate all the cake?", "lear_examp": "I want to go to the river and eat a big chocolate cake."}, {"sense": "to have a meal", "level": "A1", "dict_examp": "We usually eat at about 7 o'clock.", "lear_examp": "I go there to eat whenever I have time."}, {"sense": "to eat in a restaurant", "level": "B1", "dict_examp": "When I lived in Spain, I used to eat out all the time.", "lear_examp": "If you don't have any plans next weekend, I want to eat out with you."}, {"sense": "to eat all the food you have been given", "level": "B2", "dict_examp": "Be a good boy and eat up your dinner.", "lear_examp": "There wasn't any more time after eating it up."}]}]}, {"word": "earth", "poses": [{"pos": "noun", "senses": [{"sense": "the planet that we live on", "level": "B1", "dict_examp": "The Earth takes approximately 365 days to go round the Sun.", "lear_examp": "I like it because it is the best football on Earth!"}, {"sense": "soil or ground", "level": "B2", "dict_examp": "The ploughed earth looked rich and dark.", "lear_examp": "At the same time, the two sisters began to throw earth and stones."}, {"sense": "used when you are extremely surprised, confused, or angry about something", "level": "C1", "dict_examp": "Why on earth didn't you tell me before?", "lear_examp": "How on earth can you have a coach without a toilet?"}]}]}, {"word": "easily", "poses": [{"pos": "adverb", "senses": [{"sense": "with no difficulty or effort", "level": "A2", "dict_examp": "I can easily get some food on the way home tonight, if you'd like.", "lear_examp": "There are a lot of mountains and the weather is lovely. You can easily get there by bus."}, {"sense": "used to emphasize that something is likely", "level": "C1", "dict_examp": "A comment like that could easily be misunderstood.", "lear_examp": "In conclusion, even if products seem to be the same in many countries, there are more differences left between them, which fortunately will not easily change in the future, such as landscapes and scenery."}, {"sense": "certainly the best/worst/biggest, etc.", "level": "C2", "dict_examp": "It was easily the biggest dog I have ever seen.", "lear_examp": "In conclusion, the percentage of newly employed make up easily the biggest proportion of UK university students who graduated in 2001."}]}]}, {"word": "easygoing", "poses": [{"pos": "adjective", "senses": [{"sense": "usually relaxed and calm, not worried or upset", "level": "B1", "dict_examp": "My brother is easygoing, but I'm the excitable type.", "lear_examp": "She was friendly, easygoing and sociable, and I enjoyed my free time with her."}]}]}, {"word": "earn", "poses": [{"pos": "verb", "senses": [{"sense": "to receive money for doing work", "level": "A2", "dict_examp": "She earns about $50,000 a year.", "lear_examp": "We can wash cars to earn some money for the necessary materials."}, {"sense": "to have enough money for the things you need from doing your work", "level": "B2", "dict_examp": "You can't expect to earn a living from your painting.", "lear_examp": "We work to earn a living."}, {"sense": "to get something that you deserve because of your work, qualities, etc.", "level": "C2", "dict_examp": "As a teacher you have to earn the respect of your students.", "lear_examp": "In Japan they always had to keep a certain image to earn the respect they deserved but in that house they could set free their emotions."}]}]}, {"word": "efficient", "poses": [{"pos": "adjective", "senses": [{"sense": "working or operating quickly and effectively in an organized way", "level": "B1", "dict_examp": "The city's transportation system is one of the most efficient in Europe.", "lear_examp": "The staff were so courteous and efficient, and the atmosphere was intimate and relaxing."}]}]}, {"word": "eccentric", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving in a strange and unusual way", "level": "C2", "dict_examp": "an eccentric professor", "lear_examp": "Celebrities become eccentric to the point of godlike insanity."}]}]}, {"word": "economical", "poses": [{"pos": "adjective", "senses": [{"sense": "not using a lot of money, fuel,  etc.", "level": "B2", "dict_examp": "What's the most economical way of heating this building?", "lear_examp": "Moreover a bike is a very economical means of transport because it does not need any fuel."}]}]}, {"word": "effectiveness", "poses": [{"pos": "noun", "senses": [{"sense": "the degree to which something achieves its intended result", "level": "C1", "dict_examp": "There are doubts about the effectiveness of the drug.", "lear_examp": "If this is done, the effectiveness of the lessons will no doubt be increased."}]}]}, {"word": "eighteen", "poses": [{"pos": "number", "senses": [{"sense": "the number 18", "level": "A1", "dict_examp": "seventeen, eighteen, nineteen", "lear_examp": "I want to sell a bike. It is eighteen years old."}]}]}, {"word": "educational", "poses": [{"pos": "adjective", "senses": [{"sense": "providing education or relating to education", "level": "B2", "dict_examp": "educational toys", "lear_examp": "There is also an educational advantage to having zoos."}]}]}, {"word": "eighth", "poses": [{"pos": "ordinal number", "senses": [{"sense": "8th written as a word", "level": "A2", "dict_examp": "He finished eighth in the race.", "lear_examp": "I'm free on the eighth of June."}]}]}, {"word": "edible", "poses": [{"pos": "adjective", "senses": [{"sense": "safe to eat and not harmful", "level": "C1", "dict_examp": "edible berries", "lear_examp": "Part of your journey can be made through the forests where you can pick up some edible berries and wild mushrooms but be careful, you may need the local guide to help you with decisions there."}]}]}, {"word": "effectively", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is successful and achieves what you want", "level": "B2", "dict_examp": "Teachers need to be able to communicate ideas effectively.", "lear_examp": "As well as learning English, we should be aware of the cultures of many countries in order to be able to communicate more effectively."}]}]}, {"word": "education", "poses": [{"pos": "noun", "senses": [{"sense": "the process of teaching or learning in a school or college, or the knowledge that you get from this", "level": "B1", "dict_examp": "primary/secondary/adult/university/higher education", "lear_examp": "She wanted me to tell her about people, education, life and history."}]}]}, {"word": "egg", "poses": [{"pos": "noun", "senses": [{"sense": "an oval object with a hard shell which is produced by female birds, especially chickens, and which is eaten as food", "level": "A1", "dict_examp": "a hard-boiled/soft-boiled egg", "lear_examp": "I like to eat soup, eggs, meat and salad, and drink orange juice."}, {"sense": "an oval object with a hard shell that contains a baby bird, insect or other creature", "level": "B2", "dict_examp": "The cuckoo lays her egg in another bird's nest.", "lear_examp": "The only thing they can do is to lay eggs."}, {"sense": "a sum of money that has been saved or kept for a specific purpose", "level": "C2", "dict_examp": "She used her nest egg to buy a really good  piano.", "lear_examp": "She was the only heir of a rich family and her husband, who died ten years ago, left her a sizeable nest egg."}]}]}, {"word": "economic", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to trade, industry and money", "level": "B2", "dict_examp": "We have seen ten years of economic growth.", "lear_examp": "Nowadays there are economic problems in many countries."}]}]}, {"word": "eat", "poses": [{"pos": "verb", "senses": [{"sense": "to put food into your mouth and then swallow it", "level": "A1", "dict_examp": "Who ate all the cake?", "lear_examp": "I want to go to the river and eat a big chocolate cake."}, {"sense": "to have a meal", "level": "A1", "dict_examp": "We usually eat at about 7 o'clock.", "lear_examp": "I go there to eat whenever I have time."}, {"sense": "to eat in a restaurant", "level": "B1", "dict_examp": "When I lived in Spain, I used to eat out all the time.", "lear_examp": "If you don't have any plans next weekend, I want to eat out with you."}, {"sense": "to eat all the food you have been given", "level": "B2", "dict_examp": "Be a good boy and eat up your dinner.", "lear_examp": "There wasn't any more time after eating it up."}]}]}, {"word": "eight", "poses": [{"pos": "number", "senses": [{"sense": "the number 8", "level": "A1", "dict_examp": "She was eight years old when her family moved here.", "lear_examp": "I will arrive at eight in the morning."}]}]}, {"word": "editor", "poses": [{"pos": "noun", "senses": [{"sense": "a person who corrects or changes text, film, etc., or a person who is in charge of a newspaper or magazine", "level": "B2", "dict_examp": "She's a senior editor in the reference department of a publishing company.", "lear_examp": "It seems to me that you don't take your job as seriously as every reader expects from an objective and informative newspaper editor."}]}]}, {"word": "economist", "poses": [{"pos": "noun", "senses": [{"sense": "a person who studies or has a special knowledge of economics", "level": "B2", "dict_examp": "", "lear_examp": "I discovered that one of the examiners was a very famous economist."}]}]}, {"word": "ecologically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that relates to ecology or the environment", "level": "B2", "dict_examp": "It's an ecologically friendly/sound means of transport.", "lear_examp": ""}]}]}, {"word": "efficiently", "poses": [{"pos": "adverb", "senses": [{"sense": "quickly and effectively in an organized way", "level": "B2", "dict_examp": "She runs the business very efficiently.", "lear_examp": "Needless to say, the computer plays a key role in making us use a library efficiently."}]}]}, {"word": "effort", "poses": [{"pos": "noun", "senses": [{"sense": "an attempt to do something", "level": "B1", "dict_examp": "If we could all make an effort to keep this office neater it would help.", "lear_examp": "So they planned everything and they didn't have to make an effort as the stupid \"kidnapper\" was walking my dog round the park before the meeting so they arrested him and I got my dog back."}, {"sense": "the energy that you need to do  something", "level": "B1", "dict_examp": "They've put a lot of effort into getting the design of the magazine right.", "lear_examp": "We climbed a mountain and it was so hard, but the effort was worth it because the view was beautiful."}]}]}, {"word": "economy", "poses": [{"pos": "noun", "senses": [{"sense": "the system by which a country produces and uses goods and money", "level": "B2", "dict_examp": "the German/US economy", "lear_examp": "As China's economy is growing fast, we will run low on resources soon."}]}]}, {"word": "edit", "poses": [{"pos": "verb", "senses": [{"sense": "to prepare text, film, etc. by deciding what to include and by correcting mistakes", "level": "B2", "dict_examp": "Janet edited books for a variety of publishers.", "lear_examp": "If you can edit these errors, I would appreciate it."}]}]}, {"word": "effective", "poses": [{"pos": "adjective", "senses": [{"sense": "successful or achieving the results that you want", "level": "B2", "dict_examp": "effective management", "lear_examp": "To be honest, I don't think it's very effective, but we have to do something against fat."}]}]}, {"word": "efficiency", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something uses time and energy well, without wasting any", "level": "B2", "dict_examp": "What is so impressive about their society is the efficiency of the public services.", "lear_examp": "Finally, I think modern technology makes me do my business faster, with much more efficiency."}]}]}, {"word": "effect", "poses": [{"pos": "noun", "senses": [{"sense": "the result of a particular influence", "level": "B1", "dict_examp": "The accident had a big effect on her life.", "lear_examp": "The next day, my teacher asked me to stand in front of all the students and then she told my classmates that being honest could always bring us a gift or have a fantastic effect on our life."}, {"sense": "a sound, image, etc. that is created artificially", "level": "B1", "dict_examp": "It's got to be thirty seconds long, and we can use whatever sound effects we like.", "lear_examp": "The film was amazing, with excellent special effects and good actors."}, {"sense": "to begin, or to start to produce results or changes", "level": "C1", "dict_examp": "The medicine should take effect quickly.", "lear_examp": "Some factories tried to organize transport means for the employees, but it took effect in small towns only, where people travel shorter distances."}, {"sense": "make little/no difference", "level": "C1", "dict_examp": "The new measures have had little effect on ordinary people's lives.", "lear_examp": "As for the weather, it was only a five-minute shower that soon passed over and therefore had no effect on the show."}, {"sense": "used to say what the real situation is", "level": "C2", "dict_examp": "This means, in effect, that the plan has been scrapped.", "lear_examp": "However, if the government increases the amount of money they pay to the unemployed, that in effect means higher taxes for the citizens which will cause strikes and various other problems."}, {"sense": "to begin being used", "level": "C2", "dict_examp": "New food safety rules went into effect on Monday.", "lear_examp": "In conclusion, I believe that if these suggestions are put into effect they will improve life for younger people, as youths will have the ability to gather in a place and spend their time as they like."}]}]}, {"word": "eighty", "poses": [{"pos": "NUMBER", "senses": [{"sense": "the number 80", "level": "A2", "dict_examp": "seventy, eighty, ninety", "lear_examp": "The film is a fantasy novel and it was written by Tolkien about eighty years ago."}, {"sense": "to be aged between 80 and 89", "level": "B2", "dict_examp": "Many of the residents are in their eighties.", "lear_examp": ""}, {"sense": "the years 1980 through 1989", "level": "B2", "dict_examp": "They moved to Georgia in the eighties.", "lear_examp": "He is a normal man with no special education, but he became famous during the eighties as a musician."}]}]}, {"word": "ecology", "poses": [{"pos": "noun", "senses": [{"sense": "the relationship between living things and the environment, or the scientific study of this", "level": "C1", "dict_examp": "The oil spill caused terrible damage to the fragile ecology of the coast.", "lear_examp": "This solution supports business - well, then it's up to the residents to choose either business or ecology."}]}]}, {"word": "edge", "poses": [{"pos": "noun", "senses": [{"sense": "the part of something that is farthest from the center", "level": "B1", "dict_examp": "He'd piped fresh cream around the edge of the cake.", "lear_examp": "Finally, I managed to move my right foot closer to the edge."}, {"sense": "the part of a blade of a knife or tool that cuts, or any sharp part of an object which could cut", "level": "B2", "dict_examp": "Careful with that open can - it's got a very sharp edge.", "lear_examp": "When I sat down, I didn't notice that the seat in front of me was broken on the side, and when it was time for me to get off the bus, I cut my hand on the sharp edge."}, {"sense": "to be slightly better than someone or something else", "level": "C2", "dict_examp": "Because of her experience she has an edge over the other applicants.", "lear_examp": "Reading the latest information, attending conferences and symposiums and being well informed in general about your field, gives you an edge over your competitors."}, {"sense": "to be nervous or worried", "level": "C2", "dict_examp": "Sorry for shouting - I'm a little on edge today.", "lear_examp": "I was consequently on edge all the time and was not able to have fun as much as the others did."}]}]}, {"word": "echo", "poses": [{"pos": "verb", "senses": [{"sense": "If a sound echoes, or a place echoes with a sound, you hear the sound again because you are in a large, empty space.", "level": "C2", "dict_examp": "Their voices echoed around the room.", "lear_examp": "Our cheer of delight united with the neighing of the horses and the din of the hens still echoes in my ears."}, {"sense": "to repeat something that someone else has said or to express ideas or feelings similar to those of someone else", "level": "C2", "dict_examp": "This report echoes some of the earlier research I've read.", "lear_examp": "I find myself echoing many of the points you have raised."}]}, {"pos": "noun", "senses": [{"sense": "a sound that you hear more than once after it hits a surface in a big space", "level": "C2", "dict_examp": "I could hear the echo of the bell.", "lear_examp": "You can always hear the echo of a bell."}]}]}, {"word": "either", "poses": [{"pos": "conjunction", "senses": [{"sense": "used when you are giving a choice between two or more things", "level": "B1", "dict_examp": "Either you leave now or I call the police!", "lear_examp": "We can go either to the beach or to the inner part of Uruguay which is mainly a huge meadow."}]}, {"pos": "adverb", "senses": [{"sense": "used in negative sentences to mean that something else is true", "level": "B1", "dict_examp": "I don't eat meat and my husband doesn't either.", "lear_examp": "It's so quick and not too expensive either."}]}, {"pos": "pronoun", "senses": [{"sense": "one of two people or things when it is not important which", "level": "B1", "dict_examp": "Either candidate would be ideal for the job.", "lear_examp": "But, either option, call me at my house before coming."}, {"sense": "used to talk about two possibilities where the result will be the same", "level": "B1", "dict_examp": "You can get there by train or bus - either way it takes an hour.", "lear_examp": "If that doesn't work, you can ask them to talk to your friends' parents so you could all go together. Either way, I know you will have lots of fun this summer."}, {"sense": "both sides/ends, etc.", "level": "B2", "dict_examp": "Friends sat on either side of me on the plane.", "lear_examp": "You can watch it while it's eating: standing up on its back legs and holding the nut with its front legs, then putting all of it into one of its two \"sacks\" on either side of its mouth."}]}]}, {"word": "economics", "poses": [{"pos": "noun", "senses": [{"sense": "the study of the way in which trade, industry and money are organized", "level": "B1", "dict_examp": "She's in her third year at York University, studying economics .", "lear_examp": "I am 20 years old and I am studying economics at university in Berlin."}]}]}, {"word": "educate", "poses": [{"pos": "verb", "senses": [{"sense": "to teach someone in a school, college or university", "level": "B2", "dict_examp": "She was educated at Crown Woods preparatory school.", "lear_examp": "Occasionally, students are not being educated equally. I strongly believe that students have to have the right to choose their subjects."}, {"sense": "to give people information about something so that they understand it better", "level": "B2", "dict_examp": "The government said it is trying to do more to educate the public about the consequences of drug abuse.", "lear_examp": "Therefore, in my opinion, if people had been educated to love and respect nature, zoos would have already been abolished."}]}]}, {"word": "edition", "poses": [{"pos": "noun", "senses": [{"sense": "a book, newspaper, etc. that is one of several that are the same and were produced at the same time", "level": "B2", "dict_examp": "a new edition", "lear_examp": "With reference to your advertisement in Thursday's edition of the Daily Star, I am interested in applying for the position of babysitter."}]}]}, {"word": "ecological", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to ecology or the environment", "level": "B2", "dict_examp": "The destruction of the rain forests is an ecological disaster.", "lear_examp": "There are ecological, technical, and social problems."}]}]}, {"word": "eggplant", "poses": [{"pos": "noun", "senses": [{"sense": "an oval, purple vegetable that is white inside", "level": "B2", "dict_examp": "For dinner we had eggplant parmigiana - eggplant with tomato sauce and cheese.", "lear_examp": ""}]}]}, {"word": "eldest", "poses": [{"pos": "adjective", "senses": [{"sense": "the oldest of three or more children, brothers, etc., especially within a family", "level": "B1", "dict_examp": "Her eldest child is nearly 14.", "lear_examp": "And guess who I met: Jack Hawk, Tony Hawk's eldest son."}]}, {"pos": "noun", "senses": [{"sense": "a person who is the oldest of three of more people", "level": "B2", "dict_examp": "He was the eldest of four kids.", "lear_examp": "She's the eldest - 98 years old - and knows the whole history of our town."}]}]}, {"word": "elite", "poses": [{"pos": "noun", "senses": [{"sense": "the richest, most powerful, or best educated group in a society", "level": "C1", "dict_examp": "a member of the elite", "lear_examp": "But before you decide to become one of the elite, you should think about all the freedom you would be giving up and all the freedom you would get."}]}]}, {"word": "electronically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that uses electronic equipment, especially a computer", "level": "B2", "dict_examp": "electronically generated graphics", "lear_examp": "I hope that you can subscribe to the Internet as well so that we can communicate electronically."}]}]}, {"word": "elusive", "poses": [{"pos": "adjective", "senses": [{"sense": "difficult to describe, find, achieve, or remember", "level": "C2", "dict_examp": "The answers to these questions remain as elusive as ever.", "lear_examp": "Nowadays, the picture of a clean environment seems to be an elusive goal moving ever further from us."}]}]}, {"word": "elderly", "poses": [{"pos": "adjective", "senses": [{"sense": "a more polite word for \"old,\" used to describe people", "level": "B1", "dict_examp": "elderly relatives/parents", "lear_examp": "This short story is about a man who is accused of having murdered a rich elderly widow."}]}, {"pos": "noun", "senses": [{"sense": "people who are elderly", "level": "C1", "dict_examp": "The city is building new housing for the elderly.", "lear_examp": "I also heard complaints from the elderly, fearing the city streets due to the traffic, something that would not be resolved by a central parking lot, and certainly the elderly would be the ones worst affected by increased pollution, with their less effective immune systems."}]}]}, {"word": "electronic", "poses": [{"pos": "adjective", "senses": [{"sense": "Electronic equipment consists of things such as computers, televisions, and radios.", "level": "B1", "dict_examp": "electronic components/devices", "lear_examp": "I like buying clothes, but I prefer buying some other stuff like electronic devices or that sort of thing."}, {"sense": "done by computers", "level": "B1", "dict_examp": "electronic communication", "lear_examp": "On the other hand, many people argue about the security of an electronic transaction and also that not many people have Internet access."}]}]}, {"word": "elevator", "poses": [{"pos": "noun", "senses": [{"sense": "a machine that carries people up and down in tall buildings", "level": "A2", "dict_examp": "Just take the elevator up to the fourth floor.", "lear_examp": "I can meet you at 7:00 pm near to the elevator."}]}]}, {"word": "electronics", "poses": [{"pos": "noun", "senses": [{"sense": "the scientific study of electric current and the technology that uses it", "level": "B2", "dict_examp": "a degree in electronics", "lear_examp": "I am still  studying electronics and computer science."}]}]}, {"word": "elegantly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is elegant", "level": "B2", "dict_examp": "elegantly dressed", "lear_examp": "You should always be dressed elegantly."}]}]}, {"word": "eleven", "poses": [{"pos": "number", "senses": [{"sense": "the number 11", "level": "A1", "dict_examp": "nine, ten, eleven, twelve", "lear_examp": "I invited ten or eleven friends."}]}]}, {"word": "else", "poses": [{"pos": "adverb", "senses": [{"sense": "in addition to someone or something", "level": "A2", "dict_examp": "Would you like anything else to eat?", "lear_examp": "If you need anything else, you'll find it in the classroom."}, {"sense": "different from someone or something", "level": "A2", "dict_examp": "I don't like it here. Let's go somewhere else.", "lear_examp": "I think we should go somewhere else to have a drink after the film."}, {"sense": "other things or people", "level": "A2", "dict_examp": "I forgot my toothbrush, but I remembered everything else.", "lear_examp": "As this year I turned 12 my mom and dad gave me 12 gifts and everyone else gave me clothes or money."}, {"sense": "used to say what will happen if another thing does not happen", "level": "B2", "dict_examp": "We must be there by six, or else we'll miss the beginning.", "lear_examp": "He told me to hurry up, or else I would miss my bus."}]}]}, {"word": "election", "poses": [{"pos": "noun", "senses": [{"sense": "a time when people vote in order to choose someone for a political or official job", "level": "B1", "dict_examp": "a presidential election", "lear_examp": "The film shows very different things about the American election."}]}]}, {"word": "electrician", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to put in, check or repair electrical wires and equipment", "level": "B2", "dict_examp": "We have an electrician coming to put some new outlets in.", "lear_examp": "The following day we had to call an electrician in because my brother had broken down the lighting in the whole house."}]}]}, {"word": "electricity", "poses": [{"pos": "noun", "senses": [{"sense": "a type of energy that can produce light and heat, or make machines work", "level": "A2", "dict_examp": "The electricity has been turned off.", "lear_examp": "You can also see how life is in our African villages, where there is no electricity or gas and where water comes only from the river."}]}]}, {"word": "elbow", "poses": [{"pos": "noun", "senses": [{"sense": "the part in the middle of your arm where it bends", "level": "B1", "dict_examp": "Her arm was bandaged from the elbow to the fingers.", "lear_examp": "I was sure I would have a beautiful bruise on my elbow."}]}]}, {"word": "elder", "poses": [{"pos": "adjective", "senses": [{"sense": "a sister/brother/son/daughter who is older than the other sister(s), brother(s), etc.", "level": "B1", "dict_examp": "My elder sister is getting married.", "lear_examp": "My elder brother visited me in Berlin as you know."}]}, {"pos": "noun", "senses": [{"sense": "the older person of two people", "level": "B2", "dict_examp": "Of the two brothers, Harvey is the elder.", "lear_examp": "We first meet Joss, the elder, when Mary, the heroine of the story, arrived at the inn."}, {"sense": "people older than you", "level": "C2", "dict_examp": "I was taught to respect my elders.", "lear_examp": "Little can our elders do to enlighten us if they are chained to a machine to keep on breathing."}]}]}, {"word": "eliminate", "poses": [{"pos": "verb", "senses": [{"sense": "to remove something from something, or get rid of something", "level": "C1", "dict_examp": "The doctor advised me to eliminate salt from my diet.", "lear_examp": "The parents should spend enough time with their offspring and teach them the good things and eliminate the bad things."}, {"sense": "to defeat someone so that they cannot go any further in a competition", "level": "C1", "dict_examp": "She was eliminated after the first round of the tournament.", "lear_examp": ""}]}]}, {"word": "elapse", "poses": [{"pos": "verb", "senses": [{"sense": "If time elapses, it passes.", "level": "C2", "dict_examp": "Two years have elapsed since we last saw him.", "lear_examp": "Now that such a long period of time has elapsed and nothing has changed we have decided to write to you."}]}]}, {"word": "elimination", "poses": [{"pos": "noun", "senses": [{"sense": "when you eliminate someone or something", "level": "C2", "dict_examp": "the elimination of disease/pain", "lear_examp": "Investments, education, birth control, political stability, jobs - all of these factors will contribute to the elimination of homelessness."}]}]}, {"word": "elaborate", "poses": [{"pos": "adjective", "senses": [{"sense": "complicated, detailed, or made carefully from many parts", "level": "C2", "dict_examp": "an elaborate ceremony", "lear_examp": "A nurse was standing nearby, adjusting an intravenous vial suspended by an elaborate array of tubes."}]}]}, {"word": "elegance", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something is stylish or attractive in their appearance or behavior", "level": "C1", "dict_examp": "We were impressed by the elegance of his clothes.", "lear_examp": "As with the sport I mentioned before, it also has the grace and elegance of a dancer and the technique, of course, of a skater."}]}]}, {"word": "elephant", "poses": [{"pos": "noun", "senses": [{"sense": "a very large, gray animal with big ears and a very long nose with which it picks things up", "level": "A2", "dict_examp": "", "lear_examp": "We saw elephants, tigers, snakes, monkeys... and in the afternoon we visited the museums."}]}]}, {"word": "elementary", "poses": [{"pos": "adjective", "senses": [{"sense": "basic or relating to the early stages of studying a subject", "level": "B1", "dict_examp": "students at elementary level", "lear_examp": "This book can be used by English students at an elementary level."}]}]}, {"word": "electric", "poses": [{"pos": "adjective", "senses": [{"sense": "Electric lights, tools, etc. work using electricity.", "level": "A2", "dict_examp": "an electric car/heater", "lear_examp": "I like rock music so if you want I can play my electric guitar at your concert."}, {"sense": "supplying electricity", "level": "B1", "dict_examp": "an electric plug/outlet", "lear_examp": "The weight of the snow broke the branches of the trees and some branches fell on electric cables, breaking them."}, {"sense": "full of excitement and emotion", "level": "C1", "dict_examp": "The atmosphere backstage was electric.", "lear_examp": "That was on Friday night, and on my way to the stadium where the concert was taking place I started to feel the electric atmosphere."}]}]}, {"word": "element", "poses": [{"pos": "noun", "senses": [{"sense": "a part of something", "level": "B2", "dict_examp": "List the elements which make up a perfect dinner party.", "lear_examp": "The main element of a novel is, of course, the story itself."}, {"sense": "a simple substance that cannot be reduced to smaller chemical parts, for example hydrogen", "level": "B2", "dict_examp": "Iron is one of the elements of the Earth's crust.", "lear_examp": "Cars produce CO2 and this combining of chemical elements pollutes our environment and promotes the Greenhouse effect."}, {"sense": "a small amount of an emotion or quality", "level": "C2", "dict_examp": "There's an element of truth in what she says.", "lear_examp": "I think the reason why I loved Marseille so much was because it brought an element of insecurity and danger into my life."}]}]}, {"word": "either", "poses": [{"pos": "conjunction", "senses": [{"sense": "used when you are giving a choice between two or more things", "level": "B1", "dict_examp": "Either you leave now or I call the police!", "lear_examp": "We can go either to the beach or to the inner part of Uruguay which is mainly a huge meadow."}]}, {"pos": "adverb", "senses": [{"sense": "used in negative sentences to mean that something else is true", "level": "B1", "dict_examp": "I don't eat meat and my husband doesn't either.", "lear_examp": "It's so quick and not too expensive either."}]}, {"pos": "pronoun", "senses": [{"sense": "one of two people or things when it is not important which", "level": "B1", "dict_examp": "Either candidate would be ideal for the job.", "lear_examp": "But, either option, call me at my house before coming."}, {"sense": "used to talk about two possibilities where the result will be the same", "level": "B1", "dict_examp": "You can get there by train or bus - either way it takes an hour.", "lear_examp": "If that doesn't work, you can ask them to talk to your friends' parents so you could all go together. Either way, I know you will have lots of fun this summer."}, {"sense": "both sides/ends, etc.", "level": "B2", "dict_examp": "Friends sat on either side of me on the plane.", "lear_examp": "You can watch it while it's eating: standing up on its back legs and holding the nut with its front legs, then putting all of it into one of its two \"sacks\" on either side of its mouth."}]}]}, {"word": "elect", "poses": [{"pos": "verb", "senses": [{"sense": "to choose someone  for a particular job or position by voting", "level": "B2", "dict_examp": "He was elected president in 1997.", "lear_examp": "In 1987 a young girl, Cecilia Bolocco, was elected Miss Chile."}]}]}, {"word": "elated", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely happy and excited", "level": "C2", "dict_examp": "We were elated by/at the news.", "lear_examp": "When the show was over and I staggered from the scene I found myself in some kind of rose-tinted daze, elated by the sheer joy that, at least for me, only music can bring."}]}]}, {"word": "eligible", "poses": [{"pos": "adjective", "senses": [{"sense": "If you are eligible to do something, you can do it because you are in the right situation.", "level": "C1", "dict_examp": "Only people over 18 are eligible to vote.", "lear_examp": "Hello, I am writing the following article, and I hope to be considered as eligible to win a Personal Computer, in response to your competition entry in the PC World magazine."}]}]}, {"word": "elegant", "poses": [{"pos": "adjective", "senses": [{"sense": "stylish and attractive", "level": "B2", "dict_examp": "She's a very elegant woman.", "lear_examp": "The building itself looks grand and elegant."}]}]}, {"word": "elsewhere", "poses": [{"pos": "adverb", "senses": [{"sense": "in or to another place", "level": "B2", "dict_examp": "The report looks at economic growth in Europe and elsewhere.", "lear_examp": "As for communication with our relatives in Sweden or elsewhere, the fax-machine turned out to be an excellent invention."}]}]}, {"word": "elementary school", "poses": [{"pos": "noun", "senses": [{"sense": "a school for children aged 5 to 11 or 13", "level": "B1", "dict_examp": "I have two children in elementary school.", "lear_examp": "After I started to study (when I was attending the elementary school) and I also started to read comics especially \"THE AMAZING SPIDERMAN.\""}]}]}, {"word": "electrical", "poses": [{"pos": "adjective", "senses": [{"sense": "related to or working using electricity", "level": "B1", "dict_examp": "electrical wiring/equipment", "lear_examp": "Japan is famous for electrical things, and you can buy them cheaper than you do in other countries."}, {"sense": "relating to the production and supply of electricity", "level": "C1", "dict_examp": "electrical engineering", "lear_examp": "As an electrical engineer, computer training is very important to me in several ways."}]}]}, {"word": "embarrassed", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling ashamed or shy", "level": "B1", "dict_examp": "She felt embarrassed about undressing in front of the doctor.", "lear_examp": "I went to the first lesson last week and I have to admit I felt a bit embarrassed about doing some writing at the beginning of the lesson."}]}]}, {"word": "emotionally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that shows emotions or relates to emotions", "level": "B2", "dict_examp": "She spoke emotionally about her experiences as a war correspondent.", "lear_examp": "After two days, Laura was emotionally and physically exhausted."}]}]}, {"word": "empathy", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to imagine what it must be like to be in someone's situation", "level": "C2", "dict_examp": "He lacks empathy.", "lear_examp": "I developed my intercultural skills by joining forces with foreign vice presidents to solve common problems and thus acquired skills such as empathy with other cultures, commitment to a common goal and tolerance."}]}]}, {"word": "emperor", "poses": [{"pos": "noun", "senses": [{"sense": "the male ruler of an empire", "level": "C1", "dict_examp": "Emperor Charlemagne", "lear_examp": "I would certainly go, because it fascinates me how more or less 2,000 years ago, the Roman emperors could build up such a big empire."}]}]}, {"word": "enable", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone able to do something, or to make something possible", "level": "B2", "dict_examp": "Computerization should enable us to cut production costs by half.", "lear_examp": "Furthermore, computers enable us to store any amount of necessary information, which probably would take plenty of room on our bookshelves, if in written form."}]}]}, {"word": "e-mail", "poses": [{"pos": "noun", "senses": [{"sense": "the system for using computers to send messages over the Internet", "level": "A1", "dict_examp": "You can contact me by e-mail.", "lear_examp": "For example, if people live in different countries, they can use e-mail to keep in touch."}, {"sense": "a message or document sent electronically", "level": "A1", "dict_examp": "I got an e-mail from Danielle last week.", "lear_examp": "If you need anything else send me an e-mail."}]}, {"pos": "verb", "senses": [{"sense": "to send a message using e-mail", "level": "A2", "dict_examp": "E-mail me when you have time.", "lear_examp": "Phone me or e-mail me and tell me what you think."}]}]}, {"word": "enclose", "poses": [{"pos": "verb", "senses": [{"sense": "to send something in the same envelope or parcel as something else", "level": "B2", "dict_examp": "I enclose a map of the area.", "lear_examp": "I enclose a copy of my curriculum vitae, which will give you further details about my career to date."}, {"sense": "to be all around something and separate it from other things or places", "level": "C1", "dict_examp": "The house is enclosed by parkland.", "lear_examp": "You know that Aragon is a deep valley which is enclosed by two ranges of mountains."}]}]}, {"word": "emit", "poses": [{"pos": "verb", "senses": [{"sense": "to send out gas, heat, light, etc. into the air", "level": "C2", "dict_examp": "The machine emits a high-pitched sound when you press the button.", "lear_examp": "All the vehicles and factories emit fumes, which cause grave diseases such as cancer."}]}]}, {"word": "encounter", "poses": [{"pos": "verb", "senses": [{"sense": "to experience something unpleasant", "level": "B2", "dict_examp": "We encountered quite a few problems at the beginning.", "lear_examp": "On the other hand, we could infer that teenage life is quite a good time, as there is no stress or anxiety that is usually encountered later on in life."}]}]}, {"word": "end", "poses": [{"pos": "noun", "senses": [{"sense": "the final part of something such as a period of time, activity, or story", "level": "A1", "dict_examp": "I'll pay you at the end of next month.", "lear_examp": "At the end of the party we ate cake."}, {"sense": "the furthest part or final part of a place or thing", "level": "A2", "dict_examp": "Our house is the third from the end on the left.", "lear_examp": "Go up until you get to the end of the road."}, {"sense": "finally, after something has been thought about or discussed a lot", "level": "B1", "dict_examp": "We were thinking about going to Switzerland, but in the end we went to Austria.", "lear_examp": "Well I can only tell you what I would do, but in the end it's your choice."}, {"sense": "when something stops happening", "level": "B2", "dict_examp": "They are calling for an end to the violence.", "lear_examp": "My job comes to an end in two weeks, and then I will have one month free, so it will be possible for me to go on your next trip to Africa."}, {"sense": "to make something stop happening or existing", "level": "B2", "dict_examp": "He's determined to put an end to these rumors.", "lear_examp": "Maybe because I needed someone to know, or because I wanted to put an end to that feeling, and have a normal life."}, {"sense": "for hours/days, etc., without stopping", "level": "B2", "dict_examp": "She practices the violin for hours on end.", "lear_examp": "You can find information on whatever issue you want, science, technology, business, arts, etc., everything is there, without mentioning the fantastic and simplified way of buying by internet or just surfing for hours on end for whatever thing you are interested in."}, {"sense": "a lot", "level": "B2", "dict_examp": "I've had no end of trouble finding a hotel room.", "lear_examp": "I had no end of fun when we were going to the beach and the car stopped and we had to go on foot."}, {"sense": "to make something finish", "level": "C1", "dict_examp": "The stories in the newspaper brought her career to a sudden end.", "lear_examp": "At the end of the year 2002 a great construction was brought to an end."}, {"sense": "to have just enough money to pay for the things that you need", "level": "C1", "dict_examp": "I had to get a second job just to make ends meet.", "lear_examp": "Most students support themselves and barely make ends meet every month."}, {"sense": "If something is not the end of the world, it will not cause very serious problems.", "level": "C2", "dict_examp": "It won't be the end of the world if I don't get this job.", "lear_examp": ""}, {"sense": "to make someone start a new and difficult job or activity without helping them or preparing them for it", "level": "C2", "dict_examp": "My first job was to organize a huge conference - they really threw me in at the deep end!", "lear_examp": "Sometimes we can be thrown in at the deep end and have qualms about making a decision."}, {"sense": "If you do something to/till/until the bitter end, you continue it until it is finished, although it is difficult and takes a long time.", "level": "C2", "dict_examp": "The president fought for his plan to the bitter end.", "lear_examp": "We are willing to talk and find alternatives to the situation, but we are also ready to fight till the bitter end to stand for our rights."}, {"sense": "to be so tired, annoyed, or worried by something that you do not feel that you can deal with it", "level": "C2", "dict_examp": "I’m at the end of my rope with these kids!", "lear_examp": ""}, {"sense": "something that you do because it will help you to achieve something else", "level": "C2", "dict_examp": "I didn't particularly like the job - it was just a means to an end.", "lear_examp": "Major international sports competitions can either be understood as a means to an end or an end in their own right."}, {"sense": "various items of different types that are not valuable or important", "level": "C2", "dict_examp": "We moved most of the furniture to the new house, but there are still a few odds and ends to bring over.", "lear_examp": "The photograph spent some time there; in the drawer under the odds and ends everybody has."}, {"sense": "the last part of something", "level": "C2", "dict_examp": "the tail end of the eighties", "lear_examp": "Both Olivia's and the narrator's stories show India at crucial times of its history: at the tail end of the \"Raj\" and at the initial stage of a modern and independent country."}]}, {"pos": "verb", "senses": [{"sense": "to finish or stop, or to make something finish or stop", "level": "A2", "dict_examp": "When is your meeting due to end?", "lear_examp": "The course ends on 30th September."}, {"sense": "to finally be in a particular place or situation", "level": "B1", "dict_examp": "They're traveling across Europe by train and are planning to end up                             in Moscow.", "lear_examp": "After the movie we went for a drink and we ended up dancing salsa."}]}]}, {"word": "employee", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is paid to work for someone else", "level": "B1", "dict_examp": "The number of employees in the company has tripled over the past decade.", "lear_examp": "There is an exotic atmosphere, helped by the pictures on the walls and the clothes of the employees."}]}]}, {"word": "empire", "poses": [{"pos": "noun", "senses": [{"sense": "a group of countries that is ruled by one person or government", "level": "C1", "dict_examp": "the British Empire", "lear_examp": "All the Greeks can be very proud of him and have to hope that a general with unlimited skills like Alexander will make Greece an unstoppable and worldwide empire again."}, {"sense": "a large group of businesses that is controlled by one person or company", "level": "C1", "dict_examp": "a publishing empire", "lear_examp": "This concerns products like pizzas, French fries and of course hamburgers and the empire MacDonald's."}]}]}, {"word": "empirical", "poses": [{"pos": "adjective", "senses": [{"sense": "based on experience or scientific experiments and not only on ideas", "level": "C2", "dict_examp": "empirical evidence", "lear_examp": "Nevertheless, empirical evidence confirms the importance of food in a country's culture."}]}]}, {"word": "embody", "poses": [{"pos": "verb", "senses": [{"sense": "to represent an idea or quality exactly", "level": "C2", "dict_examp": "He embodies the values of hard work and fair play.", "lear_examp": "The triffids, an aggressive and dangerous species, a serious threat to the existence of mankind, embody the author's fear of what could be the result of genetic mutation."}]}]}, {"word": "emerge", "poses": [{"pos": "verb", "senses": [{"sense": "to appear from somewhere or come out from somewhere", "level": "B2", "dict_examp": "She emerged from the sea, blue with cold.", "lear_examp": "The owner of these eyes emerged from a nearby door, which was shabby and old, like the rest of the street."}, {"sense": "to become known", "level": "C1", "dict_examp": "It emerged that she had lied to her employers.", "lear_examp": "It emerged from the students' survey conducted during the recent protest that unhealthy food and little choice were the main reasons to complain, followed by high prices, unfriendly service and limited opening hours."}]}]}, {"word": "emotional", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to emotions", "level": "B2", "dict_examp": "a child's emotional development", "lear_examp": "Doctors have found that many health problems are linked with  emotional changes in a person's life."}, {"sense": "having and expressing strong feelings", "level": "B2", "dict_examp": "an emotional speech", "lear_examp": "It was so big and full of people that she felt very emotional."}]}]}, {"word": "emotion", "poses": [{"pos": "noun", "senses": [{"sense": "a strong feeling such as love or anger, or strong feelings in general", "level": "B2", "dict_examp": "Like a lot of men, he finds it hard to express/show his emotions.", "lear_examp": "Unlike Annie Lennox, whose voice sounds so pure and full of emotion."}]}]}, {"word": "embarrassing", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel embarrassed", "level": "B1", "dict_examp": "an embarrassing situation", "lear_examp": "The first lesson was very embarrassing for me, because I went late."}]}]}, {"word": "emergency", "poses": [{"pos": "noun", "senses": [{"sense": "a serious or dangerous situation that needs immediate action", "level": "B1", "dict_examp": "Call him - it's an emergency.", "lear_examp": "We really need you. It's an emergency."}]}]}, {"word": "emphasize", "poses": [{"pos": "verb", "senses": [{"sense": "to show that something is especially important or needs special attention", "level": "B2", "dict_examp": "She emphasized the need for a better diet.", "lear_examp": "To put it in a nutshell, I would like to emphasize the fact that I did not spend a \"perfect evening out\" at all."}]}]}, {"word": "encourage", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone more likely to do something, or to make something more likely to happen", "level": "B1", "dict_examp": "We were encouraged to learn foreign languages in school.", "lear_examp": "I thought it would be great to go and I encouraged them to do it."}, {"sense": "to give someone confidence or hope", "level": "B1", "dict_examp": "My parents encouraged me when things weren't going well at school.", "lear_examp": "We went into the ward and looked at her thinking all the happy thoughts we had with her and trying to encourage her to live."}]}]}, {"word": "embassy", "poses": [{"pos": "noun", "senses": [{"sense": "the official group of people who live in a foreign country and represent their government there, or the building where they work", "level": "B1", "dict_examp": "the Swedish Embassy in London", "lear_examp": "He lent me his cell phone to call the embassy."}]}]}, {"word": "empty", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is empty, it does not contain any things or people.", "level": "A2", "dict_examp": "an empty house/street", "lear_examp": "So I haven't got any empty space for the computer."}, {"sense": "having no meaning or value", "level": "C1", "dict_examp": "an empty promise/threat", "lear_examp": "But on the other hand, I need to point out all the empty promises you made with your advertisements."}]}]}, {"word": "employer", "poses": [{"pos": "noun", "senses": [{"sense": "a person or organization that employs people", "level": "B1", "dict_examp": "We need a reference from your former employer.", "lear_examp": "I took this English course and my employer said, if I pass my exam, he will give me a bonus of fifty pounds."}]}]}, {"word": "embrace", "poses": [{"pos": "verb", "senses": [{"sense": "to accept new ideas, beliefs, methods, etc. in an enthusiastic way", "level": "C1", "dict_examp": "We are always eager to embrace the latest technology.", "lear_examp": "They seem to have embraced \"the new deal\" symbolizing \"freedom\"."}, {"sense": "If you embrace someone, you put your arms around them, and if two people embrace, they put their arms around each other.", "level": "C2", "dict_examp": "She embraced him warmly.", "lear_examp": "Prior to this fulfilling statement, the elderly couple had been sitting in their GP's waiting room, nervously embracing each other."}]}, {"pos": "noun", "senses": [{"sense": "when you put your arms around someone", "level": "C2", "dict_examp": "a warm embrace", "lear_examp": "He took the baby home, nevertheless, and tried to learn how to deal with that quiet, funny-faced girl, who didn't seem to ask for anything but kisses and embraces."}]}]}, {"word": "employment", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is paid to work for a company or organization", "level": "B1", "dict_examp": "full-time/part-time/temporary/permanent/regular employment", "lear_examp": "Furthermore, the stores need more employees to work at night, and therefore create employment."}]}]}, {"word": "employ", "poses": [{"pos": "verb", "senses": [{"sense": "to have someone work or do a job for you and pay them for it", "level": "B1", "dict_examp": "How many people does your company employ?", "lear_examp": "As you know I am employed in a travel agency and last week I started my new English class."}, {"sense": "to use something", "level": "C1", "dict_examp": "Companies employ clever tactics to persuade us to buy their products.", "lear_examp": "A friend that I made on the course shares the same opinion and insists on the fact that the course gave us the opportunity to employ some of the techniques we practised in the \"How to Negotiate\" classes."}]}]}, {"word": "emphasis", "poses": [{"pos": "noun", "senses": [{"sense": "the particular importance or attention that you give to something", "level": "B2", "dict_examp": "There is a lot of emphasis on curing disease but too little emphasis on preventing it.", "lear_examp": "In the tale \"It's a good life\", the author gives much more emphasis to  Anthony than to anyone else in the story."}]}]}, {"word": "encouragement", "poses": [{"pos": "noun", "senses": [{"sense": "when someone talks or behaves in a way that gives you confidence to do something", "level": "B2", "dict_examp": "Children need lots of encouragement from their parents.", "lear_examp": "Children need some encouragement, which parents can provide at any time."}]}]}, {"word": "embarrassment", "poses": [{"pos": "noun", "senses": [{"sense": "when you feel embarrassed, or something or someone that makes you feel embarrassed", "level": "B2", "dict_examp": "She blushed with embarrassment.", "lear_examp": "Looking at his face she could see his embarrassment."}]}]}, {"word": "embarrass", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone feel ashamed or shy", "level": "C2", "dict_examp": "My dad's always embarrassing me in front of my friends.", "lear_examp": "He didn't deliberately lie to them and he comes to the conclusion that revealing the truth would have embarrassed them."}]}]}, {"word": "emission", "poses": [{"pos": "noun", "senses": [{"sense": "when gas, heat, light, etc. is sent out into the air, or an amount of gas, heat, light, etc. that is sent out", "level": "C1", "dict_examp": "Carbon dioxide emissions will be reduced by 20%.", "lear_examp": "One may argue from the point of linking CO2 emissions to other known pollutants, like industry, but recent studies have shown traffic to be one of the most important causes of air pollution."}]}]}, {"word": "encouraging", "poses": [{"pos": "adjective", "senses": [{"sense": "giving you confidence or hope", "level": "B2", "dict_examp": "The team's performance was very encouraging.", "lear_examp": "She spoke about young people that want to start this kind of career: she was so encouraging!"}]}]}, {"word": "eminent", "poses": [{"pos": "adjective", "senses": [{"sense": "famous, respected, or important", "level": "C2", "dict_examp": "an eminent historian", "lear_examp": "Last year I was awarded a trip abroad with one of the most eminent professors of our University."}]}]}, {"word": "enjoyable", "poses": [{"pos": "adjective", "senses": [{"sense": "An enjoyable event or experience gives you pleasure.", "level": "B1", "dict_examp": "We had a very enjoyable evening - thank you!", "lear_examp": "First, thanks for the most enjoyable weekend of my life."}]}]}, {"word": "engage", "poses": [{"pos": "verb", "senses": [{"sense": "to interest someone in something and keep them thinking about it", "level": "C1", "dict_examp": "The debate about food safety has engaged the whole nation.", "lear_examp": "It would be great if we could employ professional entertainers to set up activities to engage people and buy fun prizes and awards."}, {"sense": "to take part in something", "level": "C2", "dict_examp": "The two sides have agreed to engage in talks.", "lear_examp": "Quite to the contrary, advocates and opponents of these happenings have engaged in a hot debate concerning their \"true\" value."}]}]}, {"word": "enhance", "poses": [{"pos": "verb", "senses": [{"sense": "to improve something", "level": "C1", "dict_examp": "Winning that award greatly enhanced her reputation.", "lear_examp": "In addition, enhancing the reputation of the family might be another factor as well."}]}]}, {"word": "energetic", "poses": [{"pos": "adjective", "senses": [{"sense": "having or involving a lot of energy", "level": "B2", "dict_examp": "an energetic young woman", "lear_examp": "I am a cheerful and energetic person."}]}]}, {"word": "enjoy", "poses": [{"pos": "verb", "senses": [{"sense": "to get pleasure from something", "level": "A1", "dict_examp": "I really enjoyed that movie/book/concert/party/meal.", "lear_examp": "I really enjoyed my party!"}, {"sense": "to get pleasure from something that you are doing", "level": "A2", "dict_examp": "I think the party went well - people seemed to be enjoying themselves.", "lear_examp": "I'm sure you will enjoy yourself and will never regret visiting me and Azerbaijan."}, {"sense": "to have or experience something good such as success", "level": "C2", "dict_examp": "His play enjoyed great success on Broadway.", "lear_examp": "Before they can enjoy the flowers of success they have to endure the unbearable bitterness of failure."}]}]}, {"word": "enormous", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely large", "level": "B1", "dict_examp": "an enormous car/house", "lear_examp": "It has two bedrooms, an enormous bathroom, a small kitchen and a nice living-room."}]}]}, {"word": "engrossed", "poses": [{"pos": "adjective", "senses": [{"sense": "giving all your attention to something", "level": "C2", "dict_examp": "He was so engrossed in what he was doing that he didn't hear the bell.", "lear_examp": "Youngsters these days are so engrossed in their studies that they do not have much free time to enjoy themselves or make use of the above ways of entertainment."}]}]}, {"word": "endorse", "poses": [{"pos": "verb", "senses": [{"sense": "to say publicly that you support a person, product or action", "level": "C2", "dict_examp": "The idea was endorsed by a majority of members.", "lear_examp": "Furthermore, I endorse entirely the view of the reader who tends to believe that modern buildings should be constructed but with the condition that the old buildings with incredibly important historical value will not be affected in any way."}]}]}, {"word": "endurance", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to keep doing something difficult, unpleasant, or painful for a long time", "level": "C2", "dict_examp": "a race to test athletes' endurance", "lear_examp": "What's more, athletes need endurance."}]}]}, {"word": "ending", "poses": [{"pos": "noun", "senses": [{"sense": "the last part of a story, film, etc.", "level": "B1", "dict_examp": "People want love stories with happy endings.", "lear_examp": "This film is a typical romantic story with a happy ending."}, {"sense": "a part added to the end of a word", "level": "B1", "dict_examp": "To make the plural of \"dog,\" you add the plural ending \"-s.\"", "lear_examp": ""}]}]}, {"word": "endeavor", "poses": [{"pos": "verb", "senses": [{"sense": "to try very hard to do something", "level": "C1", "dict_examp": "I endeavored to explain the legal consequences of his action.", "lear_examp": "However, one should bear in mind that, while they work, they endeavor to graduate from school or enter the university, which makes things very difficult."}]}, {"pos": "noun", "senses": [{"sense": "an attempt to do something", "level": "C2", "dict_examp": "Writing is a very different endeavor than teaching.", "lear_examp": "I am, therefore, expressing my willingness, through this letter, to participate in this endeavor in whatever way you may see fit."}]}]}, {"word": "enemy", "poses": [{"pos": "noun", "senses": [{"sense": "a person who you dislike or oppose", "level": "B1", "dict_examp": "He's made a few enemies in this company.", "lear_examp": "I have made a lot of enemies."}, {"sense": "a country, or the armed forces of a country, which is at war with another country", "level": "B2", "dict_examp": "enemy forces/territory", "lear_examp": ""}]}]}, {"word": "end", "poses": [{"pos": "noun", "senses": [{"sense": "the final part of something such as a period of time, activity, or story", "level": "A1", "dict_examp": "I'll pay you at the end of next month.", "lear_examp": "At the end of the party we ate cake."}, {"sense": "the furthest part or final part of a place or thing", "level": "A2", "dict_examp": "Our house is the third from the end on the left.", "lear_examp": "Go up until you get to the end of the road."}, {"sense": "finally, after something has been thought about or discussed a lot", "level": "B1", "dict_examp": "We were thinking about going to Switzerland, but in the end we went to Austria.", "lear_examp": "Well I can only tell you what I would do, but in the end it's your choice."}, {"sense": "when something stops happening", "level": "B2", "dict_examp": "They are calling for an end to the violence.", "lear_examp": "My job comes to an end in two weeks, and then I will have one month free, so it will be possible for me to go on your next trip to Africa."}, {"sense": "to make something stop happening or existing", "level": "B2", "dict_examp": "He's determined to put an end to these rumors.", "lear_examp": "Maybe because I needed someone to know, or because I wanted to put an end to that feeling, and have a normal life."}, {"sense": "for hours/days, etc., without stopping", "level": "B2", "dict_examp": "She practices the violin for hours on end.", "lear_examp": "You can find information on whatever issue you want, science, technology, business, arts, etc., everything is there, without mentioning the fantastic and simplified way of buying by internet or just surfing for hours on end for whatever thing you are interested in."}, {"sense": "a lot", "level": "B2", "dict_examp": "I've had no end of trouble finding a hotel room.", "lear_examp": "I had no end of fun when we were going to the beach and the car stopped and we had to go on foot."}, {"sense": "to make something finish", "level": "C1", "dict_examp": "The stories in the newspaper brought her career to a sudden end.", "lear_examp": "At the end of the year 2002 a great construction was brought to an end."}, {"sense": "to have just enough money to pay for the things that you need", "level": "C1", "dict_examp": "I had to get a second job just to make ends meet.", "lear_examp": "Most students support themselves and barely make ends meet every month."}, {"sense": "If something is not the end of the world, it will not cause very serious problems.", "level": "C2", "dict_examp": "It won't be the end of the world if I don't get this job.", "lear_examp": ""}, {"sense": "to make someone start a new and difficult job or activity without helping them or preparing them for it", "level": "C2", "dict_examp": "My first job was to organize a huge conference - they really threw me in at the deep end!", "lear_examp": "Sometimes we can be thrown in at the deep end and have qualms about making a decision."}, {"sense": "If you do something to/till/until the bitter end, you continue it until it is finished, although it is difficult and takes a long time.", "level": "C2", "dict_examp": "The president fought for his plan to the bitter end.", "lear_examp": "We are willing to talk and find alternatives to the situation, but we are also ready to fight till the bitter end to stand for our rights."}, {"sense": "to be so tired, annoyed, or worried by something that you do not feel that you can deal with it", "level": "C2", "dict_examp": "I’m at the end of my rope with these kids!", "lear_examp": ""}, {"sense": "something that you do because it will help you to achieve something else", "level": "C2", "dict_examp": "I didn't particularly like the job - it was just a means to an end.", "lear_examp": "Major international sports competitions can either be understood as a means to an end or an end in their own right."}, {"sense": "various items of different types that are not valuable or important", "level": "C2", "dict_examp": "We moved most of the furniture to the new house, but there are still a few odds and ends to bring over.", "lear_examp": "The photograph spent some time there; in the drawer under the odds and ends everybody has."}, {"sense": "the last part of something", "level": "C2", "dict_examp": "the tail end of the eighties", "lear_examp": "Both Olivia's and the narrator's stories show India at crucial times of its history: at the tail end of the \"Raj\" and at the initial stage of a modern and independent country."}]}, {"pos": "verb", "senses": [{"sense": "to finish or stop, or to make something finish or stop", "level": "A2", "dict_examp": "When is your meeting due to end?", "lear_examp": "The course ends on 30th September."}, {"sense": "to finally be in a particular place or situation", "level": "B1", "dict_examp": "They're traveling across Europe by train and are planning to end up                             in Moscow.", "lear_examp": "After the movie we went for a drink and we ended up dancing salsa."}]}]}, {"word": "engineer", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to design, build or repair machines, engines, roads, bridges, etc.", "level": "A2", "dict_examp": "a civil engineer", "lear_examp": "I can help with the concert, because I'm a sound engineer!"}]}]}, {"word": "enforce", "poses": [{"pos": "verb", "senses": [{"sense": "to make people obey a rule or law", "level": "C1", "dict_examp": "It is the duty of the police to enforce the law.", "lear_examp": "Traffic police rarely enforce the law on public transport vehicles, which leads to a lot of chaos."}]}]}, {"word": "endow", "poses": [{"pos": "verb", "senses": [{"sense": "to have a particular quality or characteristic", "level": "C2", "dict_examp": "The country is richly endowed with natural resources.", "lear_examp": "That some people should have been lucky enough to have been endowed with the talent to write such music, and that some others should have had the gift of voices to sing it, truly leaves me very humble."}]}]}, {"word": "enjoyment", "poses": [{"pos": "noun", "senses": [{"sense": "when you enjoy something", "level": "B2", "dict_examp": "Knowing the ending already didn't spoil my enjoyment of the film.", "lear_examp": "It is worth seeing because of the wonderful actors who play their roles with inspiration and enjoyment."}]}]}, {"word": "endangered", "poses": [{"pos": "adjective", "senses": [{"sense": "used of animals and plants which may soon disappear from the world because there are very few left alive", "level": "B2", "dict_examp": "Tigers are now an endangered species.", "lear_examp": "Many endangered species have been saved by zoos which have been able to make them reproduce."}]}]}, {"word": "engineering", "poses": [{"pos": "noun", "senses": [{"sense": "the work of an engineer, or the study of this work", "level": "B1", "dict_examp": "Richard studied engineering at Manchester University.", "lear_examp": "His name is Marco and he is studying engineering."}]}]}, {"word": "energy", "poses": [{"pos": "noun", "senses": [{"sense": "the power and ability to be very active without becoming tired", "level": "B1", "dict_examp": "Looking after children takes up a lot of time and energy.", "lear_examp": "When we arrived there, I felt very tired. However, as soon as I saw the beautiful sea, I was able to regain my energy."}, {"sense": "the power that comes from electricity, gas, etc.", "level": "B1", "dict_examp": "It is important for us to save energy.", "lear_examp": "I thought of buying an air-conditioning unit, but it consumes too much energy, so I'm going to buy a fan, because it is very hot here."}]}]}, {"word": "enough", "poses": [{"pos": "determiner", "senses": [{"sense": "as much as is necessary", "level": "A2", "dict_examp": "Is there enough cake for everyone?", "lear_examp": "I'll go with you to see the film on Saturday, then we'll go to see Frank if we have enough time."}, {"sense": "as much as or more than is wanted", "level": "B2", "dict_examp": "I've got enough work to do at the moment, without being given any more.", "lear_examp": "Now I think I'm going to stay around here, as I have had enough disappointments for one summer."}, {"sense": "to want something to stop because it is annoying you", "level": "C1", "dict_examp": "I've had enough of your excuses.", "lear_examp": "My neighbors and I have had enough of this sudden and deafening noise, which seems to affect our pets as well."}]}, {"pos": "adverb", "senses": [{"sense": "as much as is necessary", "level": "A2", "dict_examp": "Are you old enough to vote?", "lear_examp": "He didn't study enough."}, {"sense": "although it may seem strange", "level": "B2", "dict_examp": "Strangely enough, I was just speaking to him the other day.", "lear_examp": "Today, strangely enough, people out on the sea, often local fishermen, see the complete castle, like a ghost."}, {"sense": "used for saying that you can understand and accept someone's opinion or decision", "level": "B2", "dict_examp": "\"He says he'll only work on Sunday if he gets paid extra.\" \"Fair enough.\"", "lear_examp": "Most of the streets are open to cars and therefore people tend to escape to a little area around the pedestrian streets. Fair enough, but it makes those streets terribly overcrowded."}, {"sense": "used to say that something is more than is needed or wanted or has gone on too long", "level": "C2", "dict_examp": "The play was dull and I decided enough is enough and left early.", "lear_examp": "I have been working very hard for the last eight years or so, but I think that enough is enough. Now I would like to get rid of some responsibilities at work and find more time to enjoy the things life offers and that have little to do with work: family, friends, hobbies."}, {"sense": "as expected", "level": "C2", "dict_examp": "He said the book was on his desk, and sure enough, there it was.", "lear_examp": "And sure enough, these challenging problems come unsolicited most of the time."}]}]}, {"word": "endless", "poses": [{"pos": "adjective", "senses": [{"sense": "never finishing, or seeming never to finish", "level": "B2", "dict_examp": "We used to have endless arguments about politics.", "lear_examp": "No matter the efforts I made to finish it, it seemed that the work I had to do was endless."}]}]}, {"word": "engaged", "poses": [{"pos": "adjective", "senses": [{"sense": "having formally agreed to marry", "level": "B1", "dict_examp": "Debbie and Chris just got engaged.", "lear_examp": "I'm engaged to him."}]}]}, {"word": "engine", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a vehicle that uses energy from oil, electricity or steam to make it move", "level": "A2", "dict_examp": "a jet/diesel engine", "lear_examp": "When we left there, I started my car but the engine didn't work."}]}]}, {"word": "endure", "poses": [{"pos": "verb", "senses": [{"sense": "to suffer something difficult, unpleasant or painful", "level": "B2", "dict_examp": "We had to endure a nine-hour delay at the airport.", "lear_examp": "In addition to this, I have been doing various kinds of sports including swimming and jogging, so I could endure a long trip."}]}]}, {"word": "entertaining", "poses": [{"pos": "adjective", "senses": [{"sense": "funny and enjoyable", "level": "B2", "dict_examp": "an entertaining story/movie/talk", "lear_examp": "It is obvious that some people prefer reading books, while others claim that watching films is much more entertaining."}]}]}, {"word": "entire", "poses": [{"pos": "adjective", "senses": [{"sense": "whole or complete, with nothing missing", "level": "B2", "dict_examp": "Between them they ate an entire cake.", "lear_examp": "On behalf of the entire school, I would like to put forward a number of suggestions in regard to the improvement of the reception area."}]}]}, {"word": "enthusiastically", "poses": [{"pos": "adverb", "senses": [{"sense": "in an enthusiastic way", "level": "B2", "dict_examp": "She responded very enthusiastically to the idea.", "lear_examp": "She accepted my suggestion enthusiastically."}]}]}, {"word": "envy", "poses": [{"pos": "verb", "senses": [{"sense": "to wish that you had something that someone else has", "level": "B2", "dict_examp": "I envy her ability to talk to people she's never met before.", "lear_examp": "I really envy you, Pete."}]}, {"pos": "noun", "senses": [{"sense": "the feeling that you wish you had something that someone else has", "level": "B2", "dict_examp": "I watched with envy as she set off for the airport.", "lear_examp": "Sam, your last letter has filled me with envy."}, {"sense": "to be liked and wanted by someone", "level": "C2", "dict_examp": "Her new office was the envy of the whole company.", "lear_examp": "I enjoy being the envy of my friends as I take it out of its case and show it off."}, {"sense": "to wish very much that you had something that another person has", "level": "C2", "dict_examp": "Sam's got a job in the south of France and we're all green with envy!", "lear_examp": "The more successful players' salary makes the others green with envy."}]}]}, {"word": "entertainer", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to entertain people by singing, telling jokes, etc.", "level": "B2", "dict_examp": "He's a popular entertainer.", "lear_examp": "You could hire some entertainers."}]}]}, {"word": "entertain", "poses": [{"pos": "verb", "senses": [{"sense": "to keep a group of people interested or enjoying themselves", "level": "B1", "dict_examp": "We hired a magician to entertain the children.", "lear_examp": "They always keep playing soft music to entertain the customers."}]}]}, {"word": "entertainment", "poses": [{"pos": "noun", "senses": [{"sense": "shows, movies, television, or other performances or activities that entertain people", "level": "B1", "dict_examp": "There is live entertainment in the bar every night.", "lear_examp": "For evening entertainment or for shopping you can go to Luzern."}]}]}, {"word": "equip", "poses": [{"pos": "verb", "senses": [{"sense": "to provide someone or something with what is needed for a particular purpose", "level": "B2", "dict_examp": "They're raising money to equip the hospital.", "lear_examp": "We were equipped with crampons, ropes, ice axes, gloves, sunglasses and so on."}]}]}, {"word": "equally", "poses": [{"pos": "adverb", "senses": [{"sense": "fairly and in the same way", "level": "B2", "dict_examp": "Everyone should be treated equally.", "lear_examp": "In the festival, all the performers were treated equally."}, {"sense": "into amounts or parts that are the same size", "level": "C1", "dict_examp": "She shared the money equally between the four children.", "lear_examp": "The obligations should be divided equally between the members of the group."}, {"sense": "to the same degree or level", "level": "C1", "dict_examp": "an equally important question", "lear_examp": "I think the choice of a good organization, which can provide good facilities and social conditions, along with good teaching, is equally important."}]}]}, {"word": "enter", "poses": [{"pos": "verb", "senses": [{"sense": "to come or go into a place", "level": "A2", "dict_examp": "The police entered through/by the back door.", "lear_examp": "Without that identity card I can't enter my school."}, {"sense": "to take part in a competition, race or examination", "level": "B1", "dict_examp": "Are you going to enter the photography competition?", "lear_examp": "I have entered a competition and I need your bike."}, {"sense": "to put information into a computer, book or document", "level": "B1", "dict_examp": "You have to enter a password to access the database.", "lear_examp": "You only have to click on the product you want and enter your credit card number."}]}]}, {"word": "equipment", "poses": [{"pos": "noun", "senses": [{"sense": "the set of necessary tools, clothing, etc. for a particular purpose", "level": "B1", "dict_examp": "office/camping/kitchen equipment", "lear_examp": "You can rent equipment or take your own."}]}]}, {"word": "equate", "poses": [{"pos": "verb", "senses": [{"sense": "to consider one thing to be the same as or equal to another thing", "level": "C2", "dict_examp": "Many people equate wealth with happiness.", "lear_examp": "Because we live in a capitalist world where the notions of good life and happiness are largely, if not solely, equated with material prosperity, to achieve them requires the above listed qualities."}]}]}, {"word": "envision", "poses": [{"pos": "verb", "senses": [{"sense": "to imagine something happening, or think that something is likely to happen", "level": "C1", "dict_examp": "He envisioned a partnership between business and government.", "lear_examp": "From the childhood, when you are only a kid, you envision yourself getting married and quite naturally it is a great feeling when you do get married."}]}]}, {"word": "environmentalist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who tries to protect the natural environment from being damaged", "level": "C1", "dict_examp": "She is a well-known environmentalist.", "lear_examp": "Others also, especially environmentalists, suggest that we should turn to electric-powered engines which are environmentally friendly, as these air pollutants bring about the thinning of the ozone layer."}]}]}, {"word": "environment", "poses": [{"pos": "noun", "senses": [{"sense": "the air, land and water where people, animals and plants live", "level": "B1", "dict_examp": "We're not doing enough to protect the environment from pollution.", "lear_examp": "The first lesson was enjoyable - we had to talk about the environment."}, {"sense": "the conditions that you live or work in and the way that they influence how you feel or how effectively you can work", "level": "B2", "dict_examp": "The office is quite bright and airy - it's a pleasant working environment.", "lear_examp": "They need to live in a friendly environment with their relatives and their friends."}]}]}, {"word": "environmentally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is related to the environment", "level": "B2", "dict_examp": "environmentally damaging chemicals", "lear_examp": "All these things were made possible because we have the world's most  dedicated and environmentally adaptable government, spearheaded by Lee Kuan Yew decades ago."}]}]}, {"word": "entrance", "poses": [{"pos": "noun", "senses": [{"sense": "a door, gate, etc. by which you can enter a building or place", "level": "A2", "dict_examp": "There are two entrances - one at the front and one around the back.", "lear_examp": "From my house you can get there by bus. There's a special one, and it'll take you up to the entrance of the park."}, {"sense": "the right to enter a place or join an organization", "level": "B1", "dict_examp": "Entrance to the museum is free on Friday evenings.", "lear_examp": "If you've got membership, you don't need to pay for entrance. You only pay for the drinks and the food."}]}]}, {"word": "episode", "poses": [{"pos": "noun", "senses": [{"sense": "a single event or group of related events", "level": "B2", "dict_examp": "This latest episode in the fraud scandal has shocked a lot of people.", "lear_examp": "This little episode happened when I was seven years old."}, {"sense": "one of the single parts into which a story is divided, especially when it is broadcast on television or radio", "level": "B2", "dict_examp": "I missed the first episode.", "lear_examp": "I watched the news and one episode of \"Friends\"."}]}]}, {"word": "entitle", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone the right to do or have something", "level": "B2", "dict_examp": "I'm entitled to apply for citizenship.", "lear_examp": "In conclusion, I believe that I am entitled to a partial refund."}]}]}, {"word": "environmentally friendly", "poses": [{"pos": "adjective", "senses": [{"sense": "not harmful to the environment", "level": "B2", "dict_examp": "environmentally-friendly laundry detergent", "lear_examp": "A lot was said about creating more environmentally-friendly products."}]}]}, {"word": "equation", "poses": [{"pos": "noun", "senses": [{"sense": "a mathematical statement in which you show that two amounts or symbols are equal", "level": "C1", "dict_examp": "In the equation 3x - 3 = 15, x equals 6.", "lear_examp": "I would like to address the issue using a very simple equation of economics: Demand = supply."}]}]}, {"word": "entirely", "poses": [{"pos": "adverb", "senses": [{"sense": "completely", "level": "B2", "dict_examp": "I admit it was entirely my fault.", "lear_examp": "I would like to do something entirely different before I start to study again."}]}]}, {"word": "envelope", "poses": [{"pos": "noun", "senses": [{"sense": "a flat paper container for a letter", "level": "A2", "dict_examp": "She ripped open the envelope.", "lear_examp": "Last night I left an envelope in your house."}]}]}, {"word": "environmental", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the environment", "level": "B1", "dict_examp": "People are becoming far more aware of environmental issues.", "lear_examp": "As you know, I went to Canada in order to take part in an environmental conference."}]}]}, {"word": "entry", "poses": [{"pos": "noun", "senses": [{"sense": "a separate piece of information that is recorded in a book such as a dictionary, or on the Internet", "level": "B1", "dict_examp": "They've updated a lot of the entries on the website.", "lear_examp": "Later I got my own entry on their Clan-home-page."}, {"sense": "the right or ability to come into or go into a place", "level": "B1", "dict_examp": "She was refused entry.", "lear_examp": ""}, {"sense": "when you join an organization or take part in a competition", "level": "B1", "dict_examp": "Are there lots of exams for entry into the legal profession?", "lear_examp": "As I already said I don't have any information about how to join the club, so I would appreciate very much if you could send me an entry form."}, {"sense": "a piece of work that you do to try to win a competition", "level": "B1", "dict_examp": "There have been a fantastic number of entries for this year's poetry competition.", "lear_examp": ""}]}]}, {"word": "enthusiastic", "poses": [{"pos": "adjective", "senses": [{"sense": "showing enthusiasm", "level": "B2", "dict_examp": "You don't seem very enthusiastic about the party - don't you want to go tonight?", "lear_examp": "I've got a lot of friends who are really enthusiastic about cycling and we often go cycling together."}]}]}, {"word": "equivalent", "poses": [{"pos": "adjective", "senses": [{"sense": "equal in amount, value, importance, or meaning", "level": "C1", "dict_examp": "The UK's Brit Awards are roughly equivalent to the Oscars.", "lear_examp": "The 35-49 year old group started in 1990 with an attendance figure of 60 percent, almost equivalent to the age group of the 25-34 year olds."}]}, {"pos": "noun", "senses": [{"sense": "something that has the same value, importance, size, or meaning as something else", "level": "C1", "dict_examp": "She won the equivalent of $5 million.", "lear_examp": "Most technical terms have Latin roots and are very similar to their German equivalent."}]}]}, {"word": "equality", "poses": [{"pos": "noun", "senses": [{"sense": "the right of different groups of people to have a similar social position and receive the same treatment", "level": "B2", "dict_examp": "equality between the sexes", "lear_examp": "That's why I think people who fight to defend equality are amazing, especially Nelson Mandela because he spent part of his life in jail for that."}]}]}, {"word": "equal", "poses": [{"pos": "adjective", "senses": [{"sense": "the same in amount, number or size", "level": "B1", "dict_examp": "The sides are of equal length.", "lear_examp": "We are a well-mixed class with equal numbers of boys and girls, all about 20 years old."}, {"sense": "the same in importance and deserving the same treatment", "level": "B2", "dict_examp": "All people are equal, deserving the same rights as each other.", "lear_examp": "Then Napoleon did whatever he wanted to do under the motto of \"all animals are equal\", which was false."}]}, {"pos": "noun", "senses": [{"sense": "someone or something that has the same importance as someone or something else and deserves the same treatment", "level": "B2", "dict_examp": "The good thing about having her as a boss is that she treats us all as equals.", "lear_examp": "We must respect and treat them as our equals."}]}]}, {"word": "entity", "poses": [{"pos": "noun", "senses": [{"sense": "something which exists apart from other things", "level": "C2", "dict_examp": "They want the area recognized as a separate political entity.", "lear_examp": "Even if these qualities are also quite useful in team sports, where the whole team works as an entity, a spirit of co-operation and teamwork is also needed in order to achieve the effective coexistence of all the players of the team."}]}]}, {"word": "enthusiasm", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of energetic interest in a particular subject or activity and an eagerness to be involved in it", "level": "B2", "dict_examp": "One of the good things about teaching young children is their enthusiasm.", "lear_examp": "I am filled with enthusiasm about spending two weeks at Camp California in the U.S.A."}]}]}, {"word": "enrich", "poses": [{"pos": "verb", "senses": [{"sense": "to improve the quality of something by adding something to it", "level": "C1", "dict_examp": "Our culture has been enriched by the many immigrants who live here.", "lear_examp": "It can be of great assistance especially for those who start studying the Greek language and for those who want to enrich their knowledge, too."}]}]}, {"word": "enterprise", "poses": [{"pos": "noun", "senses": [{"sense": "a business or organization", "level": "C1", "dict_examp": "private enterprise", "lear_examp": "I suppose that you didn't know about this, and I'd like to believe you will try to correct what is wrong, so that you will be able to establish your enterprise in a firm ground."}, {"sense": "when someone is enthusiastic and willing to do something new and clever, although there are risks involved", "level": "C1", "dict_examp": "They showed a great deal of enterprise in setting up this project.", "lear_examp": "I am talking about a frank and sincere young lady with enterprise."}, {"sense": "a difficult and important plan", "level": "C2", "dict_examp": "Putting on the concert will be a joint enterprise between the two schools.", "lear_examp": "She succeeded in whatever enterprises she undertook all through her life and even the death of her husband did not prevent her from carrying on."}]}]}, {"word": "eradicate", "poses": [{"pos": "verb", "senses": [{"sense": "to destroy or completely get rid of something such as a social problem or a disease", "level": "C2", "dict_examp": "The government claims to be doing all it can to eradicate corruption.", "lear_examp": "Homelessness is not going to be eradicated unless we acknowledge that it is not anything else but a symptom of the imperfection of the society in which we live."}]}]}, {"word": "error", "poses": [{"pos": "noun", "senses": [{"sense": "a mistake", "level": "B2", "dict_examp": "He admitted that he'd made an error.", "lear_examp": "There are a lot of factual errors in this article."}, {"sense": "the amount by which a calculation can be wrong but still give a good result", "level": "C2", "dict_examp": "a margin of error of 5 percent", "lear_examp": "It might be true that what is considered to be healthy or unhealthy changes over time, however, as science progresses the margin of error becomes smaller, and experts are then able to have a more accurate and precise say on all matters, including health."}, {"sense": "a way of learning the best way to do something by trying different methods", "level": "C2", "dict_examp": "There aren't any instructions with it - it's just a matter of trial and error.", "lear_examp": "If you don't know the past, you're liable to live through it again as instead of deriving the lessons from someone else's experiences, you'll have to learn them the hard way, by trial and error."}]}]}, {"word": "erosion", "poses": [{"pos": "noun", "senses": [{"sense": "damage to soil, stone, etc. by water or wind", "level": "C1", "dict_examp": "soil/coastal erosion", "lear_examp": "Deforestation changes the climate and natural ability to stop soil erosion also plays a role here."}, {"sense": "gradual damage to something such as a quality or situation", "level": "C2", "dict_examp": "There has been a gradual erosion of confidence in the government.", "lear_examp": "For one thing, shopping can cause an erosion in family values. Children now tend to give more importance to material things."}]}]}, {"word": "establishment", "poses": [{"pos": "noun", "senses": [{"sense": "a business or other organization, or the place where an organization operates", "level": "C1", "dict_examp": "an educational/religious establishment", "lear_examp": ""}]}]}, {"word": "escape", "poses": [{"pos": "verb", "senses": [{"sense": "to succeed in getting away from a place where you do not want to be", "level": "B1", "dict_examp": "The two prisoners escaped from prison last night.", "lear_examp": "You also get to meet people there, interesting people - for example, I met a really weird guy who claims to have escaped from an asylum, twice!"}, {"sense": "to avoid a dangerous or unpleasant situation", "level": "B2", "dict_examp": "She was lucky to escape serious injury.", "lear_examp": "Happily they were found by some hunters and escaped with minor injuries."}, {"sense": "If something escapes your notice or attention, you do not notice or see it.", "level": "C2", "dict_examp": "Nothing that goes on in this office escapes her attention.", "lear_examp": "It has hardly escaped the attention of anyone that the football World Cup is coming up, and it seems that virtually everybody has something to say about this event or about international sports competitions in general."}, {"sense": "If something such as a name escapes you, you cannot remember it.", "level": "C2", "dict_examp": "The name of her book escapes me at the moment.", "lear_examp": "My first teacher was an elderly woman (her name escapes me now), who had worked in that school for many years."}]}, {"pos": "noun", "senses": [{"sense": "something that helps you to forget about your usual life or problems", "level": "B2", "dict_examp": "I love old movies - they're such an escape from the real world.", "lear_examp": "When I come there in September, I would rather spend our time in the countryside on your uncle's farm. It will be for me an escape from routine and source of revival."}, {"sense": "when someone succeeds in getting out of a place or a dangerous or bad situation", "level": "C1", "dict_examp": "He made his escape on the back of a motorbike.", "lear_examp": "Being impatient in the jail, Tom planned for his escape."}, {"sense": "If you have a narrow escape, you only just avoid danger.", "level": "C2", "dict_examp": "He had a narrow escape when a falling tree crushed his car.", "lear_examp": "Ralph will have a narrow escape: he is saved by the arrival of a ship which has at last come to rescue them all."}]}]}, {"word": "establish", "poses": [{"pos": "verb", "senses": [{"sense": "to start a company or organization that is likely to continue for a long time", "level": "B2", "dict_examp": "The brewery was established in 1822.", "lear_examp": "The first restaurant, which was established 10 years ago, is called Paris."}, {"sense": "to start having a relationship or communicating with another person, company, country, or organization", "level": "C1", "dict_examp": "The two countries have only recently established diplomatic relations.", "lear_examp": "As everyone knows, English is called \"the universal language\", which is used in all the airports of the world, to establish communication between the airports and the planes that arrive from all over the world."}, {"sense": "to put someone or something into a successful and lasting position", "level": "C1", "dict_examp": "He quickly established himself as a talented actor.", "lear_examp": "In fact, after ending his career as a football player, Pele managed to establish himself as a successful businessman."}, {"sense": "to decide something", "level": "C2", "dict_examp": "Our first step must be to establish priorities for the weeks ahead.", "lear_examp": "As well as this, parents have to establish clear guidelines in relation to expenditure."}, {"sense": "to find out information or prove something", "level": "C2", "dict_examp": "The police are trying to establish how he died.", "lear_examp": "In summary, it is difficult to establish how people choose to buy what they buy."}]}]}, {"word": "estimate", "poses": [{"pos": "verb", "senses": [{"sense": "to guess the cost, size, value, etc. of something", "level": "B2", "dict_examp": "Sources estimate a long-term 50% increase in train fares.", "lear_examp": "I estimate it will take only 7 minutes to walk from the conference center to the hotel."}]}, {"pos": "noun", "senses": [{"sense": "a guess of what the size, value, amount, cost, etc. of something might be", "level": "B2", "dict_examp": "The number of people who applied for the course was 120 compared with an initial estimate of between 50 and 100.", "lear_examp": ""}]}]}, {"word": "ethical", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to what is right or wrong", "level": "C2", "dict_examp": "The book raises some serious ethical questions.", "lear_examp": "In addition, being successful requires a certain ruthlessness which enables one to regard one's own ethical standards, as well as one's perception of the world, as beyond criticism."}, {"sense": "morally correct and good", "level": "C2", "dict_examp": "He dealt with this case in a completely professional and ethical manner.", "lear_examp": "It's not so much a problem of funds now, for I and my husband earn our living easily, but the question of how to bring across those moral and ethical values I believe in, namely reliability, honesty, self-confidence, to a certain degree endurance and discipline, paired with friendly and polite manners."}]}]}, {"word": "essential", "poses": [{"pos": "adjective", "senses": [{"sense": "very important and necessary", "level": "B1", "dict_examp": "Government support will be essential if the project is to succeed.", "lear_examp": "Well, thirdly, rest is essential!"}, {"sense": "the most basic and important", "level": "C2", "dict_examp": "There's one essential point I think you've forgotten.", "lear_examp": "There is an essential difference between Germans from Germany and native Germans from abroad."}]}]}, {"word": "erupt", "poses": [{"pos": "verb", "senses": [{"sense": "to burst out suddenly or explode", "level": "C2", "dict_examp": "The crowd erupted in cheers.", "lear_examp": "To talk about youth means awakening all the bursting and erupting emotions."}]}]}, {"word": "essence", "poses": [{"pos": "noun", "senses": [{"sense": "the basic or most important idea or quality of something", "level": "C2", "dict_examp": "The essence of his argument is that we should not eat meat.", "lear_examp": "But growth is in the essence of every living being, and it is a part of the educational process, as the child grows older, that parents learn to \"let go\"."}, {"sense": "used to emphasize the most important idea or quality of something", "level": "C2", "dict_examp": "In essence, its purpose is to contain information.", "lear_examp": "In essence, homelessness means that you don't have a home and because of this you are living on the streets."}]}]}, {"word": "essentially", "poses": [{"pos": "adverb", "senses": [{"sense": "relating to the most important characteristics or ideas of something", "level": "B2", "dict_examp": "It's essentially a dictionary but it differs in one or two respects.", "lear_examp": "Although we are essentially a rock band, we integrate elements of traditional Indian music (such as sitar)."}]}]}, {"word": "evaluate", "poses": [{"pos": "verb", "senses": [{"sense": "to consider or study something carefully and decide how good or bad it is", "level": "C1", "dict_examp": "We need time to evaluate the proposal.", "lear_examp": "The aim of this report is to evaluate and describe how successful our College Film Club has been so far."}]}]}, {"word": "ethic", "poses": [{"pos": "noun", "senses": [{"sense": "ideas and beliefs about what type of behavior is morally right and wrong", "level": "C2", "dict_examp": "a code of ethics", "lear_examp": "By experiencing difficult situations in life, they become wiser and they never forget their values and ethics."}, {"sense": "a belief or idea that influences the way you think or behave", "level": "C2", "dict_examp": "Our school promotes an ethic of service to the community.", "lear_examp": "Though I am no longer a believer, I agree with the whole religious ethic, and I shall transmit it to my children."}]}]}, {"word": "evaluation", "poses": [{"pos": "noun", "senses": [{"sense": "the act of considering something carefully and deciding how good or bad it is", "level": "C1", "dict_examp": "There was no evaluation of the risks involved.", "lear_examp": "And that is what counts in the evaluation of job candidates."}]}]}, {"word": "even", "poses": [{"pos": "adverb", "senses": [{"sense": "used to emphasize something that is surprising", "level": "A2", "dict_examp": "Everyone danced - even Mick.", "lear_examp": "You were the only one who wasn't there, even Marcelo was there!"}, {"sense": "used to emphasize a comparison", "level": "B1", "dict_examp": "Her last film was even better.", "lear_examp": "When I saw her getting off the train I really was close to breaking down because she looked even more beautiful."}, {"sense": "used to emphasize the fact that something does not happen or is not true", "level": "B1", "dict_examp": "\"I never cry.\" \"Not even when you hurt yourself really badly?\"", "lear_examp": "We tried to fish, but didn't catch a thing, not even a shoe!"}, {"sense": "whether or not", "level": "B2", "dict_examp": "Even if you take a taxi, you'll still miss your train.", "lear_examp": "I often go to parks, with or without the children, even if the weather is not good."}, {"sense": "although", "level": "B2", "dict_examp": "Even though he left school at 16, he still managed to become a millionaire.", "lear_examp": "They didn't give up hope even though they were tired and wet to the bone."}, {"sense": "used to emphasize that something surprising is true despite what you have just said", "level": "C1", "dict_examp": "Car prices have gone down a lot, but even so, we couldn't afford to buy one.", "lear_examp": "I'm sure many of these things happened due to bad luck, but even so, there are some arrangements that, I believe, can easily be improved."}, {"sense": "to make as much money as you spent, but no more", "level": "C1", "dict_examp": "The company only managed to break even this year.", "lear_examp": "Company C does not seem to be doing well. In the year 2000, it just seems to be breaking even."}]}]}, {"word": "era", "poses": [{"pos": "noun", "senses": [{"sense": "a period of time in history that is special for a particular reason", "level": "B2", "dict_examp": "the Clinton era", "lear_examp": "The world is paddling through the era of technology."}]}]}, {"word": "escalator", "poses": [{"pos": "noun", "senses": [{"sense": "moving stairs that take people from one level of a building to another", "level": "B2", "dict_examp": "I'll meet you by the up/down escalator on the second floor.", "lear_examp": "The newly decorated section is fairly modern in style with escalators and touch-screen ticket machines."}]}]}, {"word": "erode", "poses": [{"pos": "verb", "senses": [{"sense": "If soil, stone, etc., erodes or is eroded, it is gradually damaged by water or wind.", "level": "C2", "dict_examp": "The coastline is slowly being eroded.", "lear_examp": "The areas of Sayago - in the Spanish province of Zamora - and Tras-os-Montes, in Portugal, are joined by a natural border: the river Duero and the rocky canyon that has been eroded for millions of years by the action of the water."}, {"sense": "to gradually destroy something such as a quality or situation or to make it weaker", "level": "C2", "dict_examp": "Budget cuts could further erode the benefit package provided for by the contract.", "lear_examp": "Competition can erode a child's confidence."}]}]}, {"word": "euro", "poses": [{"pos": "noun", "senses": [{"sense": "the unit of money used in most European Union countries; €", "level": "A2", "dict_examp": "Most hotels are priced between a hundred and two hundred euros a night.", "lear_examp": "The price is 50 euro."}]}]}, {"word": "essay", "poses": [{"pos": "noun", "senses": [{"sense": "a short piece of writing about a particular subject, especially one done by students", "level": "B1", "dict_examp": "For homework I want you to write an essay on endangered species.", "lear_examp": "I could write an extra essay."}]}]}, {"word": "equivalent", "poses": [{"pos": "adjective", "senses": [{"sense": "equal in amount, value, importance, or meaning", "level": "C1", "dict_examp": "The UK's Brit Awards are roughly equivalent to the Oscars.", "lear_examp": "The 35-49 year old group started in 1990 with an attendance figure of 60 percent, almost equivalent to the age group of the 25-34 year olds."}]}, {"pos": "noun", "senses": [{"sense": "something that has the same value, importance, size, or meaning as something else", "level": "C1", "dict_examp": "She won the equivalent of $5 million.", "lear_examp": "Most technical terms have Latin roots and are very similar to their German equivalent."}]}]}, {"word": "ethnic", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to a large group of people who have the same national, racial, or cultural origins", "level": "C1", "dict_examp": "an ethnic neighborhood", "lear_examp": "Over 98% of the population are ethnic Chinese."}]}]}, {"word": "eraser", "poses": [{"pos": "noun", "senses": [{"sense": "a small piece of rubber that is used to remove pencil marks from paper", "level": "A1", "dict_examp": "I usually have pencils and an eraser in my backpack.", "lear_examp": "You will have to bring a pencil, an eraser and a notebook."}]}]}, {"word": "especially", "poses": [{"pos": "adverb", "senses": [{"sense": "very much or particularly", "level": "A2", "dict_examp": "She's not especially interested in sports.", "lear_examp": "I like sports, especially playing basketball."}]}]}, {"word": "erase", "poses": [{"pos": "verb", "senses": [{"sense": "to remove writing or other marks from something by rubbing it with a piece of rubber or with a cloth", "level": "B2", "dict_examp": "I kept changing my mind and erasing my answers on the test.", "lear_examp": "The dozen notebooks she had written, erased, tore apart and thrown in the trash can didn't bother her now."}]}]}, {"word": "estimated", "poses": [{"pos": "adjective", "senses": [{"sense": "guessed", "level": "B2", "dict_examp": "an estimated cost/value", "lear_examp": "My estimated time of arrival at Heathrow airport is nine o'clock in the morning and my flight number is OK 1312."}]}]}, {"word": "estate", "poses": [{"pos": "noun", "senses": [{"sense": "a large area of land in the country which is owned by a family or an organization and is often used for growing crops or raising animals", "level": "B2", "dict_examp": "a country estate", "lear_examp": "There is a special law in Sweden which allows everyone to wander through any private estate unless one causes harm."}, {"sense": "a group of houses or factories built in a planned way", "level": "B2", "dict_examp": "a housing estate", "lear_examp": "I live on a big housing estate."}]}]}, {"word": "everyone", "poses": [{"pos": "pronoun", "senses": [{"sense": "every person", "level": "A2", "dict_examp": "Everyone agreed with me.", "lear_examp": "Almost everyone went to the party."}]}]}, {"word": "ever", "poses": [{"pos": "adverb", "senses": [{"sense": "at any time", "level": "A2", "dict_examp": "Have you ever been to London?", "lear_examp": "It is the most beautiful place I've ever seen."}, {"sense": "almost never", "level": "B1", "dict_examp": "We hardly ever go out these days.", "lear_examp": "Well, nowadays I hardly ever watch television, as time is something that I really don't have enough to spend."}, {"sense": "continuously since that time", "level": "B1", "dict_examp": "We met at school and have been friends ever since.", "lear_examp": "The pen was given to me by my father on my birthday and I have treasured it ever since."}, {"sense": "always in the future", "level": "B1", "dict_examp": "I'm not going to live here for ever.", "lear_examp": "My friend  was leaving the city for ever and going to a city in another country."}, {"sense": "better/faster/happier, etc. than at any time before", "level": "C1", "dict_examp": "She is running faster than ever.", "lear_examp": "As for the students' exam results, they are better than ever."}, {"sense": "always changing/growing/increasing, etc.", "level": "C2", "dict_examp": "We live in an ever-changing world.", "lear_examp": "In our ever-changing society, in the affluent cities of the Western world, life moves at such a fast pace that parents are the reflection and the result of our times, the cogs of a large, rather uncontrollable wheel."}]}]}, {"word": "everything", "poses": [{"pos": "pronoun", "senses": [{"sense": "all things", "level": "A2", "dict_examp": "The thieves took everything.", "lear_examp": "We have to bring a pencil, they'll give us everything else we need."}, {"sense": "to be the most important part of someone's life", "level": "B2", "dict_examp": "His children mean everything to him.", "lear_examp": "I think that every person has a different opinion, but for me, money and fame isn't everything in life."}, {"sense": "to do everything that you are able and allowed to do", "level": "C1", "dict_examp": "I've done everything in my power to help him.", "lear_examp": "She will not allow the new Mrs. de Winter to become the lady of Manderly and will do everything in her power to stop her."}]}]}, {"word": "event", "poses": [{"pos": "noun", "senses": [{"sense": "something that happens, especially something important or unusual", "level": "B1", "dict_examp": "Local people have been shocked by recent events in town.", "lear_examp": "I like this book because I like the description of historical events."}, {"sense": "a race, party, competition, etc. that has been organized for a particular time", "level": "B1", "dict_examp": "Over two thousand people took part in the event.", "lear_examp": "When there are parties or important social events, I usually choose a dress to wear."}, {"sense": "if something happens", "level": "C1", "dict_examp": "An airbag could save your life in the event of an accident.", "lear_examp": "In the event of bad weather, it would be wise to plan an alternative to the boat trip, for example a visit of Buckingham Palace or the Houses of Parliament."}, {"sense": "whatever happens", "level": "C1", "dict_examp": "I'm not sure if I'm coming on Friday, but in any event, I'll see you next week.", "lear_examp": "In any event, it is incumbent upon all of us to carefully plan our travel matters, so as to take advantage of their several benefits."}, {"sense": "the way in which a situation develops, especially a sudden or unexpected change", "level": "C2", "dict_examp": "We were all shocked by this tragic turn of events.", "lear_examp": "She was not prepared for such an unexpected turn of events!"}]}]}, {"word": "every", "poses": [{"pos": "determiner", "senses": [{"sense": "each one of a group of people or things", "level": "A1", "dict_examp": "Every time I go to New Jersey I get caught in a traffic jam.", "lear_examp": "I like every country or place, where the weather is hot."}, {"sense": "used to show that something is repeated regularly", "level": "A1", "dict_examp": "He goes to Ireland every summer.", "lear_examp": "She cooks every afternoon."}, {"sense": "as much as is possible", "level": "B2", "dict_examp": "I'd like to wish you every success in your new job.", "lear_examp": "The man realized that people should take every opportunity that life offers them, because all we are is dust in the wind."}, {"sense": "sometimes, but not often", "level": "C1", "dict_examp": "We still get together for lunch every now and then.", "lear_examp": "Each day choose 10 new words and learn them by heart. In a week you will have learned 70 new words, and in a year 3640, a lot of words. Please, do not forget to repeat them every now and then."}, {"sense": "sometimes, but not often", "level": "C2", "dict_examp": "He went into town every so often to buy supplies.", "lear_examp": "And likewise, common sense tells us it doesn't matter that oranges from Spain contain 0.01% more vitamin C than those from Florida, as long as we eat them every once in a while."}, {"sense": "happening every two days/weeks, etc., not each day/week, etc.", "level": "C2", "dict_examp": "Alice goes to the gym every other day.", "lear_examp": "First, I would run 2 miles every other day, but soon it became a need to do it on a daily basis."}]}]}, {"word": "everybody", "poses": [{"pos": "pronoun", "senses": [{"sense": "every person", "level": "A2", "dict_examp": "Everybody thought it was a good idea.", "lear_examp": "I was so happy, because everybody had a good time."}]}]}, {"word": "evidence", "poses": [{"pos": "noun", "senses": [{"sense": "something that makes you believe that something is true or exists", "level": "B2", "dict_examp": "evidence of global warming", "lear_examp": "David started looking for evidence, but he found nothing."}, {"sense": "information that is given or objects that are shown in a court of law to help to prove if someone has committed a crime", "level": "C2", "dict_examp": "He was arrested despite the lack of evidence against him.", "lear_examp": "My new neighbour murdered his wife and although the circumstantial evidence against him was enormous, the case was dismissed because of the lack of some clinching piece of evidence."}]}]}, {"word": "evident", "poses": [{"pos": "adjective", "senses": [{"sense": "obvious to everyone and easy to see or understand", "level": "B2", "dict_examp": "The full extent of the damage only became evident the following morning.", "lear_examp": "Her lyrical verses, poems and prose (especially autobiographical) have something special in them that makes it evident that they were written by a very talented writer."}]}]}, {"word": "exactly", "poses": [{"pos": "adverb", "senses": [{"sense": "used when you are giving or asking for information that is completely correct", "level": "A2", "dict_examp": "The journey took exactly three hours.", "lear_examp": "I don't know exactly what time I'll arrive."}, {"sense": "used to emphasize what you are saying", "level": "B1", "dict_examp": "I've found some shoes that are exactly the same color as that dress.", "lear_examp": "That is exactly one of the reasons why I decided to join a new English class."}, {"sense": "something you say when you agree completely with someone", "level": "B2", "dict_examp": "\"Surely they should have told us about this problem sooner?\" \"Exactly!\"", "lear_examp": ""}, {"sense": "used to say that something is not completely true", "level": "B2", "dict_examp": "\"So you gave her your book?\" \"Not exactly, I lent it to her.\"", "lear_examp": ""}]}]}, {"word": "evolution", "poses": [{"pos": "noun", "senses": [{"sense": "the way in which living things change and develop over millions of years", "level": "B2", "dict_examp": "Darwin's theory of evolution", "lear_examp": "I think it is good to have zoos, but we shouldn't try to control natural evolution as we have done until now."}, {"sense": "a gradual process of change and development", "level": "B2", "dict_examp": "the evolution of language", "lear_examp": "Leonardo's studies and projects on mechanics puzzle us and foresee the future evolution of science and technology."}]}]}, {"word": "even", "poses": [{"pos": "adverb", "senses": [{"sense": "used to emphasize something that is surprising", "level": "A2", "dict_examp": "Everyone danced - even Mick.", "lear_examp": "You were the only one who wasn't there, even Marcelo was there!"}, {"sense": "used to emphasize a comparison", "level": "B1", "dict_examp": "Her last film was even better.", "lear_examp": "When I saw her getting off the train I really was close to breaking down because she looked even more beautiful."}, {"sense": "used to emphasize the fact that something does not happen or is not true", "level": "B1", "dict_examp": "\"I never cry.\" \"Not even when you hurt yourself really badly?\"", "lear_examp": "We tried to fish, but didn't catch a thing, not even a shoe!"}, {"sense": "whether or not", "level": "B2", "dict_examp": "Even if you take a taxi, you'll still miss your train.", "lear_examp": "I often go to parks, with or without the children, even if the weather is not good."}, {"sense": "although", "level": "B2", "dict_examp": "Even though he left school at 16, he still managed to become a millionaire.", "lear_examp": "They didn't give up hope even though they were tired and wet to the bone."}, {"sense": "used to emphasize that something surprising is true despite what you have just said", "level": "C1", "dict_examp": "Car prices have gone down a lot, but even so, we couldn't afford to buy one.", "lear_examp": "I'm sure many of these things happened due to bad luck, but even so, there are some arrangements that, I believe, can easily be improved."}, {"sense": "to make as much money as you spent, but no more", "level": "C1", "dict_examp": "The company only managed to break even this year.", "lear_examp": "Company C does not seem to be doing well. In the year 2000, it just seems to be breaking even."}]}]}, {"word": "eventful", "poses": [{"pos": "adjective", "senses": [{"sense": "full of interesting or important events", "level": "C2", "dict_examp": "a very eventful day/journey", "lear_examp": "Well do I remember a present I was given on one of my most memorable and eventful birthdays."}]}]}, {"word": "evolve", "poses": [{"pos": "verb", "senses": [{"sense": "to develop or make something develop, usually gradually", "level": "C1", "dict_examp": "rapidly evolving technology", "lear_examp": "This device has evolved from being a large machine into the size of a notebook."}]}]}, {"word": "exaggerate", "poses": [{"pos": "verb", "senses": [{"sense": "to make something seem larger, better, worse, etc. than it really is", "level": "C1", "dict_examp": "Don't exaggerate - it didn't cost that much!", "lear_examp": "Without exaggerating, I would like to mention that she is dependable and trustworthy but also tactful and supportive."}]}]}, {"word": "evidently", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is easy to see", "level": "B2", "dict_examp": "He evidently likes her.", "lear_examp": "There are, evidently, points in favor and points against."}]}]}, {"word": "evening", "poses": [{"pos": "noun", "senses": [{"sense": "the part of the day between the afternoon and the night", "level": "A1", "dict_examp": "I'm working late this evening.", "lear_examp": "She watches TV every evening."}]}]}, {"word": "eventual", "poses": [{"pos": "adjective", "senses": [{"sense": "happening or existing at the end of a process or period of time", "level": "C2", "dict_examp": "the eventual winner of the competition", "lear_examp": "Finally, the most important consequence - and in some way quite a perverse one - is that setting the island on fire leads to the boys' eventual rescue; so, pure destruction here means catharsis (speaking in terms of drama)."}]}]}, {"word": "evil", "poses": [{"pos": "adjective", "senses": [{"sense": "very cruel, bad or harmful", "level": "B2", "dict_examp": "an evil monster", "lear_examp": "She is a very dark and evil person who can't forget the first Mrs. de Winter."}]}, {"pos": "noun", "senses": [{"sense": "something that is very bad and harmful", "level": "B2", "dict_examp": "Drug-addiction is one of today's great social evils.", "lear_examp": "It is not simply the confronting of good and evil."}]}]}, {"word": "exam", "poses": [{"pos": "noun", "senses": [{"sense": "an official test of how much you know about something, or how well you can do something", "level": "A2", "dict_examp": "How many pupils are taking the chemistry exam this year?", "lear_examp": "I will take my exam on December 8."}]}]}, {"word": "exaggeration", "poses": [{"pos": "noun", "senses": [{"sense": "when you describe something as larger, better, worse, etc. than it really is", "level": "C1", "dict_examp": "a slight/gross exaggeration of the facts", "lear_examp": "You wrote about \"a sudden downpour of rain\" which was a huge exaggeration."}]}]}, {"word": "eventually", "poses": [{"pos": "adverb", "senses": [{"sense": "in the end, especially after a long time", "level": "B2", "dict_examp": "Eventually they reached an agreement.", "lear_examp": "Anyway Pat eventually apologized to me."}]}]}, {"word": "exact", "poses": [{"pos": "adjective", "senses": [{"sense": "completely correct in every detail", "level": "B1", "dict_examp": "The exact distance is 1.838 meters.", "lear_examp": "I am looking forward to your next letter to know the exact time of your arrival."}]}]}, {"word": "everywhere", "poses": [{"pos": "adverb", "senses": [{"sense": "in or to every place", "level": "A2", "dict_examp": "I looked everywhere for my keys.", "lear_examp": "I love the teddy bear because it's soft and I can take it with me everywhere."}]}]}, {"word": "examination", "poses": [{"pos": "noun", "senses": [{"sense": "an exam", "level": "A2", "dict_examp": "a written examination", "lear_examp": "We try to improve our English, because we must pass the P.E.T. examination to complete our studies."}, {"sense": "when someone looks at or considers something carefully in order to discover something", "level": "B2", "dict_examp": "a medical examination", "lear_examp": "Finally we went to the hospital for a medical examination and fortunately we were all right."}]}]}, {"word": "exemplify", "poses": [{"pos": "verb", "senses": [{"sense": "to be or give a typical example of something", "level": "C2", "dict_examp": "This painting perfectly exemplifies the naturalistic style so popular at that time.", "lear_examp": "Okonkwo serves to exemplify to the reader the consequences that the Igbo people were suffering."}]}]}, {"word": "exchange rate", "poses": [{"pos": "noun", "senses": [{"sense": "the rate at which the money of one country can be changed for the money of another country", "level": "B1", "dict_examp": "The Money Ready Reckoner gives the exchange rate for any country you plan to visit and shows how much currency you will get.", "lear_examp": "I looked around and saw a shop with the notice \"Currency exchange\". I decided to go in to find out the exchange rate."}]}]}, {"word": "excellent", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good", "level": "A2", "dict_examp": "The food was excellent.", "lear_examp": "I had an excellent supper and danced with Nat."}]}]}, {"word": "excitement", "poses": [{"pos": "noun", "senses": [{"sense": "when people feel very happy and enthusiastic", "level": "B1", "dict_examp": "The competition is causing a lot of excitement.", "lear_examp": "However, if you are looking for fun and excitement, I would go for the city."}]}]}, {"word": "excuse", "poses": [{"pos": "verb", "senses": [{"sense": "used to politely get someone's attention", "level": "A1", "dict_examp": "Excuse me, does this bus go to Oxford Street?", "lear_examp": "While I was waiting for my fast food, someone knocked my shoulder. I turned and saw a girl about my age. I asked: - Excuse me, did you call me?"}, {"sense": "used to say you are sorry for something that you do without intending to", "level": "A2", "dict_examp": "Oh, excuse me, did I take your seat?", "lear_examp": "Excuse me, I'm going to miss the English class tomorrow."}, {"sense": "used to politely ask someone to repeat something they said because you have not heard it", "level": "A2", "dict_examp": "\"Did you see the movie?\" \"Excuse me? What was that?\" \"I asked if you saw the movie.\"", "lear_examp": "I asked: Excuse me, did you call me?"}, {"sense": "to forgive someone", "level": "B1", "dict_examp": "Please excuse me for arriving late - my flight was delayed.", "lear_examp": "I hope you'll excuse me now, I have to do my homework."}, {"sense": "to be given as a reason for someone's bad behavior, so that it does not seem so bad", "level": "B2", "dict_examp": "Nothing can excuse that sort of behavior.", "lear_examp": "Their main goals are to save the animals and/or to show the animals to the public in order to make us take an interest in the animals and in ecology. I think that these purposes can excuse the fact that the animals are locked up, if they have enough space and are treated very well."}]}, {"pos": "noun", "senses": [{"sense": "a reason that you give to explain why you did something wrong", "level": "B1", "dict_examp": "What was his excuse for being late?", "lear_examp": "I had no excuse to give for being late with this report."}, {"sense": "a false reason that you give to explain why you do something", "level": "B1", "dict_examp": "Nick was just looking for an excuse to call her.", "lear_examp": "Also shopping for clothes is an excuse to go out with girls!!"}]}]}, {"word": "exclude", "poses": [{"pos": "verb", "senses": [{"sense": "to not allow someone or something to take part in an activity or to enter a place", "level": "C1", "dict_examp": "Two students were excluded from the class because they registered late and it was already full.", "lear_examp": "Lots of students made a different decision and participated in the swimming gala, where nobody was excluded, because there were races for all abilities."}, {"sense": "to intentionally not include something", "level": "C1", "dict_examp": "The advertised price excludes the sales tax.", "lear_examp": "Hungary was excluded from the Formula 1 Calendar and as a result a new country is to be chosen to replace the missing event."}]}]}, {"word": "exclamation point", "poses": [{"pos": "noun", "senses": [{"sense": "a punctuation mark (!) used at the end of a sentence that expresses surprise, excitement or shock", "level": "B2", "dict_examp": "Her e-mail is full of exclamation points.", "lear_examp": ""}]}]}, {"word": "exercise", "poses": [{"pos": "noun", "senses": [{"sense": "physical activity that you do to make your body strong and healthy", "level": "A2", "dict_examp": "You really should get more exercise.", "lear_examp": "I can also get some exercise with the bicycle."}, {"sense": "a short piece of written work which you do to practice something you are learning", "level": "A2", "dict_examp": "The book has exercises at the end of every chapter.", "lear_examp": "It's a new book and it has all the necessary exercises for secondary school."}, {"sense": "a set of actions that a group of soldiers do to practice their skills", "level": "C2", "dict_examp": "The cadets are out on military exercises.", "lear_examp": "I am not opposed to military exercises, but such a noisy activity cannot be tolerated in a world in which environmental protection should be promoted by everybody, including the army."}]}, {"pos": "verb", "senses": [{"sense": "to do physical activities to make your body strong and healthy", "level": "B1", "dict_examp": "She exercises most evenings, usually by running.", "lear_examp": "It's funny how I heard about that; I was at the gym with Sarah, we were exercising when we heard Tom talking about it with John."}, {"sense": "to use a power, right, or ability", "level": "C2", "dict_examp": "You should always exercise your right to vote.", "lear_examp": "However, if you believe that nothing can be done, I have to inform you that we will exercise our legal rights and take action against you."}]}]}, {"word": "exceptionally", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely", "level": "C1", "dict_examp": "an exceptionally gifted student", "lear_examp": "The tourism section, which interested me the most, was outstanding, exceptionally well-prepared presentations!"}]}]}, {"word": "excessive", "poses": [{"pos": "adjective", "senses": [{"sense": "more than is necessary or wanted", "level": "C1", "dict_examp": "They accused the police of using excessive force.", "lear_examp": "However, having 2 indoor courts seems a bit excessive since the problem with the court is the schedule, not the space."}]}]}, {"word": "exceptional", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good", "level": "B2", "dict_examp": "He really is an exceptional student.", "lear_examp": "This trip constitutes an exceptional challenge for me."}, {"sense": "very unusual and not likely to happen very often", "level": "C2", "dict_examp": "Visitors are only allowed in exceptional circumstances.", "lear_examp": "However, there are always some exceptional circumstances in which they fail to understand what is appropriate for them."}]}]}, {"word": "exclaim", "poses": [{"pos": "verb", "senses": [{"sense": "to say something suddenly and loudly because you are surprised, annoyed, excited, etc.", "level": "C2", "dict_examp": "\"How terrible!\" she exclaimed.", "lear_examp": "Then he would exclaim, \"What a wonderful selection,\" with a robust laugh."}]}]}, {"word": "exclusively", "poses": [{"pos": "adverb", "senses": [{"sense": "only", "level": "C1", "dict_examp": "an exclusively female audience", "lear_examp": "In addition, the reduced price mentioned refers exclusively to UK students, which caused significant problems."}]}]}, {"word": "excitedly", "poses": [{"pos": "adverb", "senses": [{"sense": "in an excited way", "level": "B1", "dict_examp": "She ran excitedly down the hall to greet her cousins.", "lear_examp": "We talked excitedly about it all the way home."}]}]}, {"word": "examine", "poses": [{"pos": "verb", "senses": [{"sense": "to look at or consider a person or thing carefully and in detail in order to discover something about them", "level": "B2", "dict_examp": "She picked up the knife and examined it closely.", "lear_examp": "I examined both of them and finally I discovered that it was a virus changed genetically in order to kill people."}, {"sense": "to test someone to see how much they know or how well they can do something", "level": "C2", "dict_examp": "You'll be examined in three main areas: speaking, listening, and reading comprehension.", "lear_examp": "Be prepared, not only in the areas you will be examined in."}]}]}, {"word": "executive", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to making decisions and managing businesses", "level": "C1", "dict_examp": "an executive director", "lear_examp": "So I am now an executive director, I have a job and I know very important people in the Romanian Government."}]}, {"pos": "noun", "senses": [{"sense": "someone who has an important job in a business", "level": "C1", "dict_examp": "a company executive", "lear_examp": "The main reason why I attended this conference was to learn how international companies select their employees and how I could improve my qualifications as a finance executive."}]}]}, {"word": "except", "poses": [{"pos": "preposition", "senses": [{"sense": "not including a particular fact, thing or person", "level": "A2", "dict_examp": "The museum is open daily except Mondays.", "lear_examp": "All of my friends came except you."}, {"sense": "used to give a reason why something is not possible or true", "level": "B1", "dict_examp": "I want to go, except that I'm tired.", "lear_examp": ""}]}]}, {"word": "exception", "poses": [{"pos": "noun", "senses": [{"sense": "someone or something that is not included in a rule, group or list or that does not behave in the expected way", "level": "B2", "dict_examp": "There are exceptions to every rule.", "lear_examp": "The animals looked so sad to me. So I decided to set them free, all of them, without exception."}]}]}, {"word": "exceed", "poses": [{"pos": "verb", "senses": [{"sense": "to be more than a particular number or amount", "level": "C1", "dict_examp": "Sales have exceeded $1 million so far this year.", "lear_examp": "Our administration costs didn't exceed 5%, the other 10% were the pure costs of the entertainment."}, {"sense": "to be much bigger or better than expected", "level": "C1", "dict_examp": "The location of the apartment exceeded our expectations.", "lear_examp": "The presentation on tourism was brilliant, exceeding my expectations."}, {"sense": "to drive faster than you are allowed to according to the law", "level": "C1", "dict_examp": "She was caught exceeding the speed limit.", "lear_examp": "There are three ground rules you have to follow: stop at stop-signs, don't exceed the speed limit and don't be in the way of other cars."}]}]}, {"word": "exciting", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel very happy and enthusiastic", "level": "A1", "dict_examp": "an exciting movie/game", "lear_examp": "I enjoyed the game very much, because it was very exciting."}]}]}, {"word": "excited", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling very happy and enthusiastic", "level": "A1", "dict_examp": "Are you getting excited about your vacation?", "lear_examp": "I am very excited!"}]}]}, {"word": "exchange", "poses": [{"pos": "noun", "senses": [{"sense": "when you give something to someone and they give you something else", "level": "B1", "dict_examp": "an exchange  of ideas/information", "lear_examp": "So, it was a very interesting exchange of ideas."}, {"sense": "an arrangement by which students and teachers from one country go to stay with students and teachers in another country", "level": "B1", "dict_examp": "Our school has an exchange with a school in Madrid, so I'll be going to Spain next semester.", "lear_examp": "His name is Rob and, like me, he applied to the student exchange program."}]}, {"pos": "verb", "senses": [{"sense": "to give something to someone and receive something similar from them", "level": "B1", "dict_examp": "It's traditional for the two teams to exchange shirts after the game.", "lear_examp": "She moved to another part of town and we forgot to exchange our addresses."}, {"sense": "to take something back to the shop where you bought it and change it for something else", "level": "B2", "dict_examp": "Your purchase can only be exchanged if you have the original receipt.", "lear_examp": ""}, {"sense": "If two people exchange looks, opinions, views, etc., they look at each other, talk to each other, etc.", "level": "B2", "dict_examp": "The group meets every month to exchange their views on a book they have all read.", "lear_examp": "You can exchange opinions with them as to the way of life in Japan and your country."}]}]}, {"word": "exclusive", "poses": [{"pos": "adjective", "senses": [{"sense": "expensive and only for people who are rich or of a high social class", "level": "B2", "dict_examp": "an exclusive club/hotel/shop", "lear_examp": "If you prefer small exclusive shops, you'll be able to find them at every corner in St. Gallen."}, {"sense": "not shared with another person, organization, newspaper, etc.", "level": "C1", "dict_examp": "an exclusive interview", "lear_examp": "They don't have a personal life anymore because of this, and photographers are following them everywhere because they want to take an exclusive picture, so they can earn a lot of money with it when a magazine wants to buy it."}]}]}, {"word": "excel", "poses": [{"pos": "verb", "senses": [{"sense": "to be very good at something", "level": "C2", "dict_examp": "Paula excelled at when she was in school.", "lear_examp": "If a school is successful, it will provide opportunities for the child to excel in other areas such as the creative arts, like music, dance, painting and drama, and also sports."}]}]}, {"word": "excess", "poses": [{"pos": "noun", "senses": [{"sense": "more of something than is usual or needed", "level": "C1", "dict_examp": "The company’s losses are in excess of more than $5 million.", "lear_examp": "We should change our behavior and buy what we need and not in excess, giving the children a pattern to follow."}, {"sense": "to do something too much", "level": "C2", "dict_examp": "It is best to avoid eating any one type of food to excess.", "lear_examp": "We eat and drink to excess only to face the consequences later on."}]}, {"pos": "adjective", "senses": [{"sense": "more than is usual or allowed", "level": "C1", "dict_examp": "We had to pay $50 for excess baggage.", "lear_examp": "Most students feel that they need to get rid of excess energy at the end of the day and also convey that they are hampered by the fact that not enough sports facilities are available."}]}]}, {"word": "execute", "poses": [{"pos": "verb", "senses": [{"sense": "to kill someone as a legal punishment", "level": "C2", "dict_examp": "He was executed for murder.", "lear_examp": "She might even have had some cruel aspects in her personality for she did not hesitate to execute traitors."}, {"sense": "to do something, such as follow a plan or order", "level": "C2", "dict_examp": "to execute a deal/plan", "lear_examp": "When he controls the work of the other staff members, he wants to find out whether they executed their duties perfectly."}]}]}, {"word": "example", "poses": [{"pos": "noun", "senses": [{"sense": "something that is typical of the group of things being talked about", "level": "A1", "dict_examp": "This painting here is a marvelous example of her work.", "lear_examp": "I like rap music, one example of that is El Santo."}, {"sense": "used to give an example of the type of thing you mean", "level": "A1", "dict_examp": "I like soft fruit, for example peaches and plums.", "lear_examp": "You can make a quick snack, for example a sandwich."}, {"sense": "to do something in a good way so that other people might try to copy you", "level": "B2", "dict_examp": "Try to set a good example for the younger children.", "lear_examp": "It sets a good example for other museums."}, {"sense": "a very good example of something", "level": "C2", "dict_examp": "This is a prime example of what happens when communication is poor.", "lear_examp": "In this context in the analyses of Piggy's character, it strikes me as a first spontaneous impression that he personifies the typical proper schoolboy who will later on undoubtedly grow up to be the prime example of a good and responsible citizen."}]}]}, {"word": "expectation", "poses": [{"pos": "noun", "senses": [{"sense": "when you expect good things to happen in the future", "level": "B2", "dict_examp": "The holiday lived up to all our expectations.", "lear_examp": "The talks given by writers were up to my expectations and it was a pleasure to attend all of them."}, {"sense": "to be much bigger or better than expected", "level": "C1", "dict_examp": "The location of the apartment exceeded our expectations.", "lear_examp": "The presentation on tourism was brilliant, exceeding my expectations."}]}]}, {"word": "expenditure", "poses": [{"pos": "noun", "senses": [{"sense": "the total amount of money that a person, business, group, etc., spends", "level": "C2", "dict_examp": "a large expenditure of funds", "lear_examp": "What's more, it is not always possible to travel, and holidays represent in many cases an additional expenditure of money that it is not available."}]}]}, {"word": "exercise", "poses": [{"pos": "noun", "senses": [{"sense": "physical activity that you do to make your body strong and healthy", "level": "A2", "dict_examp": "You really should get more exercise.", "lear_examp": "I can also get some exercise with the bicycle."}, {"sense": "a short piece of written work which you do to practice something you are learning", "level": "A2", "dict_examp": "The book has exercises at the end of every chapter.", "lear_examp": "It's a new book and it has all the necessary exercises for secondary school."}, {"sense": "a set of actions that a group of soldiers do to practice their skills", "level": "C2", "dict_examp": "The cadets are out on military exercises.", "lear_examp": "I am not opposed to military exercises, but such a noisy activity cannot be tolerated in a world in which environmental protection should be promoted by everybody, including the army."}]}, {"pos": "verb", "senses": [{"sense": "to do physical activities to make your body strong and healthy", "level": "B1", "dict_examp": "She exercises most evenings, usually by running.", "lear_examp": "It's funny how I heard about that; I was at the gym with Sarah, we were exercising when we heard Tom talking about it with John."}, {"sense": "to use a power, right, or ability", "level": "C2", "dict_examp": "You should always exercise your right to vote.", "lear_examp": "However, if you believe that nothing can be done, I have to inform you that we will exercise our legal rights and take action against you."}]}]}, {"word": "exotic", "poses": [{"pos": "adjective", "senses": [{"sense": "unusual, interesting and often foreign", "level": "B2", "dict_examp": "exotic flowers/fruits", "lear_examp": "Even if you do not have any cooking skills you can enjoy exotic meals."}]}]}, {"word": "exile", "poses": [{"pos": "noun", "senses": [{"sense": "when someone has to leave their home and live in another country, often for political reasons", "level": "C2", "dict_examp": "He lives in exile in New York.", "lear_examp": "Back in 1964, in the peak of a dictatorship period in Brazil, Caetano was forced into exile, leaving behind his mother, who also was his best friend."}]}]}, {"word": "experimental", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to tests, especially scientific ones", "level": "C2", "dict_examp": "The two scientists used very different experimental methods.", "lear_examp": "But in my opinion this is no excuse to discard the findings of numerous well-educated nutritionists and food specialists who devote long hours to researching the eating habits of the people of the world, who sift through data from times gone by to find out about our predecessors' habits and who build and test hypotheses in strictly controlled experimental conditions."}]}]}, {"word": "exhaustion", "poses": [{"pos": "noun", "senses": [{"sense": "when you are extremely tired", "level": "B2", "dict_examp": "She felt sick with exhaustion.", "lear_examp": "Imagine our exhaustion after a few days walking around the city in the heat."}]}]}, {"word": "existence", "poses": [{"pos": "noun", "senses": [{"sense": "when something or someone exists", "level": "B2", "dict_examp": "Many people question the existence of God.", "lear_examp": "The book  gives explanations about all these popular beliefs about ghosts and their supposed existence among living people."}]}]}, {"word": "exhausted", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely tired", "level": "B1", "dict_examp": "By the time they reached the summit they were exhausted.", "lear_examp": "When we got back home I was absolutely exhausted."}]}]}, {"word": "exhibition", "poses": [{"pos": "noun", "senses": [{"sense": "when objects such as paintings are shown to the public", "level": "B1", "dict_examp": "to see/visit an exhibition", "lear_examp": "We went to the Royal Academy to see the Kandinsky exhibition."}]}]}, {"word": "experienced", "poses": [{"pos": "adjective", "senses": [{"sense": "having skill or knowledge because you have done something many times", "level": "B1", "dict_examp": "an experienced teacher", "lear_examp": "You can go to the nearest village, where you can do a mountain walk led by experienced guides."}]}]}, {"word": "expense", "poses": [{"pos": "noun", "senses": [{"sense": "the money that you spend on something", "level": "B2", "dict_examp": "Buying a bigger car has proved to be well worth the expense.", "lear_examp": "We couldn't afford the expense of a new car at that time."}, {"sense": "If you do one thing at the expense of another, doing the first thing harms the second thing.", "level": "C1", "dict_examp": "He spent a lot of time at work, at the expense of his marriage.", "lear_examp": "Unfortunately one is usually done at the expense of the other."}, {"sense": "in order to make someone look stupid", "level": "C2", "dict_examp": "Stop making jokes at my expense.", "lear_examp": "But despite his intellectual superiority, Piggy was subject to derision because of his physical outward appearance and the group of boys played jokes at his expense."}]}]}, {"word": "expenses", "poses": [{"pos": "noun", "senses": [{"sense": "money that you spend when you are doing your job, that your employer will pay back to you", "level": "C1", "dict_examp": "travel/entertainment expenses", "lear_examp": "They actually helped me a lot with relocation and even reimbursed my travel expenses."}]}]}, {"word": "expensive", "poses": [{"pos": "adjective", "senses": [{"sense": "costing a lot of money", "level": "A1", "dict_examp": "expensive jewelry", "lear_examp": "My mother bought the glass for me last year and it's very expensive."}]}]}, {"word": "exhaust", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone very tired", "level": "C1", "dict_examp": "The long trip  exhausted the children.", "lear_examp": "I think that the students were expecting to be given a job that would actually improve their English and not just exhaust them physically."}]}, {"pos": "noun", "senses": [{"sense": "the waste gas from a vehicle's engine", "level": "C1", "dict_examp": "exhaust fumes", "lear_examp": "Therefore, it might cause a great deal of pollution because of exhaust fumes."}, {"sense": "the pipe that waste gas from a vehicle's engine flows through", "level": "C1", "dict_examp": "The car needs a new exhaust.", "lear_examp": "There are traffic jams and it becomes a real hell to drive or simply to walk (because of the noise and pollution of exhaust pipes)."}]}]}, {"word": "expect", "poses": [{"pos": "verb", "senses": [{"sense": "to think or believe that something will happen", "level": "B1", "dict_examp": "We are expecting a lot of applicants for the job.", "lear_examp": "I expect that it is going to be sunny because in the hotel there is a swimming-pool."}, {"sense": "to be waiting for someone or something to arrive", "level": "B1", "dict_examp": "I'm expecting a letter from my sister.", "lear_examp": "I wasn't expecting any message."}, {"sense": "to think that someone should behave in a particular way or do a particular thing", "level": "B2", "dict_examp": "You will be expected to work some weekends.", "lear_examp": "You have to satisfy your boss but you do not have to do more than you are expected to."}, {"sense": "to be going to have a baby", "level": "B2", "dict_examp": "I'm expecting our first baby in May.", "lear_examp": "When I was nine or ten years old, my mother was expecting a baby."}]}]}, {"word": "expected", "poses": [{"pos": "adjective", "senses": [{"sense": "thought likely to happen or be true", "level": "B2", "dict_examp": "The expected power cuts never happened.", "lear_examp": "I went into the theatre on time but became a little bit angry at having to wait until 20:15, forty-five minutes after the expected starting time."}]}]}, {"word": "expert", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has a lot of skill in something or a lot of knowledge of something", "level": "B1", "dict_examp": "a computer/gardening/medical expert", "lear_examp": "My \"personal\" trainer is Peter, he is a real expert in running."}]}, {"pos": "adjective", "senses": [{"sense": "having or showing a lot of knowledge or skill", "level": "B2", "dict_examp": "The center provides expert advice for people with financial problems.", "lear_examp": "We're not expert cyclists and we could get tired before we get to the Mountain Hostel."}]}]}, {"word": "exit", "poses": [{"pos": "noun", "senses": [{"sense": "the door or gate which you use to leave a public building or place", "level": "A2", "dict_examp": "a fire exit", "lear_examp": "I'll meet you tonight at the exit of Wood Green station."}, {"sense": "a road which you use to leave a highway", "level": "A2", "dict_examp": "Take the third exit and turn left at the end of the ramp.", "lear_examp": "You should take the highway from Palermo to Mazzara and take the third exit."}]}, {"pos": "verb", "senses": [{"sense": "to stop using a program on a computer", "level": "B1", "dict_examp": "Press escape to exit the game.", "lear_examp": ""}]}]}, {"word": "expansion", "poses": [{"pos": "noun", "senses": [{"sense": "when something increases in size or amount", "level": "B2", "dict_examp": "These years saw the rapid expansion of the software industry.", "lear_examp": "More effective ways include the construction of bridges in heavy traffic areas and the expansion of METRO to even more areas of Athens."}]}]}, {"word": "experiment", "poses": [{"pos": "noun", "senses": [{"sense": "a test, especially a scientific one,  that you do in order to learn something or to discover whether something is true", "level": "B1", "dict_examp": "Some people believe that experiments on animals should be banned.", "lear_examp": "In the chemistry lab experiments are often set up."}]}, {"pos": "verb", "senses": [{"sense": "to try something in order to discover what it is like", "level": "B2", "dict_examp": "Did he ever experiment with drugs?", "lear_examp": "Last year I started to take a lot of black and white photos and I wanted to follow the process all the way through so I bought an enlarger. I was now able to experiment with all sorts of techniques."}, {"sense": "to do an experiment", "level": "C2", "dict_examp": "Experimenting on mice can give us an idea of the effect of the disease in humans.", "lear_examp": "Firstly, scientists are the best contributors for a better world around us being smarter and hard-working, gaining knowledge and experimenting in laboratories."}]}]}, {"word": "experience", "poses": [{"pos": "noun", "senses": [{"sense": "knowledge that you get from doing a job, or from doing, seeing, or feeling something", "level": "B1", "dict_examp": "She has a lot of teaching experience.", "lear_examp": "I believe as I get more experience, I will be converted to an international basketball player."}, {"sense": "something that happens to you that affects how you feel", "level": "B1", "dict_examp": "I had a very unpleasant experience at the dentist.", "lear_examp": "It was a great experience, we talked for 3 hours about lots of things."}]}, {"pos": "verb", "senses": [{"sense": "If you experience something, it happens to you, or you feel it.", "level": "B1", "dict_examp": "We experienced a lot of difficulty selling our house.", "lear_examp": "We had three fantastic days - the best we have ever experienced."}]}]}, {"word": "expand", "poses": [{"pos": "verb", "senses": [{"sense": "to increase in size or amount, or to make something increase in this way", "level": "B2", "dict_examp": "The air in the balloon expands when heated.", "lear_examp": "I would like to expand my library."}]}]}, {"word": "expedition", "poses": [{"pos": "noun", "senses": [{"sense": "an organized journey, especially a long one for a particular purpose", "level": "B1", "dict_examp": "Shackleton led several expeditions in the Antarctic.", "lear_examp": "I was with my father on Mount Tahan and I had the best time of my life during this expedition."}]}]}, {"word": "exhibit", "poses": [{"pos": "verb", "senses": [{"sense": "to show objects such as paintings to the public", "level": "C1", "dict_examp": "She's exhibiting her roses at the local flower show.", "lear_examp": "Roman pottery was found here in recent years, and it is now exhibited at the local museum."}, {"sense": "to show a feeling, quality, or ability", "level": "C2", "dict_examp": "The crew exhibited great courage when the plane crashed.", "lear_examp": "I consider my father a successful man because he exhibits all the qualities I've mentioned above."}]}, {"pos": "noun", "senses": [{"sense": "an object such as a painting that is shown to the public", "level": "C1", "dict_examp": "The museum’s exhibits range from Iron Age pottery to Eskimo clothing.", "lear_examp": "Apart from that, there are English-speaking tourist guides in museums and historical sites, so that visitors can enjoy them and understand what the exhibits are."}]}]}, {"word": "existing", "poses": [{"pos": "adjective", "senses": [{"sense": "describes something that exists now", "level": "B2", "dict_examp": "The existing church was built in the sixteenth century.", "lear_examp": "The computer upgraded most of the existing inventions, and made them more efficient, faster and more user-friendly."}]}]}, {"word": "exhaustive", "poses": [{"pos": "adjective", "senses": [{"sense": "complete and including everything", "level": "C1", "dict_examp": "an exhaustive account of the incident", "lear_examp": "I think this report is exhaustive and that we can rely on this institution, should other colleagues be sent to a similar course there."}]}]}, {"word": "exhausting", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel extremely tired", "level": "B2", "dict_examp": "I've had an exhausting day.", "lear_examp": "We will also have the opportunity to drink a coffee or have a snack after an exhausting day in the swimming pool!!"}]}]}, {"word": "exist", "poses": [{"pos": "verb", "senses": [{"sense": "to be present or real", "level": "B1", "dict_examp": "Poverty still exists in this country.", "lear_examp": "Buses will not exist any more and everyone will have his own car and his own computer too."}, {"sense": "to live in difficult conditions", "level": "C1", "dict_examp": "You can't exist without water for more than a week.", "lear_examp": "It's hard to exist without water, so there were long queues to our local wells."}]}]}, {"word": "expression", "poses": [{"pos": "noun", "senses": [{"sense": "a word or phrase", "level": "B2", "dict_examp": "He uses a lot of informal expressions.", "lear_examp": "With these kinds of videos, they could learn words and expressions used every day by normal people talking to normal people."}, {"sense": "the look on someone's face, showing what they feel or think", "level": "B2", "dict_examp": "facial expressions", "lear_examp": "He had a funny expression on his face."}, {"sense": "when you show what you think or how you feel using words or actions", "level": "B2", "dict_examp": "He wrote her a poem as an expression of his love.", "lear_examp": "It always thrilled me, the energy and expression this dance had."}]}]}, {"word": "explosive", "poses": [{"pos": "adjective", "senses": [{"sense": "An explosive substance or piece of equipment can cause explosions.", "level": "C2", "dict_examp": "The explosive device was hidden in a suitcase.", "lear_examp": "The small piece of an explosive material caused chaos in the streets of London."}, {"sense": "An explosive situation or subject causes strong feelings, and may make people angry or violent.", "level": "C2", "dict_examp": "a highly explosive political issue", "lear_examp": "Moreover, there are some explosive issues that give them food for thought, such as the environmental pollution, and the poverty."}]}, {"pos": "noun", "senses": [{"sense": "a substance or piece of equipment that can cause explosions", "level": "C2", "dict_examp": "He was caught smuggling explosives into the building.", "lear_examp": "It was in this background of events that Riyaz Mohammed drove a van loaded with a thousand kilos of explosives into the US embassy compound in Nairobi, Kenya, causing the deaths of hundreds of Kenyans and dozens of American citizens."}]}]}, {"word": "explanation", "poses": [{"pos": "noun", "senses": [{"sense": "the details or reasons that someone gives to make something clear or easy to understand", "level": "B1", "dict_examp": "What was her explanation for why she was late?", "lear_examp": "There must be some kind of explanation."}]}]}, {"word": "explosion", "poses": [{"pos": "noun", "senses": [{"sense": "when something such as a bomb explodes", "level": "B2", "dict_examp": "Forty people were killed in the explosion.", "lear_examp": "I was doing my homework when I heard an explosion."}, {"sense": "when something increases suddenly by a large amount", "level": "C1", "dict_examp": "the recent population explosion", "lear_examp": "The factors leading to this population explosion in cities of the world might vary from country to country and city to city, but there is one common demominator - the quest for a better life."}]}]}, {"word": "extinction", "poses": [{"pos": "noun", "senses": [{"sense": "when a type of animal no longer exists", "level": "C1", "dict_examp": "Many species of animal are threatened with extinction.", "lear_examp": "I wholeheartedly suggest that it should be returned to nature and to the turtles, as they face extinction after the loss of their natural home."}]}]}, {"word": "extra", "poses": [{"pos": "adjective", "senses": [{"sense": "more, or more than usual", "level": "A2", "dict_examp": "She babysits to earn a little of extra cash.", "lear_examp": "You only have to bring an extra t-shirt."}]}, {"pos": "adverb", "senses": [{"sense": "more", "level": "B1", "dict_examp": "They pay her extra to work nights.", "lear_examp": "Will there be any special events that cost extra?"}]}, {"pos": "noun", "senses": [{"sense": "something that you can get with something else if you pay a little more money", "level": "B1", "dict_examp": "A sunroof is an optional extra on this model of the car.", "lear_examp": "The DVD contains many extras."}, {"sense": "an actor in a who does not have a speaking part and usually plays someone in a crowd", "level": "C1", "dict_examp": "A friend of mine is an extra on that movie.", "lear_examp": "A theater troop at the beginning of a new project is more often than not a flabbergasting rabble of actors, technicians, extras, back-stage workers and so forth."}]}]}, {"word": "exquisite", "poses": [{"pos": "adjective", "senses": [{"sense": "very beautiful or perfect", "level": "C2", "dict_examp": "a garden of exquisite flowers", "lear_examp": "On the forefinger of my left hand they can see the most exquisite diamond ring that they ever did see."}]}]}, {"word": "extinct", "poses": [{"pos": "adjective", "senses": [{"sense": "If a type of animal is extinct, it does not now exist.", "level": "C1", "dict_examp": "These creatures could soon be extinct.", "lear_examp": "In my opinion, we should start worrying about our environment now, otherwise we will make our own species become extinct before long, and I am sure nobody wants that to happen."}]}]}, {"word": "explicit", "poses": [{"pos": "adjective", "senses": [{"sense": "clear and exact", "level": "C2", "dict_examp": "She was very explicit about her plans.", "lear_examp": "Rules have to be explicit and well explained so that they can be strictly followed."}, {"sense": "showing or talking about sex or violence in a very detailed way", "level": "C2", "dict_examp": "an explicit film", "lear_examp": "One is not supposed to watch explicit movies under the age of 16 nor drink alcohol under the age of 18."}]}]}, {"word": "exploit", "poses": [{"pos": "verb", "senses": [{"sense": "to treat someone unfairly for your own advantage", "level": "B2", "dict_examp": "Laws exist to prevent companies from exploiting their employees.", "lear_examp": "I suppose those people are often exploited and do not have real friends with whom they can share feelings and emotions. Therefore I believe being a famous person is also synonymous with being lonely."}, {"sense": "to use or develop something to your advantage", "level": "B2", "dict_examp": "We need to make sure that we exploit our resources as fully as possible.", "lear_examp": "John would certainly exploit this unique opportunity and meet the interviewer's expectations easily."}]}]}, {"word": "extraordinary", "poses": [{"pos": "adjective", "senses": [{"sense": "very special, unusual or strange", "level": "B1", "dict_examp": "He told the extraordinary story of his escape.", "lear_examp": "On the next day there was an extraordinary thunderstorm!"}]}]}, {"word": "exposure", "poses": [{"pos": "noun", "senses": [{"sense": "when someone experiences something or is affected by it because they are in a particular situation or place", "level": "C1", "dict_examp": "There is a risk of exposure to radiation.", "lear_examp": "Due to exposure to low temperatures throughout the tour I developed pneumonia and had to be admitted to hospital on arrival in London."}]}]}, {"word": "extract", "poses": [{"pos": "verb", "senses": [{"sense": "to remove or take out something", "level": "B2", "dict_examp": "The oil which is extracted from olives is used mainly for cooking.", "lear_examp": "I'm really sorry, but I can't come on the day before because I need to have my teeth extracted."}]}, {"pos": "noun", "senses": [{"sense": "a short part of a book, poem, etc.", "level": "B2", "dict_examp": "They published an extract from his autobiography.", "lear_examp": "The number of copied and read articles or book extracts has increased steadily."}]}]}, {"word": "expressive", "poses": [{"pos": "adjective", "senses": [{"sense": "showing your feelings", "level": "C2", "dict_examp": "expressive language", "lear_examp": "Ann was a beautiful girl with wonderful hair and expressive brown eyes."}]}]}, {"word": "external", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the outside part of something", "level": "B2", "dict_examp": "the external walls of the house", "lear_examp": "If you see all this external decoration, you will probably fall in love with this art."}, {"sense": "coming from or relating to another country, group, organization, etc.", "level": "B2", "dict_examp": "Most news magazines have a section devoted to external affairs.", "lear_examp": ""}]}]}, {"word": "explore", "poses": [{"pos": "verb", "senses": [{"sense": "to go around a place where you have never been in order to find out what is there", "level": "B1", "dict_examp": "The best way to explore the countryside is on foot.", "lear_examp": "You can walk and explore in the jungle."}, {"sense": "to find out more about something, often something that  you might do in the future", "level": "B2", "dict_examp": "We're exploring the possibility of buying a vacation home.", "lear_examp": "It is a great camera and I still have not explored all the possibilities it holds."}]}]}, {"word": "extravagant", "poses": [{"pos": "adjective", "senses": [{"sense": "costing too much, or spending a lot more money than you need to", "level": "C2", "dict_examp": "the extravagant lifestyle of a movie star", "lear_examp": "In some extreme cases, young people are known to have extravagant lifestyles and wasteful spending habits."}]}]}, {"word": "expire", "poses": [{"pos": "verb", "senses": [{"sense": "If a legal document or agreement expires, you can no longer use it.", "level": "C2", "dict_examp": "Your contract expired six months ago.", "lear_examp": "It is extremely important that your passport does not expire before your return date."}]}]}, {"word": "export", "poses": [{"pos": "verb", "senses": [{"sense": "to send goods to another country for sale", "level": "B2", "dict_examp": "French cheeses are exported to many different countries.", "lear_examp": "And of course, while Italy is exporting pizza, spaghetti and food like that, Italian people are able to try different food from foreign countries, like hamburgers, Chinese food, or pudding."}]}, {"pos": "noun", "senses": [{"sense": "a product that you sell in another country or the business of selling products in another country", "level": "B2", "dict_examp": "Coffee is one of Brazil's main exports.", "lear_examp": "At present I work for a Multinational company as export officer."}]}]}, {"word": "exploration", "poses": [{"pos": "noun", "senses": [{"sense": "the act of traveling to a place or searching a place to learn about it", "level": "C1", "dict_examp": "explorations of the South Pole", "lear_examp": "In the near future robots will take part in space exploration, as well as ocean exploration."}]}]}, {"word": "exterior", "poses": [{"pos": "noun", "senses": [{"sense": "the outside part of something or someone", "level": "C1", "dict_examp": "The exterior of the house was painted white.", "lear_examp": "Thus, it is best for the management to improve the look of this building as other buildings  in this area have a better looking exterior than ours."}]}]}, {"word": "explain", "poses": [{"pos": "verb", "senses": [{"sense": "to make something clear or easy to understand by giving reasons for it or details about it", "level": "A2", "dict_examp": "If there's anything you don't understand, I'll be happy to explain.", "lear_examp": "We have to explain the information to our friends."}]}]}, {"word": "extension", "poses": [{"pos": "noun", "senses": [{"sense": "extra time that you are given to do or use something", "level": "B2", "dict_examp": "I've applied for an extension of my visa.", "lear_examp": ""}, {"sense": "a telephone that is connected to the main telephone in an office or other large building", "level": "B2", "dict_examp": "Call me on extension 3104.", "lear_examp": "For further information call 990-643 extension 93."}, {"sense": "something that has developed as a result of something else", "level": "B2", "dict_examp": "The book is an extension of ideas he set out in an earlier article.", "lear_examp": "So we might say the computer is the extension of our brain."}]}]}, {"word": "extensive", "poses": [{"pos": "adjective", "senses": [{"sense": "large in amount or size", "level": "B2", "dict_examp": "Fire had caused extensive damage to the building.", "lear_examp": "You see, this medieval city has an extensive collection of antiques."}]}]}, {"word": "explode", "poses": [{"pos": "verb", "senses": [{"sense": "If something such as a bomb explodes, it bursts with noise and force, and if you explode it, you make it burst with noise and force.", "level": "B1", "dict_examp": "A bomb exploded at one of London's busiest railway stations this morning.", "lear_examp": "A bomb had exploded and that boy rescued me from the accident."}]}]}, {"word": "expose", "poses": [{"pos": "verb", "senses": [{"sense": "to make public something bad or dishonest", "level": "B2", "dict_examp": "The review exposed widespread corruption in the police force.", "lear_examp": "If I do not receive full satisfaction, I will expose your operation by writing to the newspaper."}, {"sense": "to experience something or be affected by something because you are in a particular situation or place", "level": "B2", "dict_examp": "It was the first time I'd been exposed to violence.", "lear_examp": "Also, with television, we might be exposed to violence in some films and advertisements, which does not happen if we read a book."}]}]}, {"word": "extend", "poses": [{"pos": "verb", "senses": [{"sense": "to make something bigger or to make something last for a longer time", "level": "B2", "dict_examp": "We have plans to extend the deck.", "lear_examp": "If we decide to extend our stay for two more days, does the offer still stand?"}]}]}, {"word": "extent", "poses": [{"pos": "noun", "senses": [{"sense": "the size or importance of something", "level": "B2", "dict_examp": "They are just beginning to realize the full extent of the damage.", "lear_examp": "For the past couple of decades, TV has been diffused in Japan to such an extent that nowadays, one household is likely to have more than 2 TV sets that show a wide range of programs nearly 24 hours a day."}, {"sense": "mainly", "level": "B2", "dict_examp": "Their anger was to a large extent justified.", "lear_examp": "In bad, rainy weather, one might get wet and cold. On the other hand, this can be avoided to a large extent by wearing proper equipment."}, {"sense": "in some ways", "level": "B2", "dict_examp": "To some extent, she was responsible for the accident.", "lear_examp": "To a certain extent, this point of view seems to be very respectable."}, {"sense": "the degree to which something happens or is likely to happen", "level": "C2", "dict_examp": "The research should show the extent to which these changes are being implemented.", "lear_examp": "Several factors determine the extent to which a person's character may influence our own opinions and even our way of life, such as the time spent with that particular person, or the importance that figure has in our lives."}]}]}, {"word": "express", "poses": [{"pos": "verb", "senses": [{"sense": "to show what you think or how you feel using words or actions", "level": "B2", "dict_examp": "I'm simply expressing my opinion.", "lear_examp": "Dear Aunt Ann, First of all I'd like to express my gratitude to you and to Uncle Mark for your hospitality."}]}]}, {"word": "extraordinarily", "poses": [{"pos": "adverb", "senses": [{"sense": "very", "level": "B2", "dict_examp": "She is, it must be said, extraordinarily beautiful.", "lear_examp": "Besides, the trip will be extraordinarily helpful for my course at school."}]}]}, {"word": "extremist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has such strong opinions or beliefs that most people cannot agree with them", "level": "C2", "dict_examp": "political/religious extremists", "lear_examp": "Bearing in mind all these strict rules my children have to follow they seem to be bound to become anarchic extremists."}]}]}, {"word": "eyesight", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to see", "level": "B2", "dict_examp": "My eyesight is getting worse.", "lear_examp": "I had some trouble with my eyesight, so he advised me to wear glasses and not to strain my eyes."}]}]}, {"word": "eyebrow", "poses": [{"pos": "noun", "senses": [{"sense": "the thin line of hair that is  above each eye", "level": "B2", "dict_examp": "He's got really bushy eyebrows.", "lear_examp": "He woke up and cleaned off the blood from his injured eyebrow."}]}]}, {"word": "eye", "poses": [{"pos": "noun", "senses": [{"sense": "one of the two organs in your face, which you use to see with", "level": "A1", "dict_examp": "He has no sight in his left/right eye.", "lear_examp": "I like her long brown hair and blue eyes."}, {"sense": "to be very surprised when you see someone or something", "level": "B1", "dict_examp": "I couldn't believe my eyes when I saw what he was wearing.", "lear_examp": "Well, this church was extremely simple on the outside, but when I got inside it, I couldn't believe my eyes."}, {"sense": "to watch or look after someone or something", "level": "B2", "dict_examp": "Could you keep an eye on this pot of soup for a moment?", "lear_examp": "You have to supply everything they need and keep an eye on them all the time."}, {"sense": "in someone's opinion", "level": "B2", "dict_examp": "In my parents' eyes, I'll always be a child.", "lear_examp": "To answer your question right away, the boat trip is highly recommendable in my eyes!"}, {"sense": "to be unable to stop looking at someone or something because they are so attractive or interesting", "level": "B2", "dict_examp": "He couldn't take his eyes off the wrapped gifts on the table.", "lear_examp": "Her daughter, Lourdes Maria, is such a pretty little girl that I couldn't take my eyes off her."}, {"sense": "to be good at noticing a particular type of thing", "level": "B2", "dict_examp": "Your son has a very good eye for detail.", "lear_examp": "She's got an eye for details but a mind like anybody else's."}, {"sense": "to look at someone in a direct way, without showing fear or shame", "level": "B2", "dict_examp": "I wanted to look him in the eye and tell him I made a mistake.", "lear_examp": "One day she looked me in the eyes with a sharp deep look - never have I seen such a deep look - and asked me what was happening and I told her."}, {"sense": "to watch carefully for someone or something to appear", "level": "C1", "dict_examp": "Keep an eye out for the delivery truck.", "lear_examp": "Although individually we try to deliver the best care possible for our individual patients, we do keep an ear or an eye out for the other members of the team that day."}, {"sense": "to choose to ignore something that you know is wrong", "level": "C1", "dict_examp": "The restaurant staff often took food home, and their boss turned a blind eye.", "lear_examp": "Nevertheless, we can't turn a blind eye to this reality."}, {"sense": "to be famous and often featured in the media", "level": "C1", "dict_examp": "Her new role means that she will be in the public eye.", "lear_examp": "But being famous also means that you are always in the public eye, which is a major drawback."}, {"sense": "to get someone's attention by looking at them", "level": "C2", "dict_examp": "I tried to catch her eye, but she had already turned away.", "lear_examp": "All of a sudden she caught my eye and smiled in a sad way."}, {"sense": "to be attractive or different enough to be noticed by people", "level": "C2", "dict_examp": "It was the color of his jacket that caught my eye.", "lear_examp": "Dear Sir, I am writing regarding your newly published article about nutrition, which immediately caught my eye as I was reading your magazine."}, {"sense": "If two people see eye to eye, they agree with each other.", "level": "C2", "dict_examp": "My sister didn’t see eye to eye with me.", "lear_examp": "Although I agree with some of the statements given by the young people, I do not see eye to eye with all of their viewpoints."}, {"sense": "to watch carefully for someone or something", "level": "C2", "dict_examp": "Keep your eyes peeled, he should be here any minute.", "lear_examp": "Ever since, I try to keep my eyes peeled for anything similar."}, {"sense": "to watch carefully for someone or something", "level": "C2", "dict_examp": "Keep your eyes open for anything unusual.", "lear_examp": "While staying in Turkey, for example, people ought to keep their eyes open. Look into life there."}, {"sense": "If someone cries their eyes out, they cry a lot about a problem or situation.", "level": "C2", "dict_examp": "When she heard the fire had destroyed the houses, she cried her eyes out.", "lear_examp": "She passed away when I was six years old.  I cried my eyes out."}, {"sense": "extremely quickly", "level": "C2", "dict_examp": "In the blink of an eye, he was gone.", "lear_examp": "I got dressed in the blink of an eye and I got down to the kitchen almost rolling down the stairs."}, {"sense": "in your imagination or memory", "level": "C2", "dict_examp": "In my mind's eye, I imagined the building painted white, with a beautiful garden around it.", "lear_examp": "He sees her in his mind's eye, running around barefoot, laughing and squealing, wading in the water and running back out, screaming, trying to get away from the breaking waves."}, {"sense": "If something can be seen by the naked eye, it is big enough to be seen without special equipment.", "level": "C2", "dict_examp": "These bugs are so tiny you cannot see them with the naked eye.", "lear_examp": ""}, {"sense": "to move your eyes in a circle to show surprise or disapproval", "level": "C2", "dict_examp": "When I asked her when she thought the building work would be finished, she just rolled her eyes.", "lear_examp": "This attitude is obvious when, for instance, sales assistants show no patience for the slower reaction of elderly people; when nobody offers a seat to an older person in an overcrowded train; when we roll our eyes about older people's desire for quiet, etc."}, {"sense": "when people look directly at each other, for instance when they are talking to each other", "level": "C2", "dict_examp": "There was very little eye contact between them.", "lear_examp": "I tried to avoid having eye contact with people just because of this humility."}]}]}, {"word": "eyelid", "poses": [{"pos": "noun", "senses": [{"sense": "the piece of skin that covers your eyes when you close them", "level": "B2", "dict_examp": "His eyelids drooped with tiredness.", "lear_examp": ""}]}]}, {"word": "extremely", "poses": [{"pos": "adverb", "senses": [{"sense": "very, or much more than usual", "level": "B1", "dict_examp": "They played extremely well.", "lear_examp": "The film was extremely funny."}]}]}, {"word": "eyelash", "poses": [{"pos": "noun", "senses": [{"sense": "one of the short hairs which grow from the edge of your eyelids", "level": "B2", "dict_examp": "false/long eyelashes", "lear_examp": ""}]}]}, {"word": "extreme sports", "poses": [{"pos": "noun", "senses": [{"sense": "a sport or activity that is exciting and dangerous", "level": "B1", "dict_examp": "I love most extreme sports, such as bungee jumping and white-water rafting.", "lear_examp": "You can go camping, climb mountains or learn a lot of extreme sports."}]}]}, {"word": "extrovert", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is very confident and likes being with other people", "level": "C1", "dict_examp": "She is an extrovert.", "lear_examp": "She is an extrovert, a sociable person, who loves talking to people and is always ready to sacrifice her free time to make them happy."}]}]}, {"word": "extreme", "poses": [{"pos": "adjective", "senses": [{"sense": "very large in amount or degree", "level": "B2", "dict_examp": "extreme pain/danger/wealth", "lear_examp": "This time I promise that I will take extreme caution with your things."}, {"sense": "the most unusual or the most serious possible", "level": "B2", "dict_examp": "extreme weather conditions", "lear_examp": "It seems to be an extreme case but it is a fact that modern children have no more contact with animal life."}, {"sense": "having such strong opinions or beliefs that most people cannot agree with you", "level": "C2", "dict_examp": "extreme views", "lear_examp": "Consequently, I can now express my disagreement with both articles, mostly because of the extreme opinions they contain."}]}]}]