[{"word": "facilitate", "poses": [{"pos": "verb", "senses": [{"sense": "to make something possible or easier", "level": "C1", "dict_examp": "I will do everything in my power to facilitate the process.", "lear_examp": "I found that the presentations and talks about CVs and letters of application were really useful, but we should have been divided into smaller groups to facilitate conversation."}]}]}, {"word": "face", "poses": [{"pos": "noun", "senses": [{"sense": "the front part of the head, where the eyes, nose and mouth are, or the expression on this part", "level": "A1", "dict_examp": "She's got a long, thin face.", "lear_examp": "She has got brown eyes, a round face and white skin."}, {"sense": "to show with your face that you do not like someone or something", "level": "B1", "dict_examp": "Joe made a face when he saw what was for lunch.", "lear_examp": "Making a face, I slapped my forehead."}, {"sense": "If you accept something at face value because of the way it first looks or seems, you do so without thinking carefully about it.", "level": "C1", "dict_examp": "You can't just accept everything you read in the newspapers at face value.", "lear_examp": "People are assessed at face value by the type of cars they drive."}, {"sense": "to become less respected by others because of  something you did", "level": "C2", "dict_examp": "She had to find a way to accept defeat without losing face.", "lear_examp": "However, many popular people like Pierce Brosnan managed to keep their lives out of the press and yet be present to meet public demand without losing face."}, {"sense": "to manage to stop yourself from smiling or laughing", "level": "C2", "dict_examp": "I can never play jokes on people because I can't keep a straight face.", "lear_examp": ""}, {"sense": "used when you are describing how a situation seems on the surface", "level": "C2", "dict_examp": "On the face of it, this seems like a bargain, but I bet there are hidden costs.", "lear_examp": "On the face of it, both sides have valid arguments, and it's a difficult balancing act to manage."}, {"sense": "while having to deal with a difficult situation or problem", "level": "C2", "dict_examp": "They left home in the face of strong opposition from their families.", "lear_examp": "No doubt, it was rather difficult to like Enid X. She was hardly likely to arouse sympathy in anybody even in the face of death."}, {"sense": "to be the opposite of what is usual or accepted", "level": "C2", "dict_examp": "These recommendations fly in the face of previous advice on safe limits of consumption.", "lear_examp": "But when we have a look outside our wonderful world, we can easily see that this argument flies in the face of the facts."}, {"sense": "something someone does that insults or upsets you", "level": "C2", "dict_examp": "After all that hard work, losing my job was a real slap in the face.", "lear_examp": "My father noticed that and decided it was high time to take me down a peg or two. He used to work as a volunteer in a hospital for children dying for cancer. One day, he took me there. It was like a slap in the face - suddenly I saw a different world. It was a bleak world, without smiles and happy faces."}]}, {"pos": "verb", "senses": [{"sense": "to be or turn in a particular direction", "level": "B1", "dict_examp": "Our house faces north/south/east/west.", "lear_examp": "There is  a desk to the right of the room which faces my bed."}, {"sense": "If you face a problem, or a problem faces you, you have to deal with it.", "level": "B2", "dict_examp": "This is one of the many problems faced by working mothers.", "lear_examp": "Grandparents are experienced people and they can help their children to avoid a lot of problems which they have faced."}, {"sense": "to not want to do something or deal with someone, often because it is difficult or unpleasant", "level": "B2", "dict_examp": "I can't face walking up all those steps again.", "lear_examp": "Everybody at the swimming pool was laughing about me. I couldn't face my family."}, {"sense": "to accept that something unpleasant is true and start to deal with the situation", "level": "B2", "dict_examp": "I think Phil has to face the fact that she no longer loves him.", "lear_examp": "But Mary has a strong personality, she faces the facts."}, {"sense": "to accept punishment or criticism for something bad that you have done", "level": "C1", "dict_examp": "If she doesn't have a good reason for being late, she'll just have to face the music.", "lear_examp": "Teenagers who live with their parents have to face the music about the long bills their parents receive monthly!"}, {"sense": "something that you say before you say something that is unpleasant but true", "level": "C2", "dict_examp": "Let's face it, none of us are getting any younger.", "lear_examp": "Let's face it, a life with no physical and mental exercise is something none of us relishes."}, {"sense": "to accept that a difficult situation exists", "level": "B2", "dict_examp": "Eventually, he faced up to his money problems.", "lear_examp": "However, she had to face up to the fact that it was her duty to question the serial killer, to find out what his motives were."}]}]}, {"word": "factory", "poses": [{"pos": "noun", "senses": [{"sense": "a building or set of buildings where large amounts of goods are made using machines", "level": "A1", "dict_examp": "a car/shoe factory", "lear_examp": "My friend Martin works at a factory."}]}]}, {"word": "facility", "poses": [{"pos": "noun", "senses": [{"sense": "a building or other place provided for a particular purpose", "level": "B1", "dict_examp": "a training/research/medical facility", "lear_examp": "Moreover, spending the whole afternoon at the lake gives people a chance to try a couple of water sports, which the facility offers."}, {"sense": "a part of a system or machine which makes it possible to do something", "level": "B2", "dict_examp": "an overdraft facility", "lear_examp": "I would suggest free Internet access as an extra facility in our library."}]}]}, {"word": "failure", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something does not succeed", "level": "B2", "dict_examp": "Their attempt to climb Mount Everest ended in failure.", "lear_examp": "David told her that the reason for his failure was her, because she used to press him and she couldn't accept that he wanted to be an actor."}, {"sense": "when you do not do something that you are expected to do", "level": "B2", "dict_examp": "Failure to pay within 14 days will result in interest being charged.", "lear_examp": ""}, {"sense": "when something does not work, or stops working as well as it should", "level": "B2", "dict_examp": "All street lights aren't working due to a power failure.", "lear_examp": "There has been a power failure but it will be solved in a few minutes."}]}]}, {"word": "face to face", "poses": [{"pos": "adverb", "senses": [{"sense": "directly, meeting someone in the same place", "level": "B1", "dict_examp": "We need to talk face to face.", "lear_examp": "I need to talk to her face to face."}]}]}, {"word": "fade", "poses": [{"pos": "verb", "senses": [{"sense": "to  become less bright, strong or clear, or to make something become less bright, strong or clear", "level": "B2", "dict_examp": "If you hang your clothes out in the bright sun, they will fade.", "lear_examp": "Since the cottage is quite isolated, the electric power supply is not always the best. Anyway, the first night, the lights started to fade."}, {"sense": "to gradually become less strong or clear and then disappear", "level": "B2", "dict_examp": "With time, memories of that painful summer would fade away.", "lear_examp": "These memories would never fade away, she knew it."}]}]}, {"word": "fabulous", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good", "level": "C1", "dict_examp": "They've got a fabulous house.", "lear_examp": "Everybody admitted that the entertainment was absolutely fabulous."}]}]}, {"word": "facilities", "poses": [{"pos": "noun", "senses": [{"sense": "the equipment and services provided for a particular purpose", "level": "B2", "dict_examp": "athletic facilities", "lear_examp": "The city has more facilities than the countryside."}]}]}, {"word": "factor", "poses": [{"pos": "noun", "senses": [{"sense": "one of the things that has an effect on a situation, decision, event, etc.", "level": "B2", "dict_examp": "Money was an important factor in their decision to move.", "lear_examp": "Modern technology is another important factor which affects our life."}, {"sense": "something important that helps to make the final decision", "level": "C2", "dict_examp": "Cost was the deciding factor in choosing this builder.", "lear_examp": "Personally, I think the quality of teachers, school reputation and facilities should be the deciding factors for parents for which schools their children should be educated in."}]}]}, {"word": "fail", "poses": [{"pos": "verb", "senses": [{"sense": "to not pass a test or exam", "level": "A2", "dict_examp": "A lot of people fail their driving test the first time.", "lear_examp": "I was told most people fail the exam two or three times."}, {"sense": "to not do what is necessary or expected", "level": "B2", "dict_examp": "He failed to turn up for football practice yesterday.", "lear_examp": "Your advertisement also failed to mention the fact that there were no discounts."}, {"sense": "to not be successful", "level": "B2", "dict_examp": "She moved to London in the hope of finding work as a model, but failed.", "lear_examp": "I tried to make him give up, but all my attempts failed."}, {"sense": "to stop working normally, or to become weaker", "level": "B2", "dict_examp": "Two of the plane's engines had failed.", "lear_examp": "The sound system failed."}, {"sense": "used to say that you do not accept something", "level": "C2", "dict_examp": "I fail to see why you cannot work on a Sunday.", "lear_examp": "I fail to understand why they still refuse to use this media; it could possibly be the main solution to the present problems in the library."}]}]}, {"word": "faculty", "poses": [{"pos": "noun", "senses": [{"sense": "teachers at a college or university, or in a department of a college or university", "level": "B2", "dict_examp": "We are interviewing for new faculty - there are two positions open in the history department.", "lear_examp": ""}, {"sense": "the group of teaching staff of a college or university or of a department of a college or university", "level": "C1", "dict_examp": "He was part of the computer engineering faculty before becoming dean of the Graduate School.", "lear_examp": "I think that the strengths of the system are mainly in higher education and in some university faculties."}]}]}, {"word": "faint", "poses": [{"pos": "adjective", "senses": [{"sense": "slight and not easy to notice, smell, hear, etc.", "level": "B2", "dict_examp": "a faint sound/noise/smell", "lear_examp": "I heard a faint sound."}, {"sense": "to feel very weak and as if you might fall down", "level": "C2", "dict_examp": "Seeing all the blood made me feel faint.", "lear_examp": "Starting to feel faint, Fred quickly roused himself and ran out of the hotel as quickly as he could."}, {"sense": "used to emphasize that you do not know something", "level": "C2", "dict_examp": "I haven't the faintest idea what you're talking about.", "lear_examp": "Some twenty years ago, when I left my parents' home to go and live on my own, I was given four mugs. By whom? I haven't the faintest idea."}]}, {"pos": "verb", "senses": [{"sense": "to suddenly become unconscious for a short time, usually falling down", "level": "B2", "dict_examp": "He faints at the sight of blood.", "lear_examp": "The young girl was about to faint."}]}]}, {"word": "face-to-face", "poses": [{"pos": "adjective", "senses": [{"sense": "involving two people who are meeting in the same place", "level": "B1", "dict_examp": "a face-to-face meeting", "lear_examp": ""}]}]}, {"word": "fact", "poses": [{"pos": "noun", "senses": [{"sense": "something that you know is true, exists, or has happened", "level": "A2", "dict_examp": "I don't know all the facts about what happened.", "lear_examp": "I love this book, because it's about history facts and it's very interesting."}, {"sense": "used to emphasize what is really true, or to give more information", "level": "B1", "dict_examp": "We met Rebecca for lunch. In fact, we spent the whole afternoon with her.", "lear_examp": "The club has its own small clubhouse, with many things in it. For example, there was a big pinball-game and some computers.  In fact it was the best clubhouse I've ever seen."}, {"sense": "used to refer to a situation which is surprising in relation to something that is true or happens", "level": "B2", "dict_examp": "The company has been forced to reduce its price, despite the fact that the offer has been very popular.", "lear_examp": "The advantages of the kind of life that people had years ago is that they could eat more fruit and vegetables than us. However, there are advantages for us too, because despite the fact that we eat more fast food, we do more exercise than they did."}, {"sense": "real events and experiences, not things that are imagined", "level": "B2", "dict_examp": "It's sometimes hard to separate fact from fiction.", "lear_examp": ""}, {"sense": "used to give more information, or to correct something that has been said", "level": "B2", "dict_examp": "John plays golf professionally. As a matter of fact, he has just won a big competition.", "lear_examp": "I think it would be better to choose somewhere outdoors. As a matter of fact, I prefer the open air and the sunlight!"}, {"sense": "used to tell someone that something is the truth", "level": "B2", "dict_examp": "I wouldn't usually ask for your help, but the fact is I'm desperate.", "lear_examp": "You may find it unusual for a woman to play football, but the fact is I'm Brazilian and in Brazil it is really common."}]}]}, {"word": "facial", "poses": [{"pos": "adjective", "senses": [{"sense": "of or on the face", "level": "C2", "dict_examp": "facial expressions/hair", "lear_examp": "I can still recall the doctor's facial expression when he announced the exciting news to me."}]}]}, {"word": "fabric", "poses": [{"pos": "noun", "senses": [{"sense": "cloth", "level": "C1", "dict_examp": "a light/cotton fabric", "lear_examp": "In our country fabric seldom could be obtained. My mother made herself a winter jacket from old curtains and black stockings from an old woolen pullover."}, {"sense": "the basic way in which a society or other social group is organized", "level": "C2", "dict_examp": "The family is part of the fabric of society.", "lear_examp": "You cannot infringe individual liberties and ban the purchase of cars - it would go against the very fabric of modern society."}]}]}, {"word": "fake", "poses": [{"pos": "adjective", "senses": [{"sense": "not real, but made to look or seem real", "level": "C1", "dict_examp": "fake fur", "lear_examp": "On the walls there are paintings which are very artistic - one of them is a fake Picasso."}]}, {"pos": "noun", "senses": [{"sense": "a copy of something that is intended to look real or valuable and deceive people", "level": "C2", "dict_examp": "Experts say that the painting is a fake.", "lear_examp": "Many of the pictures taken are fakes."}, {"sense": "someone who pretends to have particular skills or qualities so that they can deceive people or get their admiration", "level": "C2", "dict_examp": "He said he was a doctor, but we soon realized he was a fake.", "lear_examp": "So, after all he was a fake!"}]}, {"pos": "verb", "senses": [{"sense": "to copy something in order to deceive people", "level": "C2", "dict_examp": "The documents had been faked.", "lear_examp": "People liked it so much that another author, using the pseudonym of \"Arellaneda\", faked Cervante's novel by writing a second part."}, {"sense": "to pretend that something has happened when it has not or to pretend to have a feeling that you do not have", "level": "C2", "dict_examp": "They faked illness to avoid having to work.", "lear_examp": "This situation lasted about two years until Caroline had a great idea: they would fake their death and run away to live a quiet life on a secret island they would have bought under an alias."}]}]}, {"word": "faith", "poses": [{"pos": "noun", "senses": [{"sense": "great trust or confidence in something or someone", "level": "B2", "dict_examp": "She has no faith in modern medicine.", "lear_examp": "We must do our best to help these children to have faith in their future."}, {"sense": "strong belief in a god or gods", "level": "B2", "dict_examp": "Even in the bad times she never lost her faith.", "lear_examp": "Your story about Christianity was very interesting and I was shocked at your deep faith in God."}, {"sense": "a particular religion", "level": "B2", "dict_examp": "the Muslim/Christian/Jewish faith", "lear_examp": "Everybody was praying, asking for help according to their faith or religion."}]}]}, {"word": "fair", "poses": [{"pos": "adjective", "senses": [{"sense": "having pale skin or a light color of hair", "level": "A2", "dict_examp": "She's got fair hair and blue eyes.", "lear_examp": "She is a pretty girl with long fair hair and she has beautiful eyes."}, {"sense": "treating everyone in the same way, so that no one has an advantage", "level": "B1", "dict_examp": "That's not fair! You always go first!", "lear_examp": "Even though she thought her mom wasn't being fair, she decided to go and try to have a nice day with her family."}, {"sense": "acceptable, reasonable or right", "level": "B1", "dict_examp": "a fair deal", "lear_examp": "You may ask yourself: \"What do you do in a club?\" Well, it's a fair question!!!"}, {"sense": "used for saying that you can understand and accept someone's opinion or decision", "level": "B2", "dict_examp": "\"He says he'll only work on Sunday if he gets paid extra.\" \"Fair enough.\"", "lear_examp": "Most of the streets are open to cars and therefore people tend to escape to a little area around the pedestrian streets. Fair enough, but it makes those streets terribly overcrowded."}, {"sense": "not very good but not very bad", "level": "C1", "dict_examp": "He’s good in chemistry but only fair in math.", "lear_examp": "As for grammar, listening and writing skills, they were only fair."}, {"sense": "a large amount, distance, size, etc.", "level": "C2", "dict_examp": "There's still a fair amount of work to be done on the house.", "lear_examp": "Of course it is important to find a job we enjoy and which leaves us a fair amount of free time, but it is equally important to find a job that pays the bills, especially nowadays."}, {"sense": "an equal and honest opportunity", "level": "C2", "dict_examp": "All he asks is a fair chance to prove his innocence.", "lear_examp": "Then again, I think you have to give every job a fair chance."}, {"sense": "behavior that is fair, honest, and does not take advantage of people", "level": "C2", "dict_examp": "The public needs to feel a sense of fair play from the government.", "lear_examp": "He still believes in justice or just the rule of fair play."}]}, {"pos": "noun", "senses": [{"sense": "an event outside where food and goods are sold, there is entertainment, and sometimes contests", "level": "B1", "dict_examp": "the state/county fair", "lear_examp": "The annual Leipzig fair is 500 years old."}, {"sense": "a show in a large place where people who work  in a particular industry or have a particular interest or hobby meet to sell products, share information, give demonstrations, etc.", "level": "C1", "dict_examp": "a book/antiques/toy fair", "lear_examp": "The fair was well organized and structured into specific sections from clothing and sportswear to household appliances and electronics."}]}]}, {"word": "fairness", "poses": [{"pos": "noun", "senses": [{"sense": "when you treat everyone in the same way, so that no one has an advantage", "level": "C1", "dict_examp": "He believes in fairness and decency.", "lear_examp": "I think you have not treated us with fairness and truthfulness and therefore I do think that an apology in the newspaper would be in order."}]}]}, {"word": "faint", "poses": [{"pos": "adjective", "senses": [{"sense": "slight and not easy to notice, smell, hear, etc.", "level": "B2", "dict_examp": "a faint sound/noise/smell", "lear_examp": "I heard a faint sound."}, {"sense": "to feel very weak and as if you might fall down", "level": "C2", "dict_examp": "Seeing all the blood made me feel faint.", "lear_examp": "Starting to feel faint, Fred quickly roused himself and ran out of the hotel as quickly as he could."}, {"sense": "used to emphasize that you do not know something", "level": "C2", "dict_examp": "I haven't the faintest idea what you're talking about.", "lear_examp": "Some twenty years ago, when I left my parents' home to go and live on my own, I was given four mugs. By whom? I haven't the faintest idea."}]}, {"pos": "verb", "senses": [{"sense": "to suddenly become unconscious for a short time, usually falling down", "level": "B2", "dict_examp": "He faints at the sight of blood.", "lear_examp": "The young girl was about to faint."}]}]}, {"word": "fairly", "poses": [{"pos": "adverb", "senses": [{"sense": "more than average, but less than very", "level": "B1", "dict_examp": "a fairly big family", "lear_examp": "The weather was fairly warm."}, {"sense": "If you do something fairly, you do it in a way which is right and reasonable and treats people equally.", "level": "B2", "dict_examp": "He claimed that he hadn't been treated fairly by his employers.", "lear_examp": ""}]}]}, {"word": "faithful", "poses": [{"pos": "adjective", "senses": [{"sense": "loyal", "level": "B2", "dict_examp": "a faithful friend", "lear_examp": "An ideal pet should be a faithful friend to people, especially to its owner."}, {"sense": "If your husband, wife or partner is faithful, they do not have a romantic relationship with anyone else.", "level": "C2", "dict_examp": "a faithful husband", "lear_examp": "Making a commitment to be faithful to another, and to love a person for the rest of your life is no small thing."}, {"sense": "not changing any of the original details, facts, style, etc.", "level": "C2", "dict_examp": "Does the film adaptation stay faithful to the novel?", "lear_examp": "Working with deconstruction in music, he remained faithful to his main motto: Be yourself, express yourself, never repeat or imitate."}]}]}, {"word": "fall", "poses": [{"pos": "verb", "senses": [{"sense": "to move down toward the ground, sometimes by accident", "level": "A2", "dict_examp": "The path's very steep, so be careful you don't fall.", "lear_examp": "You'd better wear your cheap clothes as paint may fall on you."}, {"sense": "to become lower in size, amount or strength", "level": "B1", "dict_examp": "Demand for new cars has fallen recently.", "lear_examp": "It fell steadily until 1960, and remained at 3% until 1987."}, {"sense": "to start to sleep", "level": "B1", "dict_examp": "I fell asleep on the sofa watching TV.", "lear_examp": "And I need a bookshelf and a lamp of course, because I always read in bed before I fall asleep."}, {"sense": "to start to love someone", "level": "B1", "dict_examp": "I was 20 when I first fell in love.", "lear_examp": "I fell in love with David."}, {"sense": "If an event or joke falls flat, it fails to have the effect that you wanted, such as making people laugh.", "level": "C1", "dict_examp": "All the jokes in his speech fell flat.", "lear_examp": "The cultural visits fell flat in comparison to their expectations, although the sightseeing tour of Willstown was, as the students said, \"fascinating.\""}, {"sense": "used to say that it is becoming dark", "level": "C2", "dict_examp": "When darkness fell, I began to feel worried.", "lear_examp": "He greeted the worms and the slugs, and as darkness fell he retired to the shelter he had built for the night."}, {"sense": "to be defeated and start to be controlled by a different leader", "level": "C2", "dict_examp": "The city fell to the enemy.", "lear_examp": ""}, {"sense": "to become worse, or start to be in a bad situation or condition", "level": "C2", "dict_examp": "Education standards are continuing to fall.", "lear_examp": "This impressive, massive 18th-century building which accommodated the Town Hall until recently (5 years ago) has now fallen into disuse."}, {"sense": "to hang down", "level": "C2", "dict_examp": "Her long hair fell softly over her shoulders.", "lear_examp": "She had gorgeous black hair falling down her back, a creamy complexion and a figure models dream of."}, {"sense": "If advice or a request falls on deaf ears, people ignore it.", "level": "C2", "dict_examp": "Our pleas for help fell on deaf ears.", "lear_examp": "His cry for help and for a more meaningful relationship between himself and Mildred invariably fell on deaf ears."}, {"sense": "When events or details that you did not understand before fall into place, they become easy to understand.", "level": "C2", "dict_examp": "When Jo told me she had a twin sister, everything fell into place.", "lear_examp": ""}, {"sense": "to be hurt or deceived by something or someone bad", "level": "C2", "dict_examp": "He fell prey to a gang of criminals pretending to be city officials.", "lear_examp": "As young people do not have experience in living independently in society and are not fully aware of social problems such as drugs and violence, they may easily fall prey to adults who would like to exploit them."}, {"sense": "to not reach a particular level, but only by a small amount", "level": "C2", "dict_examp": "Sales for the first half of this year fell just short of the target.", "lear_examp": "Furthermore, it cannot be denied that public transport falls short of the target set during the planning process."}, {"sense": "to fail to achieve something", "level": "C2", "dict_examp": "His behavior falls short of what we expect.", "lear_examp": "This routine was really wearing me out, but, I didn't want to fall short of my parents' expectations."}, {"sense": "to break into pieces", "level": "B2", "dict_examp": "My poor old boots are falling apart.", "lear_examp": "It looks like it is going to fall apart any day."}, {"sense": "to start having problems that you cannot deal with", "level": "B2", "dict_examp": "The deal fell apart because of a lack of financing.", "lear_examp": "All her dreams and wishes fell apart."}, {"sense": "to use someone or something when other things have failed, or when there are no other choices", "level": "C2", "dict_examp": "We've been saving up the past few years, to have something to fall back on.", "lear_examp": "Moreover, in an emergency, you can fall back on my neighbors."}, {"sense": "to fall onto the ground", "level": "B1", "dict_examp": "Our apple tree fell down in the storm.", "lear_examp": "When I got up in the morning, I slipped on a piece of soap and fell down."}, {"sense": "to suddenly have strong romantic feelings about someone", "level": "B2", "dict_examp": "She fell for a tall, handsome Frenchman when she was on vacation in Paris.", "lear_examp": "I saw a handsome boy and I fell for him."}, {"sense": "to argue with someone and stop being friendly with them", "level": "B2", "dict_examp": "She's fallen out with her sister.", "lear_examp": "My husband always blames me and we fall out over my incapacity to cook."}, {"sense": "If someone or something falls over, they fall to the ground or onto their side.", "level": "B1", "dict_examp": "She tripped and fell over.", "lear_examp": "I nearly fell over because the corridor was very dark."}, {"sense": "If a plan or agreement falls through, it fails to happen.", "level": "B2", "dict_examp": "Our plans to go on vacation together fell through when Jamie got sick.", "lear_examp": "All our plans fell through and I hope it will never happen to me again."}]}, {"pos": "noun", "senses": [{"sense": "the season of the year between summer and winter, when leaves fall from the trees", "level": "A2", "dict_examp": "We like to travel in the fall when there are fewer tourists.", "lear_examp": "You come here in the fall and I think it's best to spend our time in the city because the countryside is very cold."}, {"sense": "when the size, amount or strength of something gets lower", "level": "B1", "dict_examp": "the recent fall in the price of gas", "lear_examp": "There is a fall in job vacancies."}, {"sense": "when someone or something falls down to the ground, often without intending to or by accident", "level": "B2", "dict_examp": "He had a nasty fall and hurt his back.", "lear_examp": "I was terrified and I heard the noise of a fall just by my side."}, {"sense": "when a city, government, leader, etc. loses power or control", "level": "C1", "dict_examp": "the fall of the Roman Empire", "lear_examp": "After the fall of the previous system everything changed."}]}]}, {"word": "familiarize", "poses": [{"pos": "verb", "senses": [{"sense": "to teach someone more about something new, or try to understand more about it yourself", "level": "C2", "dict_examp": "We spent a few minutes familiarizing ourselves with the day's schedule.", "lear_examp": "Also, it is better for you to stay in my house for several days to familiarize yourself with the environment."}]}]}, {"word": "farmer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who owns or looks after a farm", "level": "A2", "dict_examp": "a sheep farmer", "lear_examp": "The farmer was very friendly and we spent the day with him."}]}]}, {"word": "fascinate", "poses": [{"pos": "verb", "senses": [{"sense": "to interest someone a lot", "level": "C1", "dict_examp": "Science has always fascinated me.", "lear_examp": "What fascinates me about it is that this style of music allows the artist to bring in crazy new ideas such as African or Indian rhythms."}]}]}, {"word": "familiar", "poses": [{"pos": "adjective", "senses": [{"sense": "easy to recognize because of being seen, met, heard, etc. before", "level": "B1", "dict_examp": "There were one or two familiar faces.", "lear_examp": "Someone started to wave and then I saw a familiar face."}, {"sense": "to know something or someone well", "level": "B2", "dict_examp": "I'm sorry, I'm not familiar with your poetry.", "lear_examp": "I'm familiar with many kinds of sports activities such as ball games, recreation games, swimming and Japanese budo-karate, judo etc."}]}]}, {"word": "fan", "poses": [{"pos": "noun", "senses": [{"sense": "someone who admires and supports a person, sport, sports team, etc.", "level": "A2", "dict_examp": "More than 15,000 Liverpool fans attended Saturday's game.", "lear_examp": "I'm a fan of rock music."}, {"sense": "something that is used to move the air around so that it feels cooler, such as a machine or an object that you move with your hand", "level": "B1", "dict_examp": "There was no air conditioning, just a ceiling fan turning slowly.", "lear_examp": "Since it's quite hot here I brought a fan. I have to use it at night otherwise I can't get to sleep."}]}]}, {"word": "faraway", "poses": [{"pos": "adjective", "senses": [{"sense": "a long distance away", "level": "C2", "dict_examp": "faraway places", "lear_examp": "They transport me to faraway places and to a magic world."}, {"sense": "an expression on someone's face that shows that they are not thinking about what is happening around them", "level": "C2", "dict_examp": "He had a faraway look in his eyes.", "lear_examp": "But her most noticeable features are her large brown eyes and her happy smile. Yet, sometimes you could see a faraway look in her eyes."}]}]}, {"word": "fame", "poses": [{"pos": "noun", "senses": [{"sense": "when you are known by many people because of your achievements, skills, etc.", "level": "B2", "dict_examp": "She first rose to fame as a singer at the age of 16.", "lear_examp": "It is certain that these people have fame, fortune and success, and that many of them are very rich."}]}]}, {"word": "famous", "poses": [{"pos": "adjective", "senses": [{"sense": "known and recognized by many people", "level": "A1", "dict_examp": "a famous actor", "lear_examp": "It is the most famous place in Edinburgh."}]}]}, {"word": "family", "poses": [{"pos": "noun", "senses": [{"sense": "a group of people who are related to each other, such as a mother, a father, and their children", "level": "A1", "dict_examp": "A new family has moved in next door.", "lear_examp": "I will come with my family."}, {"sense": "the children of a family", "level": "B1", "dict_examp": "He's a single parent raising a family on his own.", "lear_examp": "Some people also want to have a family because they want to be a father or a mother."}]}]}, {"word": "far", "poses": [{"pos": "adverb", "senses": [{"sense": "at, to or from a great distance in space or time", "level": "A2", "dict_examp": "Is the station far away?", "lear_examp": "It isn't so far from my house so we can go on foot."}, {"sense": "until now", "level": "B1", "dict_examp": "So far we've made eight hundred dollars.", "lear_examp": "So far I like it here very much."}, {"sense": "very much", "level": "B2", "dict_examp": "This car is far better than our old one.", "lear_examp": "I think restaurant B is far better than restaurant A."}, {"sense": "used to say that you think something is true, but cannot be sure", "level": "B2", "dict_examp": "As far as I know, he's never been in trouble with the police.", "lear_examp": "As far as I know, accommodation at Camp California is in tents or log cabins."}, {"sense": "used to say what someone's opinion is", "level": "B2", "dict_examp": "It's all over as far as I'm concerned.", "lear_examp": "As far as I am concerned, Bernard is similar to him."}, {"sense": "used to say what you are talking about", "level": "B2", "dict_examp": "As far as sports are concerned, I like tennis and football.", "lear_examp": "As far as studying abroad is concerned, I totally agree with this idea."}, {"sense": "by a great amount", "level": "B2", "dict_examp": "They are by far the best students in the class.", "lear_examp": "I have traveled to many countries, but New Zealand is by far the best."}, {"sense": "used to talk about how true something is", "level": "C1", "dict_examp": "How far do politicians represent the views of ordinary people?", "lear_examp": "How far and to what extent would the characteristics we are born with influence our future development in life?"}, {"sense": "used to tell someone that something is certainly not true", "level": "C1", "dict_examp": "He's not selfish, far from it – he's probably one of the kindest people I know.", "lear_examp": "Contrary to what you may believe by the title, this is not an article about angels waging war against each other. It is far from it as a matter of fact, unless of course you consider high-quality web sites to be your guardian angels."}, {"sense": "not at all something", "level": "C1", "dict_examp": "The situation is far from clear.", "lear_examp": "The service was far from satisfactory, and to say that the hotel was not at all luxurious, would be putting it mildly."}, {"sense": "used to say that something has gone well until now", "level": "C2", "dict_examp": "It's the first time I've done any decorating, but so far, so good.", "lear_examp": "So far, so good, only no one told us they held this point of view before the actual christening took place."}, {"sense": "certainly not doing something", "level": "C2", "dict_examp": "Far from being pleased, he was embarrassed by the praise.", "lear_examp": "Far from asking you to close the airport, which would be quite an irrational request, I am suggesting that you should take some action to improve the situation."}, {"sense": "to take the extreme action of doing something", "level": "C2", "dict_examp": "He even went so far as to stop her using the telephone.", "lear_examp": "Our present course of action may go so far as to cause irreversible damage not only to our planet but also to the people living upon it."}, {"sense": "to behave in a way that upsets or annoys other people", "level": "C2", "dict_examp": "He's said some stupid things in the past, but this time he's gone too far.", "lear_examp": "Lucia let her speak and calmly said: \"You really have gone too far this time.\""}, {"sense": "not happening or existing very often", "level": "C2", "dict_examp": "Opportunities like this are few and far between.", "lear_examp": "Jobs in those days were few and far between and for a number of years he was alternating between temporary jobs and unemployment benefits."}]}, {"pos": "adjective", "senses": [{"sense": "describes the part of something that is most distant from the center or from you", "level": "B2", "dict_examp": "His office is at the far end of the corridor.", "lear_examp": "The dark spot at the far end of the wall seemed to be coming after her this time."}, {"sense": "to be very different from something", "level": "C1", "dict_examp": "Her luxury mansion is a far cry from the house she grew up in.", "lear_examp": "The museum was a far cry from what we expected. Not only were the machines really old and should have been replaced a long time ago, but they were boring as well."}, {"sense": "used to describe political groups whose opinions are very extreme", "level": "C2", "dict_examp": "He belongs to a far right group.", "lear_examp": ""}]}]}, {"word": "fantasy", "poses": [{"pos": "noun", "senses": [{"sense": "a situation or event that you imagine, which is not real or true", "level": "B2", "dict_examp": "Steve's favorite fantasy was to own a big house and expensive car.", "lear_examp": "Reading a book stimulates one's fantasy and imagination."}]}]}, {"word": "fashion", "poses": [{"pos": "noun", "senses": [{"sense": "a style that is popular at a particular time, especially in clothes, hair, makeup, etc.", "level": "A2", "dict_examp": "Long hair is back in fashion for men.", "lear_examp": "I like this present because I love clothes and fashion."}, {"sense": "making and selling clothes", "level": "B1", "dict_examp": "the fashion industry", "lear_examp": "When I'm tired, I like reading fashion magazines."}]}]}, {"word": "farm", "poses": [{"pos": "noun", "senses": [{"sense": "an area of land with fields and buildings, used for growing crops and/or keeping animals as a business", "level": "A1", "dict_examp": "farm animals", "lear_examp": "It's very important because I'm going to a farm this weekend and there's nothing to do."}]}]}, {"word": "fantastic", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good", "level": "A2", "dict_examp": "You look fantastic in that dress.", "lear_examp": "The beaches here are fantastic!"}]}]}, {"word": "fascinating", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely interesting", "level": "B2", "dict_examp": "a fascinating person/place", "lear_examp": "You can enjoy not only Hungarian food but also fascinating Hungarian music."}]}]}, {"word": "famine", "poses": [{"pos": "noun", "senses": [{"sense": "when people living in a particular area do not have enough food for a long time causing suffering and death", "level": "C2", "dict_examp": "The floods were followed by a terrible famine.", "lear_examp": "Pictures of the famine in Africa or the deforestation of the Amazon raise important issues for humanity as a whole, urging us to be more active citizens."}]}]}, {"word": "fashionable", "poses": [{"pos": "adjective", "senses": [{"sense": "popular at a particular time", "level": "B1", "dict_examp": "a fashionable nightclub/restaurant", "lear_examp": "There are some fashionable cafes, restaurants and museums."}]}]}, {"word": "fanatic", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose interest in something or enthusiasm for something is extreme", "level": "C2", "dict_examp": "a religious fanatic", "lear_examp": "This can give way to fanatics, religious or political, who may easily influence the frustrated masses into doing something they would under other circumstances refrain from."}]}]}, {"word": "fancy", "poses": [{"pos": "adjective", "senses": [{"sense": "attractive and formal or having attractive decoration and interesting features", "level": "B1", "dict_examp": "I wanted a simple black dress, nothing fancy.", "lear_examp": "Men usually wear a tuxedo, and women usually wear fancy dresses."}, {"sense": "expensive, fashionable, or of high quality", "level": "B1", "dict_examp": "a fancy hotel/restaurant", "lear_examp": "We can visit museums, beaches, and go to fancy restaurants for dinner."}]}]}, {"word": "false", "poses": [{"pos": "adjective", "senses": [{"sense": "not true or correct", "level": "B1", "dict_examp": "a false name", "lear_examp": "I must say that the advertisement for the show included a lot of false information."}, {"sense": "not real, but made to look or seem real", "level": "B2", "dict_examp": "false eyelashes/teeth", "lear_examp": "The main reason why we want to join your course is in order to learn how to recognize a false stamp."}, {"sense": "not sincere or expressing real emotions", "level": "C1", "dict_examp": "false promises", "lear_examp": "The actor is really getting on my nerves because he is so selfish and so false."}]}]}, {"word": "fascinated", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely interested", "level": "B2", "dict_examp": "They were fascinated by his stories.", "lear_examp": "I am sure you will be fascinated by his work and his multi-faceted character."}]}]}, {"word": "fantastically", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely", "level": "B2", "dict_examp": "They're fantastically rich.", "lear_examp": "We spent three fantastically romantic days later."}]}]}, {"word": "farming", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of working on a farm or organizing the work there", "level": "B1", "dict_examp": "modern  farming practices", "lear_examp": "I am interested in farming and hope to own a farm one day."}]}]}, {"word": "fare", "poses": [{"pos": "noun", "senses": [{"sense": "the money that you pay for a journey on a vehicle such as a bus or train", "level": "B1", "dict_examp": "Air/Bus/Train fares are going up again.", "lear_examp": "In fact, there are buses (number 843 and 845) which go to my village but the bus fare is very expensive for me."}]}]}, {"word": "fascination", "poses": [{"pos": "noun", "senses": [{"sense": "when you find someone or something fascinating", "level": "C1", "dict_examp": "Her fascination with fashion started at an early age.", "lear_examp": "Anyhow, even if you can't grasp the deep meaning behind the words, its beautiful rhyme and rhythm will exert a fascination on you."}]}]}, {"word": "feat", "poses": [{"pos": "noun", "senses": [{"sense": "an act or achievement that shows great skill or strength", "level": "C2", "dict_examp": "The Eiffel Tower is a remarkable feat of engineering.", "lear_examp": "Try as I might, getting good grades was always met more with a sense of mission accomplished - duly noted - than a feat worthy of congratulations."}, {"sense": "used when you want to emphasize that an act or achievement is very difficult", "level": "C2", "dict_examp": "Learning to ski at 60 is no mean feat!", "lear_examp": "There was an interesting discussion about whether it was harder or easier for them to enter the world of cinema, given their famous names. Both said that it was no mean feat because people were more demanding as to their abilities."}]}]}, {"word": "fasten", "poses": [{"pos": "verb", "senses": [{"sense": "to close or attach something together, or to become closed or attached together", "level": "B1", "dict_examp": "Fasten your seat belt.", "lear_examp": "She fell fast asleep and only woke to the sound of the announcement: \"Ladies and gentlemen fasten your seat belts - in a couple of minutes we will be landing in Kingston\"."}, {"sense": "to attach one thing to another", "level": "B2", "dict_examp": "He fastened the rope to a tree.", "lear_examp": ""}]}]}, {"word": "fat", "poses": [{"pos": "adjective", "senses": [{"sense": "Someone who is fat weighs too much.", "level": "A1", "dict_examp": "He eats all the time but he never gets fat.", "lear_examp": "She is tall and a little bit fat."}]}, {"pos": "noun", "senses": [{"sense": "a solid or liquid substance that is taken from animals or plants and used in cooking", "level": "B2", "dict_examp": "This product contains no animal fat.", "lear_examp": "They should also consume as much salad as they can, due to the fact that it does not contain fat."}]}]}, {"word": "fate", "poses": [{"pos": "noun", "senses": [{"sense": "what happens to someone, especially something bad", "level": "B2", "dict_examp": "We want to decide our own fate.", "lear_examp": "No one as powerless as him deserves this fate."}, {"sense": "a power that some people believe decides what will happen", "level": "B2", "dict_examp": "When we met again by chance in Cairo, I felt it must be fate.", "lear_examp": "But, little we did know what fate had in store for us."}]}]}, {"word": "faucet", "poses": [{"pos": "noun", "senses": [{"sense": "the part at the end of a pipe that controls the flow of water", "level": "B1", "dict_examp": "Turn on/off the faucet.", "lear_examp": ""}]}]}, {"word": "faulty", "poses": [{"pos": "adjective", "senses": [{"sense": "not working correctly or not in perfect condition", "level": "B2", "dict_examp": "faulty brakes", "lear_examp": "I do believe you should not mislead your readers by giving them faulty information."}]}]}, {"word": "favorable", "poses": [{"pos": "adjective", "senses": [{"sense": "showing that you like or approve of someone or something, or making you support or approve of someone or something", "level": "B2", "dict_examp": "She made a very favorable impression on us.", "lear_examp": "I would be glad if a favorable answer is given to my request."}]}]}, {"word": "fast", "poses": [{"pos": "adjective", "senses": [{"sense": "moving or happening quickly, or able to move or happen quickly", "level": "A1", "dict_examp": "fast cars", "lear_examp": "I like fast music very much."}, {"sense": "doing or getting the things that lead to rapid success and advancement", "level": "C2", "dict_examp": "Their  hard work and successful software put them in the fast lane.", "lear_examp": "Finally, should you ask why people are not happier than before, the answer is that nowadays they spend more hours on work than before because modern life is mostly a life in the fast lane."}, {"sense": "a very quick way of achieving or dealing with something", "level": "C2", "dict_examp": "These intensive courses claim to offer a fast track to wealth and success.", "lear_examp": "If I ever found a job which lives up to these expectations, I would consider myself on the fast track already."}]}, {"pos": "adverb", "senses": [{"sense": "moving or happening quickly", "level": "A2", "dict_examp": "We ran as fast as we could.", "lear_examp": "I rode my bike home as fast as I could."}, {"sense": "in a firm or tight way", "level": "C2", "dict_examp": "He tried to get away, but she held him fast.", "lear_examp": "Thankfully, there are those who still cling to such age-old values as personal contentment and growth, regarding them as the anchors which hold happiness fast."}, {"sense": "completely asleep", "level": "C2", "dict_examp": "I looked into his room but he was still  fast asleep.", "lear_examp": "Then she took a relaxing bath and 20 minutes later she was fast asleep."}]}]}, {"word": "fatal", "poses": [{"pos": "adjective", "senses": [{"sense": "A fatal illness or accident causes death.", "level": "B2", "dict_examp": "This illness is fatal in almost all cases.", "lear_examp": "Paul  received a fatal shot in the head."}, {"sense": "Fatal actions have very bad effects.", "level": "B2", "dict_examp": "He made the fatal mistake/error of believing what they told him.", "lear_examp": "That was a fatal mistake because that person was my teacher and he wasn't so pleased about my behavior."}]}]}, {"word": "fear", "poses": [{"pos": "noun", "senses": [{"sense": "a strong, unpleasant feeling that you get when you think that something bad, dangerous, or frightening  might happen", "level": "B1", "dict_examp": "her fear of snakes", "lear_examp": "I was afraid to eat it but after the first bite, I lost my fear."}, {"sense": "because you are worried about something/doing something", "level": "C2", "dict_examp": "I didn't want to move for fear of waking her up.", "lear_examp": "No one dared to turn around for fear of being bitterly disappointed."}]}, {"pos": "verb", "senses": [{"sense": "to be worried or frightened that something bad might happen or might have happened", "level": "B2", "dict_examp": "Police fear (that) the couple may have drowned.", "lear_examp": "Lots of changes which may occur during these next fifty years might make us fear that our sons' and grandsons' lives will not be as happy as ours."}, {"sense": "to be frightened of something or someone", "level": "B2", "dict_examp": "Most older employees fear unemployment.", "lear_examp": "I've always feared the dark."}, {"sense": "to worry that something very bad will happen or that something very bad has happened", "level": "C2", "dict_examp": "When there was no sign of the children, the rescuers feared the worst.", "lear_examp": "Her parents had been quarrelling constantly now for almost half a year, and she feared the worst."}]}]}, {"word": "fault", "poses": [{"pos": "noun", "senses": [{"sense": "If something bad that has happened is someone's fault, they are responsible for it.", "level": "B1", "dict_examp": "She believes it was the doctor's fault that Peter died.", "lear_examp": "\"It's my fault\" I said and he answered \"Never mind, it's all ok\"."}, {"sense": "responsible for something bad that has happened", "level": "B2", "dict_examp": "I was the one at fault and I apologized.", "lear_examp": "I really felt at fault."}, {"sense": "something that is wrong with someone's character", "level": "B2", "dict_examp": "He has many faults, but dishonesty isn't one of them.", "lear_examp": "He had a fault: he talked a lot."}, {"sense": "to criticize someone or something, especially without good reasons", "level": "C2", "dict_examp": "She was always finding fault with our work.", "lear_examp": "Sometimes I take offence at their trying to find fault with me and I am not allowed to answer back."}]}]}, {"word": "fax", "poses": [{"pos": "verb", "senses": [{"sense": "to send a document using a fax machine", "level": "B1", "dict_examp": "Fax me your reply/Fax your reply to me.", "lear_examp": "I will ask one of my classmates to fax me the work you give, and I will try to do it."}]}]}, {"word": "fatty", "poses": [{"pos": "adjective", "senses": [{"sense": "Fatty foods contain a lot of fat.", "level": "C1", "dict_examp": "Try to cut down on eating fatty foods.", "lear_examp": "There is a greater reliance on fast food and fatty foods."}]}]}, {"word": "fearless", "poses": [{"pos": "adjective", "senses": [{"sense": "not frightened of anything", "level": "C2", "dict_examp": "a fearless fighter", "lear_examp": "Yannis knew all about it, but he was fearless and stubborn, as people described him, willing to work hard and determined to succeed."}]}]}, {"word": "feather", "poses": [{"pos": "noun", "senses": [{"sense": "one of the soft, light things that grow from and cover a bird's skin", "level": "B2", "dict_examp": "I found a peacock's feather.", "lear_examp": "Birds were cleaning their feathers and singing morning songs, monkeys were jumping at the top of an old tree in the corner of the monastery yard."}]}]}, {"word": "federal", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the central government of some countries", "level": "C1", "dict_examp": "the federal government", "lear_examp": "The federal government spending is lower compared to the USA, which will be discussed in the latter part of the report."}]}]}, {"word": "feasible", "poses": [{"pos": "adjective", "senses": [{"sense": "possible or reasonable and likely to do", "level": "C1", "dict_examp": "a feasible plan", "lear_examp": "In the context of Singapore, where land is scarce and the widening or building of more roads is just not feasible, we have no choice but to choose what is best for everyone."}]}]}, {"word": "fast food", "poses": [{"pos": "noun", "senses": [{"sense": "hot food that can be served very quickly because it is already prepared", "level": "A2", "dict_examp": "fast food restaurants", "lear_examp": "We don't eat lots of fast food, usually I cook every day."}]}]}, {"word": "favorite", "poses": [{"pos": "adjective", "senses": [{"sense": "best liked or most enjoyed", "level": "A1", "dict_examp": "\"What's your favorite color?\" \"Green.\"", "lear_examp": "My favorite place is the Hotel near Olomouc."}]}, {"pos": "noun", "senses": [{"sense": "a thing that someone likes best or enjoys most", "level": "B1", "dict_examp": "How smart of you to buy chocolate chip cookies - they're my favorite.", "lear_examp": "Here in Mendoza there are very good restaurants, but one of them is my favorite and it's located in Godoy Cruz, Mendoza."}]}]}, {"word": "faultless", "poses": [{"pos": "adjective", "senses": [{"sense": "perfect, or without any mistakes", "level": "C2", "dict_examp": "a faultless performance", "lear_examp": "Children also need to be taught that parents are not faultless and the best way to teach a child to apologize is by doing it oneself after having treated the child unfairly."}]}]}, {"word": "February", "poses": [{"pos": "noun", "senses": [{"sense": "the second month of the year, after January and before March", "level": "A1", "dict_examp": "the 28th of February/February 28(th)", "lear_examp": "I'll begin on February 21st at 10:00 a.m."}]}]}, {"word": "feature", "poses": [{"pos": "noun", "senses": [{"sense": "a typical quality, or an important part of something", "level": "B2", "dict_examp": "The town's main features are its beautiful mosque and ancient marketplace.", "lear_examp": "He explained the features of the new product to the rest of his colleagues."}, {"sense": "Someone's features are the parts of their face that you notice when you look at them.", "level": "B2", "dict_examp": "His eyes are his best feature.", "lear_examp": "They have similar figures, and the features of their faces are nearly the same."}, {"sense": "a special article in a newspaper or magazine, or a special television program", "level": "C2", "dict_examp": "a double-page feature on global warming", "lear_examp": "As a regular reader of the student magazine \"Uni,\" I read with particular interest last week's feature on political thrillers."}]}, {"pos": "verb", "senses": [{"sense": "to include someone or something as an important part", "level": "B2", "dict_examp": "The film features James Dean as a disaffected teenager.", "lear_examp": "I truly hope that the festival next year will feature more of the plays."}]}]}, {"word": "father-in-law", "poses": [{"pos": "noun", "senses": [{"sense": "the father of your husband or wife", "level": "B2", "dict_examp": "My father-in-law was a banker.", "lear_examp": "My father-in-law, I'm pretty sure, will be able to answer all your questions."}]}]}, {"word": "fearful", "poses": [{"pos": "adjective", "senses": [{"sense": "frightened or worried", "level": "C2", "dict_examp": "He was fearful of driving on the icy streets.", "lear_examp": "My mother is a very fearful person and when I was playing with other children in the sea I could not stand it when she interrupted our game all the time with the same words: \"Do not do that and do not do this, it is too dangerous.\""}]}]}, {"word": "feast", "poses": [{"pos": "noun", "senses": [{"sense": "a large meal, especially to celebrate something special", "level": "C1", "dict_examp": "Everyone cooked a different dish and we had quite a feast!", "lear_examp": "Finally, they have a feast with a lot of food and wine."}]}, {"pos": "verb", "senses": [{"sense": "to eat a lot of food and enjoy it very much", "level": "C2", "dict_examp": "We feasted on fried chicken, ice cream, and chocolate cake.", "lear_examp": "Some people think that traveling entails feasting on typical food and buying lots of clothes."}]}]}, {"word": "father", "poses": [{"pos": "noun", "senses": [{"sense": "your male parent", "level": "A1", "dict_examp": "My father took me to watch football every Saturday.", "lear_examp": "I got it from my father and mother."}]}]}, {"word": "favor", "poses": [{"pos": "noun", "senses": [{"sense": "something that you do to help someone", "level": "B1", "dict_examp": "She called up to ask me a favor.", "lear_examp": "I need to ask you a favor."}, {"sense": "to agree with or approve of a plan or idea", "level": "B2", "dict_examp": "Most people are in favor of reducing traffic in cities.", "lear_examp": "I am more in favor of longer opening hours during the week, and of shorter ones on the weekend."}]}]}, {"word": "female", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging or relating to women, or to the sex that can produce eggs or have babies", "level": "B1", "dict_examp": "a female athlete/employee", "lear_examp": "All my female friends at school say that he is an attractive young man."}]}, {"pos": "noun", "senses": [{"sense": "a female animal or person", "level": "B2", "dict_examp": "The kitten was actually a female, not a male.", "lear_examp": "We all know the problems that are caused by having animals kept in a zoo: females refuse the males, or they become mad from the lack of freedom."}]}]}, {"word": "feed", "poses": [{"pos": "verb", "senses": [{"sense": "to give food to a person, group or animal", "level": "B1", "dict_examp": "I usually feed the neighbor's cat while she's away.", "lear_examp": "You can also ride horses and feed animals like rabbits, birds and hamsters."}, {"sense": "If an animal or a baby feeds, it eats.", "level": "C1", "dict_examp": "The caterpillars feed on cabbage leaves.", "lear_examp": "In the same way, animals killed plants and fed on them."}, {"sense": "to supply something such as information to a person or a machine, especially in a regular or continuous way", "level": "C1", "dict_examp": "We fed them false information about our plans.", "lear_examp": "For heaven's sake, the strike lasted for three weeks not three years. ... They feed you with lies."}]}]}, {"word": "fiction", "poses": [{"pos": "noun", "senses": [{"sense": "literature and stories about imaginary characters and events", "level": "B1", "dict_examp": "The book is a work of fiction and not intended as a historical account.", "lear_examp": "In his fiction, one can detect traces of different literary schools."}, {"sense": "something that is not true or real", "level": "C1", "dict_examp": "Nobody knows whether his statement is fact or fiction.", "lear_examp": "On the other hand they were hardly available after lessons, so \"the individual tuition on demand\" the school offers in the advertisement turned out to be a fiction."}]}]}, {"word": "fed up", "poses": [{"pos": "adjective", "senses": [{"sense": "annoyed or bored by something that you have experienced for too long", "level": "B2", "dict_examp": "I'm fed up with my job.", "lear_examp": "I'm sure that the whole world is fed up with Mozart."}]}]}, {"word": "fertile", "poses": [{"pos": "adjective", "senses": [{"sense": "Fertile land or soil produces a lot of healthy plants.", "level": "C2", "dict_examp": "They settled in the fertile river valleys.", "lear_examp": "We had an enormous backyard with the most fertile soil where we grew all sorts of vegetables."}]}]}, {"word": "federation", "poses": [{"pos": "noun", "senses": [{"sense": "a group of organizations, countries, regions, etc. that have joined together to form a larger organization or government", "level": "C1", "dict_examp": "Canada is a federation of provinces and territories.", "lear_examp": "In Yugoslavia sports was an important factor contributing to the overall stability of the federation."}]}]}, {"word": "fellow", "poses": [{"pos": "adjective", "senses": [{"sense": "describes someone who has the same job or interests as you, or is in the same situation as you", "level": "B2", "dict_examp": "She introduced me to some of her fellow students.", "lear_examp": "In conclusion, I have to declare that I myself and my fellow students will be available to help with this short video."}]}]}, {"word": "feedback", "poses": [{"pos": "noun", "senses": [{"sense": "information or opinions about something, such as a new product, that provide an idea of whether it is successful or liked", "level": "B2", "dict_examp": "Have you had any feedback from customers about the product?", "lear_examp": "I am writing to you to give you feedback about the social program."}]}]}, {"word": "field", "poses": [{"pos": "noun", "senses": [{"sense": "an area of land used for growing crops or keeping animals", "level": "A2", "dict_examp": "corn fields", "lear_examp": "You could spend hours walking in wonderful forests and fields."}, {"sense": "an area of grass used for playing sports", "level": "B1", "dict_examp": "the school sports fields", "lear_examp": "They have chosen our school because it has got a lot of things such as basketball courts and baseball fields."}, {"sense": "an area of study or activity", "level": "B2", "dict_examp": "He's an expert in the field of biochemistry.", "lear_examp": "This time it is the case of telecommunications, tomorrow it will be the time of advances in the field of medicine."}, {"sense": "the people competing in a race, activity, or business", "level": "C2", "dict_examp": "We lead the field in genetic research.", "lear_examp": "Brian Moore leads the field with a style that can only be called immaculate."}, {"sense": "an area of land covered with or containing a lot of a particular substance", "level": "C2", "dict_examp": "an oil/gas/coal field", "lear_examp": "Our tour took also us to see the lower fields; from where the tour bus stops to the end of the lava fields, which is in the sea, it takes about thirty minutes walking."}]}]}, {"word": "feminine", "poses": [{"pos": "adjective", "senses": [{"sense": "showing qualities that people generally think are typical of women", "level": "C1", "dict_examp": "a feminine voice", "lear_examp": "When my grandmother was a young women, it was a must for her to wear a dress or at least a skirt and a very feminine blouse."}]}]}, {"word": "feel", "poses": [{"pos": "verb", "senses": [{"sense": "to experience something physical or emotional", "level": "A1", "dict_examp": "\"How are you feeling?\" \"Not too bad, but I've still got a headache.\"", "lear_examp": "I like Prague, because it is place where I feel good."}, {"sense": "to have a feeling or idea about something that you have experienced even though it is not true", "level": "B1", "dict_examp": "I feel as if I've known you for ages.", "lear_examp": "I feel like I've been here for ages."}, {"sense": "to have a wish for something, or to want to do something, at a particular moment", "level": "B1", "dict_examp": "I feel like going for a swim.", "lear_examp": "The weather is warm and I feel like swimming."}, {"sense": "to seem to be similar to a type of person, thing, or situation", "level": "B1", "dict_examp": "My feet feel like blocks of ice.", "lear_examp": "In front of these big towers, I feel like a tiny insect!"}, {"sense": "to think something or have an opinion", "level": "B1", "dict_examp": "I feel (that) I should be doing more to help her.", "lear_examp": "The more he got close to this man, the more he felt sure it was Chris, who died in a car crash in April 1972."}, {"sense": "to feel sympathy for someone because they are in a difficult situation", "level": "B1", "dict_examp": "I feel so sorry for the children - it must be really hard for them.", "lear_examp": "Anyway, I feel sorry for her and I wonder: what would I do if I were her?"}, {"sense": "to feel happy and confident in a place or situation", "level": "B1", "dict_examp": "After a month she felt at home in her new job.", "lear_examp": "I explained: \"I was in Manchester for just 10 months and during that time the people from there made me feel at home so I feel proud to have the accent.\""}, {"sense": "to touch something, especially with your hands, in order to examine it", "level": "B2", "dict_examp": "I felt his head and it was hot.", "lear_examp": "I tried to open the heavy door; I could feel the iron bar with my almost frozen fingers."}, {"sense": "If a place, situation, etc., feels different, strange, etc., that is how it seems to you, or that describes your experience of it.", "level": "B2", "dict_examp": "It felt strange to see him again after so long.", "lear_examp": "It felt strange and yet so wonderful to ski in the summer!"}, {"sense": "to be aware of something", "level": "B2", "dict_examp": "I could feel them watching me.", "lear_examp": "I could feel the silence."}, {"sense": "to feel that you should do something", "level": "C1", "dict_examp": "He felt compelled to resign from his job.", "lear_examp": "As a member of the International Student's Sports Club, I felt compelled to write this article in answer to the previous article about how today's youth is putting sports and healthy activities aside."}, {"sense": "to feel very weak and as if you might fall down", "level": "C2", "dict_examp": "Seeing all the blood made me feel faint.", "lear_examp": "Starting to feel faint, Fred quickly roused himself and ran out of the hotel as quickly as he could."}]}]}, {"word": "feeble", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely weak", "level": "C2", "dict_examp": "She became too feeble to get out of bed.", "lear_examp": "Most of the times, the owner is a decrepit and feeble old man, who can hardly hear you, but who can be a magnificent narrator."}, {"sense": "not very good or effective", "level": "C2", "dict_examp": "a feeble argument/excuse", "lear_examp": "Some of the passengers began to pray under their breath, in a feeble attempt to suppress their panic."}]}]}, {"word": "fend", "poses": [{"pos": "verb", "senses": [{"sense": "to take care of yourself without help", "level": "C2", "dict_examp": "When you go away to college, you have to learn to fend for yourself.", "lear_examp": "For such people to be able to provide for their families and fend for themselves, they have to work irrespective of how they do the job."}]}]}, {"word": "fever", "poses": [{"pos": "noun", "senses": [{"sense": "when someone's  body temperature rises because they are ill", "level": "B1", "dict_examp": "He's got a headache and a high/slight fever.", "lear_examp": "I understood that she was alone with her brother and he has a fever."}, {"sense": "when people are very excited about something", "level": "C2", "dict_examp": "Election fever has gripped the nation.", "lear_examp": "It was then when they started to build enormous buildings and skyscrapers all around. The \"building fever\" had started."}]}]}, {"word": "fictional", "poses": [{"pos": "adjective", "senses": [{"sense": "existing only in fiction", "level": "C2", "dict_examp": "a fictional character", "lear_examp": "What he is especially known and admired for are his fictional but memorable characters, which became almost archetypes in literature."}]}]}, {"word": "feeling", "poses": [{"pos": "noun", "senses": [{"sense": "emotion", "level": "B1", "dict_examp": "a feeling of joy/sadness", "lear_examp": "When I'm walking alone I can think about all my feelings, combine them into one and the name of this feeling is love."}, {"sense": "Your feelings are your beliefs and emotions, especially those influenced by other people.", "level": "B1", "dict_examp": "You can't hide your feelings from me.", "lear_examp": "I can't explain my feelings."}, {"sense": "an idea that something is true or exists", "level": "B1", "dict_examp": "I had the strange feeling that we had met before.", "lear_examp": "When I saw the policeman's face I got a bad feeling about this man. He didn't look like a cop but he was dressed like one, so I decided to stay away from this guy."}, {"sense": "when you feel something physical", "level": "B1", "dict_examp": "I've got this odd feeling in my stomach.", "lear_examp": "After one hour I was home and still had the feeling of warm rain touching my skin."}, {"sense": "an opinion or belief", "level": "B2", "dict_examp": "My feeling is that we had better act quickly or it will be too late.", "lear_examp": "My feeling is that we should simply buy what we want to buy and not what we are prompted to buy."}, {"sense": "anger, unhappiness, or lack of trust", "level": "C2", "dict_examp": "I hope you don't have any hard feelings.", "lear_examp": "There were no hard feelings anymore."}]}]}, {"word": "few", "poses": [{"pos": "determiner", "senses": [{"sense": "some, or a small number of", "level": "A2", "dict_examp": "I'll be ready in a few minutes.", "lear_examp": "I invited a few of my friends and relatives."}, {"sense": "quite a large number of", "level": "B1", "dict_examp": "I know quite a few people who've had the same problem.", "lear_examp": "There were quite a few people at the park."}, {"sense": "a small number, not many or not enough", "level": "B1", "dict_examp": "He is among the few people I can trust.", "lear_examp": "Usually there are very few people, so it's a great place to escape from busy towns. Preliminary English Test; Estonia; B1 THRESHOLD; 2004; Estonian; Pass)(1611693;"}, {"sense": "not happening or existing very often", "level": "C2", "dict_examp": "Opportunities like this are few and far between.", "lear_examp": "Jobs in those days were few and far between and for a number of years he was alternating between temporary jobs and unemployment benefits."}]}]}, {"word": "ferry", "poses": [{"pos": "noun", "senses": [{"sense": "a boat that regularly carries passengers and often vehicles across an area of water", "level": "B1", "dict_examp": "a car ferry", "lear_examp": "We are planning to go to the \"Red Island\", which is just 15 minutes from Rovigno by ferry."}]}]}, {"word": "festival", "poses": [{"pos": "noun", "senses": [{"sense": "a series of special events, performances, etc. that often takes place over several days", "level": "B1", "dict_examp": "a film/music/jazz festival", "lear_examp": "I decided to go to that city because of the film festival that was going to happen."}, {"sense": "a special day or period when people celebrate something, especially a religious event", "level": "B1", "dict_examp": "a harvest festival", "lear_examp": "I like to dress up traditionally during festivals."}]}]}, {"word": "fee", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of money that you pay to do something, to use something, or to get a service", "level": "B1", "dict_examp": "legal/late fees", "lear_examp": "Before I can enter the club I must to pay an entrance fee of fifteen dollars."}]}]}, {"word": "fence", "poses": [{"pos": "noun", "senses": [{"sense": "a wood, wire or metal structure which divides or goes around an area of land", "level": "B2", "dict_examp": "a garden fence", "lear_examp": "I looked around to make sure that no-one saw me and jumped over the fence."}]}]}, {"word": "film-maker", "poses": [{"pos": "noun", "senses": [{"sense": "a film director, especially an independent one who has control over how the film is made", "level": "B1", "dict_examp": "one of the industry's top film-makers.", "lear_examp": "The plot is about a film-maker and his difficulties in finishing his last film."}]}]}, {"word": "filter", "poses": [{"pos": "verb", "senses": [{"sense": "to gradually become known", "level": "C1", "dict_examp": "News is filtering in of an earthquake in Mexico.", "lear_examp": "For example, what was happening in the other parts of the country and even in the world took a lot of time to filter through."}, {"sense": "to pass a liquid or gas through a piece of equipment in order to remove solid pieces or other substances", "level": "C2", "dict_examp": "The water was filtered to remove any impurities.", "lear_examp": "The sun's rays, filtered through the black lenses, seemed harmless."}, {"sense": "to gradually appear", "level": "C2", "dict_examp": "The sunlight filtered through the bedroom curtains.", "lear_examp": "Outside, the moonlight filtered through the leaves of the roadside trees like a sheet of burnished silver."}]}, {"pos": "noun", "senses": [{"sense": "a piece of equipment that you pass a liquid or gas through in order to remove particular substances", "level": "C2", "dict_examp": "a coffee filter", "lear_examp": "Finally, the governments of all countries should implement heavy pecuniary punishments to the factory owners who do not use special filters on their chimneys or on their waste systems."}]}]}, {"word": "filthy", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely dirty", "level": "C1", "dict_examp": "Wash your hands, they're filthy!", "lear_examp": "Although the listening area is enormous, it is filthy and there are papers everywhere."}, {"sense": "rude or offensive", "level": "C1", "dict_examp": "filthy language/jokes", "lear_examp": "As far as books are concerned, pornography and filthy language is evident everywhere, to lure people to buy these books."}]}]}, {"word": "figure", "poses": [{"pos": "noun", "senses": [{"sense": "the symbol for a number or an amount expressed in numbers", "level": "B1", "dict_examp": "Can you read this figure? Is it a three or an eight?", "lear_examp": "More than 5,000 were present, so I don't understand why you mention the figure 2,000."}, {"sense": "the shape of someone's body, usually an attractive shape", "level": "B1", "dict_examp": "She's got a good figure.", "lear_examp": "She has long blond hair and blue eyes. She has a good figure."}, {"sense": "a particular type of person, often someone important or famous", "level": "B2", "dict_examp": "Lincoln was a major figure in American politics.", "lear_examp": "She is an important figure in Argentina."}, {"sense": "a person that you cannot see clearly", "level": "B2", "dict_examp": "I could see two tall figures in the distance.", "lear_examp": "Suddenly a figure appeared in front of us."}, {"sense": "a picture or drawing in a book or document, usually with a number", "level": "B2", "dict_examp": "Figure 10.3 shows the maximum length of the bridges.", "lear_examp": "Figure 1 demonstrates the use of electricity in England in summer and winter."}, {"sense": "a number that expresses an amount, especially in official documents", "level": "C1", "dict_examp": "The latest figures show a rise in unemployment.", "lear_examp": "They do not have any avenues of change until they migrate to cities, which only 15% of villagers do in Pakistan according to government figures."}]}, {"pos": "verb", "senses": [{"sense": "to decide something or expect something to happen after thinking about it", "level": "B1", "dict_examp": "They figured (that) about twenty people would be there.", "lear_examp": "I see you have difficulty figuring where to go, but if you really want my opinion I do recommend the countryside as it's filled with peaceful silence and beautiful views all around."}, {"sense": "to finally understand something or someone", "level": "B2", "dict_examp": "I can't figure out why he did it.", "lear_examp": "I couldn't figure out what had happened."}]}]}, {"word": "fifth", "poses": [{"pos": "ordinal number", "senses": [{"sense": "5th written as a word", "level": "A2", "dict_examp": "the fifth floor of the building", "lear_examp": "This is the fifth Harry Potter book."}]}, {"pos": "noun", "senses": [{"sense": "one of five equal parts of something", "level": "B1", "dict_examp": "One fifth is the same as 20 percent.", "lear_examp": ""}]}]}, {"word": "fierce", "poses": [{"pos": "adjective", "senses": [{"sense": "violent or angry", "level": "B2", "dict_examp": "a fierce dog", "lear_examp": "This may surprise some of you who have always thought of the tiger as a fierce and dangerous beast."}, {"sense": "very strong or powerful", "level": "B2", "dict_examp": "Fierce winds/storms battered the coast all weekend.", "lear_examp": "The need for darkness was justified by the fierce thunderstorm, which seemed likely to smash the house into pieces."}, {"sense": "showing strong feeling or energetic activity", "level": "B2", "dict_examp": "The expansion plans will face fierce opposition/resistance from environmentalists.", "lear_examp": "Nowadays, family life importance is a matter that arouses fierce passions."}]}]}, {"word": "fifty", "poses": [{"pos": "number", "senses": [{"sense": "the number 50", "level": "A2", "dict_examp": "forty, fifty, sixty", "lear_examp": "There were fifty guests at my party."}, {"sense": "to be aged between 50 and 59", "level": "B2", "dict_examp": "He retired when he was still in his fifties.", "lear_examp": "Despite being in my fifties I am healthy and in good shape."}, {"sense": "the years 1950 through 1959", "level": "B2", "dict_examp": "Many new suburbs were built in the fifties.", "lear_examp": "I love bands from the fifties, sixties, seventies  . . . and most of the radio stations seem to forget that the music has a history and it is always nice to remember past songs, because a good song will always be a good song."}]}]}, {"word": "field", "poses": [{"pos": "noun", "senses": [{"sense": "an area of land used for growing crops or keeping animals", "level": "A2", "dict_examp": "corn fields", "lear_examp": "You could spend hours walking in wonderful forests and fields."}, {"sense": "an area of grass used for playing sports", "level": "B1", "dict_examp": "the school sports fields", "lear_examp": "They have chosen our school because it has got a lot of things such as basketball courts and baseball fields."}, {"sense": "an area of study or activity", "level": "B2", "dict_examp": "He's an expert in the field of biochemistry.", "lear_examp": "This time it is the case of telecommunications, tomorrow it will be the time of advances in the field of medicine."}, {"sense": "the people competing in a race, activity, or business", "level": "C2", "dict_examp": "We lead the field in genetic research.", "lear_examp": "Brian Moore leads the field with a style that can only be called immaculate."}, {"sense": "an area of land covered with or containing a lot of a particular substance", "level": "C2", "dict_examp": "an oil/gas/coal field", "lear_examp": "Our tour took also us to see the lower fields; from where the tour bus stops to the end of the lava fields, which is in the sea, it takes about thirty minutes walking."}]}]}, {"word": "fifteen", "poses": [{"pos": "number", "senses": [{"sense": "the number 15", "level": "A1", "dict_examp": "thirteen, fourteen, fifteen, sixteen", "lear_examp": "It is fifteen years old and it is in good condition."}]}]}, {"word": "fill", "poses": [{"pos": "verb", "senses": [{"sense": "to make a container or space full, or to become full", "level": "A2", "dict_examp": "I filled the bucket with water.", "lear_examp": "It was really hot, even for a summer day, but we were refreshed by  a beautiful waterfall that we stopped at to fill our water bottle."}, {"sense": "If people or things fill a space, there are a lot of them in it.", "level": "B1", "dict_examp": "Dark clouds filled the sky.", "lear_examp": "Suddenly clouds filled the sky with darkness."}, {"sense": "If light, sound, or a smell fills a place, you can easily notice it.", "level": "B1", "dict_examp": "The smell of smoke filled the room.", "lear_examp": "The class was filled with the sound of laughing."}, {"sense": "to make someone feel very angry/happy/proud, etc.", "level": "B2", "dict_examp": "The thought of losing him filled her with fear.", "lear_examp": "Nobody was talking and the 50 passengers were filled with terror."}, {"sense": "to give a job or position to someone", "level": "C1", "dict_examp": "I'm sorry, the job/position/post/vacancy has already been filled.", "lear_examp": "Suppose if ten people retire from an organization, the vacancies are filled by bringing up the middle management and their previous positions will be filled be lower management."}, {"sense": "to provide something that people need or want", "level": "C2", "dict_examp": "The new nursery is really filling a need.", "lear_examp": "I had nearly finished my study and had an idea to start a small software company, filling a gap in the market that was overlooked by the larger I.T. companies."}, {"sense": "to write the necessary information on an official document", "level": "A2", "dict_examp": "to fill in/out a form/questionnaire", "lear_examp": "Please fill in my form."}, {"sense": "to become full, or to make something become full", "level": "B1", "dict_examp": "The seats in the hall were filling up fast.", "lear_examp": "I bought that couch just to fill up the space left."}]}]}, {"word": "file", "poses": [{"pos": "noun", "senses": [{"sense": "a collection of information such as text, pictures or computer programs stored together electronically with a single name", "level": "A2", "dict_examp": "What's the file name?", "lear_examp": "I need the computer to save all my files."}, {"sense": "a collection of information and documents about someone or something", "level": "A2", "dict_examp": "a project/subject/research file", "lear_examp": "I think I've left the file near the table in the drawing room."}]}]}, {"word": "final", "poses": [{"pos": "adjective", "senses": [{"sense": "last in a series or coming at the end of something", "level": "A2", "dict_examp": "a final warning/offer", "lear_examp": "I need them immediately as my final exam is the day after tomorrow."}, {"sense": "If a decision, agreement, or answer is final, it will not be changed or discussed any more.", "level": "C2", "dict_examp": "The committee's decision is final.", "lear_examp": "It was the sort of statement that you know is final, and Mr. Cameron perceived this."}]}, {"pos": "noun", "senses": [{"sense": "the last in a series of games, races or competitions, usually the one in which the winner is chosen", "level": "B1", "dict_examp": "They're in the final.", "lear_examp": "We were in the final, but we lost."}]}]}, {"word": "film", "poses": [{"pos": "noun", "senses": [{"sense": "a story shown in  moving pictures, shown at a movie theater or on television", "level": "B1", "dict_examp": "She's an artist who makes experimental films.", "lear_examp": "I like watching documentary films about animals (especially, about dolphins and elephants, like you do)."}, {"sense": "a thin layer of something on a surface", "level": "C2", "dict_examp": "A film of oil glistened on the surface of the water.", "lear_examp": "The walls were covered with a thin film of water."}]}, {"pos": "verb", "senses": [{"sense": "to record moving pictures with a camera, usually to make a \tmovie", "level": "B1", "dict_examp": "Most of the scenes were filmed in a studio.", "lear_examp": "So he had put it into his cupboard which was just open and the burglar hadn't noticed the camera which filmed all his actions."}]}]}, {"word": "fighting", "poses": [{"pos": "noun", "senses": [{"sense": "when people fight, especially in a war", "level": "B2", "dict_examp": "Fierce fighting has continued all day.", "lear_examp": "Kung-fu is not only a way of fighting, it is also a way of life."}]}]}, {"word": "fight", "poses": [{"pos": "verb", "senses": [{"sense": "to use physical force to try to defeat another person or group of people", "level": "B1", "dict_examp": "Two men were fighting outside the park.", "lear_examp": "She was very tired and afraid, so I decided to help her by going to the \"Blue Forest\", and I remember I fought with the wizards."}, {"sense": "to take part in a war", "level": "B2", "dict_examp": "Millions of young men fought in the First World War.", "lear_examp": "He fought in the Spanish Civil war and in World War II."}, {"sense": "to argue", "level": "B2", "dict_examp": "We've got to stop fighting in front of the children.", "lear_examp": "Then I became angry again because although I spent my day doing nothing, I didn't buy a present for my sister, and when I went home we fought."}, {"sense": "to try hard to stop something bad happening", "level": "B2", "dict_examp": "He fought against racism.", "lear_examp": "The other great advantage is that it is a nice way of fighting against pollution."}, {"sense": "to try hard to achieve something you want or think is right", "level": "B2", "dict_examp": "They are fighting for their freedom.", "lear_examp": "All of them were fighting for their cause."}]}, {"pos": "noun", "senses": [{"sense": "when people use physical force to hurt or attack others", "level": "B1", "dict_examp": "Jeff's always getting into/starting fights.", "lear_examp": "My son got into a fight on his way from the school to the house and he had a black eye."}, {"sense": "when you use a lot of effort to achieve or stop something", "level": "B2", "dict_examp": "Join us in our fight for freedom!", "lear_examp": "I was sitting like every evening in my armchair, reading my favorite book \"My fight for Irish freedom\" and suddenly the lights went out."}, {"sense": "an argument", "level": "B2", "dict_examp": "I don't want to have a fight over this.", "lear_examp": "I had a fight with my mother and she told me off in front of my friends."}]}]}, {"word": "fine", "poses": [{"pos": "adjective", "senses": [{"sense": "well, healthy, or happy", "level": "A1", "dict_examp": "\"How are you?\" \"I'm fine, thanks.\"", "lear_examp": "I'm fine."}, {"sense": "used to agree with a suggestion, idea, etc.", "level": "A1", "dict_examp": "\"Should we meet at 8 o'clock?\" \"Yes, that's fine.\"", "lear_examp": "If you want to meet me on Monday, that's fine."}, {"sense": "good or good enough", "level": "A2", "dict_examp": "\"Is this soup hot enough?\" \"Yes, it's fine.\"", "lear_examp": ""}, {"sense": "sunny and not raining", "level": "B1", "dict_examp": "It should be a fine day tomorrow.", "lear_examp": "The weather is fine."}, {"sense": "excellent or much better than average", "level": "B2", "dict_examp": "a fine musician/artist", "lear_examp": "There we will be served a fine dinner."}, {"sense": "a very small difference between two things that may seem different", "level": "C1", "dict_examp": "There's a fine line between courage and foolishness.", "lear_examp": "It took me 6 months to realize that there is a fine line between telling off and psychological abuse."}, {"sense": "thin or made of very small pieces", "level": "C2", "dict_examp": "fine, brown hair", "lear_examp": "They got their hands on some anthrax bacteria, grew them in petri dishes and with all her knowledge in biology managed to make anthrax spores. Her friends ground the clumps of spores into fine particles."}]}, {"pos": "noun", "senses": [{"sense": "an amount of money that you must pay for breaking a rule or law", "level": "B1", "dict_examp": "She had to pay a fine.", "lear_examp": "She was made to pay a fine and she wasn't sent to prison."}]}, {"pos": "verb", "senses": [{"sense": "to charge someone an amount of money as a punishment for not obeying a rule or law", "level": "B2", "dict_examp": "Drivers who break the speed limit can expect to be fined heavily.", "lear_examp": "Besides, you can be fined by the police."}]}, {"pos": "adverb", "senses": [{"sense": "very well or without any problems", "level": "B2", "dict_examp": "\"How did your exam go?\" \"It went fine, I think.\"", "lear_examp": "The couple was great and everything went fine."}]}]}, {"word": "fingertip", "poses": [{"pos": "noun", "senses": [{"sense": "If you have something at your fingertips, you can get it and use it very easily.", "level": "C2", "dict_examp": "He had all the information needed at his fingertips.", "lear_examp": "An Internet connection literally means having the world at your fingertips."}]}]}, {"word": "fingernail", "poses": [{"pos": "noun", "senses": [{"sense": "the hard part that covers and protects the top of the end of your finger", "level": "B2", "dict_examp": "dirty/long fingernails", "lear_examp": "Half way through dinner we had discussed almost everything about him: his lips, fingernails, how he would look in swim trunks how he would dance, etc."}]}]}, {"word": "financially", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that relates to money or how money is managed", "level": "B2", "dict_examp": "He's still financially dependent on  his parents.", "lear_examp": "They advise them or help them financially."}]}]}, {"word": "finally", "poses": [{"pos": "adverb", "senses": [{"sense": "after a long time or some difficulty", "level": "A2", "dict_examp": "We finally got home at midnight.", "lear_examp": "Well, I have finally decided that I will paint my room blue."}, {"sense": "used especially at the beginning of a sentence to introduce the last point or idea", "level": "B1", "dict_examp": "Finally, I'd like to thank everyone for coming this evening.", "lear_examp": "Finally, I want you to say hi to everybody and I am looking forward to seeing you."}]}]}, {"word": "finance", "poses": [{"pos": "noun", "senses": [{"sense": "the control of how large amounts of money should be spent", "level": "B2", "dict_examp": "You need to speak to someone in the finance department.", "lear_examp": "Therefore we decided to invite a minister of finance to explain it."}, {"sense": "the money which a person, company or country has", "level": "B2", "dict_examp": "We keep a tight control on the organization's finances.", "lear_examp": "First of all, we should budget our finances better."}]}, {"pos": "verb", "senses": [{"sense": "to provide the money needed for something to happen", "level": "B2", "dict_examp": "The developer is still looking for a way to finance the new stadium.", "lear_examp": "I am applying for this job because I want to earn some money to finance my study."}]}]}, {"word": "finger", "poses": [{"pos": "noun", "senses": [{"sense": "one of the long, thin parts of the hand that hold things, including the thumb", "level": "A2", "dict_examp": "He noticed her long delicate fingers.", "lear_examp": "Then my mother brought the cake and while she was lighting the candles she burned her finger."}, {"sense": "to hope that things will happen in the way that you want them to, and to put a finger over the one next to it as a sign of that hope", "level": "C2", "dict_examp": "Let's keep our fingers crossed that she gets the job.", "lear_examp": "Wish me luck, Winnie,\" she sighed \"keep your fingers crossed, please.\""}, {"sense": "to understand exactly why a situation is the way it is", "level": "C2", "dict_examp": "Something was wrong, but I couldn't put my finger on it.", "lear_examp": "Something sinister about the picture, he felt, but he couldn't put his finger on what made him think this."}, {"sense": "to be/stay familiar with the most recent changes or improvements", "level": "C2", "dict_examp": "The situation changes daily, so you've got to keep your finger on the pulse.", "lear_examp": "It wouldn't be clever to hire people who are completely ignorant about music and they must constantly keep their finger on the pulse of the music industry."}]}]}, {"word": "fire", "poses": [{"pos": "noun", "senses": [{"sense": "heat, light, and flames that are produced when something burns", "level": "A2", "dict_examp": "The library was badly damaged in the fire.", "lear_examp": "Yesterday I bought very cool clothes. ... I bought them because yesterday all my shoes and T-shirts were burned in a fire."}, {"sense": "to start burning", "level": "B1", "dict_examp": "The car crashed and caught fire.", "lear_examp": "One of the new machines that I had brought from Germany had caught fire."}, {"sense": "If something is on fire, it is burning when it should not be.", "level": "B1", "dict_examp": "If your home was on fire and you could save only one thing, what would it be?", "lear_examp": "A lot of buildings were on fire."}, {"sense": "a small controlled fire that is used for heating or cooking", "level": "B1", "dict_examp": "It's very cold in here - should I light a fire?", "lear_examp": "In the evenings we sat down on the grass round a fire and talked to each other."}, {"sense": "the shooting of guns and other weapons", "level": "C2", "dict_examp": "The soldiers opened fire.", "lear_examp": "Suddenly, one of the thieves opened fire."}, {"sense": "to be criticized", "level": "C2", "dict_examp": "The government has come under fire for closing the hospital.", "lear_examp": ""}, {"sense": "to make something start burning, usually to cause damage", "level": "C2", "dict_examp": "Enemy troops set fire to the village.", "lear_examp": "At this point nothing made sense anymore, so I just watched while Jake set the car on fire."}, {"sense": "to be involved in an activity that could be dangerous", "level": "C2", "dict_examp": "We're playing with fire if we continue with genetic modification of our food.", "lear_examp": "Stop playing with fire or World War 3 might come in the shape of a nuclear war."}]}, {"pos": "verb", "senses": [{"sense": "to cause a weapon to shoot bullets, arrows or missiles", "level": "B2", "dict_examp": "He fired his gun into the air.", "lear_examp": "Martins found Lime on an iron staircase and fired a last shot, killing Lime."}, {"sense": "to tell someone they must leave their job", "level": "B2", "dict_examp": "She was fired after she was caught stealing from her employer.", "lear_examp": "Last month I was fired from my job in a bank."}, {"sense": "to make someone very excited or interested in something", "level": "C2", "dict_examp": "His paintings really fired my imagination.", "lear_examp": "The newspaper article on education that I read really fired my imagination and urged me to think about the points raised."}]}]}, {"word": "find", "poses": [{"pos": "verb", "senses": [{"sense": "to discover something or someone that you have been searching for", "level": "A1", "dict_examp": "I couldn't find Andrew's telephone number.", "lear_examp": "I can't find my cd, can you bring some music please?"}, {"sense": "to discover something unexpectedly", "level": "A2", "dict_examp": "I found some money in my coat pocket.", "lear_examp": "Miss Murphy said that she had found my diary in a street near the airport."}, {"sense": "to become aware that something exists or has happened", "level": "B1", "dict_examp": "We came home to find (that) the cat had had kittens.", "lear_examp": "I found that the food inside there is very nice."}, {"sense": "to think or feel a particular way about someone or something", "level": "B1", "dict_examp": "Do you find Clive difficult to talk to?", "lear_examp": "I found it very amusing."}, {"sense": "to have or get enough money/time, etc. to do something", "level": "B1", "dict_examp": "Where do you find the money to do all these things?", "lear_examp": "You can even go somewhere with your friends and have fun with them: if you do both things everyone will be happy, you have three months: you can find the time to do everything."}, {"sense": "to become aware that you have gone somewhere or done something without intending to", "level": "B2", "dict_examp": "I suddenly found myself making lunch.", "lear_examp": "The most embarrassing moment of my life was when, during a school trip to Paris, a friend of mine and I went to the wrong room and found ourselves in front of our teacher who, having had a shower, was looking for his glasses."}, {"sense": "to exist or be present somewhere", "level": "B2", "dict_examp": "Many plant and animal species are found only in the rainforests.", "lear_examp": "An example might be the koala bear, which could be found almost everywhere in Australia not so long ago."}, {"sense": "to judge that someone is guilty or not guilty in a law court", "level": "B2", "dict_examp": "She was found guilty of murder.", "lear_examp": "To the surprise of everyone in the village, the judge found her guilty but didn't send her to jail because he thought she should take care of Linda, who had no other relatives."}, {"sense": "to criticize someone or something, especially without good reasons", "level": "C2", "dict_examp": "She was always finding fault with our work.", "lear_examp": "Sometimes I take offence at their trying to find fault with me and I am not allowed to answer back."}, {"sense": "to get information about something, or to learn a fact for the first time", "level": "A2", "dict_examp": "How did you find out about the party?", "lear_examp": "I was at home when I found out that I had lost my cell-phone."}]}]}, {"word": "finely", "poses": [{"pos": "adverb", "senses": [{"sense": "into small pieces", "level": "B2", "dict_examp": "Finely chop the onion.", "lear_examp": ""}]}]}, {"word": "finish", "poses": [{"pos": "verb", "senses": [{"sense": "to complete something, or come to the end of an activity", "level": "A1", "dict_examp": "I'll call you when I've finished my homework.", "lear_examp": "I have finished my course."}, {"sense": "to end", "level": "A1", "dict_examp": "The meeting should finish around four o'clock.", "lear_examp": "I will finish work at five o'clock."}, {"sense": "to eat, drink or use something completely so that none remains", "level": "B1", "dict_examp": "He finished his coffee and left.", "lear_examp": ""}, {"sense": "to complete the last part of something that you are doing", "level": "B2", "dict_examp": "I want to finish off this essay before I go to bed.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the end of a race, or the last part of something", "level": "B1", "dict_examp": "a close finish", "lear_examp": "We had a race and I came second at the finish."}]}]}, {"word": "finite", "poses": [{"pos": "adjective", "senses": [{"sense": "having a limit or end", "level": "C2", "dict_examp": "We only have a finite amount of time to complete this task.", "lear_examp": "Last but not least, the problem of pollution.  It is recognized as an increased hazard in modern society and if we take into account that the air we breathe is finite, we should do our best to restrict the main culprits such as cars, factories, insecticides and so on."}]}]}, {"word": "financial", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to money or how money is managed", "level": "B1", "dict_examp": "They're having a few financial difficulties at the moment.", "lear_examp": "The person described himself as a financial officer of a South African government and needs a contact person in Switzerland to transfer 200 m dollars."}]}]}, {"word": "first language", "poses": [{"pos": "noun", "senses": [{"sense": "the language that someone learns to speak first", "level": "B2", "dict_examp": "Madeleine's first language is French, but she also speaks English fluently.", "lear_examp": "Originally I come from Germany and therefore my first language is German."}]}]}, {"word": "the first person", "poses": [{"pos": "noun", "senses": [{"sense": "the form of a verb or pronoun that is used when people are speaking or writing about themselves. For example, \"I\" and \"we\" are first person pronouns.", "level": "B2", "dict_examp": "Autobiographies are written in the first person.", "lear_examp": ""}]}]}, {"word": "first name", "poses": [{"pos": "noun", "senses": [{"sense": "the personal name that was given to you when you were born and that is not your family's name", "level": "A2", "dict_examp": "It can be rude to call someone by their first name if they are much older or more important than you.", "lear_examp": "After that he asked the students to introduce themselves, and he easily learned the first names of the students and addressed them by their first name except me and it really annoyed me."}]}]}, {"word": "fisherman", "poses": [{"pos": "noun", "senses": [{"sense": "someone who catches fish as a job or as a hobby", "level": "B2", "dict_examp": "Local fishermen are finding it difficult to make a living.", "lear_examp": "His father was a fisherman and he died working just a few days before he was born, so the child had never met him."}]}]}, {"word": "firm", "poses": [{"pos": "adjective", "senses": [{"sense": "not soft, but not completely hard", "level": "B2", "dict_examp": "A firm mattress is better for your back.", "lear_examp": ""}, {"sense": "certain or fixed and not likely to change", "level": "B2", "dict_examp": "We don't have any firm plans for the weekend yet.", "lear_examp": "It is my firm belief that I would use all the experience I have."}, {"sense": "strict and making certain that people do what you want", "level": "C2", "dict_examp": "You've got to be firm with children.", "lear_examp": "Being an officer, my father was rather firm with my sister and me."}, {"sense": "strong and tight", "level": "C2", "dict_examp": "a firm handshake/grip", "lear_examp": "The teacher, Miss Parchman, keeping a firm grip on his hand, took Peter outside of the classroom in order to get him calm."}]}, {"pos": "noun", "senses": [{"sense": "a company or business", "level": "B2", "dict_examp": "He works for a law firm called Neil and Vigliano.", "lear_examp": "The only thing I could remember was that the meeting was set up at 9 a.m. and that a law firm in Zurich was looking for a secretary."}]}]}, {"word": "firework", "poses": [{"pos": "noun", "senses": [{"sense": "a small object that explodes to produce a loud noise and bright colors, often used to celebrate special events", "level": "B1", "dict_examp": "a fireworks display", "lear_examp": "We have spent three days at Disneyland, watching fireworks every night."}]}]}, {"word": "firstly", "poses": [{"pos": "adverb", "senses": [{"sense": "used to refer to the first thing in a list", "level": "B2", "dict_examp": "There are two very good reasons why we can't do it. Firstly, we don't have enough money, and secondly, we don't have enough time.", "lear_examp": "I think it would suit us, firstly because it is good work experience, and secondly because we can get discounts on books and CDs."}]}]}, {"word": "fishing", "poses": [{"pos": "noun", "senses": [{"sense": "the sport or job of catching fish", "level": "A2", "dict_examp": "My dad loves to go fishing.", "lear_examp": "We can go fishing or hunting."}]}]}, {"word": "fire department", "poses": [{"pos": "noun", "senses": [{"sense": "an organization that is in charge of preventing and stopping unwanted fires", "level": "B2", "dict_examp": "Someone called the fire department, and the blaze was quickly put out.", "lear_examp": "The first thing I've done was call the fire department but they told me the it would take some time because they had another building on fire in another part of town."}]}]}, {"word": "fire station", "poses": [{"pos": "noun", "senses": [{"sense": "the building where fire engines are kept and firefighters wait for emergencies", "level": "B1", "dict_examp": "We visited our local fire station.", "lear_examp": "I only saw Mr. Bean from my classroom window - they were filming him running to the fire station."}]}]}, {"word": "fire", "poses": [{"pos": "noun", "senses": [{"sense": "heat, light, and flames that are produced when something burns", "level": "A2", "dict_examp": "The library was badly damaged in the fire.", "lear_examp": "Yesterday I bought very cool clothes. ... I bought them because yesterday all my shoes and T-shirts were burned in a fire."}, {"sense": "to start burning", "level": "B1", "dict_examp": "The car crashed and caught fire.", "lear_examp": "One of the new machines that I had brought from Germany had caught fire."}, {"sense": "If something is on fire, it is burning when it should not be.", "level": "B1", "dict_examp": "If your home was on fire and you could save only one thing, what would it be?", "lear_examp": "A lot of buildings were on fire."}, {"sense": "a small controlled fire that is used for heating or cooking", "level": "B1", "dict_examp": "It's very cold in here - should I light a fire?", "lear_examp": "In the evenings we sat down on the grass round a fire and talked to each other."}, {"sense": "the shooting of guns and other weapons", "level": "C2", "dict_examp": "The soldiers opened fire.", "lear_examp": "Suddenly, one of the thieves opened fire."}, {"sense": "to be criticized", "level": "C2", "dict_examp": "The government has come under fire for closing the hospital.", "lear_examp": ""}, {"sense": "to make something start burning, usually to cause damage", "level": "C2", "dict_examp": "Enemy troops set fire to the village.", "lear_examp": "At this point nothing made sense anymore, so I just watched while Jake set the car on fire."}, {"sense": "to be involved in an activity that could be dangerous", "level": "C2", "dict_examp": "We're playing with fire if we continue with genetic modification of our food.", "lear_examp": "Stop playing with fire or World War 3 might come in the shape of a nuclear war."}]}, {"pos": "verb", "senses": [{"sense": "to cause a weapon to shoot bullets, arrows or missiles", "level": "B2", "dict_examp": "He fired his gun into the air.", "lear_examp": "Martins found Lime on an iron staircase and fired a last shot, killing Lime."}, {"sense": "to tell someone they must leave their job", "level": "B2", "dict_examp": "She was fired after she was caught stealing from her employer.", "lear_examp": "Last month I was fired from my job in a bank."}, {"sense": "to make someone very excited or interested in something", "level": "C2", "dict_examp": "His paintings really fired my imagination.", "lear_examp": "The newspaper article on education that I read really fired my imagination and urged me to think about the points raised."}]}]}, {"word": "firmly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is certain or fixed", "level": "B2", "dict_examp": "I firmly believe that we must take action on this.", "lear_examp": "I firmly believe that some of the things you mentioned are wrong."}, {"sense": "strongly; in a way that will not become loose", "level": "B2", "dict_examp": "Make sure the rope is firmly attached before attempting to climb down it.", "lear_examp": "Slowly but firmly I grabbed the door handle, took another quick glance in the room, and turned it."}]}]}, {"word": "fit", "poses": [{"pos": "verb", "senses": [{"sense": "to be the right size or shape for someone or something", "level": "B1", "dict_examp": "That jacket fits you perfectly.", "lear_examp": "I never go shopping for clothes, I only go shopping like once a year to buy shoes when the ones I have don't fit me."}, {"sense": "If people or things fit somewhere, or if you can fit them somewhere, that place is big enough for them.", "level": "B1", "dict_examp": "How many people can you fit in your car?", "lear_examp": "The desk has to be very small and has to fit into the corner, because there is not much space left in my bedroom."}, {"sense": "to be the same as or like something", "level": "C1", "dict_examp": "She seems to fit the description.", "lear_examp": "The accommodations I had during the trip didn't fit the description in the advertisement and neither did the restaurants or the cultural activities."}, {"sense": "to be suitable for something", "level": "C1", "dict_examp": "The job fits him well.", "lear_examp": "You ought to put on a formal dress or suit to fit the atmosphere."}, {"sense": "to feel that you belong to a particular group and are accepted by them", "level": "B2", "dict_examp": "He doesn't fit in with the other  pupils in his class.", "lear_examp": "I do not think it is a good idea to advertise the club in a big way, it would not be very serious of us.  We could tell only the people that we think could fit in."}, {"sense": "If one thing fits in with another thing, it belongs with them or they are suitable for each other.", "level": "B2", "dict_examp": "It's a very nice sofa but it doesn't fit in with the rest of                             the furniture.", "lear_examp": "Nevertheless, there was something that wouldn't fit in with what Rollo would hear from Harry's friends."}, {"sense": "If  something fits in with a situation, idea, method, etc., it is suitable and works successfully as part of it.", "level": "C1", "dict_examp": "Changing location fits in with their plans to expand the business.", "lear_examp": "In conclusion, I think your wedding day should be about you and your partner and the wedding celebrations should fit in with your combined ideas and cultures and wants to make it a memorable occasion for you and not to satisfy other people."}]}, {"pos": "adjective", "senses": [{"sense": "healthy and strong, especially as a result of exercise", "level": "A2", "dict_examp": "I joined a gym to get fit.", "lear_examp": "Many of people in my country try to be fit and every day for breakfast eat yogurt with flakes and fruits."}, {"sense": "of a good enough quality or suitable type for a particular purpose", "level": "C1", "dict_examp": "He isn't fit to be treasurer.", "lear_examp": "It has undergone restoration recently and is now fit to serve as a perfect example of a model and modern British college library."}, {"sense": "believe to be what is good, correct, or necessary", "level": "C2", "dict_examp": "You can leave it here or take it home with you, whichever you see fit.", "lear_examp": "I am, therefore, expressing my willingness, through this letter, to participate in this endeavor in whatever way you may see fit."}]}]}, {"word": "first-floor", "poses": [{"pos": "adjective", "senses": [{"sense": "on the first floor", "level": "B1", "dict_examp": "a first-floor apartment/office/classroom", "lear_examp": ""}]}]}, {"word": "fireplace", "poses": [{"pos": "noun", "senses": [{"sense": "a space in the wall of a room where you can have a fire, or the structure around this space", "level": "C2", "dict_examp": "There was a large fireplace in the living room.", "lear_examp": "They were sitting in front of the fireplace, in a tiny cottage."}]}]}, {"word": "firefighter", "poses": [{"pos": "noun", "senses": [{"sense": "a person whose job is to stop fires from burning", "level": "B1", "dict_examp": "My cousin Mark is a firefighter.", "lear_examp": "We could see firefighters and ambulances coming from all over the premises!"}]}]}, {"word": "fish", "poses": [{"pos": "noun", "senses": [{"sense": "an animal that lives only in water and swims using its tail and fins", "level": "A1", "dict_examp": "Several large fish live in the pond.", "lear_examp": "We are going to go to an even larger (no, the largest) river to catch fish next week!!"}, {"sense": "fish eaten as food", "level": "A1", "dict_examp": "fried fish", "lear_examp": "Usually in Spain every day the people eat potatoes and salads with fish or meat."}]}, {"pos": "verb", "senses": [{"sense": "to try to catch fish", "level": "B1", "dict_examp": "They're fishing for tuna.", "lear_examp": "In the countryside the air is pure and you can fish in lakes or walk in fields."}]}]}, {"word": "fist", "poses": [{"pos": "noun", "senses": [{"sense": "a hand closed into a ball with the fingers and thumb curled tightly together", "level": "C2", "dict_examp": "He banged his fist down angrily on the table.", "lear_examp": "He slammed his fists against the door and yelled out several times but to no response."}]}]}, {"word": "fitness", "poses": [{"pos": "noun", "senses": [{"sense": "the condition of being physically strong and healthy", "level": "B1", "dict_examp": "I'm trying to improve my physical fitness by riding my bike to work.", "lear_examp": "I specially like fitness lessons."}]}]}, {"word": "first", "poses": [{"pos": "adjective", "senses": [{"sense": "coming before all others", "level": "A1", "dict_examp": "This is my first trip to New York.", "lear_examp": "Near the city there is the first championship golf course in Slovakia."}, {"sense": "most important, top", "level": "A2", "dict_examp": "Sheila won first prize in the photo competition.", "lear_examp": "It was good because my cousin played and won the first prize."}, {"sense": "at the start of a situation", "level": "B2", "dict_examp": "Why did you invite her in the first place?", "lear_examp": "In the first place, you were unknown people for me, but now you are my special foreign friends."}]}, {"pos": "adverb", "senses": [{"sense": "before everything or everyone else", "level": "A1", "dict_examp": "I can come out tonight, but I've got to do my homework first.", "lear_examp": "I have to go to the dentist first!"}, {"sense": "before anything else", "level": "A2", "dict_examp": "First of all, I’d like to ask you a few questions.", "lear_examp": "Dear Pat: first of all, thanks for your invitation."}, {"sense": "for the first time", "level": "B1", "dict_examp": "When did you first meet each other?", "lear_examp": "I first heard of it on the radio and then I saw a leaflet about it."}, {"sense": "used to introduce the first idea, reason, etc., in a series", "level": "B1", "dict_examp": "First, I want to thank my parents.", "lear_examp": "First we all met in \"Linda's cafe\" and brought our bikes with us, then we started our trip to Texas."}, {"sense": "at the beginning of a situation or period of time", "level": "B1", "dict_examp": "At first I thought she was unfriendly, but actually she's just shy.", "lear_examp": "At first, when I arrived I was very nervous because I didn't know anyone, but then a girl started talking to me and I felt better."}, {"sense": "more than anything else", "level": "C1", "dict_examp": "In spite of being elected to office, she remains first and foremost a writer.", "lear_examp": "First and foremost it is my longing to help others with what they cannot do for themselves."}, {"sense": "when you first see or hear about something or someone", "level": "C1", "dict_examp": "It may, at first sight, seem a surprising choice.", "lear_examp": "I must admit that, at first sight, I did not feel like reading it, but later I made up my mind and decided to accept your invitation."}, {"sense": "to be the most important person or thing", "level": "C1", "dict_examp": "Her career always comes first.", "lear_examp": "They do not take the time to sit down and enjoy being with their family. The work comes first, and the family next."}, {"sense": "to consider someone or something to be the most important thing", "level": "C2", "dict_examp": "Most couples put their children first.", "lear_examp": "On the other hand, we forget about our personality and the worth that we have as individuals; we put our wishes first, rather than what we really need in life."}]}, {"pos": "noun", "senses": [{"sense": "the first person or thing to do or be something, or the first person or thing mentioned", "level": "B1", "dict_examp": "Tonight sees the first of three documentaries about cancer.", "lear_examp": "I prefer the first because it's an exciting story of a cat that escapes from a dangerous house lived in by an aggressive dog."}, {"sense": "to be something that has never happened before", "level": "C2", "dict_examp": "Winning the state championship was a first for out school.", "lear_examp": ""}]}]}, {"word": "the first floor", "poses": [{"pos": "noun", "senses": [{"sense": "the floor of a building that is at the same level as the ground outside", "level": "B1", "dict_examp": "She works on the first floor.", "lear_examp": "My bedroom is on the first floor."}]}]}, {"word": "flavor", "poses": [{"pos": "noun", "senses": [{"sense": "the way a food or drink tastes, or a particular taste itself", "level": "B1", "dict_examp": "Add a little salt to bring out the flavor of the herbs.", "lear_examp": "You should try to offer a wider variety of flavors, instead of just coffee, chocolate and vanilla."}, {"sense": "a particular quality or style that something has", "level": "C2", "dict_examp": "London has a very international flavor.", "lear_examp": ""}]}]}, {"word": "flawless", "poses": [{"pos": "adjective", "senses": [{"sense": "with no mistakes or bad characteristics", "level": "C2", "dict_examp": "a flawless complexion", "lear_examp": "All in all, it is a classic comedy with memorable dialogue and flawless performances."}]}]}, {"word": "flat", "poses": [{"pos": "adjective", "senses": [{"sense": "level and smooth, with no high, raised, or round parts", "level": "B1", "dict_examp": "An ice rink needs to be completely flat.", "lear_examp": "The countryside is very flat and for this kind of holiday it's really perfect!!"}, {"sense": "Flat shoes do not raise your feet far from the ground.", "level": "B1", "dict_examp": "Wear flat shoes - you'll be on your feet all day.", "lear_examp": "In your last letter you wanted me to tell you about clothes. Well, as you know I'm tall so I always wear flat shoes in light colors like white, light green and blue."}, {"sense": "If a tire is flat, it does not contain enough air.", "level": "B2", "dict_examp": "When I got to the car, I discovered I had a flat tire.", "lear_examp": "In the evening I got a flat tire, and because of this I got late to the show, when I got to my place, it was used (it cost a lot) and they took me to the cheapest seats, where I couldn't see a thing."}, {"sense": "If a drink is flat, it does not contain enough bubbles of gas.", "level": "C2", "dict_examp": "If you don’t put the top back on the soda bottle, it will go flat.", "lear_examp": ""}]}, {"pos": "adverb", "senses": [{"sense": "in a level position, often against another surface", "level": "B2", "dict_examp": "Lay the cloth flat across the table.", "lear_examp": ""}, {"sense": "to fall over so that your face hits the ground, often in an embarrassing way", "level": "B2", "dict_examp": "I stepped on the ice and fell flat on my face.", "lear_examp": "You can guess what happened next - I fell flat on my face right in the mud and I have never felt more embarrassed in my life!"}, {"sense": "If an event or joke falls flat, it fails to have the effect that you wanted, such as making people laugh.", "level": "C1", "dict_examp": "All the jokes in his speech fell flat.", "lear_examp": "The cultural visits fell flat in comparison to their expectations, although the sightseeing tour of Willstown was, as the students said, \"fascinating.\""}]}]}, {"word": "five", "poses": [{"pos": "number", "senses": [{"sense": "the number 5", "level": "A1", "dict_examp": "Five, four, three, two, one, blast-off!", "lear_examp": "I will finish work at five o'clock."}]}]}, {"word": "flawed", "poses": [{"pos": "adjective", "senses": [{"sense": "not perfect, or containing mistakes", "level": "C2", "dict_examp": "Diamonds are still valuable, even when they are flawed.", "lear_examp": "Some people see society as it stands today as inherently flawed, an amorphous group of people who follow and worship anyone that gives them pleasure and empty dreams of perfection."}]}]}, {"word": "fleet", "poses": [{"pos": "noun", "senses": [{"sense": "a group of ships, or all of the ships in a country's navy", "level": "C1", "dict_examp": "The entire naval fleet was used for the operation.", "lear_examp": "The Spartans order the people of Athens to destroy their city walls and most of their remaining fleet."}, {"sense": "a group of vehicles that are owned and controlled by one person or organization", "level": "C1", "dict_examp": "a fleet of aircraft/cars", "lear_examp": "In a simplified scenario one can consider when one has a fleet of cars, some manual and other automatic, and a pool of drivers who can only drive one type of car."}]}]}, {"word": "float", "poses": [{"pos": "verb", "senses": [{"sense": "to stay on the surface of a liquid and not sink, or to make something do this", "level": "B1", "dict_examp": "Leaves were floating on the surface.", "lear_examp": "Finally we were floating on the sea, admiring the famous bay."}, {"sense": "to stay in the air, or move gently through the air", "level": "B1", "dict_examp": "Fluffy white clouds were floating across the sky.", "lear_examp": "Suddenly, I saw a \"thing\" floating by the window, making noises and  like nothing human."}]}]}, {"word": "flee", "poses": [{"pos": "verb", "senses": [{"sense": "to leave a place quickly because you are in danger or are afraid", "level": "C1", "dict_examp": "Police think the suspect has now fled the country.", "lear_examp": "Of course most people on those boats were fleeing their country for religious or political reasons but I would have left Europe for the spirit of adventure."}]}]}, {"word": "flashback", "poses": [{"pos": "noun", "senses": [{"sense": "when you suddenly remember something that happened in the past, often something bad", "level": "C2", "dict_examp": "She suffered from flashbacks for years after the accident.", "lear_examp": "Margaret started to remember, yes; a sudden flashback brought her to the twenties, when she was still her mamma's little girl, all innocence and curls."}, {"sense": "part of a film or book that goes back in time to something that happened before the main story began", "level": "C2", "dict_examp": "There are several flashbacks to the character's childhood.", "lear_examp": "Another way of increasing the reader's interest is the parallelism of both stories and the flashbacks she is always giving us to explain Olivia's experiences."}]}]}, {"word": "flexible", "poses": [{"pos": "adjective", "senses": [{"sense": "able to change or be changed easily according to the situation", "level": "B2", "dict_examp": "My schedule is quite flexible - I could arrange to meet with you any day next week.", "lear_examp": "In the advertisement it is said that you will have a lot of spare time but actually, you have flexible working hours and you never know whether you will have free time."}, {"sense": "able to bend or to be bent easily", "level": "C2", "dict_examp": "The cover is made of flexible plastic.", "lear_examp": "Another physical requirement is a flexible body. Flexibility and agility will be crucial factors in whether you will succeed or not."}]}]}, {"word": "flash", "poses": [{"pos": "verb", "senses": [{"sense": "to shine brightly and suddenly, or to make something shine in this way", "level": "B2", "dict_examp": "Stop flashing that light in my eyes!", "lear_examp": "As they were driving back, a light flashed, a crash sounded, then screams."}, {"sense": "to appear for a short time, or to make something appear for a short time", "level": "C2", "dict_examp": "An error message flashed on the screen.", "lear_examp": ""}, {"sense": "to move or happen quickly", "level": "C2", "dict_examp": "A fire engine flashed by.", "lear_examp": "But one day an idea flashed through her mind."}]}, {"pos": "noun", "senses": [{"sense": "a sudden bright light", "level": "B2", "dict_examp": "The bomb exploded in a flash of yellow light.", "lear_examp": "At the same moment, that piece of unknown stuff sent towards me a flash of very bright light!"}, {"sense": "a piece of camera equipment that produces a bright light when you take a photograph in a dark place", "level": "B2", "dict_examp": "Flash photography is not permitted anywhere in the museum.", "lear_examp": ""}, {"sense": "immediately, or very quickly", "level": "C2", "dict_examp": "I'll be back in a flash.", "lear_examp": "He took it and, in a flash, he came up to the surface."}]}]}, {"word": "flame", "poses": [{"pos": "noun", "senses": [{"sense": "hot, bright, burning gas produced by something on fire", "level": "B2", "dict_examp": "The flames grew larger as the fire spread.", "lear_examp": "We were standing by the window and the flames were getting nearer and nearer."}, {"sense": "to suddenly start burning", "level": "C2", "dict_examp": "The car plunged down a hill and burst into flames.", "lear_examp": "When we turned it on, it burst into flames and before we could extinguish it, the fire destroyed my desk."}]}]}, {"word": "flick", "poses": [{"pos": "verb", "senses": [{"sense": "to look quickly at the pages of a magazine, book, etc.", "level": "C2", "dict_examp": "I was just flicking through a magazine.", "lear_examp": "Last week I happened to flick through a classical music magazine and was lucky enough to see an ad saying that the artist, or the pianist-conductor, would be performing all Beethoven's symphonies and piano concertos with the orchestra from next January."}]}]}, {"word": "flaw", "poses": [{"pos": "noun", "senses": [{"sense": "a mistake or bad characteristic that stops someone or something from being perfect", "level": "C1", "dict_examp": "There's a flaw in your reasoning.", "lear_examp": "However, there were some minor flaws which I would like to give my view on."}]}]}, {"word": "flag", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of cloth with a special design and colors, that  is the symbol of a country or a group, or has a particular meaning", "level": "B1", "dict_examp": "the Brazilian flag", "lear_examp": "And about my present from the USA: I really would like to have an authentic American flag, to decorate my bedroom ceiling."}]}]}, {"word": "flight", "poses": [{"pos": "noun", "senses": [{"sense": "a journey through air or space  in an aircraft or other vehicle", "level": "A2", "dict_examp": "I'll never forget my first flight.", "lear_examp": "I would like to rest because the flight will be very boring."}, {"sense": "a set of stairs connecting one floor to another in a building", "level": "C2", "dict_examp": "The elevator was broken so we had to climb six flights of stairs.", "lear_examp": "He descended a long flight of stairs and reached a door."}]}]}, {"word": "flatten", "poses": [{"pos": "verb", "senses": [{"sense": "to become flat or to make something become flat", "level": "C2", "dict_examp": "Roll out the dough into balls and flatten them slightly.", "lear_examp": "Another thing they accomplished was to stop people cutting down trees because they wanted to flatten the land."}]}]}, {"word": "flesh", "poses": [{"pos": "noun", "senses": [{"sense": "the soft part of a person's or animal's body between the skin and bones", "level": "C2", "dict_examp": "Large thorns dug into my flesh.", "lear_examp": "It smelled of rotting flesh."}, {"sense": "a member of your family", "level": "C2", "dict_examp": "I can't hate him - he's my own flesh and blood.", "lear_examp": "On the other hand, another problem old people have to face is a feeling of not being useful to society and what proves this is that they are put into old people's homes even by their own flesh and blood."}]}]}, {"word": "fix", "poses": [{"pos": "verb", "senses": [{"sense": "to repair something", "level": "B1", "dict_examp": "They couldn't fix my old computer, so I bought a new one.", "lear_examp": "One day while he was working in his office, he received a call from a client that told him to fix some computers in Spain, Rafael accepted."}, {"sense": "to arrange or put in place", "level": "B1", "dict_examp": "I need to fix my hair.", "lear_examp": "Secondly the women witch is going to get maried wears a very big whit dress and her best friend help her to fix her hair"}, {"sense": "to prepare a drink or meal", "level": "B2", "dict_examp": "I'll fix you a sandwich.", "lear_examp": "Woken up early by the birds and sunshine we headed downstairs to unpack and fix breakfast."}, {"sense": "to decide a certain and exact date, time, or place", "level": "B2", "dict_examp": "Should we fix a time for our next meeting?", "lear_examp": "If you are busy at that time, you can call them to fix a new date."}, {"sense": "to fasten something in position so that it cannot move", "level": "B2", "dict_examp": "We fixed the bookcase to the wall.", "lear_examp": "First of all, I have no problem parking my vehicle, as it can be fixed to any tree or gate."}, {"sense": "in a difficult situation that causes you trouble or problems", "level": "C2", "dict_examp": "He’s in a fix and needs our help.", "lear_examp": "She felt happy when I was down in the dumps or in a fix and kept on being jealous of me concerning trivial matters."}, {"sense": "to repair of change something so it can be used or looks better", "level": "B1", "dict_examp": "She's almost finished fixing up her new apartment.", "lear_examp": "But you can solve this problem in an easy way by just learning to fix up your bicycle, or taking it to the nearest repairing center."}]}]}, {"word": "fixed", "poses": [{"pos": "adjective", "senses": [{"sense": "arranged or decided already and not able to be changed", "level": "B2", "dict_examp": "a fixed price", "lear_examp": "Usually you have a fixed time to listen to live music, but what if you are not able to go to the concert?"}, {"sense": "If your eyes are fixed on something, you are looking at it continuously.", "level": "C2", "dict_examp": "a fixed stare", "lear_examp": "My eyes were fixed on those words which seemed to be dancing before me almost as if laughing at me."}]}]}, {"word": "flair", "poses": [{"pos": "noun", "senses": [{"sense": "a natural ability to do something well", "level": "C1", "dict_examp": "She has a flair for languages.", "lear_examp": "She's an artist with a flair for promotion."}, {"sense": "when you do something in an exciting and interesting way", "level": "C2", "dict_examp": "He played with great imagination and flair.", "lear_examp": "If I must describe the service I should say that it is superb: the gentle waiters serve with flair as if it was a culinary cabaret."}]}]}, {"word": "flashlight", "poses": [{"pos": "noun", "senses": [{"sense": "a small electric light that you hold in your hand", "level": "B2", "dict_examp": "He lit the way with his flashlight.", "lear_examp": "I was going to get a flashlight in my room when I heard a strange noise."}]}]}, {"word": "flexibility", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to change or be changed easily according to the situation", "level": "B2", "dict_examp": "The advantage of this system is its flexibility.", "lear_examp": "Further personal strengths are good communication skills, being a good team player and flexibility."}]}]}, {"word": "fog", "poses": [{"pos": "noun", "senses": [{"sense": "thick cloud just above the ground or water that makes it difficult to see", "level": "A2", "dict_examp": "Thick/Heavy fog has made driving conditions dangerous.", "lear_examp": "Imagine, in the morning there was fog, and it was a cold day."}]}]}, {"word": "folks", "poses": [{"pos": "noun", "senses": [{"sense": "your parents", "level": "B2", "dict_examp": "I'm going home to see my folks next weekend.", "lear_examp": "Please say hello to your folks for me, and write me!"}, {"sense": "people, especially those of a particular group or type", "level": "B2", "dict_examp": "Some folks don't like SUVs.", "lear_examp": "Dear Cathy How are you? Everything all right? How are John and Richard?  I miss you folks!"}]}]}, {"word": "flourish", "poses": [{"pos": "verb", "senses": [{"sense": "to grow or develop well", "level": "C2", "dict_examp": "The company soon began to flourish under his expert management.", "lear_examp": "If parents try to understand why their children act the way they do and treat them with love and affection, then teenagers will flourish like flowers in the spring sunshine!"}]}]}, {"word": "flour", "poses": [{"pos": "noun", "senses": [{"sense": "powder made from grain, especially wheat, used for making bread, cakes, pasta, pastry, etc.", "level": "B1", "dict_examp": "Add the flour to the eggs and milk.", "lear_examp": "He told the family that it was arsenic in the flour."}]}]}, {"word": "floor", "poses": [{"pos": "noun", "senses": [{"sense": "a surface that you walk on inside a building", "level": "A1", "dict_examp": "a wood/tile floor", "lear_examp": "Lily gave me a small toy cat. It can walk on the floor."}, {"sense": "a particular level of a building", "level": "A2", "dict_examp": "This building has five floors.", "lear_examp": "The new art class is on Tuesday on the first floor with Mrs. Keller."}, {"sense": "an area where a particular activity happens", "level": "B1", "dict_examp": "a dance floor", "lear_examp": "It has got a very big dance floor with a skillful jazz band."}]}]}, {"word": "foggy", "poses": [{"pos": "adjective", "senses": [{"sense": "with fog", "level": "A2", "dict_examp": "a foggy day", "lear_examp": "It was a foggy afternoon and I was at home."}]}]}, {"word": "focus", "poses": [{"pos": "noun", "senses": [{"sense": "the person or thing that is getting most attention in a situation or activity", "level": "C1", "dict_examp": "He is the focus of an investigation.", "lear_examp": "The metro (subway) moves over four million people daily so you can imagine the proportion of such a big event in a valley with an approximate population of 20 million, but the focus of local news has been how effectively people have reacted to the problem."}, {"sense": "special attention you give to something", "level": "C2", "dict_examp": "State officials urge continued focus on mosquito control.", "lear_examp": "The focus on their careers makes them forget about their co-workers, which creates a harsh and cold work environment."}]}, {"pos": "verb", "senses": [{"sense": "to give a lot of attention to one particular person, subject or thing", "level": "B2", "dict_examp": "Tonight's program focuses on the way that homelessness affects the young.", "lear_examp": "As you have probably guessed already, we are mainly interested in action movies and movies that focus on brutality and aggression."}]}]}, {"word": "folder", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of plastic or thick paper folded down the middle and used to hold loose papers", "level": "A2", "dict_examp": "I keep all my bank statements in this folder.", "lear_examp": "I think I forgot my folder in your house."}, {"sense": "a place on a computer where particular files are kept", "level": "B1", "dict_examp": "I made a new folder on the C drive.", "lear_examp": "Computers are very important because we work with them, and we keep our secret folders and files in them."}]}]}, {"word": "fold", "poses": [{"pos": "verb", "senses": [{"sense": "If you fold paper, cloth, etc., you bend it so that one part of it lies flat on top of another part.", "level": "B1", "dict_examp": "I folded the letter in half and put it in an envelope.", "lear_examp": "And the next morning, I was here again to help them folding their stuff."}]}]}, {"word": "flute", "poses": [{"pos": "noun", "senses": [{"sense": "a musical instrument in the shape of a tube that is held out to the side and played by blowing across a hole at one end", "level": "B1", "dict_examp": "Ellen started learning the flute at the age of 12.", "lear_examp": "Now I know the history of the violin, flute, cello, viola, oboe, etc."}]}]}, {"word": "fluently", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is fluent", "level": "B2", "dict_examp": "I'd like to speak English fluently.", "lear_examp": "I can speak both English and Japanese fluently."}]}]}, {"word": "folk", "poses": [{"pos": "noun", "senses": [{"sense": "music written and played in a traditional style", "level": "B1", "dict_examp": "There are several venues for folk and jazz in the city.", "lear_examp": "I can sing most kinds of songs, such as pop music, folk."}]}, {"pos": "adjective", "senses": [{"sense": "the traditional style of art, dancing, etc. among a particular group of people", "level": "B1", "dict_examp": "She's studied the folk art of the region.", "lear_examp": "There  are a lot of folk stories in Lithuania, and I would like to tell you one of them."}]}]}, {"word": "flow", "poses": [{"pos": "verb", "senses": [{"sense": "If something such as a liquid flows, it moves somewhere in a smooth, continuous way.", "level": "B2", "dict_examp": "The  river flows from the Andes into the Pacific Ocean.", "lear_examp": "Stockholm is the capital of Sweden and it is situated at the point where Norrstrom the outlet of Milowne flows out into the Baltic."}]}, {"pos": "noun", "senses": [{"sense": "when something flows in one direction", "level": "B2", "dict_examp": "the flow of a river", "lear_examp": "So, a possible solution is to build more roads and optimally design the roads and their subways, to make the flow of cars on the road quicker."}, {"sense": "to do or accept what other people are doing because it is the easiest thing to do", "level": "C2", "dict_examp": "Just relax and go with the flow!", "lear_examp": "At this stage of her progress towards knowing herself better she has accepted that life is a muddle and that to a certain extent one has to go with the flow."}]}]}, {"word": "fluctuate", "poses": [{"pos": "verb", "senses": [{"sense": "to keep changing, especially in level or amount", "level": "C2", "dict_examp": "Oil prices have fluctuated wildly in recent weeks.", "lear_examp": "During that period transportation by pipeline an road was slightly increasing while transportation by rail was fluctuating."}]}]}, {"word": "fluid", "poses": [{"pos": "noun", "senses": [{"sense": "a liquid", "level": "C2", "dict_examp": "Drink plenty of fluids.", "lear_examp": "Healthy eating habits consist of lots of fruit and vegetables, calcium-rich products such as milk or cheese and plenty of fluids."}]}, {"pos": "adjective", "senses": [{"sense": "smooth and continuous with a flowing or changing quality", "level": "C2", "dict_examp": "a dancer’s fluid movements", "lear_examp": "The third-person narration is fluid and delicate and enables us to gradually discover the characters' personalities and their reactions to the situations they are involved in."}]}]}, {"word": "floppy", "poses": [{"pos": "adjective", "senses": [{"sense": "soft and loose or hanging down loosely", "level": "C2", "dict_examp": "a floppy hat", "lear_examp": "That puppy was the cutest thing: a tiny body, with floppy ears, a curious wet nose that wanted to sniff everything on its way, and huge cheerful eyes."}]}]}, {"word": "fluent", "poses": [{"pos": "adjective", "senses": [{"sense": "able to use a language naturally without stopping or making mistakes", "level": "B2", "dict_examp": "She's fluent in French.", "lear_examp": "I am fluent in French and English."}, {"sense": "produced or done in a smooth, natural style", "level": "B2", "dict_examp": "He speaks fluent Chinese.", "lear_examp": "I speak fluent English and German."}]}]}, {"word": "fluency", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is fluent in a language", "level": "B2", "dict_examp": "One of the requirements of the job is fluency in two or more                         African languages.", "lear_examp": "So it is of the utmost importance for me to go to England in the very near future in order to improve my fluency in English."}]}]}, {"word": "flu", "poses": [{"pos": "noun", "senses": [{"sense": "an infectious illness which is like a very bad cold, but which causes a fever", "level": "B1", "dict_examp": "a flu virus", "lear_examp": "I hope you're fine and you don't have the flu any more."}]}]}, {"word": "flood", "poses": [{"pos": "verb", "senses": [{"sense": "If a place floods or is flooded, it becomes covered in water.", "level": "B1", "dict_examp": "The town was flooded when the river overflowed its banks.", "lear_examp": "The city was flooded and too many people were dead."}, {"sense": "to fill or enter a place in large numbers or amounts", "level": "B2", "dict_examp": "She drew back the curtains and the sunlight came flooding in.", "lear_examp": "The Square is flooded with local merchants selling local food,  folkloric clothing, and local wines."}, {"sense": "to receive so many messages, phone calls, etc., that you cannot deal with them", "level": "C2", "dict_examp": "We were flooded with calls from worried parents.", "lear_examp": "Soon he was being hired again and once word spread that the musician had returned, he was flooded with bookings."}]}, {"pos": "noun", "senses": [{"sense": "a large amount of water covering an area that is usually dry", "level": "B1", "dict_examp": "After the flood it took weeks for the water level to go down.", "lear_examp": "It was windy and raining with lots of floods."}, {"sense": "a large number or amount of things or people that arrive at the same time", "level": "C2", "dict_examp": "a flood of letters/calls", "lear_examp": "The sea of familiar faces brought a flood of memories rushing back."}]}]}, {"word": "follow", "poses": [{"pos": "verb", "senses": [{"sense": "to move behind someone or something and go where they go", "level": "A2", "dict_examp": "A dog followed us home.", "lear_examp": "I'll wait for you in the central square and you can follow me."}, {"sense": "to travel along a street, path, road, etc.", "level": "A2", "dict_examp": "Follow the main road down to the traffic light.", "lear_examp": "You can get to my house by following the road from the corner which is next to the playground."}, {"sense": "to happen or come after something", "level": "B1", "dict_examp": "There was a bang, followed by a cloud of smoke.", "lear_examp": "In the first lesson we started with some games, followed by work activities, like role plays and presentations."}, {"sense": "to do what someone or something says you should do", "level": "B1", "dict_examp": "Follow the instructions on the back of the package carefully.", "lear_examp": "I think I should follow her advice, shouldn't I?"}, {"sense": "to understand something", "level": "B1", "dict_examp": "Could you repeat that? I didn't quite follow what you said.", "lear_examp": "It is very hard to follow the lesson because I can't concentrate on the vocabulary."}, {"sense": "used to introduce a list or description", "level": "B2", "dict_examp": "The main reasons are as follows.", "lear_examp": "The errors made in the newspaper are as follows."}, {"sense": "to be interested in an event or activity and watch its progress", "level": "C1", "dict_examp": "I followed the trial closely.", "lear_examp": "I was happy to know you follow our national news."}, {"sense": "used to say that if one thing is true, another thing will also be true", "level": "C2", "dict_examp": "He's big, but it doesn't follow that he's strong.", "lear_examp": "It follows that they too do not have enough time."}, {"sense": "to copy someone's behavior or ideas", "level": "C2", "dict_examp": "You should follow Meg's example and tidy your room.", "lear_examp": "Thus they are encouraged to follow their example and change their character forever."}, {"sense": "to do the same things in your life as someone else did, especially a member of your family", "level": "C2", "dict_examp": "He followed in his father's footsteps and became an actor.", "lear_examp": "Her step-granddaughter gets fascinated with Olivia's story and this fascination draws her to India to follow in her footsteps."}, {"sense": "to do the same as someone else has just done", "level": "C2", "dict_examp": "If other shops lower their prices, we will have to follow suit.", "lear_examp": "Bitten by a insurmountable curiosity she goes to India to find out about her and she even follows suit: she ends up in the Himalayas driven by a strong desire to know more."}, {"sense": "to discover more about a situation or take further action in connection with it", "level": "B2", "dict_examp": "I follow up aerobic exercise with some weight lifting.", "lear_examp": "Last year I started to take a lot of black and white photos and I wanted to follow up the process so I bought an enlarger with all the equipment to go with it."}]}]}, {"word": "fly", "poses": [{"pos": "verb", "senses": [{"sense": "to travel through the air  in an aircraft", "level": "A1", "dict_examp": "I'm flying to Mumbai tomorrow.", "lear_examp": "I'm flying to Poland with my daughter."}, {"sense": "When a bird, insect or aircraft flies, it moves through the air.", "level": "A2", "dict_examp": "The plane was flying at 5000 feet.", "lear_examp": "The birds fly in the sky."}, {"sense": "to control an aircraft or other vehicle in air or space", "level": "B2", "dict_examp": "She learned to fly at the age of 18.", "lear_examp": "Louise, you are the only one who can fly this spaceship now."}, {"sense": "with a very high score or with great success", "level": "C1", "dict_examp": "He passed the exam with flying colors.", "lear_examp": "Through this, he was able to get his college degree and graduated with flying colors."}, {"sense": "If time flies, it passes very quickly.", "level": "C2", "dict_examp": "There was plenty to do, and the time flew.", "lear_examp": "But you have to enjoy it because time flies, and you will be old before you know it!"}, {"sense": "to take or send people or goods somewhere by aircraft", "level": "C2", "dict_examp": "She was flown to the hospital by helicopter.", "lear_examp": "All supplies are flown in daily from Paris in order to ensure the highest quality available."}, {"sense": "to be the opposite of what is usual or accepted", "level": "C2", "dict_examp": "These recommendations fly in the face of previous advice on safe limits of consumption.", "lear_examp": "But when we have a look outside our wonderful world, we can easily see that this argument flies in the face of the facts."}]}, {"pos": "noun", "senses": [{"sense": "a small insect with two wings", "level": "B1", "dict_examp": "There were a lot of flies around.", "lear_examp": "In the afternoon we were just lying like dead flies on our beds."}]}]}, {"word": "flower", "poses": [{"pos": "noun", "senses": [{"sense": "the attractive, colored part of a plant where the seeds grow", "level": "A1", "dict_examp": "wild flowers", "lear_examp": "You know I like flowers a lot."}]}]}, {"word": "footstep", "poses": [{"pos": "noun", "senses": [{"sense": "the sound of a foot hitting the ground when someone walks", "level": "C1", "dict_examp": "I heard footsteps behind me and quickly turned around.", "lear_examp": "We are lucky that it is summer now with warm and sunny weather.  In Stockholm people  are walking - the streets are thick with people and you can even hear their footsteps!"}, {"sense": "to do the same things in your life as someone else did, especially a member of your family", "level": "C2", "dict_examp": "He followed in his father's footsteps and became an actor.", "lear_examp": "Her step-granddaughter gets fascinated with Olivia's story and this fascination draws her to India to follow in her footsteps."}]}]}, {"word": "foolishly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a foolish way, or because of being foolish", "level": "B2", "dict_examp": "Foolishly, I didn't write the phone number down.", "lear_examp": "I was fourteen and foolishly in love with a blonde girl in my class to whom I had only spoken twice."}]}]}, {"word": "follow", "poses": [{"pos": "verb", "senses": [{"sense": "to move behind someone or something and go where they go", "level": "A2", "dict_examp": "A dog followed us home.", "lear_examp": "I'll wait for you in the central square and you can follow me."}, {"sense": "to travel along a street, path, road, etc.", "level": "A2", "dict_examp": "Follow the main road down to the traffic light.", "lear_examp": "You can get to my house by following the road from the corner which is next to the playground."}, {"sense": "to happen or come after something", "level": "B1", "dict_examp": "There was a bang, followed by a cloud of smoke.", "lear_examp": "In the first lesson we started with some games, followed by work activities, like role plays and presentations."}, {"sense": "to do what someone or something says you should do", "level": "B1", "dict_examp": "Follow the instructions on the back of the package carefully.", "lear_examp": "I think I should follow her advice, shouldn't I?"}, {"sense": "to understand something", "level": "B1", "dict_examp": "Could you repeat that? I didn't quite follow what you said.", "lear_examp": "It is very hard to follow the lesson because I can't concentrate on the vocabulary."}, {"sense": "used to introduce a list or description", "level": "B2", "dict_examp": "The main reasons are as follows.", "lear_examp": "The errors made in the newspaper are as follows."}, {"sense": "to be interested in an event or activity and watch its progress", "level": "C1", "dict_examp": "I followed the trial closely.", "lear_examp": "I was happy to know you follow our national news."}, {"sense": "used to say that if one thing is true, another thing will also be true", "level": "C2", "dict_examp": "He's big, but it doesn't follow that he's strong.", "lear_examp": "It follows that they too do not have enough time."}, {"sense": "to copy someone's behavior or ideas", "level": "C2", "dict_examp": "You should follow Meg's example and tidy your room.", "lear_examp": "Thus they are encouraged to follow their example and change their character forever."}, {"sense": "to do the same things in your life as someone else did, especially a member of your family", "level": "C2", "dict_examp": "He followed in his father's footsteps and became an actor.", "lear_examp": "Her step-granddaughter gets fascinated with Olivia's story and this fascination draws her to India to follow in her footsteps."}, {"sense": "to do the same as someone else has just done", "level": "C2", "dict_examp": "If other shops lower their prices, we will have to follow suit.", "lear_examp": "Bitten by a insurmountable curiosity she goes to India to find out about her and she even follows suit: she ends up in the Himalayas driven by a strong desire to know more."}, {"sense": "to discover more about a situation or take further action in connection with it", "level": "B2", "dict_examp": "I follow up aerobic exercise with some weight lifting.", "lear_examp": "Last year I started to take a lot of black and white photos and I wanted to follow up the process so I bought an enlarger with all the equipment to go with it."}]}]}, {"word": "food", "poses": [{"pos": "noun", "senses": [{"sense": "something that people and animals eat, or plants absorb, to keep them alive", "level": "A1", "dict_examp": "baby food", "lear_examp": "I'd like to eat Italian food, maybe lasagne."}]}]}, {"word": "follower", "poses": [{"pos": "noun", "senses": [{"sense": "someone who supports or believes in a particular person or set of ideas", "level": "C2", "dict_examp": "The newly elected governor appeared overcome with emotion as he thanked his followers.", "lear_examp": "Having been a devoted follower of the GDR's political system and having spent the collapse of this very system in a coma in hospital, once she wakes up, Christane has to be sheltered from the new developments."}]}]}, {"word": "fool", "poses": [{"pos": "noun", "senses": [{"sense": "a stupid person", "level": "B1", "dict_examp": "I was a fool to trust him.", "lear_examp": "I wonder if I'm a fool because in spite of my economic problems I want to join the best tennis club in the town, but I love tennis."}, {"sense": "to make someone look stupid intentionally", "level": "B2", "dict_examp": "She was always trying to make a fool out of me in front of my friends.", "lear_examp": "He thought I had tried to make a fool of him but no, I was really desperate to get him as my boyfriend."}, {"sense": "to behave in a silly or embarrassing way", "level": "B2", "dict_examp": "I got very excited  and made a fool of myself.", "lear_examp": "I had to leave that shop in full embarrassment and I also made a fool of myself."}]}, {"pos": "verb", "senses": [{"sense": "to trick someone", "level": "B2", "dict_examp": "Don't be fooled by his appearance.", "lear_examp": "I don't like to be fooled."}]}]}, {"word": "following", "poses": [{"pos": "preposition", "senses": [{"sense": "after or as a result of", "level": "B2", "dict_examp": "Following the dinner, there will be a dance.", "lear_examp": "Following the course in England, I worked in an office that sells computer programs and games as a secretary to earn money and with the help of this job, I gained experience in office work."}]}, {"pos": "adjective", "senses": [{"sense": "the next day/morning, etc.", "level": "B1", "dict_examp": "We met again the following afternoon.", "lear_examp": "I could give it back to you the following day."}]}, {"pos": "noun", "senses": [{"sense": "what comes next, often used to introduce a list, report, etc.", "level": "B2", "dict_examp": "The following is an extract from her diary.", "lear_examp": "Regarding your questions, the following are my answers."}]}]}, {"word": "fond", "poses": [{"pos": "adjective", "senses": [{"sense": "to like someone or something", "level": "B1", "dict_examp": "She was very fond of horses.", "lear_examp": "My boyfriend is very fond of cycling."}, {"sense": "expressing or causing happy feelings", "level": "B2", "dict_examp": "Many of us have fond memories of our childhoods.", "lear_examp": "I will keep fond memories of the two nights I have spent with you."}]}]}, {"word": "foot", "poses": [{"pos": "noun", "senses": [{"sense": "one of the two flat parts on the ends of your legs that you stand on", "level": "A1", "dict_examp": "I've hurt my left foot.", "lear_examp": "Then, in just a few minutes, we are going to put our feet in the hot sand."}, {"sense": "walking", "level": "A2", "dict_examp": "Are you riding your bicycle or going on foot?", "lear_examp": "It isn't far away from the main building - it's about 15 minutes on foot."}, {"sense": "a unit of measurement, equal to twelve inches or 0.3048 meters", "level": "B1", "dict_examp": "The man was standing only a few feet away.", "lear_examp": "The room is about 150 square feet, rectangular in shape, with a window opposite the door and a pair of sliding doors to the balcony at one end."}, {"sense": "the bottom of something such as stairs, a hill, a bed, or a page", "level": "C1", "dict_examp": "Put the notes at the foot of the page.", "lear_examp": "Every year, expedition-groups from almost every country met at the foot of the highest mountain in the world to conquer it."}, {"sense": "to go into a place or onto a piece of land", "level": "C1", "dict_examp": "He told me never to set foot in his house again.", "lear_examp": "I dream of being the first one to set foot on a white sandy beach, to admire a new kind of vegetation: cranberry bushes, sweet potatoes, wild turkeys, a different climate; how scary and exciting at the same time!"}, {"sense": "to tell someone in a strong way that they must do something or must stop doing something", "level": "C2", "dict_examp": "When she started borrowing my clothes without asking, I had to put my foot down.", "lear_examp": "Finally, I would like to appeal to other readers of the \"Cyprus Weekly,\" who might even be living near my area, to put your foot down and apply any pressure you can on people who can do something about the situation."}, {"sense": "to relax, especially by sitting with your feet supported above the ground", "level": "C2", "dict_examp": "Put your feet up for half an hour before the kids get home.", "lear_examp": "You have done your work and now you can put your feet up."}, {"sense": "to say something you should not say, especially something embarrassing", "level": "C2", "dict_examp": "He makes outrageous comments and is always putting his foot in his mouth.", "lear_examp": ""}, {"sense": "to start a relationship or activity badly", "level": "C2", "dict_examp": "He got off on the wrong foot with my parents by arriving late.", "lear_examp": "One of the greatest pleasures of reading \"The Remains of the Day\" would be to see the gradual development of the relationship between Stevens and Miss Kenton. From the beginning, they get off on the wrong foot."}, {"sense": "to stand up after you have been sitting", "level": "C2", "dict_examp": "The audience rose to their feet.", "lear_examp": "The capacity crowd rose to their feet to cheer Dylan and his band; since then I understood why his fans worship him like a god."}]}, {"pos": "verb", "senses": [{"sense": "to pay for something that costs a lot of money", "level": "C2", "dict_examp": "His parents can’t afford to foot the bill for his college education.", "lear_examp": "Only one problem arouse, which is who is going to foot the bill because such a factory is quite expensive."}]}]}, {"word": "foolish", "poses": [{"pos": "adjective", "senses": [{"sense": "stupid and not wise", "level": "B2", "dict_examp": "It would be foolish to pay more.", "lear_examp": "She looked foolish because of the mistakes she had made."}]}]}, {"word": "football", "poses": [{"pos": "noun", "senses": [{"sense": "an oval ball made of leather or plastic and filled with air, used in playing football", "level": "A1", "dict_examp": "They were tossing around a football.", "lear_examp": "I'll get a new football for you."}, {"sense": "a game in which two teams of players kick, throw, and run with an oval ball to cross a goal line and score points", "level": "A2", "dict_examp": "a football player/team/helmet", "lear_examp": "Now I'm very happy, we play football, baseball but it's very difficult to speak all the time in English."}, {"sense": "the game of soccer", "level": "A2", "dict_examp": "He played football in Spain.", "lear_examp": "I got two tickets for the football match."}]}]}, {"word": "for", "poses": [{"pos": "preposition", "senses": [{"sense": "intended to be given to or used by someone or something", "level": "A1", "dict_examp": "There's a message for you.", "lear_examp": "This is my information for you."}, {"sense": "used to show an amount of time or distance", "level": "A1", "dict_examp": "She's out of the office for a few days next week.", "lear_examp": "I had a break for 20 minutes."}, {"sense": "used to give an example of the type of thing you mean", "level": "A1", "dict_examp": "I like soft fruit, for example, peaches and plums.", "lear_examp": "You can make a quick snack, for example a sandwich."}, {"sense": "having a particular purpose", "level": "A2", "dict_examp": "There's a sign there saying \"boats for rent.\"", "lear_examp": "You need to bring your exercise book for art."}, {"sense": "in order to get or achieve something", "level": "A2", "dict_examp": "I hate waiting for the bus.", "lear_examp": "It's important to me because I'm going to study for an exam."}, {"sense": "in exchange for something, especially an amount of money", "level": "A2", "dict_examp": "How much did you pay for your glasses?", "lear_examp": "I'm selling it for 100 Euro."}, {"sense": "on the occasion of", "level": "A2", "dict_examp": "What did you buy him for Christmas?", "lear_examp": "I'm tired because I had a party yesterday for my birthday."}, {"sense": "at a particular time", "level": "A2", "dict_examp": "I made a reservation at the restaurant for nine o'clock.", "lear_examp": "Can we rearrange the time for five o'clock?"}, {"sense": "because of or as a result of something", "level": "A2", "dict_examp": "He got fined for leaving his car in a no-parking zone.", "lear_examp": "It is famous for \"paella\" but we have many different kinds of food."}, {"sense": "showing meaning", "level": "A2", "dict_examp": "What's the Czech word for \"book\"?", "lear_examp": ""}, {"sense": "toward or in the direction of", "level": "A2", "dict_examp": "They looked as if they were heading for the train station.", "lear_examp": ""}, {"sense": "available to buy", "level": "A2", "dict_examp": "Is this painting for sale?", "lear_examp": "For sale: \"Olympus\" camera + bag."}, {"sense": "in order to help someone", "level": "B1", "dict_examp": "I'll carry those bags for you.", "lear_examp": "I'd like to do something helpful for them."}, {"sense": "being employed by or representing a company, country, etc.", "level": "B1", "dict_examp": "She works for a charity.", "lear_examp": "He works for a company in Mexico."}, {"sense": "always in the future", "level": "B1", "dict_examp": "I'm not going to live here for ever.", "lear_examp": "My friend  was leaving the city for ever and going to a city in another country."}, {"sense": "for pleasure and not for any other reason", "level": "B1", "dict_examp": "I ran but just for fun.", "lear_examp": "Fortunately I discovered that the e-mail wasn't for me. I didn't appreciate that there were people that were sending things like that just for fun."}, {"sense": "without any doubt", "level": "B1", "dict_examp": "I think he's Canadian but I don't know for sure.", "lear_examp": "For sure, you'll love Brazil."}, {"sense": "for example", "level": "B1", "dict_examp": "In the electronics industry, for instance, 5000 people lost their jobs.", "lear_examp": "For instance, you can do mountain walks."}, {"sense": "in support of or in agreement with", "level": "B2", "dict_examp": "I voted for the him at the last election.", "lear_examp": "There are a lot of votes for and against keeping animals in cages."}, {"sense": "If you do something for the moment, you are doing it now, but might do something different in the future.", "level": "B2", "dict_examp": "Let's continue with what we already decided for the moment.", "lear_examp": "For the moment I am unemployed so I have plenty of time to give you a hand."}, {"sense": "used to mean that something is happening that does not usually happen", "level": "B2", "dict_examp": "For once, the bus was on time.", "lear_examp": "We would take lots of pictures, and play our own instruments, and if we get lucky enough, we would even touch the very stones and for once be embraced by magic itself."}, {"sense": "taken seriously, not pretended", "level": "B2", "dict_examp": "I thought it was just a practice, but apparently it was for real.", "lear_examp": "You know I am a Casanova, but this time I know it is for real."}, {"sense": "used to say whose responsibility something is", "level": "C1", "dict_examp": "I can't tell you whether you should go or not - that's for you to decide.", "lear_examp": "It is for you to decide whether my colleagues should take part in this kind of course or not, but all in all I would like to recommend this course."}, {"sense": "when compared to a particular fact", "level": "C1", "dict_examp": "She's quite tall for her age.", "lear_examp": "She spends all day indoors \"stuffing\" her craving for knowledge with books quite hard for her age."}, {"sense": "forever", "level": "C1", "dict_examp": "When he was 20, he left home for good.", "lear_examp": "He was renting this property previously, but he went back to Sri Lanka for good."}, {"sense": "for the whole of someone's life", "level": "C1", "dict_examp": "I will have to take this medicine for life.", "lear_examp": "A wedding opens a new life when the two parties commit to each other for life."}, {"sense": "for a long time", "level": "C1", "dict_examp": "We didn't have to wait for long.", "lear_examp": "My parents' generation, however, would not identify with this lifestyle for long."}, {"sense": "mostly or usually", "level": "C1", "dict_examp": "I enjoyed it for the most part.", "lear_examp": "First of all, for the most part, people have to use computers in their jobs."}, {"sense": "despite", "level": "C2", "dict_examp": "For all her qualifications, she's useless at the job.", "lear_examp": "For all of his desire to be strong, Okonkwo is haunted by fear."}, {"sense": "If something is for the best, it seems unpleasant now, but will improve a situation in the future.", "level": "C2", "dict_examp": "Moving to a smaller apartment really was for the best.", "lear_examp": "It's a kind of sad thing to think about but maybe it's for the best."}, {"sense": "because you are worried about something/doing something", "level": "C2", "dict_examp": "I didn't want to move for fear of waking her up.", "lear_examp": "No one dared to turn around for fear of being bitterly disappointed."}, {"sense": "used to give a reason for something", "level": "C2", "dict_examp": "You can't give Amy that shirt - for one thing it wont fit her.", "lear_examp": "Well, for one thing, you cannot spy on your subjects 24 hours a day - they would not allow it, and it would be prohibitively expensive."}]}]}, {"word": "force", "poses": [{"pos": "noun", "senses": [{"sense": "physical strength or power", "level": "B2", "dict_examp": "The force of the wind had brought down a great many trees in the area.", "lear_examp": "I understood that someone had entered my house by force and had stolen my television."}, {"sense": "a group of people organized to work together for a particular purpose, for example in military service", "level": "B2", "dict_examp": "the security forces", "lear_examp": "Donald Wood was risking his life and that of his family in the process of reporting the vile crimes of the SA. police force."}, {"sense": "power and influence, or a person or thing that has it", "level": "C2", "dict_examp": "the forces of good/evil", "lear_examp": "Each boy is a battleground where the forces of confusion wage war on the forces of good."}, {"sense": "a very powerful person or organization", "level": "C2", "dict_examp": "His Dad is a force to be reckoned with.", "lear_examp": "No longer a remote, backward, unimportant country, it became a force to be reckoned with in Europe."}, {"sense": "When two people or groups join forces, they act or work together.", "level": "C2", "dict_examp": "She joined forces with her sister-in-law to set up a restaurant.", "lear_examp": "The second proposal is that we join forces with Green Peace in picketing the refinery, this of course is up to the individual members."}, {"sense": "If a law, rule, etc. is in force, it exists and is being used.", "level": "C2", "dict_examp": "New regulations limiting fishing on this river are now in force.", "lear_examp": "Because the measures are only in Patra they are not very powerful because it isn't an official law so that it is always in force."}, {"sense": "all of the people available to work or actually employed in a particular area, industry, or company", "level": "C2", "dict_examp": "In this city, over 15 percent of the labor force are in jobs that require a bachelor's degree.", "lear_examp": "Young couples usually don't want to have more then one or two children and the labor force is declining."}]}, {"pos": "verb", "senses": [{"sense": "to make someone do something that they do not want to do", "level": "B2", "dict_examp": "You can't force her to make a decision.", "lear_examp": "By participating in such games you force yourself to do your best."}, {"sense": "to use physical strength or effort to make something move or open", "level": "C2", "dict_examp": "Move your leg up gently when you're doing this exercise, but don't force it.", "lear_examp": "They forced the door, entered the house and found Mary under the effect of drugs and her boyfriend on the floor dead."}]}]}, {"word": "forceful", "poses": [{"pos": "adjective", "senses": [{"sense": "expressing opinions strongly and demanding attention or action", "level": "C2", "dict_examp": "a forceful manner/personality", "lear_examp": "But she was a forceful woman who knew how to deal with her problems."}]}]}, {"word": "forecast", "poses": [{"pos": "noun", "senses": [{"sense": "a report saying what the weather is likely to be like", "level": "B1", "dict_examp": "The weather forecast said it was going to rain later today.", "lear_examp": "The weather forecast is not so good for the next two days: rain and wind."}]}]}, {"word": "forever", "poses": [{"pos": "adverb", "senses": [{"sense": "for all time in the future", "level": "B1", "dict_examp": "I'll love you forever.", "lear_examp": "I'll keep it forever in my memory!"}, {"sense": "for an extremely long time or too much time", "level": "B2", "dict_examp": "We'd better walk a bit quicker - it's going to take forever if we go this slowly.", "lear_examp": "It would take forever."}]}]}, {"word": "forbid", "poses": [{"pos": "verb", "senses": [{"sense": "to order someone not to do something, or to say that something must not happen", "level": "B2", "dict_examp": "I forbid you to see that boy again!", "lear_examp": "They forbid people talking in the same room where they watch TV."}]}]}, {"word": "foresee", "poses": [{"pos": "verb", "senses": [{"sense": "to expect a future situation or event", "level": "C1", "dict_examp": "I don't foresee any problems in the future.", "lear_examp": "Our duty is to foresee any complication before it appears."}]}]}, {"word": "forbidden", "poses": [{"pos": "adjective", "senses": [{"sense": "not allowed, especially by law", "level": "B1", "dict_examp": "Smoking is forbidden in the theater.", "lear_examp": "She explained to me how this school works, what is allowed and what is forbidden."}]}]}, {"word": "foremost", "poses": [{"pos": "adverb", "senses": [{"sense": "more than anything else", "level": "C1", "dict_examp": "In spite of being elected to office, she remains first and foremost a writer.", "lear_examp": "First and foremost it is my longing to help others with what they cannot do for themselves."}]}, {"pos": "adjective", "senses": [{"sense": "most important", "level": "C2", "dict_examp": "He's one of the country's foremost experts on military law.", "lear_examp": "At the beginning of Lord of the flies we find out about one of the main characters, whose foremost feature is the fact that he is \"different from the other boys\"."}]}]}, {"word": "foreigner", "poses": [{"pos": "noun", "senses": [{"sense": "a person who comes from another country", "level": "B1", "dict_examp": "I was so obviously a foreigner.", "lear_examp": "I started my new English class last week, because I really want to master English for my dream, to teach Japanese for foreigners."}]}]}, {"word": "forehead", "poses": [{"pos": "noun", "senses": [{"sense": "the flat part of the face, above the eyes and below the hair", "level": "B1", "dict_examp": "She's got a high forehead.", "lear_examp": "Suddenly, the girl found herself in front of the man, holding a gun against her forehead."}]}]}, {"word": "forget", "poses": [{"pos": "verb", "senses": [{"sense": "remember", "level": "A1", "dict_examp": "Don't forget your homework!", "lear_examp": "And please don't forget the dessert!"}, {"sense": "to not bring something with you because you did not remember it", "level": "A2", "dict_examp": "I've forgotten my keys.", "lear_examp": "I forgot my wallet yesterday."}, {"sense": "to not remember to do something", "level": "B1", "dict_examp": "I forgot to phone Jan.", "lear_examp": "I nearly forgot to tell you that the film is going to be on TV on the 15th of August."}, {"sense": "to be unable to remember a fact, something that happened, or how to do something", "level": "B1", "dict_examp": "I'm sorry, I've forgotten your name.", "lear_examp": "I'd forgotten that I had an English test."}, {"sense": "to stop thinking about someone or something", "level": "B1", "dict_examp": "I'll never forget him for as long as I live.", "lear_examp": "But there are two things that I'll never forget: the taste of ostrich meat and egg, and the dolphins in the wonderful ocean."}, {"sense": "used to tell someone not to worry about something because it is not important", "level": "B2", "dict_examp": "\"I'm sorry I missed your birthday.\" \"Forget it, it doesn't matter.\"", "lear_examp": "The teacher finally told me: \"Forget it, it doesn't matter,\" and I felt so stupid that I couldn't do anything save going away."}, {"sense": "used to say you don't remember, instead of \"I have forgotten\"", "level": "C2", "dict_examp": "I forget when we last saw him.", "lear_examp": "The youth is the future, I forget who said that, but, its absolutely true."}]}]}, {"word": "foreign", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging or connected to a country that is not your own", "level": "A2", "dict_examp": "Spain was the first foreign country she had visited.", "lear_examp": "You know I have got a friend in Germany, but I want to meet more foreign people."}, {"sense": "relating to or dealing with countries that are not your own", "level": "B2", "dict_examp": "foreign policy", "lear_examp": "She is also extraordinary in that she graduated from Harvard University and Tokyo University and used to work for the Ministry of Foreign Affairs as a senior civil servant."}, {"sense": "to be something you know nothing about or do not understand", "level": "C2", "dict_examp": "The concept of loyalty is completely foreign to him.", "lear_examp": "But, vulgarity was foreign to his nature and he seemed to be merely a shy man."}]}]}, {"word": "foreseeable", "poses": [{"pos": "adjective", "senses": [{"sense": "as far in the future as you can imagine", "level": "C2", "dict_examp": "Prices will remain high for the foreseeable future.", "lear_examp": "But in my view these same jobs will find themselves subjected to the same pressures and thus will have the same destiny in the foreseeable future."}]}]}, {"word": "for", "poses": [{"pos": "preposition", "senses": [{"sense": "intended to be given to or used by someone or something", "level": "A1", "dict_examp": "There's a message for you.", "lear_examp": "This is my information for you."}, {"sense": "used to show an amount of time or distance", "level": "A1", "dict_examp": "She's out of the office for a few days next week.", "lear_examp": "I had a break for 20 minutes."}, {"sense": "used to give an example of the type of thing you mean", "level": "A1", "dict_examp": "I like soft fruit, for example, peaches and plums.", "lear_examp": "You can make a quick snack, for example a sandwich."}, {"sense": "having a particular purpose", "level": "A2", "dict_examp": "There's a sign there saying \"boats for rent.\"", "lear_examp": "You need to bring your exercise book for art."}, {"sense": "in order to get or achieve something", "level": "A2", "dict_examp": "I hate waiting for the bus.", "lear_examp": "It's important to me because I'm going to study for an exam."}, {"sense": "in exchange for something, especially an amount of money", "level": "A2", "dict_examp": "How much did you pay for your glasses?", "lear_examp": "I'm selling it for 100 Euro."}, {"sense": "on the occasion of", "level": "A2", "dict_examp": "What did you buy him for Christmas?", "lear_examp": "I'm tired because I had a party yesterday for my birthday."}, {"sense": "at a particular time", "level": "A2", "dict_examp": "I made a reservation at the restaurant for nine o'clock.", "lear_examp": "Can we rearrange the time for five o'clock?"}, {"sense": "because of or as a result of something", "level": "A2", "dict_examp": "He got fined for leaving his car in a no-parking zone.", "lear_examp": "It is famous for \"paella\" but we have many different kinds of food."}, {"sense": "showing meaning", "level": "A2", "dict_examp": "What's the Czech word for \"book\"?", "lear_examp": ""}, {"sense": "toward or in the direction of", "level": "A2", "dict_examp": "They looked as if they were heading for the train station.", "lear_examp": ""}, {"sense": "available to buy", "level": "A2", "dict_examp": "Is this painting for sale?", "lear_examp": "For sale: \"Olympus\" camera + bag."}, {"sense": "in order to help someone", "level": "B1", "dict_examp": "I'll carry those bags for you.", "lear_examp": "I'd like to do something helpful for them."}, {"sense": "being employed by or representing a company, country, etc.", "level": "B1", "dict_examp": "She works for a charity.", "lear_examp": "He works for a company in Mexico."}, {"sense": "always in the future", "level": "B1", "dict_examp": "I'm not going to live here for ever.", "lear_examp": "My friend  was leaving the city for ever and going to a city in another country."}, {"sense": "for pleasure and not for any other reason", "level": "B1", "dict_examp": "I ran but just for fun.", "lear_examp": "Fortunately I discovered that the e-mail wasn't for me. I didn't appreciate that there were people that were sending things like that just for fun."}, {"sense": "without any doubt", "level": "B1", "dict_examp": "I think he's Canadian but I don't know for sure.", "lear_examp": "For sure, you'll love Brazil."}, {"sense": "for example", "level": "B1", "dict_examp": "In the electronics industry, for instance, 5000 people lost their jobs.", "lear_examp": "For instance, you can do mountain walks."}, {"sense": "in support of or in agreement with", "level": "B2", "dict_examp": "I voted for the him at the last election.", "lear_examp": "There are a lot of votes for and against keeping animals in cages."}, {"sense": "If you do something for the moment, you are doing it now, but might do something different in the future.", "level": "B2", "dict_examp": "Let's continue with what we already decided for the moment.", "lear_examp": "For the moment I am unemployed so I have plenty of time to give you a hand."}, {"sense": "used to mean that something is happening that does not usually happen", "level": "B2", "dict_examp": "For once, the bus was on time.", "lear_examp": "We would take lots of pictures, and play our own instruments, and if we get lucky enough, we would even touch the very stones and for once be embraced by magic itself."}, {"sense": "taken seriously, not pretended", "level": "B2", "dict_examp": "I thought it was just a practice, but apparently it was for real.", "lear_examp": "You know I am a Casanova, but this time I know it is for real."}, {"sense": "used to say whose responsibility something is", "level": "C1", "dict_examp": "I can't tell you whether you should go or not - that's for you to decide.", "lear_examp": "It is for you to decide whether my colleagues should take part in this kind of course or not, but all in all I would like to recommend this course."}, {"sense": "when compared to a particular fact", "level": "C1", "dict_examp": "She's quite tall for her age.", "lear_examp": "She spends all day indoors \"stuffing\" her craving for knowledge with books quite hard for her age."}, {"sense": "forever", "level": "C1", "dict_examp": "When he was 20, he left home for good.", "lear_examp": "He was renting this property previously, but he went back to Sri Lanka for good."}, {"sense": "for the whole of someone's life", "level": "C1", "dict_examp": "I will have to take this medicine for life.", "lear_examp": "A wedding opens a new life when the two parties commit to each other for life."}, {"sense": "for a long time", "level": "C1", "dict_examp": "We didn't have to wait for long.", "lear_examp": "My parents' generation, however, would not identify with this lifestyle for long."}, {"sense": "mostly or usually", "level": "C1", "dict_examp": "I enjoyed it for the most part.", "lear_examp": "First of all, for the most part, people have to use computers in their jobs."}, {"sense": "despite", "level": "C2", "dict_examp": "For all her qualifications, she's useless at the job.", "lear_examp": "For all of his desire to be strong, Okonkwo is haunted by fear."}, {"sense": "If something is for the best, it seems unpleasant now, but will improve a situation in the future.", "level": "C2", "dict_examp": "Moving to a smaller apartment really was for the best.", "lear_examp": "It's a kind of sad thing to think about but maybe it's for the best."}, {"sense": "because you are worried about something/doing something", "level": "C2", "dict_examp": "I didn't want to move for fear of waking her up.", "lear_examp": "No one dared to turn around for fear of being bitterly disappointed."}, {"sense": "used to give a reason for something", "level": "C2", "dict_examp": "You can't give Amy that shirt - for one thing it wont fit her.", "lear_examp": "Well, for one thing, you cannot spy on your subjects 24 hours a day - they would not allow it, and it would be prohibitively expensive."}]}]}, {"word": "forgery", "poses": [{"pos": "noun", "senses": [{"sense": "an illegal copy of a document, painting, etc.", "level": "C2", "dict_examp": "The passport was clearly a forgery.", "lear_examp": ""}, {"sense": "the crime of making an illegal copy of something", "level": "C2", "dict_examp": "The doctor was convicted on two charges of forgery.", "lear_examp": "Frank remembered his dark past, when he committed forgery."}]}]}, {"word": "forest", "poses": [{"pos": "noun", "senses": [{"sense": "a large area of trees growing closely together", "level": "A2", "dict_examp": "the Black Forest", "lear_examp": "I would like to go for a walk in the forest."}]}]}, {"word": "forgiveness", "poses": [{"pos": "noun", "senses": [{"sense": "when you forgive someone for something they have done", "level": "C2", "dict_examp": "They begged her for forgiveness.", "lear_examp": "She gave me a panicked look of abashment and begged for my forgiveness."}]}]}, {"word": "formally", "poses": [{"pos": "adverb", "senses": [{"sense": "officially", "level": "C1", "dict_examp": "The deal will be formally announced on Tuesday.", "lear_examp": "First of all I'll tell you a little about the ceremony. It's usually held in a church, (in our case, a Catholic one as we are Catholics); the priest reads some parts of the Bible to the bridegroom (that's usually chosen before with the couple); then they exchange rings and they'll be formally married."}, {"sense": "in a polite way", "level": "C1", "dict_examp": "They shook hands formally.", "lear_examp": "On New Year's Day all members in a family got together (members who lived separately came home), greeted each other more formally than usual, and ate the special food."}]}]}, {"word": "foul", "poses": [{"pos": "adjective", "senses": [{"sense": "very dirty, or with an unpleasant smell", "level": "C1", "dict_examp": "the foul odor of rotting fish", "lear_examp": "Each day early in the morning, a group of twenty persons picked up the rubbish and when we went out to go to work, the streets were as clean as if there was no strike. Anyway we had to do that if we wanted to \"survive\" in this foul atmosphere."}, {"sense": "very rude and offensive words", "level": "C1", "dict_examp": "There was a lot of foul language in the movie.", "lear_examp": "It is the responsibility of the parents not to fight or use any foul language in front of the kids, as they may learn and use it in front of others."}, {"sense": "very bad or unpleasant", "level": "C2", "dict_examp": "foul weather", "lear_examp": "It reappeared only in moments of distraction and served exclusively to increase her foul mood."}]}, {"pos": "noun", "senses": [{"sense": "In some sports, a foul is something that someone does that is not allowed by the rules.", "level": "C2", "dict_examp": "The referee called it an intentional foul.", "lear_examp": "If that happens, the referee has the right to interrupt the game by blowing his whistle and saying that that team has committed a foul."}]}]}, {"word": "formerly", "poses": [{"pos": "adverb", "senses": [{"sense": "in the past", "level": "B2", "dict_examp": "The European Union was formerly called the European Community.", "lear_examp": "He was a hero in Japan, formerly known as the ungifted pupil from Switzerland."}]}]}, {"word": "former", "poses": [{"pos": "adjective", "senses": [{"sense": "happening, existing or true in the past but not now", "level": "B1", "dict_examp": "his former wife", "lear_examp": "And in my town there is also a new Italian restaurant. It's owned by my mother's former colleague."}]}, {"pos": "pronoun", "senses": [{"sense": "the first of two people, things or groups previously mentioned", "level": "B2", "dict_examp": "Of the two suggestions, I prefer the former.", "lear_examp": "The former is a Chinese restaurant and the latter an Indian."}]}]}, {"word": "fortunately", "poses": [{"pos": "adverb", "senses": [{"sense": "happening because of good luck", "level": "B1", "dict_examp": "Fortunately, we got home before it started to rain.", "lear_examp": "At the moment, fortunately, the weather is fine and sunny."}]}]}, {"word": "fork", "poses": [{"pos": "noun", "senses": [{"sense": "a small object with three or four points and a handle, that you use to pick up food and eat with", "level": "A2", "dict_examp": "a knife and fork.", "lear_examp": "I like a clean fork and knife."}]}]}, {"word": "forward", "poses": [{"pos": "adverb", "senses": [{"sense": "toward the direction in front of you", "level": "B1", "dict_examp": "She leaned forward to whisper something in my ear.", "lear_examp": "I had to try once again to take a step forward, gently I took a step forward."}, {"sense": "toward the future", "level": "B2", "dict_examp": "I always look forward, not back.", "lear_examp": "I want you to look a bit forward, try to imagine how you will feel in one or two years' time."}, {"sense": "used to say that something is making progress", "level": "C1", "dict_examp": "The project moved forward slowly.", "lear_examp": "For us, this would be a big step forward and a perfect motivation for the accountants."}]}]}, {"word": "found", "poses": [{"pos": "verb", "senses": [{"sense": "to bring something into existence", "level": "B2", "dict_examp": "York was founded by the Romans in the year 71 AD.", "lear_examp": "Red Stone was founded ten years ago."}, {"sense": "to base something on a set of ideas or beliefs", "level": "C2", "dict_examp": "a society founded on principles of equality", "lear_examp": "While Piggy is holding the conch, the symbol of a human community, founded on discussion, agreement and rules, and speaking up to Jack, Roger sets the rock in motion which destroys Piggy and his conch."}]}]}, {"word": "formal", "poses": [{"pos": "adjective", "senses": [{"sense": "describes language, clothes and behavior that are traditional and correct", "level": "B2", "dict_examp": "a formal dinner party", "lear_examp": "You don't need to wear formal clothes."}, {"sense": "Formal education, training, etc., is learning in an established course in a school.", "level": "C1", "dict_examp": "His formal education ended at the sixth grade, yet he became a millionaire at the age of thirty.", "lear_examp": "I never had any formal training in computers but I know how to operate the system, to make files and to use the Internet."}, {"sense": "public or official", "level": "C1", "dict_examp": "a formal announcement/request", "lear_examp": "For that reason, I have to ask you for a formal apology in print, where you could give the correct version of events and also change the bad image you gave to the readers of the people of my organization."}]}]}, {"word": "forgive", "poses": [{"pos": "verb", "senses": [{"sense": "to decide not to be angry with someone for something they have done, or not to punish them for something they have done", "level": "B1", "dict_examp": "She never forgave her mother for lying to her.", "lear_examp": "I will never forgive him."}, {"sense": "used before you ask or say something that might seem rude", "level": "B2", "dict_examp": "Forgive me for asking, but how much did you pay for your bag?", "lear_examp": "Forgive me if I have made it seem so funny, but I'm telling you you should have seen his face."}]}]}, {"word": "formation", "poses": [{"pos": "noun", "senses": [{"sense": "the development of something into a particular thing or shape", "level": "C2", "dict_examp": "the formation of a crystal", "lear_examp": "Due to the heat from the sun, the sea water evaporates and this leads to the formation of clouds as the water condenses as it gets higher."}, {"sense": "when something has a particular shape or things are arranged in a particular way", "level": "C2", "dict_examp": "rock/cloud formations", "lear_examp": "The cave had the most incredible ice formation I had ever seen."}]}]}, {"word": "forthcoming", "poses": [{"pos": "adjective", "senses": [{"sense": "happening soon", "level": "B2", "dict_examp": "We have just received the information about the forthcoming conference.", "lear_examp": "I am writing this letter so as to give you the information which will help you organize all the necessary details of the forthcoming holiday."}, {"sense": "If money or help is forthcoming, it is offered or given.", "level": "C1", "dict_examp": "He insisted that no more money would be forthcoming.", "lear_examp": "I trust you will agree that at the very least I deserve a letter of explanation from you and a substantial refund of my money.  Unless this is forthcoming, I will have to take matters a step further."}]}]}, {"word": "fortunate", "poses": [{"pos": "adjective", "senses": [{"sense": "lucky", "level": "B2", "dict_examp": "You're very fortunate to have found such a lovely house.", "lear_examp": "I was fortunate in that I had the chance to be with children on a daily basis and learn to communicate with them."}]}]}, {"word": "formulate", "poses": [{"pos": "verb", "senses": [{"sense": "to develop all the details of a plan for doing something", "level": "C2", "dict_examp": "They formulated a plan to save the company.", "lear_examp": "Having discussed this matter, we formulated three basic suggestions and we evaluated the advantages of each of them."}, {"sense": "to say what you think or feel after thinking carefully", "level": "C2", "dict_examp": "to formulate an answer/reply", "lear_examp": "Montag is now thinking by himself and realizes that he is able to formulate his own opinion."}]}]}, {"word": "forget", "poses": [{"pos": "verb", "senses": [{"sense": "remember", "level": "A1", "dict_examp": "Don't forget your homework!", "lear_examp": "And please don't forget the dessert!"}, {"sense": "to not bring something with you because you did not remember it", "level": "A2", "dict_examp": "I've forgotten my keys.", "lear_examp": "I forgot my wallet yesterday."}, {"sense": "to not remember to do something", "level": "B1", "dict_examp": "I forgot to phone Jan.", "lear_examp": "I nearly forgot to tell you that the film is going to be on TV on the 15th of August."}, {"sense": "to be unable to remember a fact, something that happened, or how to do something", "level": "B1", "dict_examp": "I'm sorry, I've forgotten your name.", "lear_examp": "I'd forgotten that I had an English test."}, {"sense": "to stop thinking about someone or something", "level": "B1", "dict_examp": "I'll never forget him for as long as I live.", "lear_examp": "But there are two things that I'll never forget: the taste of ostrich meat and egg, and the dolphins in the wonderful ocean."}, {"sense": "used to tell someone not to worry about something because it is not important", "level": "B2", "dict_examp": "\"I'm sorry I missed your birthday.\" \"Forget it, it doesn't matter.\"", "lear_examp": "The teacher finally told me: \"Forget it, it doesn't matter,\" and I felt so stupid that I couldn't do anything save going away."}, {"sense": "used to say you don't remember, instead of \"I have forgotten\"", "level": "C2", "dict_examp": "I forget when we last saw him.", "lear_examp": "The youth is the future, I forget who said that, but, its absolutely true."}]}]}, {"word": "formidable", "poses": [{"pos": "adjective", "senses": [{"sense": "strong, powerful, and a bit frightening", "level": "C2", "dict_examp": "a formidable woman", "lear_examp": "I suppose that this optimism supports her formidable pioneer-spirit and energy."}, {"sense": "difficult and needing a lot of effort or thought", "level": "C2", "dict_examp": "a formidable task", "lear_examp": "You could feel like a fish out of water whenever you are with your colleagues or find yourself out of place and being depressed when faced with formidable tasks which are not appealing to you at all."}]}]}, {"word": "fortune", "poses": [{"pos": "noun", "senses": [{"sense": "a lot of money", "level": "B2", "dict_examp": "She made a fortune selling her story to the newspapers.", "lear_examp": "It really made it easier for me and it would have cost me a fortune to stay in a hotel."}, {"sense": "the good or bad things that happen to you", "level": "B2", "dict_examp": "The family's fortunes changed almost overnight.", "lear_examp": "Everyone was rejoicing over her good fortune and she even thought that the gods up above were happy for her."}]}]}, {"word": "format", "poses": [{"pos": "noun", "senses": [{"sense": "the way something is designed, arranged, or produced", "level": "C1", "dict_examp": "This year's event will have a new format.", "lear_examp": "There is one particular format which has been consistently on air almost without any adjustments: the soap opera."}]}]}, {"word": "formula", "poses": [{"pos": "noun", "senses": [{"sense": "a plan or method that is used to achieve something", "level": "C1", "dict_examp": "There's no magic formula for success.", "lear_examp": "Every member of his company works as a group, rather than an individual, which is the main formula for his company's success."}, {"sense": "a set of letters, numbers, or symbols that express a data set, a mathematical fact, or a chemical composition", "level": "C1", "dict_examp": "a mathematical formula", "lear_examp": "I would be interested in learning how to do a quick search in Excel, setting up equations and establishing formula parameters for statistics operations."}]}]}, {"word": "form", "poses": [{"pos": "noun", "senses": [{"sense": "a document with spaces for you to write information", "level": "A2", "dict_examp": "an application form", "lear_examp": "My job application form is in that file."}, {"sense": "a way of writing or saying a word that shows if it is singular or plural, past or present, etc.", "level": "B1", "dict_examp": "The continuous form of \"stand\" is \"standing.\"", "lear_examp": ""}, {"sense": "a type of something", "level": "B2", "dict_examp": "Swimming is the best form of exercise.", "lear_examp": "Bicycle fans say that cycling is a very good form of exercise."}, {"sense": "the particular way in which something appears or exists", "level": "C1", "dict_examp": "The novel is written in the form of a series of letters.", "lear_examp": "For all this, I can only say that I want my money back immediately, or some compensation in the form of a real trip to a real country."}, {"sense": "feeling or performing well", "level": "C2", "dict_examp": "He was in great form and won the golf tournament by 7 strokes.", "lear_examp": "In this period of time the sportsman or -women has to constantly concentrate on being in top form, as well as dealing with the heavy amount of publicity that comes with being a \"superstar.\""}]}, {"pos": "verb", "senses": [{"sense": "to make something by combining different parts", "level": "B1", "dict_examp": "In English, you form the present participle by adding -ing to the verb.", "lear_examp": ""}, {"sense": "to begin to exist or to make something begin to exist", "level": "B2", "dict_examp": "We are learning more about how stars are formed.", "lear_examp": "You are only attached to material values and your life-style is formed by earning money."}, {"sense": "to start an organization or business", "level": "B2", "dict_examp": "She formed her own company eleven years ago.", "lear_examp": "Many organizations were formed to protect the now endangered species, and people began to ask themselves: are zoos necessary?"}, {"sense": "to take or to make something take a particular shape", "level": "C2", "dict_examp": "Hold hands and form a circle.", "lear_examp": "The girl's mother had baked the biggest cake the little girl had ever seen and covered it with a lot of cream, and 10 lighted candles formed a heart in the middle."}, {"sense": "to begin to have a particular opinion or idea about something because of the information you have", "level": "C2", "dict_examp": "I formed the opinion that I was not really welcome there any more.", "lear_examp": "Young people are at the mercy of several ideological spectrums that dominate them and prevent them from forming an objective opinion."}, {"sense": "to be the thing talked about or be part of it", "level": "C2", "dict_examp": "The Alps form a natural barrier between Italy and Switzerland.", "lear_examp": "Someone tried to drink the water that had formed a puddle on the ground but ended up with a mouthful of moist yellow-tinted mud."}]}]}, {"word": "forty", "poses": [{"pos": "number", "senses": [{"sense": "the number 40", "level": "A2", "dict_examp": "thirty, forty, fifty", "lear_examp": "There were about forty people."}, {"sense": "to be aged between 40 and 49", "level": "B2", "dict_examp": "By the time I'm in my forties, I want to be running my own business.", "lear_examp": "The man was in his early forties and he looked to be a very important man."}, {"sense": "the years 1940 through 1949", "level": "B2", "dict_examp": "Most of these people were born in the forties.", "lear_examp": "So, I would like you to consider buying some English comedies, like those Ealing Studios made in the late forties and the fifties."}]}]}, {"word": "fraction", "poses": [{"pos": "noun", "senses": [{"sense": "a very small number or amount", "level": "C2", "dict_examp": "a fraction of a second", "lear_examp": "Both of them hit the wall almost at the same time but, against Hall's prediction, Popou was better by a fraction of a second."}]}]}, {"word": "four", "poses": [{"pos": "number", "senses": [{"sense": "the number 4", "level": "A1", "dict_examp": "Most animals have four legs.", "lear_examp": "He works four days and has four days off."}]}]}, {"word": "frankly", "poses": [{"pos": "adverb", "senses": [{"sense": "used when giving an honest and direct opinion, often one that might upset someone", "level": "B2", "dict_examp": "Quite frankly, I think this whole situation is ridiculous.", "lear_examp": "I'm asking this because quite frankly, it's the part of the festival that my friend and I enjoyed the most."}]}]}, {"word": "framework", "poses": [{"pos": "noun", "senses": [{"sense": "a system of rules, ideas, or beliefs that is used to plan or decide something", "level": "C2", "dict_examp": "a legal framework for resolving disputes", "lear_examp": "They were all trying to do their best in the rigid framework of the existing system (one of them even succeeded in making the difference)."}]}]}, {"word": "frequent", "poses": [{"pos": "adjective", "senses": [{"sense": "happening often", "level": "B1", "dict_examp": "a frequent visitor to the US", "lear_examp": "As you must know I am a frequent traveler because of my job and I have many stories regarding my trips."}]}]}, {"word": "free", "poses": [{"pos": "adjective", "senses": [{"sense": "not busy doing anything", "level": "A2", "dict_examp": "Are you free this evening?", "lear_examp": "I am free this afternoon."}, {"sense": "not costing any money", "level": "A2", "dict_examp": "I got some free movie tickets.", "lear_examp": "You don't have to bring any money because it is free."}, {"sense": "not limited or controlled", "level": "B2", "dict_examp": "a free society", "lear_examp": "The plan was this: they would call the police, which would trap the man so the child would be free to return to his mother."}, {"sense": "not in prison", "level": "B2", "dict_examp": "He will soon be a free man again.", "lear_examp": "I will regret it for the rest of my life, because I wanted to be a free man..."}, {"sense": "to allow someone to leave prison or to allow a person or animal to escape", "level": "B2", "dict_examp": "He opened the cage and set the birds free.", "lear_examp": "To sum up, animals should be set free and live as they should live in nature."}, {"sense": "not being used by anyone", "level": "B2", "dict_examp": "Is this seat free?", "lear_examp": "The hall was full of people and no seat was free."}, {"sense": "not containing or having anything harmful or unpleasant", "level": "C1", "dict_examp": "a life free from pain", "lear_examp": "We can start to grow new plants so that our environment looks fresh and enchanting and free from pesticides and sicknesses as well."}, {"sense": "to escape from someone or something that is controlling you", "level": "C2", "dict_examp": "She tried to break free from the social conditioning of her upbringing.", "lear_examp": "I would like to revisit there one day as it's firmly connected to my adolescence, when I struggled to break free from my peers, and tried to establish my own identity."}, {"sense": "to suddenly escape or become separate from something or someone", "level": "C2", "dict_examp": "The dog broke free and ran into traffic.", "lear_examp": ""}, {"sense": "permission to make your own decisions about how you want to do something", "level": "C2", "dict_examp": "The students were given a free hand as far as designing their projects was concerned.", "lear_examp": "But unlike my parents, I wouldn't give my children a free hand in solving their problems."}]}, {"pos": "adverb", "senses": [{"sense": "without cost or payment", "level": "A2", "dict_examp": "Children under five travel free.", "lear_examp": "I get tickets for free."}, {"sense": "in a way that is not tied, limited, or controlled", "level": "B2", "dict_examp": "The horse broke free and ran away.", "lear_examp": "If animals were born free, why do they have to live in a prison?"}]}, {"pos": "verb", "senses": [{"sense": "to allow someone to leave a prison or place where they have been kept", "level": "B2", "dict_examp": "After a ten-hour siege the gunman agreed to free the hostages.", "lear_examp": "We were taken hostage by a bank robber but the police came and freed us."}]}]}, {"word": "frame", "poses": [{"pos": "noun", "senses": [{"sense": "a border that surrounds and supports a picture, door or window", "level": "B1", "dict_examp": "a picture/window frame", "lear_examp": "I'm going to buy picture frames to put the pictures in and I'll put them on the wall, around my table."}, {"sense": "the basic structure of a building, vehicle or piece of furniture that other parts are added onto", "level": "B2", "dict_examp": "a bicycle frame", "lear_examp": "In my bedroom is a big bed with a wood frame and a comfortable mattress."}, {"sense": "the way someone feels at a particular time", "level": "C2", "dict_examp": "She was in a much more positive frame of mind today.", "lear_examp": "Naturally, these are more difficult factors to cope with for older people, but it just happens to anyone if you're not in the right frame of mind."}]}]}, {"word": "founder", "poses": [{"pos": "noun", "senses": [{"sense": "someone who establishes an organization, movement, etc.", "level": "C2", "dict_examp": "She was one of the founders of the women's movement.", "lear_examp": "He was the founder of the Jersey Wildlife Preservation Trust forty years ago, due to his great concern for the preservation of wildlife species."}]}]}, {"word": "fox", "poses": [{"pos": "noun", "senses": [{"sense": "a wild animal like a dog with red-brown fur, a pointed nose, and a long, thick tail", "level": "B2", "dict_examp": "A fox killed the chickens during the night.", "lear_examp": "One day, the fox attacked his animals and he shouted as much as he could."}]}]}, {"word": "freeze", "poses": [{"pos": "verb", "senses": [{"sense": "If something freezes or is frozen, it becomes hard and solid because it is very cold.", "level": "B1", "dict_examp": "Water freezes at a temperature of 0°C.", "lear_examp": "Sometimes the roads are frozen and the cars cannot pass."}, {"sense": "to make food last a long time by making it very cold and  hard", "level": "B1", "dict_examp": "I'll freeze any food that's left over.", "lear_examp": ""}, {"sense": "to feel very cold", "level": "B2", "dict_examp": "Without a sleeping bag, you would freeze to death out there on the mountainside.", "lear_examp": "The weather is warm in the summer but when the winter comes... get ready to freeze!"}, {"sense": "to suddenly stop moving, especially because you are frightened", "level": "B2", "dict_examp": "She saw someone outside the window and froze.", "lear_examp": "I froze with terror."}]}]}, {"word": "frail", "poses": [{"pos": "adjective", "senses": [{"sense": "not strong or healthy", "level": "C2", "dict_examp": "a frail old lady", "lear_examp": "Looking at her, she was frail and looked confused."}]}]}, {"word": "fragrance", "poses": [{"pos": "noun", "senses": [{"sense": "a pleasant smell", "level": "C2", "dict_examp": "the delicate fragrance of roses", "lear_examp": "We were inundated with the fresh air, an untold fragrance mixed with the warm breeze and the unique-styled buildings."}]}]}, {"word": "fragile", "poses": [{"pos": "adjective", "senses": [{"sense": "easily broken, damaged, or destroyed", "level": "C2", "dict_examp": "a fragile china cup", "lear_examp": "The majority of these countries still have a very fragile economy."}, {"sense": "physically or emotionally weak", "level": "C2", "dict_examp": "a fragile little girl", "lear_examp": "She seemed to be so fragile with an everlasting smile on her face."}]}]}, {"word": "freezing", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely cold", "level": "B1", "dict_examp": "It's absolutely freezing in here - can I close the window?", "lear_examp": "At the moment, I am here in England and it is absolutely freezing."}]}]}, {"word": "foundation", "poses": [{"pos": "noun", "senses": [{"sense": "when an organization, state, or country is established", "level": "C1", "dict_examp": "the foundation of a new state", "lear_examp": "Moreover the foundation of schools and stadiums will benefit young people."}, {"sense": "an organization that gives money for a particular purpose", "level": "C1", "dict_examp": "the Mental Health Foundation", "lear_examp": "His Foundation has helped millions of HIV sufferers in every corner of the world since it was founded in 1992; it helps to raise funds for orphanages all over the world, it creates programs to educate people about prevention and how to look after those infected."}, {"sense": "the idea or principle that something is based on", "level": "C2", "dict_examp": "Jefferson's document formed the foundation of a new nation.", "lear_examp": "Love, understanding and respect will be the foundation of the upbringing of my children."}, {"sense": "If something is without foundation, there is no proof that it is true.", "level": "C2", "dict_examp": "The allegations are completely without foundation.", "lear_examp": ""}]}]}, {"word": "found", "poses": [{"pos": "verb", "senses": [{"sense": "to bring something into existence", "level": "B2", "dict_examp": "York was founded by the Romans in the year 71 AD.", "lear_examp": "Red Stone was founded ten years ago."}, {"sense": "to base something on a set of ideas or beliefs", "level": "C2", "dict_examp": "a society founded on principles of equality", "lear_examp": "While Piggy is holding the conch, the symbol of a human community, founded on discussion, agreement and rules, and speaking up to Jack, Roger sets the rock in motion which destroys Piggy and his conch."}]}]}, {"word": "fourteen", "poses": [{"pos": "number", "senses": [{"sense": "the number 14", "level": "A1", "dict_examp": "twelve, thirteen, fourteen, fifteen", "lear_examp": "Several days ago I had my birthday and I am now fourteen."}]}]}, {"word": "frenzy", "poses": [{"pos": "noun", "senses": [{"sense": "when you are so excited, nervous, or anxious that you cannot control what you are doing", "level": "C2", "dict_examp": "She hit him in a frenzy of rage.", "lear_examp": "For the next thirty-two hours, a frenzy took hold of the house."}]}]}, {"word": "freedom", "poses": [{"pos": "noun", "senses": [{"sense": "the condition or right of being able or allowed to do, say, think, etc. whatever you want to, without being controlled or limited", "level": "B2", "dict_examp": "Children are allowed much more freedom these days.", "lear_examp": "The car gives some freedom of choice: I can move quickly from one place to another, I don't waste time on public transport and in winter it protects me from the cold and rain."}, {"sense": "a situation in which you are not suffering because of something unpleasant or harmful", "level": "C2", "dict_examp": "freedom from fear/poverty", "lear_examp": "Despite our modern medicine and the progress it has made within the last century, there is no guarantee of freedom from disease or freedom from illness."}]}]}, {"word": "freezer", "poses": [{"pos": "noun", "senses": [{"sense": "a large container operated by electricity in which food can be frozen and stored", "level": "B1", "dict_examp": "There's some ice cream in the freezer.", "lear_examp": "It is about that beautiful vase you had on the freezer in the kitchen."}]}]}, {"word": "freely", "poses": [{"pos": "adverb", "senses": [{"sense": "without being controlled or limited", "level": "B2", "dict_examp": "For the first time in months she could move freely.", "lear_examp": "We have always been able to speak freely with each other and this letter is no exception."}]}]}, {"word": "frantic", "poses": [{"pos": "adjective", "senses": [{"sense": "done in a fast and excited way and not calm or organized", "level": "C2", "dict_examp": "a frantic search", "lear_examp": "Fred started to shiver as frantic images of the past flashed through his mind."}, {"sense": "very worried or frightened", "level": "C2", "dict_examp": "frantic calls for help", "lear_examp": "Donna's mother had heard her frantic shouts, and now said soothingly: \"Have you forgotten Elaine has spent the night at her friend's house?\""}]}]}, {"word": "fraud", "poses": [{"pos": "noun", "senses": [{"sense": "when someone does something illegal in order to get money", "level": "C2", "dict_examp": "credit card fraud", "lear_examp": "Michael was completely speechless when he realized that Claire had all the proof of the fraud he had committed."}, {"sense": "someone or something that deceives people by pretending to be someone or something that they are not", "level": "C2", "dict_examp": "She claimed to be a journalist, but she was just a fraud.", "lear_examp": "My marriage was a fraud, a case of bigamy."}]}]}, {"word": "fourth", "poses": [{"pos": "ordinal number", "senses": [{"sense": "4th written as a word", "level": "A2", "dict_examp": "My birthday is on the fourth of December.", "lear_examp": "The new art class is in classroom A on the fourth floor."}]}]}, {"word": "fraudulent", "poses": [{"pos": "adjective", "senses": [{"sense": "dishonest and illegal", "level": "C2", "dict_examp": "fraudulent insurance claims", "lear_examp": "This vice increases more and more as fanatics spend more money for sports-related topics, and so, most valuable players become more expensive and then they begin to be involved in cheating and fraudulent activities."}]}]}, {"word": "fragrant", "poses": [{"pos": "adjective", "senses": [{"sense": "with a pleasant smell", "level": "C2", "dict_examp": "fragrant flowers", "lear_examp": "From his terrace you can see the marvelous sea of Dublin Bay and appreciate the fragrant odor of the beautiful flowers that embellish the place."}]}]}, {"word": "fountain", "poses": [{"pos": "noun", "senses": [{"sense": "a structure that forces water up into the air as a decoration", "level": "B1", "dict_examp": "There is a beautiful fountain in the middle of the square.", "lear_examp": "The place I enjoyed the most was the park, because it had a nice atmosphere with all those happy kids, and  the most terrific fountain I've ever seen."}]}]}, {"word": "frightened", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling fear or worry", "level": "B1", "dict_examp": "Are you frightened of spiders?", "lear_examp": "We were both frightened and didn't know what to do."}]}]}, {"word": "fresh", "poses": [{"pos": "adjective", "senses": [{"sense": "Fresh food has been produced or collected recently and has not been frozen, dried, etc.", "level": "A2", "dict_examp": "fresh fruit/vegetables/fish/bread", "lear_examp": "Sometimes they go to the sea to get really fresh fish."}, {"sense": "new or different from what was there before", "level": "B1", "dict_examp": "We're looking for fresh ideas.", "lear_examp": "In fact, it was the chance of a new life, the opportunity to make a fresh start."}, {"sense": "smelling clean or feeling pleasantly cool", "level": "B1", "dict_examp": "a fresh smell/breeze", "lear_examp": "The water was wonderfully fresh."}, {"sense": "air outside buildings or away from the city that is clean and cool", "level": "B1", "dict_examp": "Let's go outside and get some fresh air.", "lear_examp": "I think it would be better to go to the south east to the countryside and have a nice relaxing time with lots of fresh air."}, {"sense": "recently made, done, arrived, etc., and especially not yet changed by time", "level": "B2", "dict_examp": "There was a fresh fall of snow during the night.", "lear_examp": "I don't know if it is the most embarrassing moment of my life, but it is still fresh in my memory and I get embarrassed every time I think of it."}, {"sense": "having a lot of energy and not feeling tired", "level": "C1", "dict_examp": "We got up the next day feeling fresh and relaxed.", "lear_examp": "Before the test, you should have your breakfast with a cup of coffee to make yourself feel fresh."}, {"sense": "Fresh skin looks healthy.", "level": "C2", "dict_examp": "a fresh complexion", "lear_examp": "Her eyes were blue and she had a beautiful fresh complexion."}, {"sense": "water from lakes, rivers, etc. that has no salt in it", "level": "C2", "dict_examp": "These fish live in fresh water.", "lear_examp": "You find stunning white beaches, clear, fresh water lakes, isolated tropic islands, reef, rainforests, buzzing cities, challenging mountain range, bush, outback - and the desert."}, {"sense": "someone or something that is new, different, and exciting", "level": "C2", "dict_examp": "Having Eve around has been a breath of fresh air.", "lear_examp": "Should this be everything the Town Council has promised, it will bring a breath of fresh air for our local youth."}]}]}, {"word": "frequently", "poses": [{"pos": "adverb", "senses": [{"sense": "often", "level": "B1", "dict_examp": "frequently asked questions", "lear_examp": "I met a beautiful girl and now we are seeing each other frequently, about twice a week."}]}]}, {"word": "friction", "poses": [{"pos": "noun", "senses": [{"sense": "disagreement or dislike caused by people having different opinions", "level": "C1", "dict_examp": "There’s less friction in relationships when you use teamwork.", "lear_examp": "Money spent on shopping can also be the cause of friction or arguments between husbands and wives."}]}]}, {"word": "friend", "poses": [{"pos": "noun", "senses": [{"sense": "someone  who you know well and like", "level": "A1", "dict_examp": "She's my best/closest friend - we've known each other since we were five.", "lear_examp": "On the weekend she is free so she goes out with friends."}, {"sense": "a person you write to on an Internet site", "level": "A2", "dict_examp": "I've just added Adam as a friend on Facebook.", "lear_examp": ""}, {"sense": "someone who you have known and liked for a long time", "level": "B1", "dict_examp": "Roger and I are old friends.", "lear_examp": "My old friends from Moscow paid me a visit in London."}, {"sense": "to know and like someone", "level": "B1", "dict_examp": "I've been friends with Jo for years.", "lear_examp": "He was really happy too, so we began to be friends."}, {"sense": "to begin to know and like someone", "level": "B1", "dict_examp": "He finds it difficult to make friends.", "lear_examp": "Although I didn't know anyone in this club, I immediately made friends with Maria and Rosaria."}]}]}, {"word": "frighten", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone feel fear", "level": "B2", "dict_examp": "He frightens me when he drives so fast.", "lear_examp": "I have no interest in lizards. Whatever their characters are, their appearance always frightens me."}]}]}, {"word": "frontier", "poses": [{"pos": "noun", "senses": [{"sense": "a line or border between two countries", "level": "C2", "dict_examp": "They placed guards on the frontier.", "lear_examp": "He took it and escaped towards the German frontier."}, {"sense": "the limits of what is known or what has been done before in an area of knowledge or activity", "level": "C2", "dict_examp": "the frontiers of science and technology", "lear_examp": "Introduction: throughout history, scientists, artists and other people tried hard to push back the frontiers of knowledge, in order to succeed in making or creating something that all humankind will benefit from somehow."}]}]}, {"word": "fried", "poses": [{"pos": "adjective", "senses": [{"sense": "cooked in hot oil or fat", "level": "A2", "dict_examp": "a fried egg", "lear_examp": "I normally order fried fish."}]}]}, {"word": "Friday", "poses": [{"pos": "noun", "senses": [{"sense": "the day of the week after Thursday and before Saturday", "level": "A1", "dict_examp": "Do you want to go to the theater on Friday?", "lear_examp": "The class is on Friday, from 2 to 4 p.m."}]}]}, {"word": "friendly", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving in a pleasant, kind way toward someone", "level": "A2", "dict_examp": "They were friendly people.", "lear_examp": "It was nice, because they played good music and the people were friendly."}]}]}, {"word": "fringe", "poses": [{"pos": "noun", "senses": [{"sense": "hair that is cut short and straight at the top of someone's face", "level": "C2", "dict_examp": "Her fringe was nearly in her eyes.", "lear_examp": "She had a long fringe over her forehead that almost covered her pale blue eyes."}, {"sense": "the outside edge of an area, group, or subject and not the main part", "level": "C2", "dict_examp": "the southern fringe of the city", "lear_examp": "He is on the fringe of society."}]}, {"pos": "adjective", "senses": [{"sense": "not belonging to the main part of a group, activity, or subject", "level": "C2", "dict_examp": "fringe politics/theatre", "lear_examp": "Unfortunately it seems to have won \"new\" currency in view of the latest events directed against foreigners, minorities and fringe groups."}]}]}, {"word": "fridge", "poses": [{"pos": "noun", "senses": [{"sense": "a refrigerator", "level": "B1", "dict_examp": "Don't forget to put the milk back in the fridge.", "lear_examp": "I decided that next month I'll buy a small fridge, so at midnight I can drink a water or a coke."}]}]}, {"word": "friendliness", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being friendly", "level": "B2", "dict_examp": "It was the  friendliness of the people that struck me.", "lear_examp": "Your description of the people, their everyday life, their characters and their friendliness reflects that you really had an excellent time here."}]}]}, {"word": "friendship", "poses": [{"pos": "noun", "senses": [{"sense": "when two people are friends", "level": "B1", "dict_examp": "a close friendship", "lear_examp": "I hope our friendship will become stronger and maybe he should become my boyfriend!"}]}]}, {"word": "fright", "poses": [{"pos": "noun", "senses": [{"sense": "a sudden feeling of shock and fear", "level": "C1", "dict_examp": "That dog gave me a terrible fright.", "lear_examp": "She suddenly realized she was being followed, so, speechless with fright, began to stride along back to her car."}]}]}, {"word": "frightening", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel fear", "level": "B1", "dict_examp": "a frightening thought", "lear_examp": "I like frightening films, so I'm going to buy it."}]}]}, {"word": "from", "poses": [{"pos": "preposition", "senses": [{"sense": "used to show the place where someone or something starts", "level": "A1", "dict_examp": "What time does the flight from Amsterdam arrive?", "lear_examp": "I like fresh food from my garden."}, {"sense": "used to show the origin of someone or something", "level": "A1", "dict_examp": "\"Where are you from?\" \"I'm from Italy.\"", "lear_examp": "She comes from Poland."}, {"sense": "used to show the time when something starts or the time when it was made or first existed", "level": "A1", "dict_examp": "Drinks will be served from seven o'clock.", "lear_examp": "It's from 5:00 p.m. to 7:00 p.m."}, {"sense": "used to show the distance between two places", "level": "A1", "dict_examp": "It's about two kilometers from the airport to your hotel.", "lear_examp": "It's about 3 kilometers from the city center."}, {"sense": "used to show the material of which something is made", "level": "A2", "dict_examp": "juice made from oranges and mangoes", "lear_examp": "The present I loved the most was a cute little cat that is made from glass."}, {"sense": "used when you are saying how similar or different two things, people or places are", "level": "B1", "dict_examp": "College is very different from high school.", "lear_examp": "His clothes are very different from everyone else's."}, {"sense": "used to show the cause of something or the reason why something happens", "level": "B2", "dict_examp": "He was rushed to the hospital but died from his injuries.", "lear_examp": "Many people have died from car accidents."}, {"sense": "used to show a change in the state of someone or something", "level": "B2", "dict_examp": "Things went from bad to worse.", "lear_examp": "On the other hand the number of animals living in freedom, for example the number of tigers, elephants and lions in Africa or Asia, is decreasing more and more, because their living conditions have gone from bad to worse."}, {"sense": "used to show the position of something in comparison with other things, or the point of view of someone when considering a matter or problem", "level": "B2", "dict_examp": "From the restaurant there is a beautiful view of Siena.", "lear_examp": "The job was hard, but from my point of view, it was worth it."}, {"sense": "used to show what someone is not allowed to do or know, or what has been stopped happening", "level": "B2", "dict_examp": "For many years, the truth was kept from the public.", "lear_examp": "Wouldn't it be better if cars were banned from the Central Business District in order to avoid traffic jams and stress?"}, {"sense": "If something moves from side to side, it moves from left to right and back again repeatedly.", "level": "B2", "dict_examp": "swinging from side to side", "lear_examp": "I began to understand it when I went to Kenya in 1986, because I had the wonderful chance to look at the animals in their natural surroundings, without being in a cage, walking nervously from side to side."}, {"sense": "sometimes but not often", "level": "B2", "dict_examp": "From time to time I still think of her.", "lear_examp": "I wash the dishes from time to time (I sometimes try to avoid this unpleasant duty) and clean our house."}, {"sense": "beginning at a particular time and continuing into the future", "level": "C1", "dict_examp": "The committee will meet on Monday and weekly from then onward.", "lear_examp": "14-24 year olds stays almost at the 90% attendance point before it picks up from 2008 onward."}, {"sense": "If you do something from scratch, you do it from the beginning.", "level": "C1", "dict_examp": "We didn't have any furniture of our own so we had to start from scratch.", "lear_examp": "That means you don't have to start from scratch with your teacher."}, {"sense": "completely", "level": "C2", "dict_examp": "I've searched the house from top to bottom and still can't find it.", "lear_examp": "Very often we can see someone in black, from top to bottom, or in white."}]}]}, {"word": "frog", "poses": [{"pos": "noun", "senses": [{"sense": "a small, green animal with long back legs for jumping that lives in or near water", "level": "B1", "dict_examp": "The frogs down at the lake were making a lot of  noise.", "lear_examp": "They made a plan, and in the afternoon, they went to the little lake near their town, and they caught a little frog."}]}]}, {"word": "front", "poses": [{"pos": "noun", "senses": [{"sense": "the side of something that is most important or most often seen because it faces forward", "level": "A2", "dict_examp": "The front of the museum is very impressive.", "lear_examp": "If you want to come with me, call me or come to the front of the Rialto at 8:45 am - I will be there."}, {"sense": "the part of something that is most forward", "level": "A2", "dict_examp": "He was standing right at the front.", "lear_examp": "Thomas plays in the front. He makes nearly all the goals for our team."}, {"sense": "close to the front part of something, or where someone can see or hear you", "level": "A2", "dict_examp": "There's parking in front of the hotel.", "lear_examp": "There are four villas in front of our building."}, {"sense": "further forward than someone or something else", "level": "B1", "dict_examp": "The car in front suddenly stopped and I ran into the back of it.", "lear_examp": "As the concert finished, I heard someone call my name. I believed it was my imagination or perhaps a dream because I couldn't see anyone in front, behind or opposite me."}]}, {"pos": "adjective", "senses": [{"sense": "in or at the front of something", "level": "B1", "dict_examp": "the front door/garden", "lear_examp": "So let's meet at the front gate, at 9:15 pm."}]}]}, {"word": "frontier", "poses": [{"pos": "noun", "senses": [{"sense": "a line or border between two countries", "level": "C2", "dict_examp": "They placed guards on the frontier.", "lear_examp": "He took it and escaped towards the German frontier."}, {"sense": "the limits of what is known or what has been done before in an area of knowledge or activity", "level": "C2", "dict_examp": "the frontiers of science and technology", "lear_examp": "Introduction: throughout history, scientists, artists and other people tried hard to push back the frontiers of knowledge, in order to succeed in making or creating something that all humankind will benefit from somehow."}]}]}, {"word": "fruit", "poses": [{"pos": "noun", "senses": [{"sense": "something such as an apple or orange that grows on a tree or a bush, contains seeds, and can be eaten as food", "level": "A1", "dict_examp": "fresh fruit", "lear_examp": "After those, maybe some fresh fruit salad with fruit juice."}, {"sense": "If something that someone does bears fruit, it produces successful results.", "level": "C2", "dict_examp": "Our decision is just beginning to bear fruit.", "lear_examp": "Being friendly at work may not necessarily be easy, but it always bears fruit."}, {"sense": "the good result of someone's work or actions", "level": "C2", "dict_examp": "The fruits of economic growth are starting to make a difference in the lives of many workers.", "lear_examp": "After weeks and months of rehearsals, at last I was able to see the fruits of their work, as well as mine."}]}]}, {"word": "fruitful", "poses": [{"pos": "adjective", "senses": [{"sense": "producing good or useful results", "level": "C1", "dict_examp": "We had a very fruitful discussion.", "lear_examp": "We had a fruitful talk about his previous achievements in his first job, after which he found out how creative he was."}]}]}, {"word": "full-time", "poses": [{"pos": "adjective", "senses": [{"sense": "happening or working for the whole of the working week and not only part of it", "level": "B1", "dict_examp": "a full-time job", "lear_examp": "So I decided to take a full-time course."}]}]}, {"word": "fry", "poses": [{"pos": "verb", "senses": [{"sense": "to cook food in hot oil or fat, or to be cooked in hot oil or fat", "level": "B1", "dict_examp": "Fry the mushrooms in a little butter.", "lear_examp": "I was frying some chicken as my wife was trying to listen to the radio news."}]}]}, {"word": "fun", "poses": [{"pos": "noun", "senses": [{"sense": "enjoyment or pleasure, or something that gives you enjoyment or pleasure", "level": "A1", "dict_examp": "Have fun!", "lear_examp": "I hope we have a great meal and a lot of fun."}, {"sense": "for pleasure and not for any other reason.", "level": "B1", "dict_examp": "I ran but just for fun.", "lear_examp": "Fortunately I discovered that the e-mail wasn't for me. I didn't appreciate that there were people that were sending things like that just for fun."}, {"sense": "to make a joke about someone or something in an unkind way", "level": "B2", "dict_examp": "The other children at school used to make fun of his hair.", "lear_examp": "I didn't want to tell other people because I didn't want them to make fun of me."}]}, {"pos": "adjective", "senses": [{"sense": "enjoyable or entertaining", "level": "A2", "dict_examp": "There are lots of fun things to do here.", "lear_examp": "I can remember my birthday party and all the fun things we did."}]}]}, {"word": "function", "poses": [{"pos": "noun", "senses": [{"sense": "the purpose of something or the particular responsibility of someone", "level": "B2", "dict_examp": "Each button has a different function.", "lear_examp": "Apart from that, zoos have got an educational function."}, {"sense": "a large, formal party or ceremony", "level": "C1", "dict_examp": "a charity function", "lear_examp": "Almost 600 people gathered at my main wedding function."}]}, {"pos": "verb", "senses": [{"sense": "to work or operate", "level": "C1", "dict_examp": "She quickly learned how the office functions.", "lear_examp": "It is important to have continuous retail sales for any economy to function."}, {"sense": "to use for a particular purpose or in a particular way", "level": "C2", "dict_examp": "Our spare bedroom also functions as a study.", "lear_examp": "In my point of view, the old building can function as a cafeteria for young people due to the fact that its location is in close proximity to the city center and people have the opportunity to pay a visit to the café and communicate with other people."}]}]}, {"word": "frost", "poses": [{"pos": "noun", "senses": [{"sense": "a thin, white layer of ice that forms on surfaces at night when it is very cold, or a time when the temperature is very cold and water freezes", "level": "B2", "dict_examp": "When I woke up this morning the ground was covered with frost.", "lear_examp": "Thirdly, you do not have to worry about rain, wind, frost or other bad weather conditions."}]}]}, {"word": "fulfill", "poses": [{"pos": "verb", "senses": [{"sense": "to do something that you have promised to do or that you are expected to do", "level": "C1", "dict_examp": "His opponents say the governor has failed to fulfill his campaign promises.", "lear_examp": "Hans is a very honest and reliable person and always fulfills his duties with passion and care as he is almost never unmotivated or in a bad mood."}, {"sense": "to do something that you really wanted to do", "level": "C1", "dict_examp": "At the age of 45, she finally fulfilled her ambition to run a marathon.", "lear_examp": "Adolescents are now exposed to the reality of life where one needs a sufficient amount of money to fulfill their ambitions, goals and aspirations."}, {"sense": "to do something that is necessary or useful", "level": "C1", "dict_examp": "You seem to fulfill a very useful role in the organization.", "lear_examp": "Besides the numbers, the capability level of the computer system does not fulfill the necessities of the department's working load and level."}, {"sense": "to have all the qualities that are wanted or needed for something", "level": "C1", "dict_examp": "He stayed an extra semester to fulfill his requirements for a second degree.", "lear_examp": "Therefore, after consideration of all these results, I would suggest choosing the Forest Manor Country Park as the suitable place for the party.  It fulfills all the criteria expressed above, and has a swimming pool too."}, {"sense": "to succeed in developing abilities or qualities to their fullest degree", "level": "C2", "dict_examp": "Her immediate goal was to complete her novel, but her long-term goal was to fulfill her potential as a writer.", "lear_examp": "I would like to thank you in advance for your assistance to fulfill my potential.  If the reasons why travel very often fails to fulfill are so clear, why should we keep on behaving this way? (583178; Certificate of Proficiency in English; Italy; C2 MASTERY; 1993; Italian; Pass)"}]}]}, {"word": "fundamental", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the most important or main part of something", "level": "C2", "dict_examp": "a fundamental change/difference", "lear_examp": "However I liked it a lot because music is fundamental to me."}]}]}, {"word": "functional", "poses": [{"pos": "adjective", "senses": [{"sense": "designed to be practical and useful", "level": "B2", "dict_examp": "functional clothing", "lear_examp": "Like many other people, I used to see my camera as a very functional object without being really fond of it."}]}]}, {"word": "frustrated", "poses": [{"pos": "adjective", "senses": [{"sense": "annoyed because things are not happening in the way that you want, or in the way that they should", "level": "C1", "dict_examp": "I'm very frustrated at/with my lack of progress.", "lear_examp": "What, however, made us very frustrated was that there was no opportunity for us to take an exam at the end of this month."}]}]}, {"word": "frying pan", "poses": [{"pos": "noun", "senses": [{"sense": "a flat, metal pan with a long handle that is used for frying food", "level": "B1", "dict_examp": "Chop the mushrooms and put them in the frying pan.", "lear_examp": ""}]}]}, {"word": "fumes", "poses": [{"pos": "noun", "senses": [{"sense": "strong, unpleasant, and often dangerous gas or smoke", "level": "C1", "dict_examp": "car exhaust fumes", "lear_examp": "Cars emit fumes that are very dangerous."}]}]}, {"word": "fulfillment", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of happiness because you are receiving or achieving what you want in life", "level": "C2", "dict_examp": "Workaholics find fulfillment in their work.", "lear_examp": "Having a satisfactory job, the need to seek fulfillment from material things will subside."}, {"sense": "the act of doing something necessary or something that you have promised or wanted to do", "level": "C2", "dict_examp": "Being here is the fulfillment of a lifelong ambition.", "lear_examp": "In general a success is perceived as fulfillment of someone's positive role in the society."}]}]}, {"word": "frustration", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being annoyed because things are not happening in the way that you want, or in the way that they should", "level": "B2", "dict_examp": "I could sense his frustration at not being able to help.", "lear_examp": "So we had to leave hungry and with a certain feeling of frustration and disappointment."}]}]}, {"word": "fuel", "poses": [{"pos": "noun", "senses": [{"sense": "a substance that is burned to provide heat or power", "level": "B1", "dict_examp": "Wood, coal, oil and gas are all different kinds of fuel.", "lear_examp": "And third, if a rising number of people  use a bike instead of their car, traffic density will decrease which is, again, good for the environment because there will be fewer traffic jams and therefore less fuel consumption and less pollution."}]}]}, {"word": "fully", "poses": [{"pos": "adverb", "senses": [{"sense": "completely", "level": "B1", "dict_examp": "The hotel was fully booked.", "lear_examp": ""}]}]}, {"word": "fulfilling", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is fulfilling, it satisfies you and makes you happy.", "level": "C2", "dict_examp": "a fulfilling job", "lear_examp": "But the choice of a fulfilling job is an important factor because most people spend 8 or 9 hours working every day and doing something that you don't like for long can be a problem."}]}]}, {"word": "full", "poses": [{"pos": "adjective", "senses": [{"sense": "If a container or a space is full, it contains as many things or people as possible, or as much of something as possible.", "level": "A2", "dict_examp": "We couldn't get in - the theater was full.", "lear_examp": "I'm selling it, because I haven't enough free time to ride it and my garage is full!"}, {"sense": "complete and including every part", "level": "A2", "dict_examp": "Please give your full name and address.", "lear_examp": "I have Diwali holiday which means I will have a full day free."}, {"sense": "containing a lot of things or people or a lot of something", "level": "A2", "dict_examp": "This sweater is full of holes.", "lear_examp": "You could  go to Venice because it is a special place full of art."}, {"sense": "the greatest possible", "level": "B1", "dict_examp": "James is very bright, but he doesn't make full use of his abilities.", "lear_examp": "You could notice he was mad about all the noise we made.  So we left at full speed!!!"}, {"sense": "completely and with nothing missing", "level": "B1", "dict_examp": "The bill must be paid in full by the end of the month.", "lear_examp": "Unfortunately, I wasn't able to read the e-mail in full, but as I understood it, he wanted to apologize for what had happened between us many years ago."}, {"sense": "having eaten enough food", "level": "B2", "dict_examp": "No more cake for me, thanks, I'm full.", "lear_examp": "After having a big lunch, he was full up."}, {"sense": "to think that you are very important in a way that annoys other people", "level": "C2", "dict_examp": "I doubt he even thought about what you might need, he’s so full of himself.", "lear_examp": "There is a thing which I consider very important for the upbringing of my own children - to \"teach\" them to be coherent and to think of the \"others\" because if you are full of yourself, you are blind and you can't see what is happening around you."}, {"sense": "to be very busy", "level": "C2", "dict_examp": "Shelley has her hands full with three kids under 5.", "lear_examp": "This very fact made my father work like a slave, as he was the only breadwinner at home, my mother having her hands full with us four."}]}]}, {"word": "frown", "poses": [{"pos": "verb", "senses": [{"sense": "to show on your face that you are annoyed or worried by moving your eyebrows  together", "level": "C2", "dict_examp": "She frowned when I mentioned his name.", "lear_examp": "She looked at him and frowned, strange, but he smiled back."}, {"sense": "to think that something is wrong and that you should not do it", "level": "C2", "dict_examp": "You can wear jeans, but I think the restaurant  frowns on shorts and sneakers.", "lear_examp": "Talking being very often frowned upon in the Zen gardens, consequently it is peaceful and so you can fully relax and completely empty your head."}]}, {"pos": "noun", "senses": [{"sense": "the expression on your face when you frown", "level": "C2", "dict_examp": "He looked at me with a puzzled frown.", "lear_examp": "If you are truly devoted to your health, logic thus dictates that you will be sitting at the dinner table with an empty plate - and certainly a frown on your face."}]}]}, {"word": "fund", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of money collected, saved, or provided for a purpose", "level": "C1", "dict_examp": "a pension fund", "lear_examp": "A fund in her name has been made for handicapped children and the amount in this fund is growing fast."}, {"sense": "money needed or available to spend on something", "level": "C1", "dict_examp": "The charity closed down due to lack of funds.", "lear_examp": "Due to the limited funds available to the committee responsible for the festivities, the location was not in accordance with the expectations."}]}, {"pos": "verb", "senses": [{"sense": "to provide the money to pay for an event, activity or organization", "level": "C1", "dict_examp": "The company has agreed to fund my trip to Australia.", "lear_examp": "This way would be a faster and more fair way to fund the changes that are to be made."}]}]}, {"word": "frustrating", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel annoyed or discouraged", "level": "C1", "dict_examp": "a frustrating situation", "lear_examp": "When you are working and you are in a hurry to get to your work place on time, waiting for the bus becomes quite annoying and frustrating."}]}]}, {"word": "frozen", "poses": [{"pos": "adjective", "senses": [{"sense": "Frozen food has been made so that it will last a long time by freezing.", "level": "B1", "dict_examp": "We don't have any fresh vegetables, only frozen peas.", "lear_examp": "Nowadays, we do not need anymore to spend hours cooking, we just put some frozen food in the microwave, and in a few minutes our meal is ready."}, {"sense": "turned into ice", "level": "B1", "dict_examp": "They skated over the frozen lake.", "lear_examp": ""}, {"sense": "If a person, or a part of their body is frozen, they are very cold.", "level": "B1", "dict_examp": "Is there any heating in here? I'm frozen!", "lear_examp": "I was frozen, but after a second I had a big silly smile on my face."}]}]}, {"word": "furiously", "poses": [{"pos": "adverb", "senses": [{"sense": "in a very angry way", "level": "B2", "dict_examp": "\"Get out of here!\" she shouted furiously.", "lear_examp": "\"Put that light out\", I shouted furiously after those sleepless nights."}]}]}, {"word": "further", "poses": [{"pos": "adjective", "senses": [{"sense": "more or extra", "level": "A2", "dict_examp": "For further details about the offer, call this number.", "lear_examp": "For further information, contact Joey Hung."}, {"sense": "additional", "level": "C1", "dict_examp": "A further 20 stores will open next year.", "lear_examp": "As a matter of fact, only 5% of the total income was taken to pay for administration costs, and a further 10% to pay for the cost of entertainment."}]}, {"pos": "adverb", "senses": [{"sense": "(comparative of far) at or to a place or time that is a longer distance away", "level": "B1", "dict_examp": "Let's walk a bit further down the road.", "lear_examp": "When we left your place we drove on the motorway to Trier and further on to Luxembourg."}, {"sense": "more", "level": "B2", "dict_examp": "He refused to discuss the matter further.", "lear_examp": "I demand a full refund or I will be forced to take this matter further."}]}, {"pos": "verb", "senses": [{"sense": "to make something develop or become more successful", "level": "C2", "dict_examp": "He'll do anything to further his career.", "lear_examp": "This could be because some Education graduates were already in the  education field and pursuing a graduate course was a means of furthering their career or knowledge."}]}]}, {"word": "fuss", "poses": [{"pos": "noun", "senses": [{"sense": "when people become excited, annoyed, or anxious about something, especially something unimportant", "level": "C1", "dict_examp": "What was all the fuss about?", "lear_examp": "The Internet contains more information than any library, more easily accessible and without the fuss of library cards or the risk of losing books."}]}]}, {"word": "fur", "poses": [{"pos": "noun", "senses": [{"sense": "the thick hair that covers the bodies of some animals, like cats or rabbits", "level": "B1", "dict_examp": "She stroked the rabbit's soft fur.", "lear_examp": "I find the killing of animals for fur an awful, disgusting thing."}]}]}, {"word": "furious", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely angry", "level": "B2", "dict_examp": "I was late and he was furious with me.", "lear_examp": "He was absolutely furious, having learned about our engagement."}]}]}, {"word": "furthest", "poses": [{"pos": "adverb", "senses": [{"sense": "most distant", "level": "B1", "dict_examp": "That's the furthest I can see without glasses.", "lear_examp": ""}]}]}, {"word": "fundamentally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a basic and important way", "level": "C2", "dict_examp": "Nothing has fundamentally changed.", "lear_examp": "Japanese gardens are fundamentally different from those designed in Europe."}]}]}, {"word": "furthermore", "poses": [{"pos": "adverb", "senses": [{"sense": "in addition to what has just been said", "level": "B2", "dict_examp": "Furthermore, we have a duty to defend our country.", "lear_examp": "I am 22 years of age and I have a degree in tourism. Furthermore, I have a working knowledge of English, Spanish, Catalan and Italian."}]}]}, {"word": "funeral", "poses": [{"pos": "noun", "senses": [{"sense": "a ceremony for burying or burning the body of a dead person", "level": "B2", "dict_examp": "The funeral will be held next Friday.", "lear_examp": "She was crying at his funeral."}]}]}, {"word": "fussy", "poses": [{"pos": "adjective", "senses": [{"sense": "only liking particular things and very difficult to please", "level": "C2", "dict_examp": "She's a very fussy eater.", "lear_examp": "When visiting a foreign country it may be difficult not to be fussy about food as well, and again, that is because of habits."}, {"sense": "too careful about unimportant details", "level": "C2", "dict_examp": "He's very fussy about keeping his car clean.", "lear_examp": "And this importance of presentation and almost fussy preciseness are reflected in our tradition."}]}]}, {"word": "furnished", "poses": [{"pos": "adjective", "senses": [{"sense": "If a room or building is furnished, there is furniture in it.", "level": "C1", "dict_examp": "He's renting a fully furnished apartment by the river.", "lear_examp": "I am looking for a two bedroom, fully furnished apartment."}]}]}, {"word": "fury", "poses": [{"pos": "noun", "senses": [{"sense": "extreme anger or force", "level": "C2", "dict_examp": "The storm raged with mounting fury.", "lear_examp": "It does not happen a lot that I sit down in anger and fury to write an open letter to the \"Esslebury Gazette.\""}]}]}, {"word": "future", "poses": [{"pos": "noun", "senses": [{"sense": "in grammar, the form of the verb used when talking about something that will happen or exist", "level": "A2", "dict_examp": "In the sentence \"Who will look after the dog?\" the verb phrase \"will look\" is in the future.", "lear_examp": ""}, {"sense": "the time that is to come", "level": "B1", "dict_examp": "Do you worry about the future?", "lear_examp": "We talked about old times and about the future."}, {"sense": "beginning from now", "level": "B1", "dict_examp": "I promise I'll be more careful in the future.", "lear_examp": "So hopefully she will follow my advice a little bit better in the future."}, {"sense": "the chance of continuing to exist or succeed", "level": "B1", "dict_examp": "There's no future in this line of work.", "lear_examp": "After his father's death, he didn't want to study, so he left university, losing a good future."}, {"sense": "what will happen to someone or something in the time that is to come", "level": "B2", "dict_examp": "We need to discuss the future of the company.", "lear_examp": "I think the 24/7 concept is the future of shops, and the main reason is that it can suit the type of life of any person."}, {"sense": "at a time that is not far away", "level": "B2", "dict_examp": "Space travel may become very common in the near future.", "lear_examp": "I look forward to receiving your reply in the near future."}, {"sense": "as far in the future as you can imagine", "level": "C2", "dict_examp": "Prices will remain high for the foreseeable future.", "lear_examp": "But in my view these same jobs will find themselves subjected to the same pressures and thus will have the same destiny in the foreseeable future."}]}, {"pos": "adjective", "senses": [{"sense": "happening or existing in the time which is to come", "level": "B1", "dict_examp": "future plans", "lear_examp": "I think that it will be very important for my future career."}]}]}, {"word": "funny", "poses": [{"pos": "adjective", "senses": [{"sense": "making you smile or laugh", "level": "A1", "dict_examp": "Do you know any funny stories/jokes?", "lear_examp": "We danced, drank coca-cola, and watched a  very funny film."}, {"sense": "strange, surprising, unexpected or difficult to explain or understand", "level": "B1", "dict_examp": "He's got some funny ideas about how to bring up children.", "lear_examp": "We often see people talking about fitness and health, but the funny thing for me is that everybody really looks worried about it although they don't do anything to make it better."}]}]}, {"word": "funding", "poses": [{"pos": "noun", "senses": [{"sense": "money available for a particular purpose", "level": "C1", "dict_examp": "The company received state funding for the project.", "lear_examp": "The Club doesn't need auxiliary funding, because it uses the money from membership fees."}]}]}, {"word": "furniture", "poses": [{"pos": "noun", "senses": [{"sense": "objects such as chairs, tables, and beds that you put into a room or building", "level": "A2", "dict_examp": "They have a lot of antique furniture.", "lear_examp": "I hurt myself one week ago so I can't help you but pupils can install chairs and the other furniture."}]}]}]