[{"word": "game", "poses": [{"pos": "noun", "senses": [{"sense": "an entertaining activity or sport that people play", "level": "A1", "dict_examp": "computer games", "lear_examp": "Martin likes to play games on his Xbox every day."}, {"sense": "a particular competition, match or occasion when people play a game", "level": "A2", "dict_examp": "We played a game of volleyball.", "lear_examp": "I also saw a basketball game between the Rockets and the Knicks."}, {"sense": "to not deal with a situation seriously or honestly", "level": "C2", "dict_examp": "Someone's life is in danger here - we're not playing games.", "lear_examp": "I couldn't possibly get all that money together, and the kidnappers were not playing games."}]}]}, {"word": "gaze", "poses": [{"pos": "verb", "senses": [{"sense": "to look for a long time at something or someone or in a particular direction", "level": "B2", "dict_examp": "He was gazing out of the window.", "lear_examp": "He gazed at her and took her hand."}]}, {"pos": "noun", "senses": [{"sense": "a long look at someone or something", "level": "C2", "dict_examp": "a steady/watchful gaze", "lear_examp": "For a moment, he had this empty gaze of someone who is in trouble and who has to find a solution."}]}]}, {"word": "garlic", "poses": [{"pos": "noun", "senses": [{"sense": "a vegetable like a small onion with a very strong taste and smell", "level": "A2", "dict_examp": "a clove of garlic", "lear_examp": ""}]}]}, {"word": "garment", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of clothing", "level": "C1", "dict_examp": "They were luxurious garments, made of silk and velvet.", "lear_examp": "Their garments consisted of four layers of robes."}]}]}, {"word": "gate", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a fence or outside wall that opens and closes like a door", "level": "A2", "dict_examp": "Please close the gate.", "lear_examp": "Let's meet at the school gate."}, {"sense": "a part of an airport where passengers get on or off an aircraft", "level": "B1", "dict_examp": "The flight to Dublin is now boarding at gate 8.", "lear_examp": "I got to the airport and started looking for gate 23 and there he was, my friend that had come back from London with a surprise for me."}]}]}, {"word": "gender", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being male or female", "level": "B2", "dict_examp": "Does this test show the gender of the baby?", "lear_examp": "There were many speakers who talked about all sorts of subjects such as politics, religion, gender identity, and art."}, {"sense": "the division of nouns, pronouns and adjectives into masculine, feminine and neuter types", "level": "B2", "dict_examp": "In English, nouns don't have gender, but in French and Spanish, they do.", "lear_examp": ""}]}]}, {"word": "gain", "poses": [{"pos": "verb", "senses": [{"sense": "to get something useful or positive, especially over a period of time", "level": "B1", "dict_examp": "After you've gained some experience teaching abroad you can come home and get a job.", "lear_examp": "You must explain to them that you need to gain some experience."}, {"sense": "to increase in something such as size, weight, or amount", "level": "B1", "dict_examp": "He's gained a lot of weight in the last few months.", "lear_examp": "I'm sure it is one of the best ways not to gain weight."}]}, {"pos": "noun", "senses": [{"sense": "when you get something useful or positive", "level": "C1", "dict_examp": "financial/personal gain", "lear_examp": "The aim of this report is to describe the gain or loss of respect of some jobs in Spain, explaining why this has occurred and talking about the future changes in job status."}, {"sense": "an increase in something such as size, weight, or amount", "level": "C1", "dict_examp": "Side effects of the medication may include tiredness, headaches or weight gain.", "lear_examp": "Consumption of pre-cooked meals, fast food, and canned food not only results in weight gain but also causes health problems."}]}]}, {"word": "gather", "poses": [{"pos": "verb", "senses": [{"sense": "to join other people somewhere to make a group, or to bring people together into a group", "level": "B2", "dict_examp": "A crowd had gathered to hear her speak.", "lear_examp": "People had gathered in front of a particular painting."}, {"sense": "to collect several things, often from different places or people", "level": "B2", "dict_examp": "We gathered our things together and left quickly.", "lear_examp": "I have gathered over three hundred species: flowers, roots, leaves and other things."}, {"sense": "to believe something because of information you have heard or seen", "level": "C1", "dict_examp": "From the look on their faces, she gathered (that) they were annoyed with her.", "lear_examp": "The  payment would be OK, I gather, but we would rely on tips to earn enough money."}, {"sense": "to increase in speed/momentum/support, etc.", "level": "C1", "dict_examp": "Finally, the train began to gather speed, and we were on our way.", "lear_examp": "The use of rail was a bit fluctuating until around 1995, but gathered momentum after that."}]}]}, {"word": "garage", "poses": [{"pos": "noun", "senses": [{"sense": "a small building, often next to a house, that you can put a car in", "level": "A2", "dict_examp": "Did you put the car in the garage?", "lear_examp": "My house has got a garden but it hasn't got a garage."}, {"sense": "a business that repairs cars, and sometimes also sells fuel", "level": "B1", "dict_examp": "The car's still at the garage getting fixed.", "lear_examp": "I took it to the garage and they are fixing it now but it will take time to repair it."}]}]}, {"word": "gas", "poses": [{"pos": "noun", "senses": [{"sense": "a liquid fuel used in cars and trucks", "level": "A2", "dict_examp": "the gas tank", "lear_examp": ""}, {"sense": "a substance in a form like air that is used as a fuel for heating and cooking", "level": "B1", "dict_examp": "a gas stove", "lear_examp": "You can also see how life is in our African villages, where there is no electricity or gas and where water comes only from the river."}, {"sense": "a substance in a form like air that is neither solid nor liquid", "level": "B2", "dict_examp": "Oxygen, hydrogen and nitrogen are all gases.", "lear_examp": "All people know that CO2 is a very dangerous gas for all kinds of animals."}]}]}, {"word": "gathering", "poses": [{"pos": "noun", "senses": [{"sense": "a party or a meeting when many people get together as a group", "level": "C1", "dict_examp": "a family gathering", "lear_examp": "Parks, for example, can't be used for a barbeque or family gathering in the winter time."}]}]}, {"word": "gap", "poses": [{"pos": "noun", "senses": [{"sense": "an empty space, hole or opening", "level": "B2", "dict_examp": "She has a small gap between her front teeth.", "lear_examp": "We need much more playgrounds in and around Leipzig.  Because of the World War II there are gaps between several old houses - so our town should take the chance to remember our children and to do something for them."}, {"sense": "a difference between two things", "level": "B2", "dict_examp": "an age gap", "lear_examp": "It is a general rule that there is a great gap between generations which leads to different ideas and mentalities between children and parents."}, {"sense": "something that is absent and stops something from being complete", "level": "B2", "dict_examp": "There are still huge gaps in my knowledge.", "lear_examp": "Another huge gap in our town is the absence of a swimming pool."}, {"sense": "a period of time spent doing something different", "level": "B2", "dict_examp": "After a gap of five years, Jennifer decided to go back to work full-time.", "lear_examp": "Finally, on the last day, I suggest you could go to the market in town during the 3-hour gap."}]}]}, {"word": "gang", "poses": [{"pos": "noun", "senses": [{"sense": "a group of young people who spend time together, usually fighting with other groups and behaving badly", "level": "B2", "dict_examp": "a gang member", "lear_examp": "It was two days ago. I wanted to join Joe's gang, but first I had to prove my courage."}, {"sense": "a group of criminals who work together", "level": "B2", "dict_examp": "a gang of armed robbers", "lear_examp": "The infamous gang had robbed twelve families of all their belongings."}, {"sense": "a group of young friends", "level": "C2", "dict_examp": "I'm going camping with Holly and the rest of the gang.", "lear_examp": "A whole gang of us decided to go on an excursion, as we did once a month."}]}]}, {"word": "gasp", "poses": [{"pos": "verb", "senses": [{"sense": "to make a noise by suddenly breathing in because you are shocked or surprised", "level": "C2", "dict_examp": "She gasped in horror as the car spun out of control.", "lear_examp": "I gasped with astonishment at the juggler's dexterity."}, {"sense": "to breathe loudly and with difficulty trying to get more air", "level": "C2", "dict_examp": "He clutched his heart, gasping for breath.", "lear_examp": "They danced until they were so tired that they fell to the ground, still laughing and gasping for air."}]}, {"pos": "noun", "senses": [{"sense": "the noise that someone makes when they gasp", "level": "C2", "dict_examp": "a gasp of surprise", "lear_examp": "His gasp startled the other sleeping tourists & they all crawled and stumbled onto their feet."}]}]}, {"word": "gallery", "poses": [{"pos": "noun", "senses": [{"sense": "a room or building which is used for showing works of art", "level": "B1", "dict_examp": "the National Portrait Gallery", "lear_examp": "Then there are a lot of museums and art galleries which you could visit."}]}]}, {"word": "gardening", "poses": [{"pos": "noun", "senses": [{"sense": "the job or activity of growing a garden and keeping it attractive", "level": "B2", "dict_examp": "She enjoys gardening.", "lear_examp": "After four years of studying and doing the A level exam, I still don't have any qualification in gardening, but I really like flowers and plants."}]}]}, {"word": "garbage", "poses": [{"pos": "noun", "senses": [{"sense": "food waste and other things that you throw away because you do not want them", "level": "B1", "dict_examp": "a garbage bag/can", "lear_examp": "The streets are dirty and smell bad and here there isn't a big place to throw the garbage away."}]}]}, {"word": "gay", "poses": [{"pos": "adjective", "senses": [{"sense": "homosexual", "level": "B1", "dict_examp": "gay rights", "lear_examp": "If you are not a religious person, if you have got divorced and you want to get married again, or if you are gay, you must get married in a civil ceremony."}]}]}, {"word": "garden", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of land belonging to a house, where flowers and other plants are grown", "level": "A1", "dict_examp": "a vegetable garden", "lear_examp": "I dropped it when we were playing with your dog in the garden."}, {"sense": "public places where flowers, trees, and other plants are grown for people to enjoy", "level": "C1", "dict_examp": "the New York Botanical Garden", "lear_examp": "Public places like the Zoo or the Botanic Gardens are closed, which effects tourists much more than the local people."}]}]}, {"word": "gambling", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of betting money, for example in a game or on a horse race", "level": "B2", "dict_examp": "Gambling can be addictive.", "lear_examp": "One night we went gambling in the hotel casino."}]}]}, {"word": "gasoline", "poses": [{"pos": "noun", "senses": [{"sense": "gas, a liquid fuel for cars and trucks", "level": "B2", "dict_examp": "regular/unleaded gasoline", "lear_examp": "Actually we know that gasoline is very expensive."}]}]}, {"word": "gear", "poses": [{"pos": "noun", "senses": [{"sense": "a set of parts in a motor vehicle or bicycle that control how fast the wheels turn", "level": "B2", "dict_examp": "a mountain bike with 21 gears", "lear_examp": "It has 24 active gears and multilink Kevlar brakes."}, {"sense": "a particular position of the gears in a motor vehicle or bicycle that controls how fast the wheels turn", "level": "B2", "dict_examp": "The light turned green, but I couldn't get into first gear.", "lear_examp": "I wrenched the car into first gear and stormed off to the office."}, {"sense": "the clothes and equipment used for a particular purpose", "level": "B2", "dict_examp": "fishing/camping gear", "lear_examp": "I'll see you in a week and don't forget your cycling gear."}]}]}, {"word": "gas station", "poses": [{"pos": "noun", "senses": [{"sense": "a place where you buy gas for a car", "level": "A2", "dict_examp": "Where's the nearest gas station?", "lear_examp": "It's on your left, near the gas station."}]}]}, {"word": "gamble", "poses": [{"pos": "verb", "senses": [{"sense": "to risk money on the result of a game, race, or competition", "level": "C2", "dict_examp": "He gambled away all of her savings.", "lear_examp": "In fact on the first night they almost gambled it all away, but John got lucky at the last minute and won 25 thousand dollars."}]}, {"pos": "noun", "senses": [{"sense": "a risk that you take that something will succeed", "level": "C2", "dict_examp": "Buying this place was a big gamble, but it seems to have paid off.", "lear_examp": "Racing along the corridor I took a gamble and rushed for the lord's office, where the documents were likely to be."}]}]}, {"word": "gardener", "poses": [{"pos": "noun", "senses": [{"sense": "someone who works in a garden, growing plants and making it look attractive", "level": "B2", "dict_examp": "They employ two gardeners.", "lear_examp": "You can become a very good gardener and walk very long distances."}]}]}, {"word": "gadget", "poses": [{"pos": "noun", "senses": [{"sense": "a small piece of equipment that does a particular job, especially a new type", "level": "C1", "dict_examp": "a kitchen gadget", "lear_examp": "I believe that robots and hi-tech gadgets will definitely invade our private and professional life."}]}]}, {"word": "generate", "poses": [{"pos": "verb", "senses": [{"sense": "to cause something to exist", "level": "B2", "dict_examp": "The new development will generate 1500 new jobs.", "lear_examp": "Football generates every kind of emotion: happiness, sadness, and above all passion."}, {"sense": "to produce energy", "level": "B2", "dict_examp": "The wind farm may be able to generate enough electricity for 2000 homes.", "lear_examp": "In France, for instance, more than three-quarters of all electricity is generated from nuclear power."}]}]}, {"word": "gerund", "poses": [{"pos": "noun", "senses": [{"sense": "A gerund is a noun made from the form of a verb that ends with -ing, for example \"fishing\" in \"John loves fishing.\"", "level": "C1", "dict_examp": "We learned about gerunds today.", "lear_examp": ""}]}]}, {"word": "genetically modified", "poses": [{"pos": "adjective", "senses": [{"sense": "having had some of the genes changed by a scientific process", "level": "C1", "dict_examp": "They are opposed to genetically modified food.", "lear_examp": "Despite the fact that the European Union prohibited genetically modified products in its countries, we are still using pesticides, causing pollution and food poisoning."}]}]}, {"word": "get", "poses": [{"pos": "verb", "senses": [{"sense": "to obtain or buy something", "level": "A1", "dict_examp": "I'll get some bread on the way home.", "lear_examp": "We could get the afternoon ticket."}, {"sense": "to receive or be given something", "level": "A1", "dict_examp": "I got some very nice presents for my birthday.", "lear_examp": "I got your note."}, {"sense": "to reach or arrive at a particular place", "level": "A1", "dict_examp": "We got home later than usual.", "lear_examp": "I had a good time at your house last night but when I got home I realized I had forgotten my bag!"}, {"sense": "to travel somewhere in a bus, train, taxi or other vehicle", "level": "A1", "dict_examp": "Should we get a taxi to the station?", "lear_examp": "You can get the train."}, {"sense": "to go somewhere and bring back someone or something", "level": "A2", "dict_examp": "Wait here while I get the car.", "lear_examp": "I decided to go on with my plan and get my father's car."}, {"sense": "to begin a legal relationship with someone as their husband or wife", "level": "A2", "dict_examp": "They got married in April.", "lear_examp": "She was going to get married, and I was invited to the wedding."}, {"sense": "to become ill or develop an illness", "level": "B1", "dict_examp": "I'm getting another cold.", "lear_examp": "I was angry, and I got a cold!"}, {"sense": "to start to be cold/ill/late, etc.", "level": "B1", "dict_examp": "Your coffee's getting cold.", "lear_examp": "It's getting late so I should finish now."}, {"sense": "to become more ill, unpleasant, difficult, severe, etc. than before", "level": "B1", "dict_examp": "My cold seems to be getting worse.", "lear_examp": "I thought, it couldn't get worse."}, {"sense": "to have something done to you", "level": "B1", "dict_examp": "He got killed in the war.", "lear_examp": "Two weeks ago many people at school got injured because of an explosion, so a TV company came to film what the school is like now ..."}, {"sense": "to produce an answer or result that is not correct, or to say or write something that is not correct", "level": "B1", "dict_examp": "I got most of the answers wrong.", "lear_examp": ""}, {"sense": "to do a task, or to arrange for someone to do a task for you", "level": "B1", "dict_examp": "Could you get the kids dressed?", "lear_examp": "First I have to go to the doctor and then I have to get my teeth checked by the dentist."}, {"sense": "to contact someone", "level": "B1", "dict_examp": "Please get in touch if you ever come back to Madrid.", "lear_examp": "Get in touch soon."}, {"sense": "to move to a different place or into a different position", "level": "B1", "dict_examp": "I saw her getting into his car.", "lear_examp": "They said that I got into a car by myself (they thought that I had believed the story)."}, {"sense": "to deal with or answer a ringing telephone, a knock on the door, etc.", "level": "B1", "dict_examp": "Could you get the phone, Al?", "lear_examp": ""}, {"sense": "to spend time with someone or something so that you gradually learn more about them", "level": "B1", "dict_examp": "The first couple of meetings are for the doctor and patient to get to know each other.", "lear_examp": "I hope you can come here and get to know him."}, {"sense": "to throw something away or give something to someone because you no longer want it", "level": "B1", "dict_examp": "We must get rid of some of those old books.", "lear_examp": "Do you think I'd better get rid of the sofa and place the bookshelf there?"}, {"sense": "to end something unpleasant", "level": "B2", "dict_examp": "I can't seem to get rid of this headache.", "lear_examp": "The first step is to get rid of smoking."}, {"sense": "to make something happen, or make someone or something do something", "level": "B2", "dict_examp": "I can't get my computer to work!", "lear_examp": "We must get the councillors to change their minds."}, {"sense": "to develop an opinion about a situation because of something that you notice", "level": "B2", "dict_examp": "I got the feeling that she was really angry about the situation.", "lear_examp": "I disagree with some points you mentioned and would like to share the impression I got from that popular holiday report during my two-week trip."}, {"sense": "to annoy someone, especially by doing something again and again", "level": "B2", "dict_examp": "If we spend too much time together, we end up getting on each other's nerves.", "lear_examp": "Sometimes, receiving a phone call can disturb very important events in a person's life, but it also gets on people's nerves when you use it in a public place like a train."}, {"sense": "to have the chance to do something", "level": "B2", "dict_examp": "I never got to meet her.", "lear_examp": "I did get to meet a musician, a singer named Anouk."}, {"sense": "to understand or hear something", "level": "B2", "dict_examp": "That joke that he told  - did you get it?", "lear_examp": ""}, {"sense": "to make an effort to control your emotions and behave more calmly", "level": "C1", "dict_examp": "Stop panicking and get a grip on yourself!", "lear_examp": "The best thing to do was to talk to people who were not doing the test rather than building up my anxiety. However, I did not do this and it almost resulted in a disaster, but I got a grip on myself and just barely passed."}, {"sense": "to make someone leave", "level": "C1", "dict_examp": "We finally got rid of my little sister by telling her scary stories.", "lear_examp": "Improving your English on your own (or a self-guide on how to get rid of your English teacher!)."}, {"sense": "to make sure that you completely understand a situation", "level": "C1", "dict_examp": "Let me get this straight - am I paying for this?", "lear_examp": "Next time you should try to get your facts straight."}, {"sense": "to become better organized so that you can make progress", "level": "C2", "dict_examp": "I wish she'd get her act together.", "lear_examp": "He was determined to get his act together and try to find a solution to his problem."}, {"sense": "to become difficult to control", "level": "C2", "dict_examp": "It was the end of week and the children were getting a little out of hand.", "lear_examp": "A few solutions can prevent this problem from getting out of hand."}, {"sense": "to learn how to do something, especially if it is not obvious or simple", "level": "C2", "dict_examp": "I've  never used one of these before. - Don't worry, you'll soon get the hang of it.", "lear_examp": "It was quite hard to get the hang of it, as I didn't have any knowledge of English."}, {"sense": "to hurry", "level": "C2", "dict_examp": "We're leaving in five minutes, so get moving!", "lear_examp": "\"Oh, look at the time, we must get moving!\""}, {"sense": "to hurry", "level": "C2", "dict_examp": "Come on, get a move on!", "lear_examp": "\"All the lights will be switched off in 28 minutes, so I have to get a move on,\" I said to myself, as I started to write on a new piece of paper."}, {"sense": "If something gets you nowhere, it does not help you to succeed.", "level": "C2", "dict_examp": "Bad manners will get you nowhere.", "lear_examp": "As this is a loophole in the law system, it's creating a conflict between house-owners and squatters and getting them nowhere."}, {"sense": "used to say that someone understands a situation", "level": "C2", "dict_examp": "Oh right, I get the picture.", "lear_examp": "If you use a photograph though, you can be sure that everyone will get the picture (pun intended) and probably remember the person you're talking about next time they see him."}, {"sense": "to begin", "level": "C2", "dict_examp": "The film festival gets underway on July 11th.", "lear_examp": ""}, {"sense": "to tell someone about something that you have been worried or angry about for a long time", "level": "C2", "dict_examp": "Tell me what's wrong - you'll feel better if you get it off your chest.", "lear_examp": "Chris is always caring and lends you his ear if there's something you need to get off your chest."}, {"sense": "to manage to make someone understand or believe something", "level": "B2", "dict_examp": "We tried to get our point across, but he just wouldn't                             listen.", "lear_examp": "I am going to get across several ideas to improve the look of our town."}, {"sense": "to have a good relationship", "level": "A2", "dict_examp": "She and her new roommate are getting along.", "lear_examp": "She is a journalist at the local newspaper and we get along very well."}, {"sense": "to travel or move from place to place", "level": "B1", "dict_examp": "The busses and subway make it easy to get around New York City.", "lear_examp": "The island isn't too big so I think we could get around on foot."}, {"sense": "to do something that you have intended to do for a long time", "level": "B2", "dict_examp": "I still haven't got around to fixing that faucet.", "lear_examp": "Dear Kim, I am terribly sorry not to drop you a line since the last time we wrote to one another. But I finally got around to writing and you'll see that it's definitely worth waiting as I have some great and unbelievable news to tell you."}, {"sense": "to be able to reach or get something", "level": "B2", "dict_examp": "I've put the cake on a high shelf where the kids can't get at it.", "lear_examp": ""}, {"sense": "If you ask someone what they are getting at, you are asking them what they really mean.", "level": "C1", "dict_examp": "What do you think the poet is getting at in these lines?", "lear_examp": "The point I'm getting at is that you have to understand that young people look at sports like school: it's something you do that makes you feel good afterward and computer games are something you do when you have some spare time."}, {"sense": "to leave or escape from a place or person, often when it is difficult to do this", "level": "B2", "dict_examp": "We walked to the next beach to get away from the crowds.", "lear_examp": "A bicycle is a means of making new friends, and getting away from your daily routine."}, {"sense": "to go somewhere for a short vacation, often  because you need to rest", "level": "B2", "dict_examp": "I just need to get away for a few days.", "lear_examp": "I've enjoyed the peace of getting away, you know I needed it."}, {"sense": "to succeed in not being criticized or  punished for something", "level": "B2", "dict_examp": "If I thought I could get away with it, I wouldn't pay any tax at all.", "lear_examp": "When the police arrived, the criminals had already disappeared: they got away with this murder."}, {"sense": "to return to a place after you have been somewhere else", "level": "A2", "dict_examp": "When we got back to the hotel, Ann had already left.", "lear_examp": "Will call you when I get back."}, {"sense": "to be given something again that you had before", "level": "B2", "dict_examp": "He went next door to get his ball back.", "lear_examp": "He hoped that he would get back his suitcase."}, {"sense": "to talk or write to someone at a later time to give them some information they asked for or because you were not able to speak to them before", "level": "C1", "dict_examp": "I need to get back to Gary about his new computer.", "lear_examp": "I am awfully sorry for having been slow in getting back to you."}, {"sense": "to make someone feel unhappy", "level": "B2", "dict_examp": "All this uncertainty is really getting me down.", "lear_examp": "But when I had finally reached the bottom of the valley seeing the whole ski group staring at me, the embarrassment got me down."}, {"sense": "to start doing something seriously and with a lot of attention and effort", "level": "B2", "dict_examp": "Before we get down to business, I'd like to thank you all for coming today.", "lear_examp": "Let's get down to business!"}, {"sense": "to succeed in entering a place, especially a building", "level": "B1", "dict_examp": "They must have gotten in through the bathroom window.", "lear_examp": "We had to hang out in front of the Museum for almost one hour. When we finally got in there, the tour was very short."}, {"sense": "to arrive at a place at a particular time", "level": "B1", "dict_examp": "My flight gets in at 9:45 p.m.", "lear_examp": ""}, {"sense": "to succeed in being chosen or elected", "level": "B2", "dict_examp": "He wanted to go to Stanford, but he didn't get in.", "lear_examp": "For the first time I was trying to get in a University or a High College."}, {"sense": "to succeed in being chosen or elected", "level": "B2", "dict_examp": "He got into Harvard.", "lear_examp": "A month later on, I finally got into a High College of Education, but almost 400 km from home."}, {"sense": "to become interested in an activity or subject, or start being involved in an activity", "level": "C1", "dict_examp": "How did you get into journalism?", "lear_examp": "Taking everything into account, I truly believe that \"Ethnos\" is the most suitable newspaper to be placed in the library ... for every student who would like to learn Greek deeply and get into the Greek culture and civilization."}, {"sense": "to leave a bus, train, aircraft or boat", "level": "A2", "dict_examp": "We should get off at the next stop.", "lear_examp": "Then get off the bus in Obdland Village and walk up the road."}, {"sense": "to go onto a bus, train, aircraft or boat", "level": "A2", "dict_examp": "I think we got on the wrong bus.", "lear_examp": "Last Saturday I was running to get on the bus, but my schoolbag was open and the diary fell out."}, {"sense": "to continue doing something, especially work", "level": "B2", "dict_examp": "We don’t have all day to finish this job, so can we just get on with it?", "lear_examp": "I must go and get on with my homework."}, {"sense": "to leave a closed vehicle, building, etc.", "level": "B1", "dict_examp": "I'll get out when you stop at the traffic light.", "lear_examp": "Suddenly the lights went out and I was there, desperately trying to find a way to get out of the house!"}, {"sense": "to go out to different places and meet people in order to enjoy yourself", "level": "C1", "dict_examp": "She doesn't get out as much now that she had the baby.", "lear_examp": "Since Internet, e-mails and mobile phones were invented, fewer people get out and meet friends."}, {"sense": "to avoid doing something that you do not want to do, especially by giving an excuse", "level": "B2", "dict_examp": "If I can get out of going to the meeting tonight I will.", "lear_examp": "I must go to Tokyo on business that Wednesday afternoon. This is a kind of step up for me and I can't get out of it."}, {"sense": "to escape from or leave a place, or to help someone do this", "level": "C1", "dict_examp": "I left the door open and the cat got out.", "lear_examp": "\"Don't panic, now, Lorraine\", he answered me. \"He may be a little .... um, eccentric, but I'm sure he'll get us out of here fine.\""}, {"sense": "to get better after an illness, or feel better after something or someone has made you unhappy", "level": "B2", "dict_examp": "She's still getting over the flu.", "lear_examp": "First of all, she had had to get over the deaths of three close relatives in the last three years."}, {"sense": "to be very shocked or surprised about something", "level": "B2", "dict_examp": "I can't get over how different you look with short hair.", "lear_examp": "I can't get over how quickly you wrote to me."}, {"sense": "to succeed in an examination or competition", "level": "B2", "dict_examp": "She got through her exams without too much trouble.", "lear_examp": "I know you want to get through your exams."}, {"sense": "to deal with a difficult or unpleasant experience, or to help someone do this", "level": "C1", "dict_examp": "My friendship with Carla got me through those tough months just after we moved.", "lear_examp": "You see, my friend, how life can be a bit difficult but people manage to get through it."}, {"sense": "to succeed in making someone understand or believe something", "level": "C1", "dict_examp": "I just don't seem to be able to get through to him these days.", "lear_examp": "He should make the lesson interesting and should manage to get through to children."}, {"sense": "to make someone feel upset or angry", "level": "C2", "dict_examp": "I know he's annoying but you shouldn't let him get to you.", "lear_examp": "But they are overprotective and it gets to me very much."}, {"sense": "to meet in order to do something or spend time together", "level": "B1", "dict_examp": "A few of us are getting together next week for a drink.", "lear_examp": "During a Chinese wedding ceremony, new couples wear traditional clothes and hold a party for friends and families getting together."}, {"sense": "to stand up", "level": "B2", "dict_examp": "The whole audience got up and started clapping.", "lear_examp": "When I got up on my feet again I reached out my arm to get a hold on something, but there wasn't anything to hold on to."}, {"sense": "to wake up and get out of bed, or make someone do this", "level": "A1", "dict_examp": "I had to get up at five o'clock this morning.", "lear_examp": "My friend gets up early."}]}]}, {"word": "genius", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is extremely intelligent or extremely good at doing something", "level": "C1", "dict_examp": "Einstein was a genius.", "lear_examp": "And what about Mozart - poor little genius!"}, {"sense": "the quality of being extremely intelligent or extremely good at doing something", "level": "C2", "dict_examp": "Einstein's genius", "lear_examp": "Nothing is more common than unrewarded genius and misused talents."}]}]}, {"word": "generalization", "poses": [{"pos": "noun", "senses": [{"sense": "when someone says something very basic that is often true but not always true", "level": "C1", "dict_examp": "It's a sweeping generalization to say that girls read more than boys.", "lear_examp": "Of course this is a very simple generalization of the issue. There are many aspects that can influence our approach towards work and money."}]}]}, {"word": "gender", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being male or female", "level": "B2", "dict_examp": "Does this test show the gender of the baby?", "lear_examp": "There were many speakers who talked about all sorts of subjects such as politics, religion, gender identity, and art."}, {"sense": "the division of nouns, pronouns and adjectives into masculine, feminine and neuter types", "level": "B2", "dict_examp": "In English, nouns don't have gender, but in French and Spanish, they do.", "lear_examp": ""}]}]}, {"word": "geography", "poses": [{"pos": "noun", "senses": [{"sense": "the study of the physical surface of the Earth and all regions of the world", "level": "A2", "dict_examp": "a degree in geography and economics", "lear_examp": "I left my geography book at your house yesterday."}]}]}, {"word": "germ", "poses": [{"pos": "noun", "senses": [{"sense": "a very small living thing that causes disease", "level": "C1", "dict_examp": "Wash your hands before cooking so that you don't spread germs.", "lear_examp": "I am more careful with cleaning up and taking care of my baby. It was amazing the way they spoke about germs and dust."}, {"sense": "the beginning of something", "level": "C2", "dict_examp": "the germ of a brilliant idea", "lear_examp": "Going back to the scene at More's home, we now understand why this is the germ of the subsequent development of the play."}]}]}, {"word": "genuinely", "poses": [{"pos": "adverb", "senses": [{"sense": "in a genuine or sincere way", "level": "B2", "dict_examp": "I'm genuinely sorry for the extra work this has caused.", "lear_examp": "We are all genuinely interested in English literature."}]}]}, {"word": "generalize", "poses": [{"pos": "verb", "senses": [{"sense": "to say something very basic that is often true but not always true", "level": "C1", "dict_examp": "You can't generalize about a continent as varied as Europe.", "lear_examp": "I am not however generalizing. There are very successful and well known people who come from all walks of life."}]}]}, {"word": "genetics", "poses": [{"pos": "noun", "senses": [{"sense": "the scientific study of the parts of cells that control particular characteristics (genes)", "level": "B2", "dict_examp": "Next year, I'll be studying genetics.", "lear_examp": "We use technology in order to save human lives and to explore strange new worlds, such as genetics."}]}]}, {"word": "generous", "poses": [{"pos": "adjective", "senses": [{"sense": "willing to give other people money, help, kindness, etc.", "level": "B1", "dict_examp": "She's been very generous with her time.", "lear_examp": "I like her because she is a generous, kindly, interesting person."}, {"sense": "larger than usual or than expected", "level": "C1", "dict_examp": "a generous discount for students", "lear_examp": "It's a pleasure to me to write this letter thanking you all for the generous hospitality I've met with in your home."}]}]}, {"word": "gently", "poses": [{"pos": "adverb", "senses": [{"sense": "calmly, kindly or softly", "level": "B2", "dict_examp": "He held the baby gently in his arms.", "lear_examp": "Now I am older and I speak to my mother very gently."}]}]}, {"word": "general", "poses": [{"pos": "adjective", "senses": [{"sense": "not detailed, but including the most basic or necessary information", "level": "B1", "dict_examp": "These leaflets contain some general information about the school.", "lear_examp": "By seeing the film, we are able to understand the general idea of the story."}, {"sense": "usually, or in most situations", "level": "B1", "dict_examp": "In general, men are taller than women.", "lear_examp": "In general, when anybody in my country has a wedding, the families invite all friends and neighbours to the wedding."}, {"sense": "involving or relating to most or all people, things or places", "level": "B2", "dict_examp": "There is general concern about rising crime rates.", "lear_examp": "The decision has already been made by general agreement."}, {"sense": "including a lot of things or subjects and not limited to only one or a few", "level": "B2", "dict_examp": "general knowledge", "lear_examp": "To improve the general knowledge of the students, it might be a good idea to offer more newspapers than magazines."}, {"sense": "considering the whole of someone or something, and not just a particular part of them", "level": "B2", "dict_examp": "So, apart from the bad ankle, how are you in general?", "lear_examp": "I think that I, as well as people in general, would have been more depressed if we didn't have light."}]}]}, {"word": "generously", "poses": [{"pos": "adverb", "senses": [{"sense": "in a generous way", "level": "B2", "dict_examp": "Please give generously to help children in need.", "lear_examp": "I can't think of any other person who opens her house so generously as you do!"}]}]}, {"word": "generation", "poses": [{"pos": "noun", "senses": [{"sense": "all the people in a society or family who are approximately the same age", "level": "B1", "dict_examp": "the older/younger generation", "lear_examp": "Some people say that cell phones are a bad influence on the younger generation."}, {"sense": "a period of about 25 to 30 years, the time it takes for children to become adults and take the place of their parents in society", "level": "B2", "dict_examp": "Our family has lived in this village for generations.", "lear_examp": "Salzburg is a beautiful medieval town - it has got a wonderful cathedral, which was built by entire generations of Italian artisans."}, {"sense": "a product when it is at a particular stage of development", "level": "B2", "dict_examp": "a new generation of computers", "lear_examp": "I can sum up the most important things that changed my life are the telephone, the computer, the portable phone and of course the new generation of television."}, {"sense": "the production of energy in a particular form", "level": "B2", "dict_examp": "electricity generation from wind and wave power", "lear_examp": "The energy generation crisis Brazil is having to deal with is well known."}]}]}, {"word": "gesture", "poses": [{"pos": "noun", "senses": [{"sense": "a movement you make with your hand, arm, or head to express what you are thinking or feeling", "level": "C1", "dict_examp": "He made a rude gesture to the crowd.", "lear_examp": "Review - The Body Speaks ... In the second part, you are taught how to read the gestures, voice, and hesitations, and analyze them."}, {"sense": "something you do to show people how you feel about a person or situation", "level": "C1", "dict_examp": "It would be a nice gesture to invite her to dinner.", "lear_examp": "Dear Sir, I am the secretary of the Student Committee in Bringtown College and I am writing to thank you for your kind gesture in inviting me to the opening of the new Arts Center."}]}, {"pos": "verb", "senses": [{"sense": "to point at something or express something using your hand, arm, or head", "level": "C2", "dict_examp": "He gestured toward the window.", "lear_examp": "She gestured to the hall's expensive Persian carpets and the extensive collection of French Impressionists hanging on the walls."}]}]}, {"word": "gene", "poses": [{"pos": "noun", "senses": [{"sense": "a part of a cell that is passed on from a parent to a child and that controls particular characteristics", "level": "C1", "dict_examp": "Scientists have discovered the gene responsible for causing this disease.", "lear_examp": "I think it would be reasonable to include capsules with human genes and the genetic material of endangered species."}]}]}, {"word": "geology", "poses": [{"pos": "noun", "senses": [{"sense": "the study of rocks and soil and the physical structure of the Earth", "level": "C1", "dict_examp": "a book about geology", "lear_examp": "I have graduated from school and I am now studying geology at the University of Greece."}]}]}, {"word": "genuine", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is genuine, it is really what it seems to be.", "level": "B2", "dict_examp": "genuine leather", "lear_examp": "The bicycle is a genuine Shimano bicycle."}, {"sense": "If a person is genuine or someone's feelings are genuine, they are sincere and honest.", "level": "C1", "dict_examp": "They showed genuine sympathy for our situation.", "lear_examp": "On the other hand, it is well known in environmental management that strategies that work via the people's purse are often the only way to motivate people who have little genuine interest in environmental problems (or just too many other concerns)."}]}]}, {"word": "generally", "poses": [{"pos": "adverb", "senses": [{"sense": "usually, or in most situations", "level": "B1", "dict_examp": "I generally wake up early.", "lear_examp": "I generally prefer reading newspapers, but I don't dislike books."}, {"sense": "considering the whole of someone or something, and not just a particular part of them", "level": "B2", "dict_examp": "My health is generally very good.", "lear_examp": "Generally, Athens has a lot of things to do."}, {"sense": "by most people, or to most people", "level": "B2", "dict_examp": "He is generally believed to be their best player.", "lear_examp": "It is generally acknowledged that it depends on the zoo because sometimes the animals are loved and sometimes hated."}]}]}, {"word": "generosity", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being generous", "level": "B2", "dict_examp": "Her friends take advantage of her generosity.", "lear_examp": "Anna, thank you again for your generosity."}]}]}, {"word": "gentleman", "poses": [{"pos": "noun", "senses": [{"sense": "a polite word for \"man\"", "level": "B2", "dict_examp": "Ladies and gentlemen, the show is about to begin.", "lear_examp": "So she walked up on the stage and started speaking steadily into the microphone: \"Ladies and gentlemen....\" This is how the story ended."}]}]}, {"word": "genetic", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to genes", "level": "C1", "dict_examp": "a rare genetic disorder", "lear_examp": "Mendel thought that basically it is the genetic material which is responsible for the future development of a child."}]}]}, {"word": "gentle", "poses": [{"pos": "adjective", "senses": [{"sense": "kind, calm and careful not to upset or hurt anyone", "level": "B1", "dict_examp": "My mother was such a gentle, loving person.", "lear_examp": "Mani  is very kind and gentle."}, {"sense": "not violent, severe or strong", "level": "B1", "dict_examp": "gentle exercise", "lear_examp": "The weather is sunny, the gentle breeze is pure and fresh."}, {"sense": "A gentle slope or climb is not steep.", "level": "C1", "dict_examp": "It was a fairly gentle climb to the summit.", "lear_examp": "THE TOUR Trained guides lead people across gentle slopes towards thick woods displaying a wide variety of birds and animal life."}]}]}, {"word": "get", "poses": [{"pos": "verb", "senses": [{"sense": "to obtain or buy something", "level": "A1", "dict_examp": "I'll get some bread on the way home.", "lear_examp": "We could get the afternoon ticket."}, {"sense": "to receive or be given something", "level": "A1", "dict_examp": "I got some very nice presents for my birthday.", "lear_examp": "I got your note."}, {"sense": "to reach or arrive at a particular place", "level": "A1", "dict_examp": "We got home later than usual.", "lear_examp": "I had a good time at your house last night but when I got home I realized I had forgotten my bag!"}, {"sense": "to travel somewhere in a bus, train, taxi or other vehicle", "level": "A1", "dict_examp": "Should we get a taxi to the station?", "lear_examp": "You can get the train."}, {"sense": "to go somewhere and bring back someone or something", "level": "A2", "dict_examp": "Wait here while I get the car.", "lear_examp": "I decided to go on with my plan and get my father's car."}, {"sense": "to begin a legal relationship with someone as their husband or wife", "level": "A2", "dict_examp": "They got married in April.", "lear_examp": "She was going to get married, and I was invited to the wedding."}, {"sense": "to become ill or develop an illness", "level": "B1", "dict_examp": "I'm getting another cold.", "lear_examp": "I was angry, and I got a cold!"}, {"sense": "to start to be cold/ill/late, etc.", "level": "B1", "dict_examp": "Your coffee's getting cold.", "lear_examp": "It's getting late so I should finish now."}, {"sense": "to become more ill, unpleasant, difficult, severe, etc. than before", "level": "B1", "dict_examp": "My cold seems to be getting worse.", "lear_examp": "I thought, it couldn't get worse."}, {"sense": "to have something done to you", "level": "B1", "dict_examp": "He got killed in the war.", "lear_examp": "Two weeks ago many people at school got injured because of an explosion, so a TV company came to film what the school is like now ..."}, {"sense": "to produce an answer or result that is not correct, or to say or write something that is not correct", "level": "B1", "dict_examp": "I got most of the answers wrong.", "lear_examp": ""}, {"sense": "to do a task, or to arrange for someone to do a task for you", "level": "B1", "dict_examp": "Could you get the kids dressed?", "lear_examp": "First I have to go to the doctor and then I have to get my teeth checked by the dentist."}, {"sense": "to contact someone", "level": "B1", "dict_examp": "Please get in touch if you ever come back to Madrid.", "lear_examp": "Get in touch soon."}, {"sense": "to move to a different place or into a different position", "level": "B1", "dict_examp": "I saw her getting into his car.", "lear_examp": "They said that I got into a car by myself (they thought that I had believed the story)."}, {"sense": "to deal with or answer a ringing telephone, a knock on the door, etc.", "level": "B1", "dict_examp": "Could you get the phone, Al?", "lear_examp": ""}, {"sense": "to spend time with someone or something so that you gradually learn more about them", "level": "B1", "dict_examp": "The first couple of meetings are for the doctor and patient to get to know each other.", "lear_examp": "I hope you can come here and get to know him."}, {"sense": "to throw something away or give something to someone because you no longer want it", "level": "B1", "dict_examp": "We must get rid of some of those old books.", "lear_examp": "Do you think I'd better get rid of the sofa and place the bookshelf there?"}, {"sense": "to end something unpleasant", "level": "B2", "dict_examp": "I can't seem to get rid of this headache.", "lear_examp": "The first step is to get rid of smoking."}, {"sense": "to make something happen, or make someone or something do something", "level": "B2", "dict_examp": "I can't get my computer to work!", "lear_examp": "We must get the councillors to change their minds."}, {"sense": "to develop an opinion about a situation because of something that you notice", "level": "B2", "dict_examp": "I got the feeling that she was really angry about the situation.", "lear_examp": "I disagree with some points you mentioned and would like to share the impression I got from that popular holiday report during my two-week trip."}, {"sense": "to annoy someone, especially by doing something again and again", "level": "B2", "dict_examp": "If we spend too much time together, we end up getting on each other's nerves.", "lear_examp": "Sometimes, receiving a phone call can disturb very important events in a person's life, but it also gets on people's nerves when you use it in a public place like a train."}, {"sense": "to have the chance to do something", "level": "B2", "dict_examp": "I never got to meet her.", "lear_examp": "I did get to meet a musician, a singer named Anouk."}, {"sense": "to understand or hear something", "level": "B2", "dict_examp": "That joke that he told  - did you get it?", "lear_examp": ""}, {"sense": "to make an effort to control your emotions and behave more calmly", "level": "C1", "dict_examp": "Stop panicking and get a grip on yourself!", "lear_examp": "The best thing to do was to talk to people who were not doing the test rather than building up my anxiety. However, I did not do this and it almost resulted in a disaster, but I got a grip on myself and just barely passed."}, {"sense": "to make someone leave", "level": "C1", "dict_examp": "We finally got rid of my little sister by telling her scary stories.", "lear_examp": "Improving your English on your own (or a self-guide on how to get rid of your English teacher!)."}, {"sense": "to make sure that you completely understand a situation", "level": "C1", "dict_examp": "Let me get this straight - am I paying for this?", "lear_examp": "Next time you should try to get your facts straight."}, {"sense": "to become better organized so that you can make progress", "level": "C2", "dict_examp": "I wish she'd get her act together.", "lear_examp": "He was determined to get his act together and try to find a solution to his problem."}, {"sense": "to become difficult to control", "level": "C2", "dict_examp": "It was the end of week and the children were getting a little out of hand.", "lear_examp": "A few solutions can prevent this problem from getting out of hand."}, {"sense": "to learn how to do something, especially if it is not obvious or simple", "level": "C2", "dict_examp": "I've  never used one of these before. - Don't worry, you'll soon get the hang of it.", "lear_examp": "It was quite hard to get the hang of it, as I didn't have any knowledge of English."}, {"sense": "to hurry", "level": "C2", "dict_examp": "We're leaving in five minutes, so get moving!", "lear_examp": "\"Oh, look at the time, we must get moving!\""}, {"sense": "to hurry", "level": "C2", "dict_examp": "Come on, get a move on!", "lear_examp": "\"All the lights will be switched off in 28 minutes, so I have to get a move on,\" I said to myself, as I started to write on a new piece of paper."}, {"sense": "If something gets you nowhere, it does not help you to succeed.", "level": "C2", "dict_examp": "Bad manners will get you nowhere.", "lear_examp": "As this is a loophole in the law system, it's creating a conflict between house-owners and squatters and getting them nowhere."}, {"sense": "used to say that someone understands a situation", "level": "C2", "dict_examp": "Oh right, I get the picture.", "lear_examp": "If you use a photograph though, you can be sure that everyone will get the picture (pun intended) and probably remember the person you're talking about next time they see him."}, {"sense": "to begin", "level": "C2", "dict_examp": "The film festival gets underway on July 11th.", "lear_examp": ""}, {"sense": "to tell someone about something that you have been worried or angry about for a long time", "level": "C2", "dict_examp": "Tell me what's wrong - you'll feel better if you get it off your chest.", "lear_examp": "Chris is always caring and lends you his ear if there's something you need to get off your chest."}, {"sense": "to manage to make someone understand or believe something", "level": "B2", "dict_examp": "We tried to get our point across, but he just wouldn't                             listen.", "lear_examp": "I am going to get across several ideas to improve the look of our town."}, {"sense": "to have a good relationship", "level": "A2", "dict_examp": "She and her new roommate are getting along.", "lear_examp": "She is a journalist at the local newspaper and we get along very well."}, {"sense": "to travel or move from place to place", "level": "B1", "dict_examp": "The busses and subway make it easy to get around New York City.", "lear_examp": "The island isn't too big so I think we could get around on foot."}, {"sense": "to do something that you have intended to do for a long time", "level": "B2", "dict_examp": "I still haven't got around to fixing that faucet.", "lear_examp": "Dear Kim, I am terribly sorry not to drop you a line since the last time we wrote to one another. But I finally got around to writing and you'll see that it's definitely worth waiting as I have some great and unbelievable news to tell you."}, {"sense": "to be able to reach or get something", "level": "B2", "dict_examp": "I've put the cake on a high shelf where the kids can't get at it.", "lear_examp": ""}, {"sense": "If you ask someone what they are getting at, you are asking them what they really mean.", "level": "C1", "dict_examp": "What do you think the poet is getting at in these lines?", "lear_examp": "The point I'm getting at is that you have to understand that young people look at sports like school: it's something you do that makes you feel good afterward and computer games are something you do when you have some spare time."}, {"sense": "to leave or escape from a place or person, often when it is difficult to do this", "level": "B2", "dict_examp": "We walked to the next beach to get away from the crowds.", "lear_examp": "A bicycle is a means of making new friends, and getting away from your daily routine."}, {"sense": "to go somewhere for a short vacation, often  because you need to rest", "level": "B2", "dict_examp": "I just need to get away for a few days.", "lear_examp": "I've enjoyed the peace of getting away, you know I needed it."}, {"sense": "to succeed in not being criticized or  punished for something", "level": "B2", "dict_examp": "If I thought I could get away with it, I wouldn't pay any tax at all.", "lear_examp": "When the police arrived, the criminals had already disappeared: they got away with this murder."}, {"sense": "to return to a place after you have been somewhere else", "level": "A2", "dict_examp": "When we got back to the hotel, Ann had already left.", "lear_examp": "Will call you when I get back."}, {"sense": "to be given something again that you had before", "level": "B2", "dict_examp": "He went next door to get his ball back.", "lear_examp": "He hoped that he would get back his suitcase."}, {"sense": "to talk or write to someone at a later time to give them some information they asked for or because you were not able to speak to them before", "level": "C1", "dict_examp": "I need to get back to Gary about his new computer.", "lear_examp": "I am awfully sorry for having been slow in getting back to you."}, {"sense": "to make someone feel unhappy", "level": "B2", "dict_examp": "All this uncertainty is really getting me down.", "lear_examp": "But when I had finally reached the bottom of the valley seeing the whole ski group staring at me, the embarrassment got me down."}, {"sense": "to start doing something seriously and with a lot of attention and effort", "level": "B2", "dict_examp": "Before we get down to business, I'd like to thank you all for coming today.", "lear_examp": "Let's get down to business!"}, {"sense": "to succeed in entering a place, especially a building", "level": "B1", "dict_examp": "They must have gotten in through the bathroom window.", "lear_examp": "We had to hang out in front of the Museum for almost one hour. When we finally got in there, the tour was very short."}, {"sense": "to arrive at a place at a particular time", "level": "B1", "dict_examp": "My flight gets in at 9:45 p.m.", "lear_examp": ""}, {"sense": "to succeed in being chosen or elected", "level": "B2", "dict_examp": "He wanted to go to Stanford, but he didn't get in.", "lear_examp": "For the first time I was trying to get in a University or a High College."}, {"sense": "to succeed in being chosen or elected", "level": "B2", "dict_examp": "He got into Harvard.", "lear_examp": "A month later on, I finally got into a High College of Education, but almost 400 km from home."}, {"sense": "to become interested in an activity or subject, or start being involved in an activity", "level": "C1", "dict_examp": "How did you get into journalism?", "lear_examp": "Taking everything into account, I truly believe that \"Ethnos\" is the most suitable newspaper to be placed in the library ... for every student who would like to learn Greek deeply and get into the Greek culture and civilization."}, {"sense": "to leave a bus, train, aircraft or boat", "level": "A2", "dict_examp": "We should get off at the next stop.", "lear_examp": "Then get off the bus in Obdland Village and walk up the road."}, {"sense": "to go onto a bus, train, aircraft or boat", "level": "A2", "dict_examp": "I think we got on the wrong bus.", "lear_examp": "Last Saturday I was running to get on the bus, but my schoolbag was open and the diary fell out."}, {"sense": "to continue doing something, especially work", "level": "B2", "dict_examp": "We don’t have all day to finish this job, so can we just get on with it?", "lear_examp": "I must go and get on with my homework."}, {"sense": "to leave a closed vehicle, building, etc.", "level": "B1", "dict_examp": "I'll get out when you stop at the traffic light.", "lear_examp": "Suddenly the lights went out and I was there, desperately trying to find a way to get out of the house!"}, {"sense": "to go out to different places and meet people in order to enjoy yourself", "level": "C1", "dict_examp": "She doesn't get out as much now that she had the baby.", "lear_examp": "Since Internet, e-mails and mobile phones were invented, fewer people get out and meet friends."}, {"sense": "to avoid doing something that you do not want to do, especially by giving an excuse", "level": "B2", "dict_examp": "If I can get out of going to the meeting tonight I will.", "lear_examp": "I must go to Tokyo on business that Wednesday afternoon. This is a kind of step up for me and I can't get out of it."}, {"sense": "to escape from or leave a place, or to help someone do this", "level": "C1", "dict_examp": "I left the door open and the cat got out.", "lear_examp": "\"Don't panic, now, Lorraine\", he answered me. \"He may be a little .... um, eccentric, but I'm sure he'll get us out of here fine.\""}, {"sense": "to get better after an illness, or feel better after something or someone has made you unhappy", "level": "B2", "dict_examp": "She's still getting over the flu.", "lear_examp": "First of all, she had had to get over the deaths of three close relatives in the last three years."}, {"sense": "to be very shocked or surprised about something", "level": "B2", "dict_examp": "I can't get over how different you look with short hair.", "lear_examp": "I can't get over how quickly you wrote to me."}, {"sense": "to succeed in an examination or competition", "level": "B2", "dict_examp": "She got through her exams without too much trouble.", "lear_examp": "I know you want to get through your exams."}, {"sense": "to deal with a difficult or unpleasant experience, or to help someone do this", "level": "C1", "dict_examp": "My friendship with Carla got me through those tough months just after we moved.", "lear_examp": "You see, my friend, how life can be a bit difficult but people manage to get through it."}, {"sense": "to succeed in making someone understand or believe something", "level": "C1", "dict_examp": "I just don't seem to be able to get through to him these days.", "lear_examp": "He should make the lesson interesting and should manage to get through to children."}, {"sense": "to make someone feel upset or angry", "level": "C2", "dict_examp": "I know he's annoying but you shouldn't let him get to you.", "lear_examp": "But they are overprotective and it gets to me very much."}, {"sense": "to meet in order to do something or spend time together", "level": "B1", "dict_examp": "A few of us are getting together next week for a drink.", "lear_examp": "During a Chinese wedding ceremony, new couples wear traditional clothes and hold a party for friends and families getting together."}, {"sense": "to stand up", "level": "B2", "dict_examp": "The whole audience got up and started clapping.", "lear_examp": "When I got up on my feet again I reached out my arm to get a hold on something, but there wasn't anything to hold on to."}, {"sense": "to wake up and get out of bed, or make someone do this", "level": "A1", "dict_examp": "I had to get up at five o'clock this morning.", "lear_examp": "My friend gets up early."}]}]}, {"word": "giant", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely large", "level": "B1", "dict_examp": "a giant spider", "lear_examp": "Harry Potter fought with the giant snake and he won."}]}, {"pos": "noun", "senses": [{"sense": "an imaginary man who is much bigger and stronger than ordinary men", "level": "C1", "dict_examp": "The story is about a friendly giant.", "lear_examp": "People have always seen him as a \"big friendly giant\", always ready to help those who are in need."}, {"sense": "a very large and important company or organization", "level": "C2", "dict_examp": "a media/software giant", "lear_examp": "In less than 15 years Bill Gates has built up his own company from scratch and turned it into a computer giant."}]}]}, {"word": "gifted", "poses": [{"pos": "adjective", "senses": [{"sense": "A gifted person has a natural ability or is extremely intelligent.", "level": "C1", "dict_examp": "a gifted athlete", "lear_examp": "Roger Federer is a young and extremely gifted tennis player."}]}]}, {"word": "get", "poses": [{"pos": "verb", "senses": [{"sense": "to obtain or buy something", "level": "A1", "dict_examp": "I'll get some bread on the way home.", "lear_examp": "We could get the afternoon ticket."}, {"sense": "to receive or be given something", "level": "A1", "dict_examp": "I got some very nice presents for my birthday.", "lear_examp": "I got your note."}, {"sense": "to reach or arrive at a particular place", "level": "A1", "dict_examp": "We got home later than usual.", "lear_examp": "I had a good time at your house last night but when I got home I realized I had forgotten my bag!"}, {"sense": "to travel somewhere in a bus, train, taxi or other vehicle", "level": "A1", "dict_examp": "Should we get a taxi to the station?", "lear_examp": "You can get the train."}, {"sense": "to go somewhere and bring back someone or something", "level": "A2", "dict_examp": "Wait here while I get the car.", "lear_examp": "I decided to go on with my plan and get my father's car."}, {"sense": "to begin a legal relationship with someone as their husband or wife", "level": "A2", "dict_examp": "They got married in April.", "lear_examp": "She was going to get married, and I was invited to the wedding."}, {"sense": "to become ill or develop an illness", "level": "B1", "dict_examp": "I'm getting another cold.", "lear_examp": "I was angry, and I got a cold!"}, {"sense": "to start to be cold/ill/late, etc.", "level": "B1", "dict_examp": "Your coffee's getting cold.", "lear_examp": "It's getting late so I should finish now."}, {"sense": "to become more ill, unpleasant, difficult, severe, etc. than before", "level": "B1", "dict_examp": "My cold seems to be getting worse.", "lear_examp": "I thought, it couldn't get worse."}, {"sense": "to have something done to you", "level": "B1", "dict_examp": "He got killed in the war.", "lear_examp": "Two weeks ago many people at school got injured because of an explosion, so a TV company came to film what the school is like now ..."}, {"sense": "to produce an answer or result that is not correct, or to say or write something that is not correct", "level": "B1", "dict_examp": "I got most of the answers wrong.", "lear_examp": ""}, {"sense": "to do a task, or to arrange for someone to do a task for you", "level": "B1", "dict_examp": "Could you get the kids dressed?", "lear_examp": "First I have to go to the doctor and then I have to get my teeth checked by the dentist."}, {"sense": "to contact someone", "level": "B1", "dict_examp": "Please get in touch if you ever come back to Madrid.", "lear_examp": "Get in touch soon."}, {"sense": "to move to a different place or into a different position", "level": "B1", "dict_examp": "I saw her getting into his car.", "lear_examp": "They said that I got into a car by myself (they thought that I had believed the story)."}, {"sense": "to deal with or answer a ringing telephone, a knock on the door, etc.", "level": "B1", "dict_examp": "Could you get the phone, Al?", "lear_examp": ""}, {"sense": "to spend time with someone or something so that you gradually learn more about them", "level": "B1", "dict_examp": "The first couple of meetings are for the doctor and patient to get to know each other.", "lear_examp": "I hope you can come here and get to know him."}, {"sense": "to throw something away or give something to someone because you no longer want it", "level": "B1", "dict_examp": "We must get rid of some of those old books.", "lear_examp": "Do you think I'd better get rid of the sofa and place the bookshelf there?"}, {"sense": "to end something unpleasant", "level": "B2", "dict_examp": "I can't seem to get rid of this headache.", "lear_examp": "The first step is to get rid of smoking."}, {"sense": "to make something happen, or make someone or something do something", "level": "B2", "dict_examp": "I can't get my computer to work!", "lear_examp": "We must get the councillors to change their minds."}, {"sense": "to develop an opinion about a situation because of something that you notice", "level": "B2", "dict_examp": "I got the feeling that she was really angry about the situation.", "lear_examp": "I disagree with some points you mentioned and would like to share the impression I got from that popular holiday report during my two-week trip."}, {"sense": "to annoy someone, especially by doing something again and again", "level": "B2", "dict_examp": "If we spend too much time together, we end up getting on each other's nerves.", "lear_examp": "Sometimes, receiving a phone call can disturb very important events in a person's life, but it also gets on people's nerves when you use it in a public place like a train."}, {"sense": "to have the chance to do something", "level": "B2", "dict_examp": "I never got to meet her.", "lear_examp": "I did get to meet a musician, a singer named Anouk."}, {"sense": "to understand or hear something", "level": "B2", "dict_examp": "That joke that he told  - did you get it?", "lear_examp": ""}, {"sense": "to make an effort to control your emotions and behave more calmly", "level": "C1", "dict_examp": "Stop panicking and get a grip on yourself!", "lear_examp": "The best thing to do was to talk to people who were not doing the test rather than building up my anxiety. However, I did not do this and it almost resulted in a disaster, but I got a grip on myself and just barely passed."}, {"sense": "to make someone leave", "level": "C1", "dict_examp": "We finally got rid of my little sister by telling her scary stories.", "lear_examp": "Improving your English on your own (or a self-guide on how to get rid of your English teacher!)."}, {"sense": "to make sure that you completely understand a situation", "level": "C1", "dict_examp": "Let me get this straight - am I paying for this?", "lear_examp": "Next time you should try to get your facts straight."}, {"sense": "to become better organized so that you can make progress", "level": "C2", "dict_examp": "I wish she'd get her act together.", "lear_examp": "He was determined to get his act together and try to find a solution to his problem."}, {"sense": "to become difficult to control", "level": "C2", "dict_examp": "It was the end of week and the children were getting a little out of hand.", "lear_examp": "A few solutions can prevent this problem from getting out of hand."}, {"sense": "to learn how to do something, especially if it is not obvious or simple", "level": "C2", "dict_examp": "I've  never used one of these before. - Don't worry, you'll soon get the hang of it.", "lear_examp": "It was quite hard to get the hang of it, as I didn't have any knowledge of English."}, {"sense": "to hurry", "level": "C2", "dict_examp": "We're leaving in five minutes, so get moving!", "lear_examp": "\"Oh, look at the time, we must get moving!\""}, {"sense": "to hurry", "level": "C2", "dict_examp": "Come on, get a move on!", "lear_examp": "\"All the lights will be switched off in 28 minutes, so I have to get a move on,\" I said to myself, as I started to write on a new piece of paper."}, {"sense": "If something gets you nowhere, it does not help you to succeed.", "level": "C2", "dict_examp": "Bad manners will get you nowhere.", "lear_examp": "As this is a loophole in the law system, it's creating a conflict between house-owners and squatters and getting them nowhere."}, {"sense": "used to say that someone understands a situation", "level": "C2", "dict_examp": "Oh right, I get the picture.", "lear_examp": "If you use a photograph though, you can be sure that everyone will get the picture (pun intended) and probably remember the person you're talking about next time they see him."}, {"sense": "to begin", "level": "C2", "dict_examp": "The film festival gets underway on July 11th.", "lear_examp": ""}, {"sense": "to tell someone about something that you have been worried or angry about for a long time", "level": "C2", "dict_examp": "Tell me what's wrong - you'll feel better if you get it off your chest.", "lear_examp": "Chris is always caring and lends you his ear if there's something you need to get off your chest."}, {"sense": "to manage to make someone understand or believe something", "level": "B2", "dict_examp": "We tried to get our point across, but he just wouldn't                             listen.", "lear_examp": "I am going to get across several ideas to improve the look of our town."}, {"sense": "to have a good relationship", "level": "A2", "dict_examp": "She and her new roommate are getting along.", "lear_examp": "She is a journalist at the local newspaper and we get along very well."}, {"sense": "to travel or move from place to place", "level": "B1", "dict_examp": "The busses and subway make it easy to get around New York City.", "lear_examp": "The island isn't too big so I think we could get around on foot."}, {"sense": "to do something that you have intended to do for a long time", "level": "B2", "dict_examp": "I still haven't got around to fixing that faucet.", "lear_examp": "Dear Kim, I am terribly sorry not to drop you a line since the last time we wrote to one another. But I finally got around to writing and you'll see that it's definitely worth waiting as I have some great and unbelievable news to tell you."}, {"sense": "to be able to reach or get something", "level": "B2", "dict_examp": "I've put the cake on a high shelf where the kids can't get at it.", "lear_examp": ""}, {"sense": "If you ask someone what they are getting at, you are asking them what they really mean.", "level": "C1", "dict_examp": "What do you think the poet is getting at in these lines?", "lear_examp": "The point I'm getting at is that you have to understand that young people look at sports like school: it's something you do that makes you feel good afterward and computer games are something you do when you have some spare time."}, {"sense": "to leave or escape from a place or person, often when it is difficult to do this", "level": "B2", "dict_examp": "We walked to the next beach to get away from the crowds.", "lear_examp": "A bicycle is a means of making new friends, and getting away from your daily routine."}, {"sense": "to go somewhere for a short vacation, often  because you need to rest", "level": "B2", "dict_examp": "I just need to get away for a few days.", "lear_examp": "I've enjoyed the peace of getting away, you know I needed it."}, {"sense": "to succeed in not being criticized or  punished for something", "level": "B2", "dict_examp": "If I thought I could get away with it, I wouldn't pay any tax at all.", "lear_examp": "When the police arrived, the criminals had already disappeared: they got away with this murder."}, {"sense": "to return to a place after you have been somewhere else", "level": "A2", "dict_examp": "When we got back to the hotel, Ann had already left.", "lear_examp": "Will call you when I get back."}, {"sense": "to be given something again that you had before", "level": "B2", "dict_examp": "He went next door to get his ball back.", "lear_examp": "He hoped that he would get back his suitcase."}, {"sense": "to talk or write to someone at a later time to give them some information they asked for or because you were not able to speak to them before", "level": "C1", "dict_examp": "I need to get back to Gary about his new computer.", "lear_examp": "I am awfully sorry for having been slow in getting back to you."}, {"sense": "to make someone feel unhappy", "level": "B2", "dict_examp": "All this uncertainty is really getting me down.", "lear_examp": "But when I had finally reached the bottom of the valley seeing the whole ski group staring at me, the embarrassment got me down."}, {"sense": "to start doing something seriously and with a lot of attention and effort", "level": "B2", "dict_examp": "Before we get down to business, I'd like to thank you all for coming today.", "lear_examp": "Let's get down to business!"}, {"sense": "to succeed in entering a place, especially a building", "level": "B1", "dict_examp": "They must have gotten in through the bathroom window.", "lear_examp": "We had to hang out in front of the Museum for almost one hour. When we finally got in there, the tour was very short."}, {"sense": "to arrive at a place at a particular time", "level": "B1", "dict_examp": "My flight gets in at 9:45 p.m.", "lear_examp": ""}, {"sense": "to succeed in being chosen or elected", "level": "B2", "dict_examp": "He wanted to go to Stanford, but he didn't get in.", "lear_examp": "For the first time I was trying to get in a University or a High College."}, {"sense": "to succeed in being chosen or elected", "level": "B2", "dict_examp": "He got into Harvard.", "lear_examp": "A month later on, I finally got into a High College of Education, but almost 400 km from home."}, {"sense": "to become interested in an activity or subject, or start being involved in an activity", "level": "C1", "dict_examp": "How did you get into journalism?", "lear_examp": "Taking everything into account, I truly believe that \"Ethnos\" is the most suitable newspaper to be placed in the library ... for every student who would like to learn Greek deeply and get into the Greek culture and civilization."}, {"sense": "to leave a bus, train, aircraft or boat", "level": "A2", "dict_examp": "We should get off at the next stop.", "lear_examp": "Then get off the bus in Obdland Village and walk up the road."}, {"sense": "to go onto a bus, train, aircraft or boat", "level": "A2", "dict_examp": "I think we got on the wrong bus.", "lear_examp": "Last Saturday I was running to get on the bus, but my schoolbag was open and the diary fell out."}, {"sense": "to continue doing something, especially work", "level": "B2", "dict_examp": "We don’t have all day to finish this job, so can we just get on with it?", "lear_examp": "I must go and get on with my homework."}, {"sense": "to leave a closed vehicle, building, etc.", "level": "B1", "dict_examp": "I'll get out when you stop at the traffic light.", "lear_examp": "Suddenly the lights went out and I was there, desperately trying to find a way to get out of the house!"}, {"sense": "to go out to different places and meet people in order to enjoy yourself", "level": "C1", "dict_examp": "She doesn't get out as much now that she had the baby.", "lear_examp": "Since Internet, e-mails and mobile phones were invented, fewer people get out and meet friends."}, {"sense": "to avoid doing something that you do not want to do, especially by giving an excuse", "level": "B2", "dict_examp": "If I can get out of going to the meeting tonight I will.", "lear_examp": "I must go to Tokyo on business that Wednesday afternoon. This is a kind of step up for me and I can't get out of it."}, {"sense": "to escape from or leave a place, or to help someone do this", "level": "C1", "dict_examp": "I left the door open and the cat got out.", "lear_examp": "\"Don't panic, now, Lorraine\", he answered me. \"He may be a little .... um, eccentric, but I'm sure he'll get us out of here fine.\""}, {"sense": "to get better after an illness, or feel better after something or someone has made you unhappy", "level": "B2", "dict_examp": "She's still getting over the flu.", "lear_examp": "First of all, she had had to get over the deaths of three close relatives in the last three years."}, {"sense": "to be very shocked or surprised about something", "level": "B2", "dict_examp": "I can't get over how different you look with short hair.", "lear_examp": "I can't get over how quickly you wrote to me."}, {"sense": "to succeed in an examination or competition", "level": "B2", "dict_examp": "She got through her exams without too much trouble.", "lear_examp": "I know you want to get through your exams."}, {"sense": "to deal with a difficult or unpleasant experience, or to help someone do this", "level": "C1", "dict_examp": "My friendship with Carla got me through those tough months just after we moved.", "lear_examp": "You see, my friend, how life can be a bit difficult but people manage to get through it."}, {"sense": "to succeed in making someone understand or believe something", "level": "C1", "dict_examp": "I just don't seem to be able to get through to him these days.", "lear_examp": "He should make the lesson interesting and should manage to get through to children."}, {"sense": "to make someone feel upset or angry", "level": "C2", "dict_examp": "I know he's annoying but you shouldn't let him get to you.", "lear_examp": "But they are overprotective and it gets to me very much."}, {"sense": "to meet in order to do something or spend time together", "level": "B1", "dict_examp": "A few of us are getting together next week for a drink.", "lear_examp": "During a Chinese wedding ceremony, new couples wear traditional clothes and hold a party for friends and families getting together."}, {"sense": "to stand up", "level": "B2", "dict_examp": "The whole audience got up and started clapping.", "lear_examp": "When I got up on my feet again I reached out my arm to get a hold on something, but there wasn't anything to hold on to."}, {"sense": "to wake up and get out of bed, or make someone do this", "level": "A1", "dict_examp": "I had to get up at five o'clock this morning.", "lear_examp": "My friend gets up early."}]}]}, {"word": "gift", "poses": [{"pos": "noun", "senses": [{"sense": "a present or something that is given", "level": "A2", "dict_examp": "a wedding gift", "lear_examp": "The guitar was my father's gift. It is the best gift I've ever received."}, {"sense": "a natural ability or skill", "level": "C1", "dict_examp": "She has a gift for design.", "lear_examp": "He understands the thought processes of children quite well, and has a gift for making difficult concepts understandable to youngsters, which obviously means he would be a very good supervisor."}]}]}, {"word": "giraffe", "poses": [{"pos": "noun", "senses": [{"sense": "a large African animal with a very long neck and long legs", "level": "B1", "dict_examp": "Giraffes are the tallest land animals.", "lear_examp": "Animals like elephants, giraffes and exotic birds must be free. How would you feel living inside a cage?"}]}]}, {"word": "girl", "poses": [{"pos": "noun", "senses": [{"sense": "a female child or young woman", "level": "A1", "dict_examp": "Two girls showed us around the classrooms.", "lear_examp": "She has one girl."}, {"sense": "a group of female friends", "level": "B1", "dict_examp": "I'm going out with the girls tonight.", "lear_examp": "We were dancing all night at the club and I really enjoyed my time with the girls."}]}]}, {"word": "girlfriend", "poses": [{"pos": "noun", "senses": [{"sense": "a woman or girl who someone is having a romantic relationship with", "level": "A2", "dict_examp": "I've never met his girlfriend.", "lear_examp": "I danced with my mother and my girlfriend Maria."}, {"sense": "a female friend of a girl or woman", "level": "A2", "dict_examp": "She's going out with her girlfriends tonight.", "lear_examp": "I buy clothes once a month, and I usually go shopping with my mother or my girlfriends."}]}]}, {"word": "ghost", "poses": [{"pos": "noun", "senses": [{"sense": "the spirit of a dead person", "level": "B1", "dict_examp": "Do you believe in ghosts?", "lear_examp": "We saw a horror film. It was about ghosts and vampires!"}]}]}, {"word": "give", "poses": [{"pos": "verb", "senses": [{"sense": "to provide someone with something", "level": "A1", "dict_examp": "Her parents gave her a car for her birthday.", "lear_examp": "Yesterday was my birthday and my mother gave me a small dictionary."}, {"sense": "to put something near someone or in their hand so that they can use it or look at it", "level": "A2", "dict_examp": "Can you give me that pen?", "lear_examp": "We gave the monkeys some bananas to eat and played with them."}, {"sense": "to telephone someone", "level": "A2", "dict_examp": "Why don't you just give him a call?", "lear_examp": "If you have other questions, you can give me a call."}, {"sense": "to tell someone something", "level": "A2", "dict_examp": "Can you give Jo a message?", "lear_examp": "I really hope you can give me some advice."}, {"sense": "to have a party", "level": "A2", "dict_examp": "They're always giving parties.", "lear_examp": "He's a very nice guy, and I would like to give him a surprise party."}, {"sense": "to allow someone to have a right or an opportunity", "level": "B1", "dict_examp": "We didn't really give him a chance to explain.", "lear_examp": "I'll see you at seven o'clock to give you the chance to explain."}, {"sense": "to produce or cause something", "level": "B1", "dict_examp": "What you said gives me an idea.", "lear_examp": "I hope this will give you an idea of what I like."}, {"sense": "to allow someone or something a particular amount of time", "level": "B1", "dict_examp": "I'm nearly ready - just give me a few minutes.", "lear_examp": "Do you think you would be able to give me 2 hours more on Friday?"}, {"sense": "to pay someone a particular amount of money for something", "level": "B1", "dict_examp": "I gave him $40 for his old camera.", "lear_examp": "Jeffry gave me a mechanical pencil while Jack and Eugene gave me twenty dollars."}, {"sense": "to perform an action", "level": "B1", "dict_examp": "She gave a cry.", "lear_examp": "When he saw me, he gave me a big, warm hug and a sweet kiss."}, {"sense": "to perform or speak in public", "level": "B2", "dict_examp": "Tony gave a great speech to open the conference.", "lear_examp": "We would be very happy if you could come to our school and give a speech."}, {"sense": "When a woman or an animal gives birth, she produces a baby from her body.", "level": "B2", "dict_examp": "She gave birth to twins.", "lear_examp": "The most important person in my life is the person who gave birth to me, my mother."}, {"sense": "when one thing or feeling changes to a different one", "level": "B2", "dict_examp": "My excitement gave way to fear when I drove a car for the first time.", "lear_examp": "The feeling of anger they first had disappeared and gave way to a feeling of disappointment."}, {"sense": "to cause something", "level": "C2", "dict_examp": "The bacteria live in the human body but do not give rise to any symptoms.", "lear_examp": "That visit gave rise to a fruitful discussion in which various opinions were voiced and here are some comments on them."}, {"sense": "If something gives way, it falls because it is not strong enough to support the weight on top of it.", "level": "C2", "dict_examp": "The wooden seats gave way under the weight of the crowd.", "lear_examp": "Fred's voice trailed off as he felt his legs give way beneath him."}, {"sense": "to choose to believe what someone tells you even though it may be wrong or a lie", "level": "C2", "dict_examp": "She says her train was late, so I suppose we'd better give her the benefit of the doubt.", "lear_examp": "Every time our parents tell us \".. have you thought about it, are you sure you are not making a mistake?\" we just answer \"sure I have, no problem.\" Next time they do, let's give them the benefit of the doubt and let's think twice about the subject."}, {"sense": "to be slightly better than someone or something else", "level": "C2", "dict_examp": "Because of her experience she has an edge over the other applicants.", "lear_examp": "Reading the latest information, attending conferences and symposiums and being well informed in general about your field, gives you an edge over your competitors."}, {"sense": "to criticize someone and make them feel guilty about something they have done", "level": "C2", "dict_examp": "Ever since I missed that catch, the other players have been giving me a hard time.", "lear_examp": "I'm not saying that I wasn't normal or anything, I just gave my family a hard time sometimes."}, {"sense": "to give something to someone without asking for payment", "level": "B1", "dict_examp": "The bakery is giving away a sample to every customer.", "lear_examp": "She decided to give away everything she had and go to a place where nobody could find her."}, {"sense": "to tell people something secret, often without intending to", "level": "B2", "dict_examp": "The party was supposed to be a surprise, but Sharon gave it away.", "lear_examp": "He gave Matthew's secret away and this made his life come to an end."}, {"sense": "to return something to the person who gave it to you", "level": "A2", "dict_examp": "Has she given you those books back yet?", "lear_examp": "Please give it back to me tomorrow."}, {"sense": "to finally agree to what someone wants, after refusing for a period of time", "level": "B1", "dict_examp": "He nagged me so much for a new bike that eventually I gave in.", "lear_examp": "What you should do is talk to your parents and explain your problem to them. Your parents may give in!"}, {"sense": "to accept that you have been defeated and agree to stop competing or fighting", "level": "B2", "dict_examp": "You'll never guess the answer - do you give in?", "lear_examp": ""}, {"sense": "to give something to a large number of people", "level": "B1", "dict_examp": "Please give these worksheets out, Maria.", "lear_examp": "At the concert, what I had to do was to give out refreshments to the audience."}, {"sense": "to stop doing a regular activity or job", "level": "B1", "dict_examp": "We're going to give up our sports club membership after this year.", "lear_examp": "I believe that you should continue sports rather than music for as you mentioned in your letter you have always done sports and you can't give all that up for music classes."}, {"sense": "If you give up a habit, such as smoking, or something such as alcohol, you stop doing it or using it.", "level": "B1", "dict_examp": "I gave up smoking two years ago.", "lear_examp": "The reason why he is not happy could be that he can't give up drinking so much and it gets him down."}, {"sense": "to stop doing an activity or piece of work before you have completed it, usually because it is too difficult", "level": "B2", "dict_examp": "I had to give up halfway through the race.", "lear_examp": "The most important thing is that you should keep doing it. Don't give up!!"}]}]}, {"word": "giggle", "poses": [{"pos": "verb", "senses": [{"sense": "to laugh in a nervous or silly way", "level": "C2", "dict_examp": "She started giggling and couldn't stop.", "lear_examp": "Clara, a thin woman in her late fifties, giggled and her usually so flabby lips trembled as she did so."}]}]}, {"word": "glasses", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment with two transparent parts that you wear in front of your eyes to help you see better", "level": "A1", "dict_examp": "a pair of glasses", "lear_examp": "Roger, I think I have left my glasses in the kitchen."}]}]}, {"word": "glove", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of clothing which covers your fingers and hand", "level": "A2", "dict_examp": "a pair of gloves", "lear_examp": "Remember to bring gloves as well."}]}]}, {"word": "glory", "poses": [{"pos": "noun", "senses": [{"sense": "when people praise and respect you for achieving something important", "level": "C1", "dict_examp": "It was my idea, but she got all the glory.", "lear_examp": "This point of view states that it is more fulfilling for a single person to achieve a goal on their own, without having to share the glory with other people and that by doing it alone, one really feels that one has achieved something."}, {"sense": "the quality of being very impressive or beautiful", "level": "C1", "dict_examp": "The castle has been restored to its former glory.", "lear_examp": "Two years ago, the state, helped by the community of the island, gave birth to an ambitious plan to restore this beach to its former glory."}]}]}, {"word": "give", "poses": [{"pos": "verb", "senses": [{"sense": "to provide someone with something", "level": "A1", "dict_examp": "Her parents gave her a car for her birthday.", "lear_examp": "Yesterday was my birthday and my mother gave me a small dictionary."}, {"sense": "to put something near someone or in their hand so that they can use it or look at it", "level": "A2", "dict_examp": "Can you give me that pen?", "lear_examp": "We gave the monkeys some bananas to eat and played with them."}, {"sense": "to telephone someone", "level": "A2", "dict_examp": "Why don't you just give him a call?", "lear_examp": "If you have other questions, you can give me a call."}, {"sense": "to tell someone something", "level": "A2", "dict_examp": "Can you give Jo a message?", "lear_examp": "I really hope you can give me some advice."}, {"sense": "to have a party", "level": "A2", "dict_examp": "They're always giving parties.", "lear_examp": "He's a very nice guy, and I would like to give him a surprise party."}, {"sense": "to allow someone to have a right or an opportunity", "level": "B1", "dict_examp": "We didn't really give him a chance to explain.", "lear_examp": "I'll see you at seven o'clock to give you the chance to explain."}, {"sense": "to produce or cause something", "level": "B1", "dict_examp": "What you said gives me an idea.", "lear_examp": "I hope this will give you an idea of what I like."}, {"sense": "to allow someone or something a particular amount of time", "level": "B1", "dict_examp": "I'm nearly ready - just give me a few minutes.", "lear_examp": "Do you think you would be able to give me 2 hours more on Friday?"}, {"sense": "to pay someone a particular amount of money for something", "level": "B1", "dict_examp": "I gave him $40 for his old camera.", "lear_examp": "Jeffry gave me a mechanical pencil while Jack and Eugene gave me twenty dollars."}, {"sense": "to perform an action", "level": "B1", "dict_examp": "She gave a cry.", "lear_examp": "When he saw me, he gave me a big, warm hug and a sweet kiss."}, {"sense": "to perform or speak in public", "level": "B2", "dict_examp": "Tony gave a great speech to open the conference.", "lear_examp": "We would be very happy if you could come to our school and give a speech."}, {"sense": "When a woman or an animal gives birth, she produces a baby from her body.", "level": "B2", "dict_examp": "She gave birth to twins.", "lear_examp": "The most important person in my life is the person who gave birth to me, my mother."}, {"sense": "when one thing or feeling changes to a different one", "level": "B2", "dict_examp": "My excitement gave way to fear when I drove a car for the first time.", "lear_examp": "The feeling of anger they first had disappeared and gave way to a feeling of disappointment."}, {"sense": "to cause something", "level": "C2", "dict_examp": "The bacteria live in the human body but do not give rise to any symptoms.", "lear_examp": "That visit gave rise to a fruitful discussion in which various opinions were voiced and here are some comments on them."}, {"sense": "If something gives way, it falls because it is not strong enough to support the weight on top of it.", "level": "C2", "dict_examp": "The wooden seats gave way under the weight of the crowd.", "lear_examp": "Fred's voice trailed off as he felt his legs give way beneath him."}, {"sense": "to choose to believe what someone tells you even though it may be wrong or a lie", "level": "C2", "dict_examp": "She says her train was late, so I suppose we'd better give her the benefit of the doubt.", "lear_examp": "Every time our parents tell us \".. have you thought about it, are you sure you are not making a mistake?\" we just answer \"sure I have, no problem.\" Next time they do, let's give them the benefit of the doubt and let's think twice about the subject."}, {"sense": "to be slightly better than someone or something else", "level": "C2", "dict_examp": "Because of her experience she has an edge over the other applicants.", "lear_examp": "Reading the latest information, attending conferences and symposiums and being well informed in general about your field, gives you an edge over your competitors."}, {"sense": "to criticize someone and make them feel guilty about something they have done", "level": "C2", "dict_examp": "Ever since I missed that catch, the other players have been giving me a hard time.", "lear_examp": "I'm not saying that I wasn't normal or anything, I just gave my family a hard time sometimes."}, {"sense": "to give something to someone without asking for payment", "level": "B1", "dict_examp": "The bakery is giving away a sample to every customer.", "lear_examp": "She decided to give away everything she had and go to a place where nobody could find her."}, {"sense": "to tell people something secret, often without intending to", "level": "B2", "dict_examp": "The party was supposed to be a surprise, but Sharon gave it away.", "lear_examp": "He gave Matthew's secret away and this made his life come to an end."}, {"sense": "to return something to the person who gave it to you", "level": "A2", "dict_examp": "Has she given you those books back yet?", "lear_examp": "Please give it back to me tomorrow."}, {"sense": "to finally agree to what someone wants, after refusing for a period of time", "level": "B1", "dict_examp": "He nagged me so much for a new bike that eventually I gave in.", "lear_examp": "What you should do is talk to your parents and explain your problem to them. Your parents may give in!"}, {"sense": "to accept that you have been defeated and agree to stop competing or fighting", "level": "B2", "dict_examp": "You'll never guess the answer - do you give in?", "lear_examp": ""}, {"sense": "to give something to a large number of people", "level": "B1", "dict_examp": "Please give these worksheets out, Maria.", "lear_examp": "At the concert, what I had to do was to give out refreshments to the audience."}, {"sense": "to stop doing a regular activity or job", "level": "B1", "dict_examp": "We're going to give up our sports club membership after this year.", "lear_examp": "I believe that you should continue sports rather than music for as you mentioned in your letter you have always done sports and you can't give all that up for music classes."}, {"sense": "If you give up a habit, such as smoking, or something such as alcohol, you stop doing it or using it.", "level": "B1", "dict_examp": "I gave up smoking two years ago.", "lear_examp": "The reason why he is not happy could be that he can't give up drinking so much and it gets him down."}, {"sense": "to stop doing an activity or piece of work before you have completed it, usually because it is too difficult", "level": "B2", "dict_examp": "I had to give up halfway through the race.", "lear_examp": "The most important thing is that you should keep doing it. Don't give up!!"}]}]}, {"word": "glue", "poses": [{"pos": "noun", "senses": [{"sense": "a substance used to stick things together", "level": "C2", "dict_examp": "Put a little glue on both edges and hold them together.", "lear_examp": "On the contrary, sometimes, with the help of our teachers, we had to fix them using \"emergency\" solutions and materials, such as tape and glue."}]}, {"pos": "verb", "senses": [{"sense": "to stick something to something else with glue", "level": "C2", "dict_examp": "Do you think you can glue this vase back together?", "lear_examp": "That is why my father glued and nailed the back of it so nobody could ever open the frame."}, {"sense": "to be watching something, especially television", "level": "C2", "dict_examp": "The kids were glued to the TV all morning.", "lear_examp": "In general, it can be said that the modern mass obsession with television has led to the fact that more people nowadays lead a sedentary way of life, not to mention their being couch potatoes, glued to the screen for most of their leisure time."}]}]}, {"word": "glow", "poses": [{"pos": "noun", "senses": [{"sense": "a soft, warm light", "level": "C2", "dict_examp": "the warm glow of the moon", "lear_examp": "The sun was setting, leaving a pink glow on everything it touched and the air smelled like fresh-cut grass."}, {"sense": "when your face feels or appears warm and healthy", "level": "C2", "dict_examp": "Sam's face had lost its rosy glow.", "lear_examp": "After about three weeks of using this product by Morway Company, you will notice that your face looks softer and has a natural healthy glow."}]}, {"pos": "verb", "senses": [{"sense": "to produce a soft, warm light", "level": "C2", "dict_examp": "toys that glow in the dark", "lear_examp": "You can safely invest in juggling equipment that glows in the dark, has flashing lights - or even that is set afire before starting to juggle with it."}, {"sense": "to have a warm and healthy appearance", "level": "C2", "dict_examp": "Her eyes were bright and her cheeks were glowing.", "lear_examp": "While the tourists were getting dressed, Ingrid, a tall middle-aged woman, checked the humidity of her armpits and that reminded her of the sentence: \"Horses sweat, men perspire, women glow.\""}, {"sense": "to feel very happy, proud, etc.", "level": "C2", "dict_examp": "Glowing with pride, she showed me her painting.", "lear_examp": "I never use it, of course, but just knowing I possess it makes me glow with happiness."}]}]}, {"word": "global", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the whole world", "level": "B2", "dict_examp": "a global disaster", "lear_examp": "The improvement of electronics and global communications has made it possible to keep in close contact with friends all over the world."}]}]}, {"word": "go", "poses": [{"pos": "verb", "senses": [{"sense": "to move or travel somewhere", "level": "A1", "dict_examp": "I'd like to go to Japan.", "lear_examp": "I'd like to go to Hawaii."}, {"sense": "to move or travel somewhere in order to do something", "level": "A1", "dict_examp": "Let's go for a walk.", "lear_examp": "I also have a dog and I like to go for a walk with him."}, {"sense": "to visit stores in order to buy things", "level": "A1", "dict_examp": "We went shopping last Saturday.", "lear_examp": "We often go shopping."}, {"sense": "to go somewhere to do a particular activity", "level": "A2", "dict_examp": "We went skating yesterday.", "lear_examp": "I'd like to go swimming."}, {"sense": "to intend to do or be something", "level": "A2", "dict_examp": "I'm going to call her tonight.", "lear_examp": "I'm going to paint my bedroom yellow."}, {"sense": "used to say that something is expected to happen in the future", "level": "A2", "dict_examp": "It's going to snow tonight.", "lear_examp": "I think it's going to rain tomorrow."}, {"sense": "to empty the body of urine or solid waste, usually using a toilet in a bathroom", "level": "A2", "dict_examp": "It's going to be a long ride, kids, so if you need to go to the bathroom do it now.", "lear_examp": "Where did he leave his suitcase? He was going to miss his flight.  He remembered he had gone to the bathroom! He hurried and found his suitcase!"}, {"sense": "to develop in a particular way", "level": "B1", "dict_examp": "My exams went really well.", "lear_examp": "I hope everything is going well."}, {"sense": "to develop problems", "level": "B1", "dict_examp": "Something's gone wrong with my computer.", "lear_examp": "Despite all that went wrong, there was something I really enjoyed. It was visiting the Diamond Cave."}, {"sense": "to disappear or no longer exist", "level": "B1", "dict_examp": "The food was all gone by the time we got to the party.", "lear_examp": "When I came to take my suitcase, it had gone!"}, {"sense": "If two things go, they match each other.", "level": "B1", "dict_examp": "That top doesn't go with these pants.", "lear_examp": ""}, {"sense": "to become bald/blind/gray, etc.", "level": "B1", "dict_examp": "He went bald in his twenties.", "lear_examp": ""}, {"sense": "If a road, path, etc. goes in a particular direction, it leads there.", "level": "B1", "dict_examp": "This road goes north to Vermont.", "lear_examp": ""}, {"sense": "If you ask for some food to go at a restaurant, you are asking for food that you can take away with you instead of eating it in the restaurant.", "level": "B1", "dict_examp": "I'd like a cheeseburger and strawberry milk shake to go, please.", "lear_examp": ""}, {"sense": "to have a particular tune or words", "level": "B2", "dict_examp": "I can't remember how his latest song goes.", "lear_examp": ""}, {"sense": "If time goes, it passes.", "level": "B2", "dict_examp": "The day went very quickly.", "lear_examp": "But the time went so quickly and now I am in my early sixties with a lot of spare time."}, {"sense": "to make a particular sound or movement", "level": "B2", "dict_examp": "A cat goes \"Miaow.\"", "lear_examp": ""}, {"sense": "to work in the right way", "level": "B2", "dict_examp": "Did you get the car going?", "lear_examp": ""}, {"sense": "to stop working correctly", "level": "B2", "dict_examp": "She's very old and her hearing is going.", "lear_examp": ""}, {"sense": "to tell or include all the facts about something", "level": "B2", "dict_examp": "I won't go into detail over the phone, but I've been having a few health problems recently.", "lear_examp": "In one of his books he really goes into detail about how children treat other children who have difficulties with their \"new\" language."}, {"sense": "If someone goes red, their face becomes red because they are embarrassed or angry.", "level": "B2", "dict_examp": "He kissed her on the cheek and she went bright red.", "lear_examp": "When Paul saw the girl who had got blond hair and bluish eyes, his face suddenly went red."}, {"sense": "If something goes without saying, it is obvious or generally accepted.", "level": "B2", "dict_examp": "It goes without saying that smoking is harmful to your health.", "lear_examp": "It goes without saying that I will participate!"}, {"sense": "If two things go hand in hand, they exist together and are connected with each other.", "level": "C1", "dict_examp": "Prosperity goes hand in hand with investment.", "lear_examp": "Traffic and pollution go hand in hand."}, {"sense": "to provide what someone needs for a short period of time", "level": "C1", "dict_examp": "Dinner is at eight, but I had an apple to keep me going.", "lear_examp": "Because of health concerns, advertisements lately show the people in Holland how important it is to have a good breakfast and that it will keep you going the whole day."}, {"sense": "to gradually become worse", "level": "C2", "dict_examp": "After his wife died, his health started to go downhill.", "lear_examp": "He had been going downhill in the last few days and so his death came as no surprise."}, {"sense": "to take the extreme action of doing something", "level": "C2", "dict_examp": "He even went so far as to stop her using the telephone.", "lear_examp": "Our present course of action may go so far as to cause irreversible damage not only to our planet but also to the people living upon it."}, {"sense": "to behave in a way that upsets or annoys other people", "level": "C2", "dict_examp": "He's said some stupid things in the past, but this time he's gone too far.", "lear_examp": "Lucia let her speak and calmly said: \"You really have gone too far this time.\""}, {"sense": "to do or accept what other people are doing because it is the easiest thing to do", "level": "C2", "dict_examp": "Just relax and go with the flow!", "lear_examp": "At this stage of her progress towards knowing herself better she has accepted that life is a muddle and that to a certain extent one has to go with the flow."}, {"sense": "If something goes against the grain, it is something you would not normally do.", "level": "C2", "dict_examp": "It goes against the grain to throw all this food away.", "lear_examp": "She tries to dodge George because she is afraid of admitting the fact that she loves him. It simply goes against the grain."}, {"sense": "to do something because you are expected to do it and not because you want to", "level": "C2", "dict_examp": "Lately he seems to just go through the motions and doesn't enjoy the job at all.", "lear_examp": "She went through the motions of every-day-life without enthusiasm."}, {"sense": "to do something too much, or to be too excited about something", "level": "C2", "dict_examp": "I think I went overboard cooking this dinner – there is enough to feed a dozen people.", "lear_examp": "While no one should restrict their eating habits to the point eating is no longer a pleasure, but rather a chore, it is important not to go overboard, completely disregarding the advice of nutrition experts."}, {"sense": "to try very hard to do something pleasant for someone", "level": "C2", "dict_examp": "He went out of his way to make us feel welcome.", "lear_examp": ""}, {"sense": "continuing to be successful or healthy after a long time", "level": "C2", "dict_examp": "The club was set up in 1987, and it's still going strong.", "lear_examp": "I am proud of him and happy that he is still going strong."}, {"sense": "to start to do something", "level": "B2", "dict_examp": "We now have permission to go ahead with the project.", "lear_examp": "I felt depressed under my parents' pressure, but I had something stronger deep inside of me saying that I should go ahead with my plan."}, {"sense": "something that you say to someone to allow them to do something", "level": "B2", "dict_examp": "\"Can I borrow your book?\" - \"Yes, go ahead.\"", "lear_examp": "Everyone needs something sweet from time to time. Go ahead but don't eat it too often, eat more fruit and vegetables!"}, {"sense": "to leave a place", "level": "B1", "dict_examp": "Just go away and leave me alone, will you?", "lear_examp": "A big dog appeared. We were very scared. However, the dog went away and we were able to spend a beautiful day, walking, and breathing clean air."}, {"sense": "to leave your home in order to spend time in a different place", "level": "B1", "dict_examp": "We're going away for a few weeks in the summer.", "lear_examp": "My grandparents had gone away for a week."}, {"sense": "to return to a place where you were or where you have been before", "level": "B1", "dict_examp": "When are you going back to Paris?", "lear_examp": "So I went back to the classroom, picked up my bag and went home."}, {"sense": "If time goes by, it passes.", "level": "B2", "dict_examp": "The days went by really slowly.", "lear_examp": "The night went by slowly and my family and I had a great time and a lot of fun."}, {"sense": "to become lower in level", "level": "B1", "dict_examp": "House prices have gone down recently.", "lear_examp": "Here in my city the temperature is going down, in the newspaper I read that this winter may be the coldest in many years so I'd like to buy a coat soon."}, {"sense": "When the sun goes down, it moves down in the sky until it cannot be seen any more.", "level": "B1", "dict_examp": "I sat with Ken and Olga and watched the sun go down.", "lear_examp": "Late in the evening we can go to the beach and see the sun go down."}, {"sense": "to choose something", "level": "B2", "dict_examp": "I don't know whether to go for the fish or the steak.", "lear_examp": "Please, in your next letter, let me know what kind of shopping you go for."}, {"sense": "to try to get or achieve something", "level": "B2", "dict_examp": "He'll be going for his fifth Olympic gold medal.", "lear_examp": ""}, {"sense": "to enter a place", "level": "A2", "dict_examp": "I looked through the window but I didn't go in.", "lear_examp": "Surprisingly there was no one in the house so I used the key to open the door and then I went in."}, {"sense": "to leave a place and go somewhere else", "level": "B1", "dict_examp": "They've gone off to the diner.", "lear_examp": "Luckily someone came along soon afterwards and they went off to phone for an ambulance which brought us here."}, {"sense": "If a light or machine goes off, it stops working.", "level": "B1", "dict_examp": "The heating goes off at 10 o'clock.", "lear_examp": "Suddenly the computer shut down and the light went off."}, {"sense": "If something that makes a noise goes off, it suddenly starts making a noise.", "level": "B2", "dict_examp": "His car alarm goes off every time it rains.", "lear_examp": "Unfortunately one of those buttons was the alarm which should be pressed in case of fire and it went off and all the staff from the restaurant came downstairs quickly."}, {"sense": "If a bomb or a gun goes off, it explodes or fires.", "level": "B2", "dict_examp": "A bomb went off in the parking lot, killing three people.", "lear_examp": ""}, {"sense": "to continue to happen or exist", "level": "B1", "dict_examp": "The meeting went on until six o'clock.", "lear_examp": "Jonathan, this can't go on any more, this week you spent with me I could see you have been working too hard."}, {"sense": "to happen", "level": "B1", "dict_examp": "Why aren't they here yet? What's going on?", "lear_examp": "\"What is going on?\", I asked."}, {"sense": "to continue doing something", "level": "B2", "dict_examp": "We can't go on living like this.", "lear_examp": "There are many people who think that even if technology improves, our lifestyles will not change much. They think we will go on dealing with problems at home as we have always done."}, {"sense": "to leave a place in order to go somewhere else", "level": "A1", "dict_examp": "Are you going out tonight?", "lear_examp": "I like to go out with my friends."}, {"sense": "If two people go out together, they have a romantic relationship with each other.", "level": "B1", "dict_examp": "I've been going out with Peter for a year.", "lear_examp": "Her name is Francesca and I met her at university. She is very nice, so we decided to go out together."}, {"sense": "If a light or something that is burning goes out, it stops producing light or heat.", "level": "B1", "dict_examp": "Should I put some more wood on the fire or let it go out?", "lear_examp": "I have never believed in ghosts, but why did the lights go out?"}, {"sense": "to examine something, such as a piece of writing or some numbers, in order to make sure that it is correct", "level": "B2", "dict_examp": "I'm just going over these figures one more time.", "lear_examp": ""}, {"sense": "to experience a difficult or unpleasant situation or event", "level": "B2", "dict_examp": "She's going through a difficult time at her job.", "lear_examp": "We went through a dreadful experience you can be sure."}, {"sense": "to become higher in level", "level": "B1", "dict_examp": "Food prices keep going up.", "lear_examp": "You should have a lot of money because the cost of living is going up."}]}]}, {"word": "glance", "poses": [{"pos": "verb", "senses": [{"sense": "to look somewhere for a short time", "level": "B1", "dict_examp": "He glanced at his watch.", "lear_examp": "From my seat at the café table I was glancing at this man when suddenly two men in black jackets, and wearing sunglasses ran and tackled the stranger, knocking him out."}, {"sense": "to read something quickly", "level": "B2", "dict_examp": "She glanced through the newspaper.", "lear_examp": "As you know, I always like glancing at some international newspapers."}]}, {"pos": "noun", "senses": [{"sense": "a quick  look", "level": "B2", "dict_examp": "She took a quick glance around the restaurant but couldn't see him.", "lear_examp": "Just have a glance at the enclosed menu."}, {"sense": "If you see or understand something at a glance, you see or understand it almost immediately.", "level": "C1", "dict_examp": "He could tell at a glance that something was wrong.", "lear_examp": "You could tell at a glance that Peter was a loner."}]}]}, {"word": "glass", "poses": [{"pos": "noun", "senses": [{"sense": "a hard transparent substance that objects such as windows and bottles are made of", "level": "A1", "dict_examp": "broken glass", "lear_examp": "The present I loved the most was a cute little cat made from glass."}, {"sense": "a container made of glass that is used for drinking", "level": "A1", "dict_examp": "Would you like a glass of water?", "lear_examp": "Usually for breakfast we have some sandwiches with cheese and ham and a glass of milk."}]}]}, {"word": "glamour", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being attractive, exciting and special", "level": "C1", "dict_examp": "Hollywood glamour", "lear_examp": "The red carpet, the glamour, the glitter, the fame are things we all dream about at one point or another in our lives."}]}]}, {"word": "give-and-take", "poses": [{"pos": "noun", "senses": [{"sense": "the willingness to accept some of another person's ideas and give up some of your own", "level": "C2", "dict_examp": "Any successful negotiation involves some give-and-take.", "lear_examp": "It is a give-and-take suggestion that in the sum up benefits the sector of population which is not under the coverage of state programs."}]}]}, {"word": "glad", "poses": [{"pos": "adjective", "senses": [{"sense": "pleased and happy", "level": "A2", "dict_examp": "I'm glad (that) you came.", "lear_examp": "I'm very glad to hear that."}, {"sense": "very willing to do something", "level": "B2", "dict_examp": "She's always glad to help.", "lear_examp": "I know him personally and I'm sure he'll be very glad to help you."}, {"sense": "to be grateful for something", "level": "C1", "dict_examp": "I'm glad of the opportunity to express my thanks.", "lear_examp": "I lived in a very nice host family (I am very glad of it), but it was too big a distance from the school - about four miles."}]}]}, {"word": "globally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that relates to the whole world", "level": "B2", "dict_examp": "The company has to be able to compete                         globally.", "lear_examp": "Since I went to Canada, I realized we should think about environmental pollution globally."}]}]}, {"word": "global warming", "poses": [{"pos": "noun", "senses": [{"sense": "a gradual increase in world temperatures caused by polluting gases", "level": "B2", "dict_examp": "Very few people now deny that global warming is caused by humankind.", "lear_examp": "Also, due to global warming, sea levels might rise and the risk of flooding will also rise."}]}]}, {"word": "glimpse", "poses": [{"pos": "noun", "senses": [{"sense": "when you see something or someone for a very short time", "level": "C1", "dict_examp": "He caught/got a glimpse of her as she got into the car.", "lear_examp": "If you go to Canada, like I did, you will enjoy great camping in the Rockies and might even catch a glimpse of the famous bears."}]}]}, {"word": "globalization", "poses": [{"pos": "noun", "senses": [{"sense": "the process by which businesses operate in many different countries and the culture of different countries becomes more similar", "level": "C1", "dict_examp": "the globalization of fashion", "lear_examp": "These dishes have been eaten for generations.  However, globalization and changing work patterns have changed traditions in big cities."}]}]}, {"word": "globe", "poses": [{"pos": "noun", "senses": [{"sense": "the world", "level": "C2", "dict_examp": "This event is being watched by 200 million people around the globe.", "lear_examp": "He has given numerous speeches around the globe, in which he always captivated the audience."}]}]}, {"word": "glare", "poses": [{"pos": "noun", "senses": [{"sense": "strong, bright light that hurts your eyes", "level": "C2", "dict_examp": "I get a lot of glare from my computer screen.", "lear_examp": "As often as not, pressing the switch gave no result or yielded the glare of a naked bulb."}, {"sense": "a long, angry look", "level": "C2", "dict_examp": "She gave me an angry glare.", "lear_examp": "His glare said everything; she was the worst thing that had ever happened to the school."}]}, {"pos": "verb", "senses": [{"sense": "to look at someone in an angry way", "level": "C2", "dict_examp": "She glared at him and stormed out of the room.", "lear_examp": "You open the door and \"Surprise!!\": it's your mother and father, who have just arrived from the country to spend the weekend with you. You glare at your mother, imagining that."}]}]}, {"word": "god", "poses": [{"pos": "noun", "senses": [{"sense": "in Jewish, Christian, or Muslim belief, the spirit who created the universe and everything in it", "level": "A2", "dict_examp": "Do you believe in God?", "lear_examp": "The book talks about God's love."}, {"sense": "used to emphasize how surprised, angry, shocked, etc. you are", "level": "B1", "dict_examp": "Oh my God! The car's been stolen.", "lear_examp": "Oh my god, your sister is getting married!"}, {"sense": "something you say when you are happy because something bad did not happen", "level": "B1", "dict_examp": "Thank God nobody was hurt in the accident.", "lear_examp": "\"Thank God my car is OK\", he said."}, {"sense": "a spirit, especially a male one, that people pray to and who has control over parts of the world or nature", "level": "B2", "dict_examp": "the ancient Greek gods and goddesses", "lear_examp": "It was circled by a halo of light as if some gods had blessed it."}]}]}, {"word": "goat", "poses": [{"pos": "noun", "senses": [{"sense": "an animal with horns which is kept to provide milk, meat, etc.", "level": "B1", "dict_examp": "goat cheese", "lear_examp": "You can enjoy watching camels and goats passing once in the morning and again in the evening."}]}]}, {"word": "goalkeeper", "poses": [{"pos": "noun", "senses": [{"sense": "the player who stands in the team's goal to try to stop the other team from scoring", "level": "B1", "dict_examp": "He was his college soccer team's goalkeeper.", "lear_examp": "He is a very good goalkeeper."}]}]}, {"word": "goal", "poses": [{"pos": "noun", "senses": [{"sense": "a point scored in sports such as soccer, when a player sends a ball or other object into a particular area, such as between two posts", "level": "A2", "dict_examp": "He scored two goals in the second half.", "lear_examp": "I scored ten goals."}, {"sense": "in some sports, the area between two posts, where players try to send the ball or other object", "level": "A2", "dict_examp": "Terry headed the ball towards the goal.", "lear_examp": "I usually play in goal, but sometimes I play in attack too."}, {"sense": "an aim or purpose", "level": "B1", "dict_examp": "Do you think I'll be able to achieve my goal of losing 10 pounds?", "lear_examp": "My goal for the future is to be a sail boat captain and this trip would be a good opportunity to practise my skills."}]}]}, {"word": "go", "poses": [{"pos": "verb", "senses": [{"sense": "to move or travel somewhere", "level": "A1", "dict_examp": "I'd like to go to Japan.", "lear_examp": "I'd like to go to Hawaii."}, {"sense": "to move or travel somewhere in order to do something", "level": "A1", "dict_examp": "Let's go for a walk.", "lear_examp": "I also have a dog and I like to go for a walk with him."}, {"sense": "to visit stores in order to buy things", "level": "A1", "dict_examp": "We went shopping last Saturday.", "lear_examp": "We often go shopping."}, {"sense": "to go somewhere to do a particular activity", "level": "A2", "dict_examp": "We went skating yesterday.", "lear_examp": "I'd like to go swimming."}, {"sense": "to intend to do or be something", "level": "A2", "dict_examp": "I'm going to call her tonight.", "lear_examp": "I'm going to paint my bedroom yellow."}, {"sense": "used to say that something is expected to happen in the future", "level": "A2", "dict_examp": "It's going to snow tonight.", "lear_examp": "I think it's going to rain tomorrow."}, {"sense": "to empty the body of urine or solid waste, usually using a toilet in a bathroom", "level": "A2", "dict_examp": "It's going to be a long ride, kids, so if you need to go to the bathroom do it now.", "lear_examp": "Where did he leave his suitcase? He was going to miss his flight.  He remembered he had gone to the bathroom! He hurried and found his suitcase!"}, {"sense": "to develop in a particular way", "level": "B1", "dict_examp": "My exams went really well.", "lear_examp": "I hope everything is going well."}, {"sense": "to develop problems", "level": "B1", "dict_examp": "Something's gone wrong with my computer.", "lear_examp": "Despite all that went wrong, there was something I really enjoyed. It was visiting the Diamond Cave."}, {"sense": "to disappear or no longer exist", "level": "B1", "dict_examp": "The food was all gone by the time we got to the party.", "lear_examp": "When I came to take my suitcase, it had gone!"}, {"sense": "If two things go, they match each other.", "level": "B1", "dict_examp": "That top doesn't go with these pants.", "lear_examp": ""}, {"sense": "to become bald/blind/gray, etc.", "level": "B1", "dict_examp": "He went bald in his twenties.", "lear_examp": ""}, {"sense": "If a road, path, etc. goes in a particular direction, it leads there.", "level": "B1", "dict_examp": "This road goes north to Vermont.", "lear_examp": ""}, {"sense": "If you ask for some food to go at a restaurant, you are asking for food that you can take away with you instead of eating it in the restaurant.", "level": "B1", "dict_examp": "I'd like a cheeseburger and strawberry milk shake to go, please.", "lear_examp": ""}, {"sense": "to have a particular tune or words", "level": "B2", "dict_examp": "I can't remember how his latest song goes.", "lear_examp": ""}, {"sense": "If time goes, it passes.", "level": "B2", "dict_examp": "The day went very quickly.", "lear_examp": "But the time went so quickly and now I am in my early sixties with a lot of spare time."}, {"sense": "to make a particular sound or movement", "level": "B2", "dict_examp": "A cat goes \"Miaow.\"", "lear_examp": ""}, {"sense": "to work in the right way", "level": "B2", "dict_examp": "Did you get the car going?", "lear_examp": ""}, {"sense": "to stop working correctly", "level": "B2", "dict_examp": "She's very old and her hearing is going.", "lear_examp": ""}, {"sense": "to tell or include all the facts about something", "level": "B2", "dict_examp": "I won't go into detail over the phone, but I've been having a few health problems recently.", "lear_examp": "In one of his books he really goes into detail about how children treat other children who have difficulties with their \"new\" language."}, {"sense": "If someone goes red, their face becomes red because they are embarrassed or angry.", "level": "B2", "dict_examp": "He kissed her on the cheek and she went bright red.", "lear_examp": "When Paul saw the girl who had got blond hair and bluish eyes, his face suddenly went red."}, {"sense": "If something goes without saying, it is obvious or generally accepted.", "level": "B2", "dict_examp": "It goes without saying that smoking is harmful to your health.", "lear_examp": "It goes without saying that I will participate!"}, {"sense": "If two things go hand in hand, they exist together and are connected with each other.", "level": "C1", "dict_examp": "Prosperity goes hand in hand with investment.", "lear_examp": "Traffic and pollution go hand in hand."}, {"sense": "to provide what someone needs for a short period of time", "level": "C1", "dict_examp": "Dinner is at eight, but I had an apple to keep me going.", "lear_examp": "Because of health concerns, advertisements lately show the people in Holland how important it is to have a good breakfast and that it will keep you going the whole day."}, {"sense": "to gradually become worse", "level": "C2", "dict_examp": "After his wife died, his health started to go downhill.", "lear_examp": "He had been going downhill in the last few days and so his death came as no surprise."}, {"sense": "to take the extreme action of doing something", "level": "C2", "dict_examp": "He even went so far as to stop her using the telephone.", "lear_examp": "Our present course of action may go so far as to cause irreversible damage not only to our planet but also to the people living upon it."}, {"sense": "to behave in a way that upsets or annoys other people", "level": "C2", "dict_examp": "He's said some stupid things in the past, but this time he's gone too far.", "lear_examp": "Lucia let her speak and calmly said: \"You really have gone too far this time.\""}, {"sense": "to do or accept what other people are doing because it is the easiest thing to do", "level": "C2", "dict_examp": "Just relax and go with the flow!", "lear_examp": "At this stage of her progress towards knowing herself better she has accepted that life is a muddle and that to a certain extent one has to go with the flow."}, {"sense": "If something goes against the grain, it is something you would not normally do.", "level": "C2", "dict_examp": "It goes against the grain to throw all this food away.", "lear_examp": "She tries to dodge George because she is afraid of admitting the fact that she loves him. It simply goes against the grain."}, {"sense": "to do something because you are expected to do it and not because you want to", "level": "C2", "dict_examp": "Lately he seems to just go through the motions and doesn't enjoy the job at all.", "lear_examp": "She went through the motions of every-day-life without enthusiasm."}, {"sense": "to do something too much, or to be too excited about something", "level": "C2", "dict_examp": "I think I went overboard cooking this dinner – there is enough to feed a dozen people.", "lear_examp": "While no one should restrict their eating habits to the point eating is no longer a pleasure, but rather a chore, it is important not to go overboard, completely disregarding the advice of nutrition experts."}, {"sense": "to try very hard to do something pleasant for someone", "level": "C2", "dict_examp": "He went out of his way to make us feel welcome.", "lear_examp": ""}, {"sense": "continuing to be successful or healthy after a long time", "level": "C2", "dict_examp": "The club was set up in 1987, and it's still going strong.", "lear_examp": "I am proud of him and happy that he is still going strong."}, {"sense": "to start to do something", "level": "B2", "dict_examp": "We now have permission to go ahead with the project.", "lear_examp": "I felt depressed under my parents' pressure, but I had something stronger deep inside of me saying that I should go ahead with my plan."}, {"sense": "something that you say to someone to allow them to do something", "level": "B2", "dict_examp": "\"Can I borrow your book?\" - \"Yes, go ahead.\"", "lear_examp": "Everyone needs something sweet from time to time. Go ahead but don't eat it too often, eat more fruit and vegetables!"}, {"sense": "to leave a place", "level": "B1", "dict_examp": "Just go away and leave me alone, will you?", "lear_examp": "A big dog appeared. We were very scared. However, the dog went away and we were able to spend a beautiful day, walking, and breathing clean air."}, {"sense": "to leave your home in order to spend time in a different place", "level": "B1", "dict_examp": "We're going away for a few weeks in the summer.", "lear_examp": "My grandparents had gone away for a week."}, {"sense": "to return to a place where you were or where you have been before", "level": "B1", "dict_examp": "When are you going back to Paris?", "lear_examp": "So I went back to the classroom, picked up my bag and went home."}, {"sense": "If time goes by, it passes.", "level": "B2", "dict_examp": "The days went by really slowly.", "lear_examp": "The night went by slowly and my family and I had a great time and a lot of fun."}, {"sense": "to become lower in level", "level": "B1", "dict_examp": "House prices have gone down recently.", "lear_examp": "Here in my city the temperature is going down, in the newspaper I read that this winter may be the coldest in many years so I'd like to buy a coat soon."}, {"sense": "When the sun goes down, it moves down in the sky until it cannot be seen any more.", "level": "B1", "dict_examp": "I sat with Ken and Olga and watched the sun go down.", "lear_examp": "Late in the evening we can go to the beach and see the sun go down."}, {"sense": "to choose something", "level": "B2", "dict_examp": "I don't know whether to go for the fish or the steak.", "lear_examp": "Please, in your next letter, let me know what kind of shopping you go for."}, {"sense": "to try to get or achieve something", "level": "B2", "dict_examp": "He'll be going for his fifth Olympic gold medal.", "lear_examp": ""}, {"sense": "to enter a place", "level": "A2", "dict_examp": "I looked through the window but I didn't go in.", "lear_examp": "Surprisingly there was no one in the house so I used the key to open the door and then I went in."}, {"sense": "to leave a place and go somewhere else", "level": "B1", "dict_examp": "They've gone off to the diner.", "lear_examp": "Luckily someone came along soon afterwards and they went off to phone for an ambulance which brought us here."}, {"sense": "If a light or machine goes off, it stops working.", "level": "B1", "dict_examp": "The heating goes off at 10 o'clock.", "lear_examp": "Suddenly the computer shut down and the light went off."}, {"sense": "If something that makes a noise goes off, it suddenly starts making a noise.", "level": "B2", "dict_examp": "His car alarm goes off every time it rains.", "lear_examp": "Unfortunately one of those buttons was the alarm which should be pressed in case of fire and it went off and all the staff from the restaurant came downstairs quickly."}, {"sense": "If a bomb or a gun goes off, it explodes or fires.", "level": "B2", "dict_examp": "A bomb went off in the parking lot, killing three people.", "lear_examp": ""}, {"sense": "to continue to happen or exist", "level": "B1", "dict_examp": "The meeting went on until six o'clock.", "lear_examp": "Jonathan, this can't go on any more, this week you spent with me I could see you have been working too hard."}, {"sense": "to happen", "level": "B1", "dict_examp": "Why aren't they here yet? What's going on?", "lear_examp": "\"What is going on?\", I asked."}, {"sense": "to continue doing something", "level": "B2", "dict_examp": "We can't go on living like this.", "lear_examp": "There are many people who think that even if technology improves, our lifestyles will not change much. They think we will go on dealing with problems at home as we have always done."}, {"sense": "to leave a place in order to go somewhere else", "level": "A1", "dict_examp": "Are you going out tonight?", "lear_examp": "I like to go out with my friends."}, {"sense": "If two people go out together, they have a romantic relationship with each other.", "level": "B1", "dict_examp": "I've been going out with Peter for a year.", "lear_examp": "Her name is Francesca and I met her at university. She is very nice, so we decided to go out together."}, {"sense": "If a light or something that is burning goes out, it stops producing light or heat.", "level": "B1", "dict_examp": "Should I put some more wood on the fire or let it go out?", "lear_examp": "I have never believed in ghosts, but why did the lights go out?"}, {"sense": "to examine something, such as a piece of writing or some numbers, in order to make sure that it is correct", "level": "B2", "dict_examp": "I'm just going over these figures one more time.", "lear_examp": ""}, {"sense": "to experience a difficult or unpleasant situation or event", "level": "B2", "dict_examp": "She's going through a difficult time at her job.", "lear_examp": "We went through a dreadful experience you can be sure."}, {"sense": "to become higher in level", "level": "B1", "dict_examp": "Food prices keep going up.", "lear_examp": "You should have a lot of money because the cost of living is going up."}]}]}, {"word": "golden", "poses": [{"pos": "adjective", "senses": [{"sense": "made of gold", "level": "A2", "dict_examp": "a golden ring", "lear_examp": "Marinella, I have left my golden ring at your house."}, {"sense": "being the bright yellow color of gold", "level": "A2", "dict_examp": "her golden hair", "lear_examp": "It is a mermaid Barbie with long golden hair."}, {"sense": "special, successful, or giving someone an advantage", "level": "B2", "dict_examp": "He has a golden opportunity to do research.", "lear_examp": "As you know, my uncle has some friends in the music world and it was a golden opportunity when he asked me to help at the Tina Turner concert!"}]}]}, {"word": "gold", "poses": [{"pos": "noun", "senses": [{"sense": "a valuable, shiny, yellow metal used to make coins, jewelry, etc.", "level": "A2", "dict_examp": "The bracelet was made of solid gold.", "lear_examp": "It's made of gold and very expensive."}]}, {"pos": "adjective", "senses": [{"sense": "made of gold", "level": "A2", "dict_examp": "gold jewelry", "lear_examp": "Sammy gave me a gold ring."}, {"sense": "being the bright yellow color of gold", "level": "A2", "dict_examp": "gold paint", "lear_examp": "I decided paint my bedroom red and gold!"}]}]}, {"word": "golf", "poses": [{"pos": "noun", "senses": [{"sense": "a game on grass where players try to hit a small ball into a series of holes, using a long, thin stick", "level": "A2", "dict_examp": "Do you play golf?", "lear_examp": "We could go to a golf course and play golf."}]}]}, {"word": "goodbye", "poses": [{"pos": "exclamation", "senses": [{"sense": "something you say when you leave someone or when they leave you", "level": "A1", "dict_examp": "Goodbye Marcos! See you next week.", "lear_examp": "Goodbye for now."}]}]}, {"word": "good evening", "poses": [{"pos": "exclamation", "senses": [{"sense": "something you say to greet someone in the evening", "level": "A1", "dict_examp": "Good evening, everyone.", "lear_examp": ""}]}]}, {"word": "goods", "poses": [{"pos": "noun", "senses": [{"sense": "items which are made to be sold", "level": "B2", "dict_examp": "There is a 25% discount on all electrical goods until the end of the week.", "lear_examp": "You can buy all goods there without tax."}]}]}, {"word": "Google", "poses": [{"pos": "verb", "senses": [{"sense": "to search for something on the Internet using the Google search engine", "level": "B2", "dict_examp": "We Googled his name and found over 2000 sites.", "lear_examp": ""}]}]}, {"word": "god", "poses": [{"pos": "noun", "senses": [{"sense": "in Jewish, Christian, or Muslim belief, the spirit who created the universe and everything in it", "level": "A2", "dict_examp": "Do you believe in God?", "lear_examp": "The book talks about God's love."}, {"sense": "used to emphasize how surprised, angry, shocked, etc. you are", "level": "B1", "dict_examp": "Oh my God! The car's been stolen.", "lear_examp": "Oh my god, your sister is getting married!"}, {"sense": "something you say when you are happy because something bad did not happen", "level": "B1", "dict_examp": "Thank God nobody was hurt in the accident.", "lear_examp": "\"Thank God my car is OK\", he said."}, {"sense": "a spirit, especially a male one, that people pray to and who has control over parts of the world or nature", "level": "B2", "dict_examp": "the ancient Greek gods and goddesses", "lear_examp": "It was circled by a halo of light as if some gods had blessed it."}]}]}, {"word": "government", "poses": [{"pos": "noun", "senses": [{"sense": "the group of people who officially control a country", "level": "B1", "dict_examp": "The government has recently cut taxes.", "lear_examp": "It talked about the anti-violence programs funded by the government."}, {"sense": "the method or process of governing a country", "level": "B2", "dict_examp": "a new style of government", "lear_examp": ""}]}]}, {"word": "good night", "poses": [{"pos": "exclamation", "senses": [{"sense": "something you say when you leave someone or they leave you in the evening, or when you are going to bed", "level": "A1", "dict_examp": "Good night, everyone - I'm off to bed.", "lear_examp": ""}]}]}, {"word": "gorgeous", "poses": [{"pos": "adjective", "senses": [{"sense": "very beautiful or pleasant", "level": "B1", "dict_examp": "I met this gorgeous guy at Erik's party.", "lear_examp": "I met this gorgeous guy Neto, and we are dating."}]}]}, {"word": "good-looking", "poses": [{"pos": "adjective", "senses": [{"sense": "If someone is good-looking, they have an attractive face.", "level": "A2", "dict_examp": "He's very good-looking.", "lear_examp": "The teacher is a very young and good-looking woman."}]}]}, {"word": "gossip", "poses": [{"pos": "noun", "senses": [{"sense": "conversation or reports about other people's private lives that might or might not be true", "level": "B2", "dict_examp": "an interesting piece of gossip", "lear_examp": "Among them are the increasingly popular reality shows and all the daily news about gossip and scandal."}]}, {"pos": "verb", "senses": [{"sense": "to talk about other people's private lives", "level": "B2", "dict_examp": "Stop gossiping and get back to work!", "lear_examp": "First of all, I think they should accept the fact that they are well-known and they should be observed all the time, as we are curious to know what they do and we love to gossip about others."}]}]}, {"word": "good morning", "poses": [{"pos": "exclamation", "senses": [{"sense": "something you say to greet someone when you meet them in the morning", "level": "A1", "dict_examp": "Good morning, Joe - how are you today?", "lear_examp": "When you come in class he says hi good morning every body."}]}]}, {"word": "grab", "poses": [{"pos": "verb", "senses": [{"sense": "to take hold of something or someone suddenly", "level": "B1", "dict_examp": "A mugger grabbed her handbag as she was walking across the park.", "lear_examp": "I quickly hung up and grabbed clothes and my cell phone."}, {"sense": "to get something quickly", "level": "B2", "dict_examp": "Let’s grab a sandwich before we leave.", "lear_examp": "We grab a burger on our way to work and a milkshake on our way back home."}, {"sense": "to take an opportunity quickly and with enthusiasm", "level": "C1", "dict_examp": "I'd grab the opportunity to travel.", "lear_examp": "I do admit that I could be more sociable and could grab the opportunity and meet many of my neighbors."}, {"sense": "to attract someone's attention", "level": "C1", "dict_examp": "The advertisement is designed to grab people's attention.", "lear_examp": "We have to find the books that best grab the reader's attention."}]}]}, {"word": "good", "poses": [{"pos": "adjective", "senses": [{"sense": "enjoyable, pleasant or interesting", "level": "A1", "dict_examp": "a good book/film", "lear_examp": "I think we will have a good time."}, {"sense": "of a high quality or level", "level": "A1", "dict_examp": "She speaks good French.", "lear_examp": "She likes eating good food from Argentina, for example barbecued meat and salad."}, {"sense": "something you say when you are pleased about what someone has said", "level": "A1", "dict_examp": "\"I'm coming on Saturday.\" \"Oh, good!\"", "lear_examp": ""}, {"sense": "something that you say when a person asks how you are  or how someone you know is", "level": "A1", "dict_examp": "\"How are you, Amelia?\" \"I'm good, thanks!\"", "lear_examp": "Hi, Jo Is your family good?"}, {"sense": "successful, or able to do something well", "level": "A1", "dict_examp": "Kate's a good cook.", "lear_examp": "He's a good football player."}, {"sense": "kind or helpful", "level": "A1", "dict_examp": "a good friend", "lear_examp": "He is a good friend."}, {"sense": "making you healthy or happy", "level": "A1", "dict_examp": "Swimming is really good for you.", "lear_examp": "I think playing basketball is good for you."}, {"sense": "suitable or satisfactory", "level": "A2", "dict_examp": "Is this a good time to talk?", "lear_examp": "Saturday is good for me, I hope that it is good for you."}, {"sense": "A good child or animal behaves well.", "level": "A2", "dict_examp": "If you're a good boy at the doctor's I'll take you swimming afterward.", "lear_examp": "I made a promise, I'll be the good child for two months, later I'll return to being the devil child you know!"}, {"sense": "morally right", "level": "B1", "dict_examp": "He's a very good person.", "lear_examp": "Only in this way can we give a good example to the new generation."}, {"sense": "If it's a good thing that something happened, it is lucky or fortunate that it happened.", "level": "B2", "dict_examp": "It's a good thing (that) we bought our tickets early.", "lear_examp": "I think it's a good thing that your parents are going to come, because ... maybe it would make it easier for you to convince them to let you spend a week here during Xmas."}, {"sense": "used to show approval for someone's success or good luck", "level": "B2", "dict_examp": "You passed your exam?  Good for you!", "lear_examp": "That's great news! Good for you!"}, {"sense": "used to emphasize the number, amount, quality, etc., of something", "level": "C1", "dict_examp": "There was a good deal of discussion about how much the car was worth.", "lear_examp": "Your children have a good chance of getting a better education."}, {"sense": "an agreement, arrangement, or situation that benefits you", "level": "C1", "dict_examp": "I think we got a really good deal on our new car.", "lear_examp": "The possibility of getting the needed staff from our own departments is absolutely a good deal for the company."}, {"sense": "to be a pleasant or interesting person to spend time with", "level": "C1", "dict_examp": "Ann and Charles are always good company.", "lear_examp": "He is a bit narrow-minded and at first he'll drive you crazy, but once you get to know him he'll be good company."}, {"sense": "not less than 20 minutes/30 miles, etc. and probably a little more", "level": "C2", "dict_examp": "It takes a good half hour to get downtown to the office.", "lear_examp": "The Arts and Social science field also has a good 21% of graduates in further study."}, {"sense": "used to say that something has gone well until now", "level": "C2", "dict_examp": "It's the first time I've done any decorating, but so far, so good.", "lear_examp": "So far, so good, only no one told us they held this point of view before the actual christening took place."}, {"sense": "to be acceptable in a way that will not upset or anger people", "level": "C2", "dict_examp": "His speech was in good taste.", "lear_examp": "I therefore thought that it would be in good taste to write about two of them."}]}, {"pos": "noun", "senses": [{"sense": "something that is an advantage or help to a person or situation", "level": "B2", "dict_examp": "Even a small donation can do a lot of good.", "lear_examp": "Please think about this, it is for your own good."}, {"sense": "to not be useful, helpful or valuable", "level": "B2", "dict_examp": "Boots are no good if they aren't waterproof.", "lear_examp": "When it is raining, you get wet and that's no good to anyone."}, {"sense": "to have a good effect on someone", "level": "B2", "dict_examp": "A vacation in the sun will do you  good.", "lear_examp": "I think that living and studying in another country will do you good."}, {"sense": "forever", "level": "C1", "dict_examp": "When he was 20, he left home for good.", "lear_examp": "He was renting this property previously, but he went back to Sri Lanka for good."}, {"sense": "something that people think is morally right or will help  others", "level": "C2", "dict_examp": "Even a small donation can do a lot of good.", "lear_examp": "From a symbolic point of view, the whole book features the conflict between good and evil, between reason and primary brutal passions such as savageness and lust for blood."}]}]}, {"word": "govern", "poses": [{"pos": "verb", "senses": [{"sense": "to control and direct the public business of a country, city, group of people, etc.", "level": "B2", "dict_examp": "The United Kingdom is now being governed by the Labour Party.", "lear_examp": "He governed this area in medieval times."}]}]}, {"word": "good afternoon", "poses": [{"pos": "exclamation", "senses": [{"sense": "something you say to someone when you meet them in the afternoon", "level": "A1", "dict_examp": "Good afternoon, Cara.", "lear_examp": ""}]}]}, {"word": "goodness", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being good", "level": "C2", "dict_examp": "She believes in the goodness of human nature.", "lear_examp": "Soon after their marriage, Kinga gained a reputation for being a  saint, for her virginity, modesty and goodness."}]}]}, {"word": "grandfather", "poses": [{"pos": "noun", "senses": [{"sense": "the father of a person's mother or father", "level": "A2", "dict_examp": "My grandfather died before I was born.", "lear_examp": "It is important because it was from my grandfather."}]}]}, {"word": "graph", "poses": [{"pos": "noun", "senses": [{"sense": "a picture with measurements marked on it as lines or curves, used to compare different things or show the development of something", "level": "B2", "dict_examp": "This graph shows how crime has varied in relationship to unemployment over the last 20 years.", "lear_examp": "The graph shows the amount of carbon dioxide produced from a range of sources in the UK from 1980 to 2000."}]}]}, {"word": "grandparent", "poses": [{"pos": "noun", "senses": [{"sense": "the father or mother of a person's father or mother", "level": "A2", "dict_examp": "We can learn a lot from our grandparents.", "lear_examp": "I invited my grandparents, friends, aunt and uncles."}]}]}, {"word": "grand", "poses": [{"pos": "adjective", "senses": [{"sense": "very large and special", "level": "C1", "dict_examp": "a grand hotel", "lear_examp": "Do you want to live in a grand mansion, an expensive flat or even a castle?"}]}]}, {"word": "grave", "poses": [{"pos": "noun", "senses": [{"sense": "a place in the ground where a dead person is buried", "level": "B2", "dict_examp": "an unmarked grave", "lear_examp": "After a couple of hours they brought her from the hospital and the next day they buried her near her mother's grave."}]}]}, {"word": "granny", "poses": [{"pos": "noun", "senses": [{"sense": "grandmother", "level": "A2", "dict_examp": "Our granny used to tell us funny stories.", "lear_examp": "That watch was very important, because my granny gave it to me before she died."}]}]}, {"word": "grandpa", "poses": [{"pos": "noun", "senses": [{"sense": "grandfather", "level": "A2", "dict_examp": "I usually see my grandpa twice a week.", "lear_examp": "My grandpa bought the book for me."}]}]}, {"word": "granddaughter", "poses": [{"pos": "noun", "senses": [{"sense": "the daughter of a person's son or daughter", "level": "A2", "dict_examp": "", "lear_examp": "I will probably offer it to my daughter or my grand-daughter later on!"}]}]}, {"word": "grasp", "poses": [{"pos": "verb", "senses": [{"sense": "to take hold of something or someone firmly", "level": "C1", "dict_examp": "He grasped my hand enthusiastically.", "lear_examp": "It would take my heart away to be able to grasp his wrinkled hand and give him a kiss on the cheek of his crimson face, as I would always do when visiting him."}, {"sense": "to understand something", "level": "C1", "dict_examp": "I find these math problems difficult to grasp.", "lear_examp": "Children born into wealth cannot grasp the importance of money, and when they finally leave the shelter of their parents' home, they are completely unable to restrict their spending and save money."}, {"sense": "to quickly try to get hold of something", "level": "C2", "dict_examp": "She grasped at the bushes as she fell.", "lear_examp": "There was half a minute of horror-stricken silence, then a soft moan left her slightly parted lips as she grasped at the wooden door frame for balance."}]}, {"pos": "noun", "senses": [{"sense": "when you understand something", "level": "C2", "dict_examp": "He has a good  grasp of of English grammar.", "lear_examp": "Computers are an essential part of our modern lives and I am sure I would need to have a good grasp of the Microsoft tools to progress in my career."}, {"sense": "when you hold onto someone or something", "level": "C2", "dict_examp": "I tried to pull him out but he slipped from my grasp.", "lear_examp": ""}, {"sense": "the ability to obtain or achieve something", "level": "C2", "dict_examp": "Victory is within our grasp.", "lear_examp": "Although immortality is still beyond our grasp, prolonged life is a well-known fact."}]}]}, {"word": "grass", "poses": [{"pos": "noun", "senses": [{"sense": "a common plant with narrow green leaves that grows close to the ground", "level": "A1", "dict_examp": "I've cut the grass.", "lear_examp": "This house is bigger than the other one because it has a garden with grass and flowers."}]}]}, {"word": "grain", "poses": [{"pos": "noun", "senses": [{"sense": "a seed or seeds from types of grass that are eaten as food", "level": "C2", "dict_examp": "grains of rice", "lear_examp": "One solution is to invent some kind of medicine, little pieces like a grain of rice, which feed a person, i.e., by just eating one piece, the person won't need to eat anything else for the rest of the day."}, {"sense": "a very small piece of something", "level": "C2", "dict_examp": "a grain of sand/sugar", "lear_examp": "She smiled again, absentmindedly, and wiped away a grain of dust from the lid of the piano."}, {"sense": "a very small amount of a quality", "level": "C2", "dict_examp": "There isn't a grain of truth in her story.", "lear_examp": "In my humble opinion, both these views contain a grain of truth, and at the same time they are fundamentally wrong."}, {"sense": "If something goes against the grain, it is something you would not normally do.", "level": "C2", "dict_examp": "It goes against the grain to throw all this food away.", "lear_examp": "She tries to dodge George because she is afraid of admitting the fact that she loves him. It simply goes against the grain."}]}]}, {"word": "gram", "poses": [{"pos": "noun", "senses": [{"sense": "a unit of mass equal to 0.001 kilograms", "level": "A2", "dict_examp": "Measure out 200 grams of butter.", "lear_examp": ""}]}]}, {"word": "graduate", "poses": [{"pos": "noun", "senses": [{"sense": "a person who has successfully completed studies at a school or received a degree from a college or university", "level": "A2", "dict_examp": "high-school graduates", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to successfully complete studies at a  school, or to complete a degree at a college or university", "level": "B2", "dict_examp": "After he graduated high school, he joined the army.", "lear_examp": "You know I graduated from high school last month."}]}]}, {"word": "grape", "poses": [{"pos": "noun", "senses": [{"sense": "a small round purple or pale green fruit that you can eat or make into wine", "level": "A2", "dict_examp": "a bunch of grapes", "lear_examp": "In the countryside there many grapes and beautiful wineries, that is why my country has great wine."}]}]}, {"word": "gradually", "poses": [{"pos": "adverb", "senses": [{"sense": "slowly over a period of time or a distance", "level": "B2", "dict_examp": "She gradually began to realize that he wasn't telling her the truth.", "lear_examp": "Books will gradually disappear, and instead we will read all the things we want on our computer."}]}]}, {"word": "grant", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of money provided by a government or organization for a special purpose", "level": "B2", "dict_examp": "a student/research grant", "lear_examp": "I'd like to know if I have to pay for my ticket  (Valencia-Kent) or if there's some kind of grant that I could apply for."}]}, {"pos": "verb", "senses": [{"sense": "to give or allow someone something, usually in an official way", "level": "B2", "dict_examp": "He was granted asylum.", "lear_examp": "He came to the USA in 1990 and was granted a permanent resident status."}, {"sense": "to not show that you are grateful for someone or something, and forget that you are lucky to have them", "level": "B2", "dict_examp": "Most of us take our freedom for granted.", "lear_examp": "So don't take the telephone for granted, but keep in mind that our modern way of life is mainly due to its invention."}, {"sense": "to believe that something is true without checking or thinking about it", "level": "B2", "dict_examp": "I took it for granted that we'd be invited to the wedding.", "lear_examp": "I have taken it for granted that you will arrive for dinner."}]}]}, {"word": "grace", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of moving in a smooth, relaxed, and attractive way", "level": "C1", "dict_examp": "She moved with grace and elegance.", "lear_examp": "As with the sport I mentioned before, it also has the grace and elegance of a dancer and the technique, of course, of a skater."}, {"sense": "the quality of being pleasantly polite", "level": "C2", "dict_examp": "He had the grace to apologize for his mistake the next day.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "When a person or object graces a place or thing, they make it more attractive.", "level": "C2", "dict_examp": "Her face has graced the covers of magazines across the world.", "lear_examp": "The cover is graced with the flower after which it is named, an enormous, virgin white magnolia."}]}]}, {"word": "grammatical", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to grammar, or obeying the rules of grammar", "level": "C2", "dict_examp": "grammatical rules", "lear_examp": "It was strange, because in the text there were some grammatical errors."}]}]}, {"word": "granddad", "poses": [{"pos": "noun", "senses": [{"sense": "grandfather", "level": "A2", "dict_examp": "Isn't that your granddad over there?", "lear_examp": "When I arrived, my granddad was waiting for me."}]}]}, {"word": "gradual", "poses": [{"pos": "adjective", "senses": [{"sense": "happening slowly over a period of time", "level": "B2", "dict_examp": "a gradual change/improvement", "lear_examp": "There was a gradual rise in 1992."}]}]}, {"word": "graphics", "poses": [{"pos": "noun", "senses": [{"sense": "images shown on a computer screen", "level": "B1", "dict_examp": "computer graphics", "lear_examp": "The film was full of special effects created with the help of computer graphics."}]}]}, {"word": "grateful", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling or showing  thanks", "level": "B1", "dict_examp": "I'm really grateful to you for all your help.", "lear_examp": "I'm grateful to the boys who established the club."}]}]}, {"word": "graceful", "poses": [{"pos": "adjective", "senses": [{"sense": "moving in a smooth, relaxed, and attractive way, or having a smooth, attractive shape", "level": "C1", "dict_examp": "graceful movements", "lear_examp": "One of the reasons for its popularity is that Hebe was a famous singer years ago, so her fans are the audience of her show. She is graceful, talented, impartial and spontaneous."}, {"sense": "behaving in a polite and pleasant way", "level": "C2", "dict_examp": "She accepted his criticism in a very graceful manner.", "lear_examp": "I believe that people who have civil and graceful manners and who refrain from being too assertive end up being more successful and powerful than those who try to exert authority at any given moment."}]}]}, {"word": "grammar", "poses": [{"pos": "noun", "senses": [{"sense": "the way words combine and change their form and position in a sentence, or the rules or study of this", "level": "A2", "dict_examp": "This course will cover basic English grammar.", "lear_examp": "You can learn grammar and vocabulary with this book."}]}]}, {"word": "graduation", "poses": [{"pos": "noun", "senses": [{"sense": "a ceremony at which students are given a certificate stating a course of study has been successfully completed or a degree has been awarded", "level": "B1", "dict_examp": "Ann decided not to go to graduation.", "lear_examp": "I want to buy my dress for the graduation."}, {"sense": "the successful completion of a course of study and awarding of a degree or certificate", "level": "B1", "dict_examp": "high-school graduation", "lear_examp": "Her house was close to my house. That was one of reasons why we still kept in touch after graduation. (587306; First Certificate in English; Japan; B2 VANTAGE; 1993;"}]}]}, {"word": "grandson", "poses": [{"pos": "noun", "senses": [{"sense": "the son of a person's son or daughter", "level": "A2", "dict_examp": "Nicholas was her first grandson.", "lear_examp": "Francisco's sons and grandsons came to meet us at Havana Airport and then we had lunch together."}]}]}, {"word": "grandma", "poses": [{"pos": "noun", "senses": [{"sense": "grandmother", "level": "A2", "dict_examp": "My grandma is a very good cook.", "lear_examp": "On Sunday I have to go to my grandma's house."}]}]}, {"word": "grade", "poses": [{"pos": "noun", "senses": [{"sense": "a school class or group of classes in which all the children are of a similar age or ability", "level": "A2", "dict_examp": "Jackie is in the sixth grade.", "lear_examp": "Everybody from school was there, 5th, 6th, 7th, 8th grades, teachers and some friends from Cultura Inglesa."}, {"sense": "a number or letter that shows how good someone's work or performance is", "level": "B1", "dict_examp": "Steve never studies, but he always gets good grades.", "lear_examp": "I was really surprised when I read this mail. I passed with very good grades."}, {"sense": "a level of quality, size, importance, etc.", "level": "B2", "dict_examp": "I applied for a position a grade higher than my current job.", "lear_examp": "The higher the proficiency grade of an any particular sportsman or sportswoman is, the better he or she is going to be paid."}]}, {"pos": "verb", "senses": [{"sense": "to separate people or things into different levels of quality, size, importance, etc.", "level": "C1", "dict_examp": "The fruit is washed and then graded by size.", "lear_examp": "Our members graded everything on a scale from 1 to 5, with 1 being very poor, and 5 being excellent."}, {"sense": "to give a score to a student's piece of work", "level": "C1", "dict_examp": "to grade papers", "lear_examp": "As to language classes I should grade them as adequate."}]}]}, {"word": "grandchild", "poses": [{"pos": "noun", "senses": [{"sense": "the child of a person's son or daughter", "level": "A2", "dict_examp": "They spend a lot of time with their grandchildren.", "lear_examp": "My grandchildren will wear a fish-like suit 100 years from now."}]}]}, {"word": "grandmother", "poses": [{"pos": "noun", "senses": [{"sense": "the mother of a person's father or mother", "level": "A2", "dict_examp": "My grandmother lives in Argentina.", "lear_examp": "My 4 brothers, dad, grandmother, sister and my friends were there."}]}]}, {"word": "grim", "poses": [{"pos": "adjective", "senses": [{"sense": "worrying and bad", "level": "C2", "dict_examp": "grim news", "lear_examp": "Sitting back and carefully thinking about all this, I come to the grim conclusion that we grown-ups are just the same!"}, {"sense": "sad and serious", "level": "C2", "dict_examp": "a grim expression", "lear_examp": "They gaped at it with surprise, but slowly the grim faces were replaced with smiles and laughter."}, {"sense": "A grim place is ugly and unpleasant.", "level": "C2", "dict_examp": "grim industrial regions", "lear_examp": "This was a particularly gloomy and grim place."}]}]}, {"word": "grip", "poses": [{"pos": "verb", "senses": [{"sense": "to hold something very tightly", "level": "B2", "dict_examp": "The baby gripped my finger with her tiny hand.", "lear_examp": "I gripped the steering wheel, fixed my eyes firmly on the road, and bravely drove up to Scotland."}, {"sense": "When an emotion grips you, you feel it very strongly.", "level": "C2", "dict_examp": "He was gripped by fear.", "lear_examp": "But when she found out, a cold feeling of shock gripped her."}, {"sense": "to keep someone's attention completely", "level": "C2", "dict_examp": "This trial has gripped the whole nation.", "lear_examp": "I was gazing at the stage and was completely gripped by the music."}]}, {"pos": "noun", "senses": [{"sense": "when you hold something tightly", "level": "B2", "dict_examp": "She tightened her grip on my arm.", "lear_examp": "Then suddenly I lost my grip on the papers and they all dropped to the floor and landed in a great heap."}, {"sense": "to make an effort to control your emotions and behave more calmly", "level": "C1", "dict_examp": "Stop panicking and get a grip on yourself!", "lear_examp": "The best thing to do was to talk to people who were not doing the test rather than building up my anxiety. However, I did not do this and it almost resulted in a disaster, but I got a grip on myself and just barely passed."}, {"sense": "to understand and deal with a problem or situation", "level": "C2", "dict_examp": "It's a difficult subject to come to grips with.", "lear_examp": "As a result, they are daily faced with tight schedules and they have to come to grips with the demanding work they have to prepare for school."}]}]}, {"word": "grilled", "poses": [{"pos": "adjective", "senses": [{"sense": "cooked on a grill", "level": "A2", "dict_examp": "grilled steak/fish", "lear_examp": "The grilled fish was delicious and spicy."}]}]}, {"word": "green", "poses": [{"pos": "adjective", "senses": [{"sense": "being the same color as grass", "level": "A1", "dict_examp": "green vegetables", "lear_examp": "I'll use purple and green paint."}, {"sense": "covered with grass or other plants", "level": "B1", "dict_examp": "green spaces", "lear_examp": "If you wanted to do some outdoor activities, we could go fishing or even go walking through the green fields."}, {"sense": "relating to nature and protecting the environment", "level": "B2", "dict_examp": "green issues", "lear_examp": "There is the government party, \"Green party\", especially in Germany."}, {"sense": "to wish very much that you had something that another person has", "level": "C2", "dict_examp": "Sam's got a job in the south of France and we're all green with envy!", "lear_examp": "The more successful players' salary makes the others green with envy."}]}, {"pos": "noun", "senses": [{"sense": "the color of grass", "level": "A2", "dict_examp": "dark/light green", "lear_examp": "I am going to use green for my bedroom."}]}]}, {"word": "gross", "poses": [{"pos": "adjective", "senses": [{"sense": "A gross amount of money has not had taxes or other costs taken from it.", "level": "C1", "dict_examp": "gross earnings/profit", "lear_examp": "Considering that our business is booming, we suggest investing a certain amount of money in the above-mentioned technical devices in order to achieve the financial target, which is to increase our gross profit by 10%."}, {"sense": "very serious or unacceptable", "level": "C1", "dict_examp": "gross misconduct", "lear_examp": "Secondly, in the second paragraph, two gross mistakes were made."}, {"sense": "very unpleasant", "level": "C2", "dict_examp": "Those bugs are really gross.", "lear_examp": "She spit out the food saying it was gross then tore the tablecloth apart, throwing all the dishes on the floor, and started yelling at him that he was a useless thing that was a waste of space."}]}]}, {"word": "greatness", "poses": [{"pos": "noun", "senses": [{"sense": "skill and importance", "level": "B2", "dict_examp": "Her greatness as a writer is unquestioned.", "lear_examp": "So, getting to be rich and famous is more related to achieving greatness in your own field and not necessarily gaining money and becoming the richest person in the world."}]}]}, {"word": "grocery store", "poses": [{"pos": "noun", "senses": [{"sense": "a store that sells  food and other groceries and goods for the home", "level": "A2", "dict_examp": "I need to stop at the grocery store and pick up a few things on the way home.", "lear_examp": ""}]}]}, {"word": "great", "poses": [{"pos": "adjective", "senses": [{"sense": "very good", "level": "A1", "dict_examp": "We had a great time at the party.", "lear_examp": "I hope we have a great meal and a lot of fun."}, {"sense": "large in amount, size or degree", "level": "A2", "dict_examp": "I use my computer a great deal.", "lear_examp": "It's a great pleasure to give you some advice."}, {"sense": "extreme", "level": "B1", "dict_examp": "He has great difficulty                   walking.", "lear_examp": "But still, car accidents are a great concern to the Portuguese authorities."}, {"sense": "important or famous", "level": "B2", "dict_examp": "This is one of Rembrandt's greatest paintings.", "lear_examp": "Ginny was a keen collector of rare paintings by great artists."}, {"sense": "very big", "level": "B2", "dict_examp": "I gave her a great big hug.", "lear_examp": "I will never forget when I was walking on the beach and all of a sudden this great big dog appears from nowhere running after me."}, {"sense": "a lot", "level": "B2", "dict_examp": "She spends a great deal of her time in Glasgow.", "lear_examp": "There will be lots of events which you could see and take a great deal of pictures of."}]}]}, {"word": "groan", "poses": [{"pos": "verb", "senses": [{"sense": "to make a long, low sound such as when expressing pain, unhappiness, etc.", "level": "C2", "dict_examp": "He collapsed, groaning with pain.", "lear_examp": "He was breathing but he was unconscious; he moaned and groaned, but he did not have any obvious signs of injuries."}]}, {"pos": "noun", "senses": [{"sense": "a long, low sound such as one expressing pain, unhappiness, etc.", "level": "C2", "dict_examp": "I could hear his groans from behind the door.", "lear_examp": "Afterwards, with a wild groan, he dropped down to the ground."}]}]}, {"word": "grill", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment with a frame of metal bars for cooking food, usually over a fire", "level": "B1", "dict_examp": "Put the burgers on the grill.", "lear_examp": "I recommend meat on the grill  - it is delicious."}]}, {"pos": "verb", "senses": [{"sense": "to cook food on a grill", "level": "B1", "dict_examp": "Grill the fish for two to three minutes on each side.", "lear_examp": "We were in the garden and we grilled meat."}]}]}, {"word": "gripping", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is gripping, it is so interesting that it holds your attention completely.", "level": "C1", "dict_examp": "a gripping story", "lear_examp": "\"I know why the caged bird sings\" is the most gripping read I have ever read."}]}]}, {"word": "gray", "poses": [{"pos": "adjective", "senses": [{"sense": "being a color that is a mixture of black and white", "level": "A1", "dict_examp": "gray clouds", "lear_examp": "It is so great, it is black with gray details."}, {"sense": "cloudy and not bright", "level": "C1", "dict_examp": "a cold, gray morning", "lear_examp": "If only we could do something about gray rainy days ..."}, {"sense": "having hair that has changed color to gray", "level": "C2", "dict_examp": "He’s already beginning to turn gray.", "lear_examp": "Or the mother that keeps a lock of hair from her beautiful baby boy, now aged 43 turning gray and almost bald."}]}, {"pos": "noun", "senses": [{"sense": "the color that is a mixture of black and white", "level": "A2", "dict_examp": "She was dressed in gray.", "lear_examp": "I am going to use dark gray for the wall and white for the ceiling."}]}]}, {"word": "greet", "poses": [{"pos": "verb", "senses": [{"sense": "to welcome someone", "level": "B1", "dict_examp": "He greeted me at the door.", "lear_examp": "We sat down and the teacher arrived. She greeted us and she told us her name."}, {"sense": "to react to something in a particular way", "level": "C2", "dict_examp": "His story was greeted with shrieks of laughter.", "lear_examp": "The return of the musician, who was once famous in the world, was greeted with joy."}]}]}, {"word": "groom", "poses": [{"pos": "noun", "senses": [{"sense": "a man who is getting married", "level": "B1", "dict_examp": "The bride and groom were posing for  pictures.", "lear_examp": "In my village, the bridge and the groom stay on their first night at the groom's parents' house."}]}]}, {"word": "grin", "poses": [{"pos": "verb", "senses": [{"sense": "to smile a big smile", "level": "C2", "dict_examp": "He grinned at me from the doorway.", "lear_examp": "He stood up, approached me in his once corduroy trousers, grinned and poked his tongue out at me."}, {"sense": "to accept an unpleasant or difficult situation because there is nothing you can do to improve it", "level": "C2", "dict_examp": "I hate my job, but I'm just going to have to grin and bear it for a while.", "lear_examp": "As I couldn't simply get up and go away, I just had to grin and bear it for a little while longer."}]}, {"pos": "noun", "senses": [{"sense": "a big smile", "level": "C2", "dict_examp": "She had a big grin on her face.", "lear_examp": "No sooner had he entered the restaurant than he was greated with broad grins and friendly hugs."}]}]}, {"word": "groceries", "poses": [{"pos": "noun", "senses": [{"sense": "food and other things you buy in a food store", "level": "B1", "dict_examp": "We usually shop for groceries on Saturday.", "lear_examp": "My wife and I go shopping on weekends to buy groceries and clothes if we need them."}]}]}, {"word": "greed", "poses": [{"pos": "noun", "senses": [{"sense": "when you want a lot more food, money, etc., than you need", "level": "C1", "dict_examp": "We were shocked by their greed.", "lear_examp": "I hate to accept that greed and ambition are the trademarks of our society, but it seems clear to me now."}]}]}, {"word": "ground", "poses": [{"pos": "noun", "senses": [{"sense": "the surface of the Earth", "level": "B1", "dict_examp": "I sat down on the ground.", "lear_examp": "The weather was really nice and the ground wasn't wet so we could run with no problem."}, {"sense": "the soil in an area", "level": "B2", "dict_examp": "soft/stony ground", "lear_examp": ""}, {"sense": "to refuse to change your opinion or give in to an argument", "level": "C2", "dict_examp": "I kept trying to get my grandmother to find  a smaller house, but she stood her ground.", "lear_examp": "She said she would stand her ground, and never, never falter."}]}]}, {"word": "greedy", "poses": [{"pos": "adjective", "senses": [{"sense": "wanting a lot more food, money, etc. than you need", "level": "B2", "dict_examp": "greedy, selfish people", "lear_examp": "He was a greedy and cruel man."}]}]}, {"word": "greatly", "poses": [{"pos": "adverb", "senses": [{"sense": "very much", "level": "B2", "dict_examp": "The higher profits were the result of greatly reduced costs.", "lear_examp": "I recently went to the music festival and I greatly enjoyed it."}]}]}, {"word": "grief", "poses": [{"pos": "noun", "senses": [{"sense": "great sadness, especially caused by someone's  death", "level": "B2", "dict_examp": "Newspapers should not intrude on people's private grief.", "lear_examp": "However, my grief was still fresh and raw then."}]}]}, {"word": "greeting", "poses": [{"pos": "noun", "senses": [{"sense": "something friendly or polite that you say or do when you meet or welcome someone", "level": "B1", "dict_examp": "They exchanged greetings before starting the session.", "lear_examp": "Lucy asked me to pass on greetings to you."}]}]}, {"word": "gulf", "poses": [{"pos": "noun", "senses": [{"sense": "an area of sea surrounded on three sides by land", "level": "B2", "dict_examp": "the Gulf of Mexico/the Gulf Coast", "lear_examp": "Apart the view of the gulf, Vesuvio, etc., the best thing of Napoli is the nightlife."}, {"sense": "an important difference between the opinions or situations of two groups of people", "level": "C2", "dict_examp": "There is a growing gulf between the rich and the poor.", "lear_examp": "While Mrs. Kingshaw simplifies and trivializes her son's fears, she increases the gulf between them."}]}]}, {"word": "guess", "poses": [{"pos": "verb", "senses": [{"sense": "used before telling someone something interesting or surprising", "level": "A2", "dict_examp": "Guess what? We won 4-0.", "lear_examp": "Guess what? Jessica gave me a teddy bear."}, {"sense": "to give an answer or opinion about something without having all the facts", "level": "A2", "dict_examp": "Guess how old he is.", "lear_examp": "You will never guess who I ran into at the club."}, {"sense": "used when you think something is probably true or likely", "level": "B1", "dict_examp": "I've known her for about 12 years, I guess.", "lear_examp": "I guess that I love her although we do not know each other very well."}, {"sense": "used when you agree/disagree but are not completely certain about something", "level": "B2", "dict_examp": "\"So they're still living in the same house?\" \"I guess so.\"", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "an attempt to give the right answer when you are not certain if you are correct", "level": "B1", "dict_examp": "How old do you think John is? Go on, take a guess.", "lear_examp": ""}]}]}, {"word": "the ground floor", "poses": [{"pos": "noun", "senses": [{"sense": "the floor of a building that is at the same level as the ground outside", "level": "B1", "dict_examp": "My office is on the ground floor.", "lear_examp": "We followed them to a new club in Siena. It is on the ground floor of an old building."}]}]}, {"word": "guilty", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling guilt", "level": "B1", "dict_examp": "She was so upset about what I'd said and I felt so guilty.", "lear_examp": "I've got a guilty conscience because I forgot to say goodbye."}, {"sense": "responsible for breaking a law", "level": "B2", "dict_examp": "The jury found her guilty.", "lear_examp": "After the trial, where the jury found him guilty, he was sent to prison for a long time."}]}]}, {"word": "growth", "poses": [{"pos": "noun", "senses": [{"sense": "when something grows, increases or develops", "level": "B2", "dict_examp": "A balanced diet is essential for healthy growth.", "lear_examp": "The huge growth of technology has brought lots of good aspects to my life, like the facility to be informed about everything that is happening around the world."}]}]}, {"word": "grumpy", "poses": [{"pos": "adjective", "senses": [{"sense": "easily annoyed and often complaining", "level": "C1", "dict_examp": "a grumpy old man", "lear_examp": "Secondly, our coach driver was a grumpy, unpleasant man who was not even polite enough to answer our questions."}]}]}, {"word": "gum", "poses": [{"pos": "noun", "senses": [{"sense": "the hard, pink part inside your mouth that your teeth grow out of", "level": "B2", "dict_examp": "Protect your teeth and gums by visiting your dentist regularly.", "lear_examp": ""}, {"sense": "a sweet substance that you chew but do not swallow", "level": "B2", "dict_examp": "a stick of gum", "lear_examp": ""}]}]}, {"word": "guilt", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of shame or unhappiness when you have done something wrong", "level": "B2", "dict_examp": "He suffered such feelings of guilt over leaving his children.", "lear_examp": "Her brother had hesitated before telling her the truth, but he proved that he really trusted his sister by confessing his guilt to her."}, {"sense": "the fact of having committed a crime", "level": "B2", "dict_examp": "Both suspects admitted their guilt to the police.", "lear_examp": ""}]}]}, {"word": "guitar", "poses": [{"pos": "noun", "senses": [{"sense": "a musical instrument with six strings and a long neck which is usually made of wood, and which is played by pulling or hitting the strings with the fingers", "level": "A1", "dict_examp": "an acoustic/electric guitar", "lear_examp": "I can play the guitar quite well."}]}]}, {"word": "guideline", "poses": [{"pos": "noun", "senses": [{"sense": "advice about how to do something", "level": "C1", "dict_examp": "government guidelines", "lear_examp": "To avoid being injured, you must follow all the guidelines provided by your employer."}]}]}, {"word": "guidebook", "poses": [{"pos": "noun", "senses": [{"sense": "a book that gives visitors information about a particular place", "level": "A2", "dict_examp": "a guidebook to/about Venice", "lear_examp": "The rest of the holiday I'll dedicate to tourism with my guidebook, getting to know the best places on the island."}]}]}, {"word": "guidance", "poses": [{"pos": "noun", "senses": [{"sense": "help or  advice", "level": "B2", "dict_examp": "spiritual/expert guidance", "lear_examp": "I dream of being Lord Krishna's devotee but I need professional guidance."}]}]}, {"word": "group", "poses": [{"pos": "noun", "senses": [{"sense": "a number of people or things that are together in one place or are connected", "level": "A1", "dict_examp": "I'm meeting a group of friends for dinner tonight.", "lear_examp": "All our group of friends were there."}, {"sense": "a number of people who play music together, especially pop music", "level": "A1", "dict_examp": "a pop/rock group", "lear_examp": "I like reggae and ska music music, especially NSK, a very good ska group."}]}, {"pos": "verb", "senses": [{"sense": "to form a group or put people or things into a group or groups", "level": "C1", "dict_examp": "The children are grouped according to their ability.", "lear_examp": "I would like to suggest that we should be grouped according to the level of our English proficiency on the first day of the semester."}]}]}, {"word": "grounds", "poses": [{"pos": "noun", "senses": [{"sense": "because of a particular reason", "level": "C1", "dict_examp": "You cannot discriminate on the grounds of religion.", "lear_examp": "I am convinced that it is better than Southside College on the grounds that a great mass of students are satisfied."}, {"sense": "a reason, cause or argument", "level": "C2", "dict_examp": "He resigned  on medical grounds.", "lear_examp": "I would like to mention some of the events in the novel which prove Stevens's loyalty and at the same time make him seem irritating especially out of a modern point of view: the dismissal of the two Jewish maids on purely racial grounds."}, {"sense": "the land around and belonging to a particular building or organization", "level": "C2", "dict_examp": "We strolled around the hospital grounds.", "lear_examp": "The visitors feel molested, since they can either not visit the famous sights without being asked for money or they are even advised not to leave the hotel grounds in order not to be robbed."}]}]}, {"word": "growing", "poses": [{"pos": "adjective", "senses": [{"sense": "increasing in size or quantity", "level": "B2", "dict_examp": "There is a growing awareness of the seriousness of this disease.", "lear_examp": "One big change in the last ten years is definitely the growing interest in more natural and healthy food."}]}]}, {"word": "guide", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to show interesting places to visitors, or to help people get somewhere", "level": "A2", "dict_examp": "a tour guide", "lear_examp": "Yesterday I visited the \"White House\" and the guide was very friendly."}, {"sense": "a book that gives information about something or tells you how to do something", "level": "B1", "dict_examp": "a hotel/restaurant guide", "lear_examp": "I found that some of the current information in the guide is a little bit old."}]}, {"pos": "verb", "senses": [{"sense": "to help someone visit a place or go somewhere", "level": "B1", "dict_examp": "Someone offered to guide us through the jungle.", "lear_examp": "I had to look after the members of the public and I guided them to their seats."}]}]}, {"word": "grown-up", "poses": [{"pos": "noun", "senses": [{"sense": "an adult, used especially when talking to children", "level": "B2", "dict_examp": "Ask a grown-up to cut the shape out for you.", "lear_examp": "If I were a grown-up I would like to have a big dog."}]}, {"pos": "adjective", "senses": [{"sense": "If you say that someone is grown-up, you mean that they are an adult or that they behave in a responsible way.", "level": "B2", "dict_examp": "She has two grown-up children who work in the family business.", "lear_examp": "Now, as a grown-up person, I am trying to evaluate such an upbringing objectively."}]}]}, {"word": "grow", "poses": [{"pos": "verb", "senses": [{"sense": "to develop and become bigger or taller as time passes", "level": "A2", "dict_examp": "Children grow so quickly.", "lear_examp": "I've grown and the dress is too tight for me."}, {"sense": "If a plant grows, or you grow it, it develops from a seed to a full plant.", "level": "A2", "dict_examp": "Tomatoes grow well in full sun.", "lear_examp": "I will grow many new trees."}, {"sense": "to increase", "level": "B1", "dict_examp": "The number of people living alone grows each year.", "lear_examp": "In Rio, violence is growing very fast, so if we're planning to spend the holiday in the city we'll have to take care."}, {"sense": "If your hair or nails grow, or if you grow them, they get longer.", "level": "B1", "dict_examp": "Are you growing a beard?", "lear_examp": "I've lost some weight and I've grown a beard."}, {"sense": "to gradually become tired/old/calm, etc.", "level": "B2", "dict_examp": "Our bodies change as we grow older.", "lear_examp": "They went to the field and, relaxing on the grass, spoke about their life without each other. Soft blue evening came and it was growing dark."}, {"sense": "to gradually become an adult", "level": "A2", "dict_examp": "I grew up in Scotland.", "lear_examp": "I have grown up eating this kind of food."}]}]}, {"word": "guitarist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who plays the guitar, especially as their job", "level": "B1", "dict_examp": "The lead guitarist in the band was excellent.", "lear_examp": "Not only did he want to be a doctor, but he was also a great guitarist."}]}]}, {"word": "guard", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to protect a person, place or thing from danger or attack, or to prevent a person such as a criminal from escaping", "level": "B1", "dict_examp": "a security guard", "lear_examp": "I saw two security guards, who opened the door for me and welcomed me inside."}, {"sense": "to surprise someone by doing something when they are not ready to deal with it", "level": "C2", "dict_examp": "The journalist caught him off guard and he admitted to lying.", "lear_examp": "It caught me off guard. This grotesque image shattered the comfort of a languid Sunday afternoon and for a few seconds hurled me into a world of pain."}, {"sense": "to be ready to deal with something difficult that might happen", "level": "C2", "dict_examp": "Companies were warned to be on their guard for suspicious packages.", "lear_examp": "However, we should be on guard, so as not to let the things escape our control."}, {"sense": "to relax when you should be careful or ready to deal with something", "level": "C2", "dict_examp": "He's worried that if he lets his guard down someone may take advantage of him.", "lear_examp": "That of course will go against anything Stevens has ever done and he never lets his guard down."}]}, {"pos": "verb", "senses": [{"sense": "to protect someone or something from being attacked or stolen", "level": "B2", "dict_examp": "Soldiers guard the main doors of the embassy.", "lear_examp": "I guess it was that thrill that actually made me anxious to know what really was going on inside the dodgy-looking old house guarded by a man with an unfriendly hound."}, {"sense": "to watch someone and make certain they do not escape from a place", "level": "B2", "dict_examp": "Five prison officers guarded the prisoners.", "lear_examp": "No one was guarding him."}]}]}, {"word": "guarantee", "poses": [{"pos": "verb", "senses": [{"sense": "to promise or make sure that something is true or will happen", "level": "B2", "dict_examp": "Every child is guaranteed a place at a public school.", "lear_examp": "I can guarantee you won't be disappointed if you let me do the job."}]}, {"pos": "noun", "senses": [{"sense": "a written promise made by a company to repair one of its products or give you a new one if it has a fault", "level": "B2", "dict_examp": "a money-back guarantee", "lear_examp": "And you couldn't take it back because  it is not under guarantee."}, {"sense": "a promise that something will be done or will happen", "level": "C2", "dict_examp": "There's no guarantee that it actually works.", "lear_examp": "They are the ones who are hit most by any economic deterioration or crisis, and there is no guarantee that they will not end up living in the streets."}]}]}, {"word": "guest", "poses": [{"pos": "noun", "senses": [{"sense": "someone who comes to visit you in your home, at a party, etc.", "level": "A2", "dict_examp": "We've got some guests coming this weekend.", "lear_examp": "There were fifty guests at my party."}, {"sense": "a person who is staying in a hotel", "level": "A2", "dict_examp": "We would like to remind all our guests to leave their keys at reception before they depart.", "lear_examp": "And if you are a guest of the hotel, they'll give you a beautiful flower."}, {"sense": "a person, such as an entertainer, who has been invited to appear on a television or radio program or in a performance", "level": "B2", "dict_examp": "Our guest tonight is Robert de Niro.", "lear_examp": "Of course a bear shouldn't be a guest on a TV show, it's not in his nature."}]}]}, {"word": "gum", "poses": [{"pos": "noun", "senses": [{"sense": "the hard, pink part inside your mouth that your teeth grow out of", "level": "B2", "dict_examp": "Protect your teeth and gums by visiting your dentist regularly.", "lear_examp": ""}, {"sense": "a sweet substance that you chew but do not swallow", "level": "B2", "dict_examp": "a stick of gum", "lear_examp": ""}]}]}, {"word": "guts", "poses": [{"pos": "noun", "senses": [{"sense": "the bravery and determination that is needed to do something difficult or unpleasant", "level": "B2", "dict_examp": "It took guts to stand up and tell the boss how she felt.", "lear_examp": "They did not expect that the people in this vicinity would actually have the guts to retaliate!"}, {"sense": "the organs inside a person's or animal's body", "level": "C2", "dict_examp": "Its guts were spilled all over the road.", "lear_examp": "The walls were covered in blood and their guts were spilled all over the place."}]}]}, {"word": "gun", "poses": [{"pos": "noun", "senses": [{"sense": "a weapon that you fire bullets out of", "level": "B1", "dict_examp": "You could hear the noise of guns firing in the distance.", "lear_examp": "He went downstairs and picked up his father's gun."}]}]}, {"word": "gymnastics", "poses": [{"pos": "noun", "senses": [{"sense": "a sport in which you do physical exercises on the floor and on different pieces of equipment, often in competitions", "level": "B1", "dict_examp": "Let's watch the gymnastics on TV.", "lear_examp": "Every Tuesday and Thursday you can do sports like basketball, football or also gymnastics."}]}]}, {"word": "guy", "poses": [{"pos": "noun", "senses": [{"sense": "a man", "level": "A2", "dict_examp": "Do you mean the guy with the blond hair and glasses?", "lear_examp": "Last night, I met a wonderful guy!"}, {"sense": "used when you are talking to or about two or more people", "level": "B1", "dict_examp": "Come on, you guys, let's go home.", "lear_examp": "Hey guys! I'm just writing to thank you for the great times we had last weekend and to say you're awesome."}]}]}, {"word": "gymnastic", "poses": [{"pos": "adjective", "senses": [{"sense": "involving gymnastics", "level": "B2", "dict_examp": "a gymnastic display", "lear_examp": "My friend likes to go swimming every morning. I prefer to do gymnastic exercises in a separate room every day."}]}]}, {"word": "gym", "poses": [{"pos": "noun", "senses": [{"sense": "a building or room with equipment for doing exercise", "level": "A2", "dict_examp": "Nick goes to the gym three times a week.", "lear_examp": "We went to a gym near my house."}, {"sense": "a school class in which children learn to exercise and play sports", "level": "A2", "dict_examp": "We have gym on Friday afternoons.", "lear_examp": "You can do gym, aqua, dance, boxing, squash, and tennis."}]}]}]