[{"word": "half", "poses": [{"pos": "noun", "senses": [{"sense": "one of two equal parts of something", "level": "A2", "dict_examp": "Rice is eaten by half of the world's population.", "lear_examp": "It takes an hour and a half."}, {"sense": "to divide something into two equal parts", "level": "B1", "dict_examp": "Divide the dough in half and roll it out into two circles.", "lear_examp": "They were very surprised when they found out that the gold was cut in half."}, {"sense": "a lot", "level": "B2", "dict_examp": "She invited a lot of people to the party but half of them didn't show up.", "lear_examp": "First of all, if the computer hadn't been invented, I wouldn't spend half of the day in front of it!"}, {"sense": "to be much less good/bad/exciting, etc. than something else", "level": "B2", "dict_examp": "Her new book isn't half as good as the last one.", "lear_examp": "Probably they wouldn't be half as famous as they are without press photographers, journalists, etc."}]}, {"pos": "adverb", "senses": [{"sense": "partly, but not completely", "level": "B1", "dict_examp": "The bottle is half empty/full.", "lear_examp": "After our kiss, my face was painted half white, half black as well."}]}]}, {"word": "handball", "poses": [{"pos": "noun", "senses": [{"sense": "a game in which players hit a small hard rubber ball against a wall with their hands", "level": "A2", "dict_examp": "We played handball yesterday.", "lear_examp": "Last Saturday was my party, it was wonderful.  I played handball in the afternoon, but in the evening I danced."}]}]}, {"word": "hail", "poses": [{"pos": "noun", "senses": [{"sense": "hard balls of ice that fall from the sky like rain", "level": "C2", "dict_examp": "Hail the size of golf balls dented my car in the storm.", "lear_examp": "In the past, a very cold winter and hail would destroy the crops and kill hundreds of families; and, moreover, people had little protection against the attacks of wild animals."}]}, {"pos": "verb", "senses": [{"sense": "If it hails, small, hard pieces of frozen rain fall from the sky.", "level": "C2", "dict_examp": "It hailed for a few minutes this morning.", "lear_examp": ""}, {"sense": "to call or wave to someone to get their attention", "level": "C2", "dict_examp": "You wait here while I hail a cab.", "lear_examp": "If you see a car or a bus or some other vehicle, just hail them and ask for help."}, {"sense": "to publicly praise or show approval for someone or something", "level": "C2", "dict_examp": "Heppner has been hailed as one of the finest tenors in the operatic world today.", "lear_examp": "But, fortunately, these Olympic Games in 2004 were hailed as a success by everyone."}]}]}, {"word": "half price", "poses": [{"pos": "adverb", "senses": [{"sense": "for half the usual price", "level": "A2", "dict_examp": "If you pay one full fare, the second person can travel at half price.", "lear_examp": "I want to sell my \"English Grammar\" book, it's a great book, simple to read, not very used, just the right book for you, and I sell it at less than half price; INCREDIBLE!!"}]}]}, {"word": "habitat", "poses": [{"pos": "noun", "senses": [{"sense": "the natural environment of an animal or plant", "level": "C1", "dict_examp": "We want to see lions in their natural habitat.", "lear_examp": "These snakes and wild cats are able to live in the wild, as the forests in Denmark are like their natural habitat."}]}]}, {"word": "hall", "poses": [{"pos": "noun", "senses": [{"sense": "a large room or building where meetings, concerts, and other events happen", "level": "A2", "dict_examp": "Her dream is to perform at Carnegie  Hall.", "lear_examp": "I can make the concert hall look more attractive."}, {"sense": "a room or passage in a building that leads to other rooms", "level": "A2", "dict_examp": "an entrance hall", "lear_examp": "I think I left it in the hall."}]}]}, {"word": "hair dryer", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of electrical equipment for drying your hair with hot air", "level": "B1", "dict_examp": "Did you pack a hair dryer?", "lear_examp": "The comfortable rooms you are offering, do they have showers, hair dryers, and such facilities?"}]}]}, {"word": "ham", "poses": [{"pos": "noun", "senses": [{"sense": "meat from a pig's back or upper leg", "level": "A2", "dict_examp": "a ham sandwich", "lear_examp": "Every day for breakfast we have bread with ham."}]}]}, {"word": "hairdresser", "poses": [{"pos": "noun", "senses": [{"sense": "a person who cuts people's hair and puts it into a style", "level": "B1", "dict_examp": "Who's your hairdresser?", "lear_examp": "I would like to suggest a new time to meet you on Tuesday because I've got a hairdresser appointment at ten a.m."}]}]}, {"word": "hair", "poses": [{"pos": "noun", "senses": [{"sense": "the thin, thread-like parts that grow on your head", "level": "A1", "dict_examp": "curly/straight hair", "lear_examp": "She has long and dark hair, she has a big eyes, she is a serious girl."}, {"sense": "one or more of the thin thread-like parts that grow on a person's or animal's skin", "level": "B2", "dict_examp": "He's starting to get a few gray hairs now.", "lear_examp": "Then he appeared: a fat, middle-aged man with only a few hairs on his head."}, {"sense": "to be very relaxed  and enjoy yourself a lot", "level": "C2", "dict_examp": "I'd love to see Clare let her hair down for once.", "lear_examp": "Thrace hosts every year, festivals and carnivals where all the family can let their hair down and have fun."}]}]}, {"word": "haircut", "poses": [{"pos": "noun", "senses": [{"sense": "when someone cuts your hair, or the style in which it has been cut", "level": "B1", "dict_examp": "to get a haircut", "lear_examp": "You two have the same haircut, the same complexion but not the same attitude, which is good."}]}]}, {"word": "habit", "poses": [{"pos": "noun", "senses": [{"sense": "something that you do often and regularly, almost without knowing that you are doing it", "level": "B1", "dict_examp": "healthy eating habits", "lear_examp": "In your last letter you asked me about my shopping habits and my clothes."}, {"sense": "something that you often do that is bad for you or is annoying", "level": "B2", "dict_examp": "He has some really annoying/nasty habits.", "lear_examp": "With more free time and more money to spend than ever, shopping is a great activity, but when this creates bad habits such as overspending, it could lead to serious problems."}]}]}, {"word": "half-price", "poses": [{"pos": "adjective", "senses": [{"sense": "costing half the usual price", "level": "A2", "dict_examp": "I got half-price tickets for the show tonight.", "lear_examp": "It will cost $215, which is almost half-price."}]}]}, {"word": "hammer", "poses": [{"pos": "noun", "senses": [{"sense": "a tool with a heavy, metal part at the top that you use to hit nails into something", "level": "B2", "dict_examp": "You will need a hammer and some nails.", "lear_examp": "I gave her tools because I did not know a hammer from a screwdriver and she cleaned four plugs."}]}]}, {"word": "hand", "poses": [{"pos": "noun", "senses": [{"sense": "the part of your body on the end of your arm that has fingers and a thumb", "level": "A1", "dict_examp": "Take your hands out of your pockets!", "lear_examp": "Hi Sabrina The party was good. I forgot my phone in your house - I had it in my pocket, then it was in my hand and then I put it on a table in the kitchen."}, {"sense": "some help, especially to do something practical", "level": "B1", "dict_examp": "Could you give me a hand with these suitcases?", "lear_examp": "She asked me to give her a hand."}, {"sense": "done or made by a person instead of a machine", "level": "B1", "dict_examp": "This sweater has to be washed by hand.", "lear_examp": "I used to remember my mother washing our clothes by hand, but for me it is just a matter of throwing the clothes into the washing machine and pressing a few buttons."}, {"sense": "used when you are comparing two different ideas or opinions", "level": "B2", "dict_examp": "On the one hand, computer games develop many skills, but on the other, they mean kids don't get enough exercise.", "lear_examp": "On the one hand, I know from my experience that it's much easier in life if you know more about everything, but on the other hand, I'd say that if someone had given me a chance (when I was kid) to study what I enjoyed,  probably I'd have more possibility to develop my skills."}, {"sense": "holding each other's hand", "level": "B2", "dict_examp": "The children walked hand in hand.", "lear_examp": "Hand in hand they got off the train and she felt that her decision to leave was the best decision she had ever made in her life."}, {"sense": "If two things go hand in hand, they exist together and are connected with each other.", "level": "C1", "dict_examp": "Prosperity goes hand in hand with investment.", "lear_examp": "Traffic and pollution go hand in hand."}, {"sense": "near in time or space", "level": "C1", "dict_examp": "Teachers are always close at hand to give help to any child who needs it.", "lear_examp": "I haven't had any lectures in English, but now and then there are lectures in English at the University so you need to understand the spoken language with no dictionary at hand."}, {"sense": "to be in someone's control or care", "level": "C1", "dict_examp": "The matter is now in the hands of my lawyer.", "lear_examp": "The future of our country is in the hands of these two men who are so different and who can't stand each other."}, {"sense": "being cared for or dealt with by someone skilled", "level": "C1", "dict_examp": "The project is in safe hands - Jan has lots of experience.", "lear_examp": "He has also been trained as a lifeguard so the residents of your hotel would probably be in safe hands."}, {"sense": "without using a weapon or tool", "level": "C2", "dict_examp": "He broke the log in two with his bare hands!", "lear_examp": "I learned how to milk a cow, with my bare hands."}, {"sense": "near to someone or something, and ready to help or be used when necessary", "level": "C2", "dict_examp": "Extra supplies will be on hand, in case they are needed.", "lear_examp": "From their point of view, they can always have you on hand whenever they need help, which is the most important part in their formative years."}, {"sense": "to find something", "level": "C2", "dict_examp": "Do you know where I can lay my hands on a pair of scissors?", "lear_examp": "And as long as we remain unable to distinguish between needs and desires, amassing material possessions to gratify our fleeting caprices or alleviate our frustrations, we are bound to be trapped in the illusion that only by laying our hands on the desired goods can we obtain happiness and peace of mind."}, {"sense": "being worked on or dealt with now", "level": "C2", "dict_examp": "Don't worry – we have the situation  in hand.", "lear_examp": "Miss Kenton keeps asking Stevens whether everything is in hand and whether her help is required."}, {"sense": "to be in a stronger position than someone else so that you control a situation", "level": "C2", "dict_examp": "Government troops are gradually gaining the upper hand over the rebels.", "lear_examp": "Humans vs. machines - who has the upper hand?"}, {"sense": "to become difficult to control", "level": "C2", "dict_examp": "It was the end of week and the children were getting a little out of hand.", "lear_examp": "A few solutions can prevent this problem from getting out of hand."}, {"sense": "permission to make your own decisions about how you want to do something", "level": "C2", "dict_examp": "The students were given a free hand as far as designing their projects was concerned.", "lear_examp": "But unlike my parents, I wouldn't give my children a free hand in solving their problems."}, {"sense": "to be very busy", "level": "C2", "dict_examp": "Shelley has her hands full with three kids under 5.", "lear_examp": "This very fact made my father work like a slave, as he was the only breadwinner at home, my mother having her hands full with us four."}, {"sense": "to do something illegal in order to punish someone because you know that the law will not punish that person", "level": "C2", "dict_examp": "The police did nothing about the thefts, so they took the law into their own hands.", "lear_examp": "Therefore, locals are scared to death, leading to their taking the law into their own hands."}]}, {"pos": "verb", "senses": [{"sense": "to give someone something", "level": "B1", "dict_examp": "She handed him the letter.", "lear_examp": "Maybe you could hand me a paper with several questions I can answer, thus I would  cover the work I miss."}, {"sense": "used when you want to show that you admire someone", "level": "C2", "dict_examp": "You have to hand it to Mick, he's done a good job on that kitchen.", "lear_examp": "She had saved the business, and of course everybody knew it.  Begrudgingly they'd had to hand it to her."}, {"sense": "to pass possessions or traditions from older people to younger ones", "level": "C2", "dict_examp": "a custom handed down through the generations", "lear_examp": "The ring is of great significance to me as it was handed down from generation to generation, and I was the lucky one, who inherited it from my grandmother."}, {"sense": "to give a piece of written work to a teacher", "level": "B1", "dict_examp": "Have you handed in your homework yet?", "lear_examp": ""}, {"sense": "to give something to each person in a group or place", "level": "B1", "dict_examp": "The teacher asked her to hand out the worksheets.", "lear_examp": "I handed out refreshments to the pop group's members during breaks - my friends were so jealous of me!"}, {"sense": "to give someone or something to someone else", "level": "B2", "dict_examp": "The hijacker was handed over to the French police.", "lear_examp": "In the end, we handed them over to the police and we were rewarded."}]}]}, {"word": "hairstylist", "poses": [{"pos": "noun", "senses": [{"sense": "a person who cuts people's hair and puts it into a style", "level": "B1", "dict_examp": "Her hairstylist gave her a short cut that's easy to care for.", "lear_examp": "All the women before the wedding usually go to the hairstylist."}]}]}, {"word": "handheld", "poses": [{"pos": "adjective", "senses": [{"sense": "describes something that is designed to be held and used easily with one or two hands", "level": "C1", "dict_examp": "a handheld camera/computer/device", "lear_examp": "Soon you will be able to access all this information through your mobile or handheld device."}]}]}, {"word": "handwriting", "poses": [{"pos": "noun", "senses": [{"sense": "the way that someone forms the letters when they write with a pen or pencil", "level": "B1", "dict_examp": "His handwriting is impossible to read.", "lear_examp": "I have pretty bad handwriting as you know from my letters, and with a computer and a printer I can avoid others who read my letters from being put off by my handwriting."}]}]}, {"word": "handsome", "poses": [{"pos": "adjective", "senses": [{"sense": "A handsome man is attractive.", "level": "B1", "dict_examp": "She's hoping that she'll meet a tall, dark, handsome stranger.", "lear_examp": "The main actor is very handsome too."}, {"sense": "a large amount of money", "level": "C2", "dict_examp": "a handsome salary", "lear_examp": "Secondly, from an economic stand-point, it is generally believed that international sports events only serve as a means for TV companies to monopolize entertainment while turning a handsome profit."}]}]}, {"word": "handful", "poses": [{"pos": "noun", "senses": [{"sense": "a small number of people or things", "level": "B2", "dict_examp": "Only a handful of people came to the meeting.", "lear_examp": "First of all, thank you for having invited me to this meeting on a matter which many people pretend to be expert at but which, in fact, is deeply known by only a handful of scholars."}]}]}, {"word": "happy", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling, showing, or causing pleasure", "level": "A1", "dict_examp": "She looks so/very happy.", "lear_examp": "I am very happy that I can go to college every day and I can see my friends every day."}, {"sense": "something friendly that you say to someone on a special day or holiday", "level": "A1", "dict_examp": "Happy anniversary, darling!", "lear_examp": "Happy Halloween!"}, {"sense": "willing to do something", "level": "A2", "dict_examp": "I'd be very happy to help, if you need a hand.", "lear_examp": "I would be very happy to help you with the concert."}, {"sense": "satisfied and not worried", "level": "A2", "dict_examp": "Are you happy with the grades you got this semester?", "lear_examp": "I am very happy with my computer."}]}]}, {"word": "happen", "poses": [{"pos": "verb", "senses": [{"sense": "If an event or situation happens, it exists or starts to be done, usually by chance.", "level": "A2", "dict_examp": "Were you there when the accident happened?", "lear_examp": "I think it happened in his bedroom because I saw some sports clothes and we know he plays basketball."}, {"sense": "to be the result of an action, situation, or event that someone or something experiences", "level": "A2", "dict_examp": "Did you hear what happened to us last night?", "lear_examp": "In most Czech families dinner is the only meal when everybody eats together and talks about everything that happened to them during that day."}, {"sense": "to do something by chance", "level": "C1", "dict_examp": "If you happen to see Peter, say \"hi\" for me.", "lear_examp": "I am certainly more confident and can understand whatever I happen to read in English, which is of course of the utmost importance for my work in this company."}, {"sense": "something that you say in order to introduce a surprising fact", "level": "C1", "dict_examp": "As it happens, her birthday is the day after mine.", "lear_examp": "As it happens, I am currently looking for a computer course for myself and I would like to join one of your courses."}]}]}, {"word": "harassment", "poses": [{"pos": "noun", "senses": [{"sense": "behavior that annoys or upsets someone", "level": "C1", "dict_examp": "sexual harassment", "lear_examp": "However, they may be underpaid in comparison to men carrying out the same tasks, are seldom promoted - although they may be better qualified - and sometimes have to endure sexual harassment by their bosses."}]}]}, {"word": "hard", "poses": [{"pos": "adjective", "senses": [{"sense": "difficult to understand or do", "level": "A1", "dict_examp": "There were some really hard questions on the test.", "lear_examp": "I don't like grammar. English grammar is hard for me."}, {"sense": "firm and stiff, and not easy to press or bend", "level": "A2", "dict_examp": "a hard surface", "lear_examp": "We have to bring with us three pencils, two hard pencils and one soft."}, {"sense": "needing or using a lot of physical or mental effort", "level": "B1", "dict_examp": "Go on - give it a good hard push!", "lear_examp": "It's the perfect place to stay and relax after a week of hard work."}, {"sense": "to criticize someone too much, or to treat them unfairly", "level": "B2", "dict_examp": "Don't be too hard on him - he's new to the job.", "lear_examp": "That's why I was a little hard on you at first."}, {"sense": "full of problems and difficult to deal with", "level": "C1", "dict_examp": "My grandparents had a very hard life.", "lear_examp": "It was a really hard time for all of us, but it passed and, I hope, will never come again."}, {"sense": "to learn something by experiencing a lot of problems or difficulty", "level": "C2", "dict_examp": "He doesn’t want to take my advice, so I guess he’ll have to learn the hard way.", "lear_examp": "If you don't know the past, you're liable to live through it again as instead of deriving the lessons from someone else's experiences, you'll have to learn them the hard way, by trial and error."}, {"sense": "to make someone unhappy by causing them problems", "level": "C2", "dict_examp": "Don’t be too hard on her – she’s just learning the job.", "lear_examp": "Also it was hard on our family only seeing my father late at night being tired or for a weekend, if he was not on a business-trip."}, {"sense": "to criticize someone and make them feel guilty about something they have done", "level": "C2", "dict_examp": "His boss has been giving him a hard time.", "lear_examp": "I'm not saying that I wasn't normal or anything, I just gave my family a hard time sometimes."}, {"sense": "anger, unhappiness, or lack of trust", "level": "C2", "dict_examp": "I hope you don't have any hard feelings.", "lear_examp": "There were no hard feelings anymore."}]}, {"pos": "adverb", "senses": [{"sense": "with a lot of physical or mental effort", "level": "A1", "dict_examp": "She tried very hard but she wasn't quite fast enough.", "lear_examp": "I don't like to work very hard and very late in the classroom and I don't like computers."}, {"sense": "with a lot of force", "level": "B1", "dict_examp": "It's been raining hard all day.", "lear_examp": "It was a cloudy day, the wind was blowing hard, and the city was quiet."}]}]}, {"word": "hardly", "poses": [{"pos": "adverb", "senses": [{"sense": "almost not, or only a very small amount", "level": "B1", "dict_examp": "We hardly ever  go to concerts.", "lear_examp": "I've hardly ever called them since I came to this country to study English."}, {"sense": "certainly not", "level": "B2", "dict_examp": "You can hardly expect me to wait around all day for you to get ready.", "lear_examp": "And then, although you have allowed me to use all your stuff, I hardly think I can touch your computer and the CD player."}]}]}, {"word": "hang", "poses": [{"pos": "verb", "senses": [{"sense": "to fasten or support something at the top leaving the other parts free to move, or to be held in this way", "level": "B1", "dict_examp": "A heavy gold necklace hung around her neck.", "lear_examp": "She kept it in a tiny red bag which hung around her neck like a necklace."}, {"sense": "to kill someone by dropping them with a rope tied around their neck, or to die in this way", "level": "B2", "dict_examp": "He was found guilty and hanged later that year.", "lear_examp": "Their childhood was rather unhappy because their father was convicted of murder and hanged."}, {"sense": "to stay in the air for a long time", "level": "C2", "dict_examp": "Smoke from the campfires hung in the air.", "lear_examp": "The smog hangs over the cities like a deadly cloud, resulting in many health problems like pulmonary diseases and cancer."}, {"sense": "If something is or hangs in the balance, nobody knows if it will continue to exist in the future or what will happen to it.", "level": "C2", "dict_examp": "The game hung in the balance until the last seconds.", "lear_examp": "It is my firm belief, that unless we make a step towards the development of our town, its future will hang in the balance and we will ultimately pay the price of our short sightedness."}, {"sense": "to spend time somewhere, usually doing very little", "level": "B1", "dict_examp": "There's nowhere for teenagers to go so they just hang around on street corners.", "lear_examp": "It was great because the whole time I was able to ride my skateboard and hang around with my friends, and I had a lot of fun."}, {"sense": "to wait for a short time", "level": "B1", "dict_examp": "Hang on a minute while I see if Steve can come to the phone.", "lear_examp": "If I were you, I would take my job with more calm and I wouldn't be nervous when talking on the telephone, hanging on waiting for an answer."}, {"sense": "to spend a lot of time in a place or with someone", "level": "B1", "dict_examp": "We like hanging out at the mall.", "lear_examp": "For example, when I hang out with my friends, I love wearing a skirt."}, {"sense": "to finish a conversation on the telephone", "level": "B1", "dict_examp": "She said goodbye and hung up.", "lear_examp": "Then he hung up immediately."}, {"sense": "to put something, especially a piece of clothing, somewhere where it can hang", "level": "B1", "dict_examp": "You can hang up your jacket over there.", "lear_examp": "The first problem I would like to mention is what everybody in our class knows: we have to hang up more signs, which show the way to the reception, because visitors and new students have lots of problems finding it."}]}, {"pos": "noun", "senses": [{"sense": "to learn how to do something, especially if it is not obvious or simple", "level": "C2", "dict_examp": "I've  never used one of these before. - Don't worry, you'll soon get the hang of it.", "lear_examp": "It was quite hard to get the hang of it, as I didn't have any knowledge of English."}]}]}, {"word": "handout", "poses": [{"pos": "noun", "senses": [{"sense": "a copy of a document that is given to all the people in a class or meeting", "level": "B2", "dict_examp": "On page two of your handout you will find a list of the books that I have referred to during the lecture.", "lear_examp": "During our course, I made an effort to follow the lectures, and, for instance, to check the unknown vocabulary which appeared in handouts."}]}]}, {"word": "handkerchief", "poses": [{"pos": "noun", "senses": [{"sense": "a small piece of cloth or soft paper that you use to dry your eyes or nose", "level": "B1", "dict_examp": "She dabbed her eyes with a handkerchief.", "lear_examp": "We are going to see a dramatic film, Era mio padre, so don't forget your handkerchief."}]}]}, {"word": "harbor", "poses": [{"pos": "noun", "senses": [{"sense": "an area of water next to the coast, often protected from the sea by a thick wall, where ships and boats can shelter", "level": "B1", "dict_examp": "Our hotel room overlooked a pretty little fishing harbor.", "lear_examp": "I have a large room with a balcony from where I see the harbor and the beach."}]}]}, {"word": "hard drive", "poses": [{"pos": "noun", "senses": [{"sense": "the part inside a computer that is not removed and that stores very large amounts of information", "level": "B2", "dict_examp": "A virus damaged my hard drive.", "lear_examp": "As you know, computer prices are getting lower every day and technology is growing so fast so I thought that if I waited more and began saving money, I could buy a new computer with new stuff (better chip, hard drive etc.) in six months time."}]}]}, {"word": "handle", "poses": [{"pos": "verb", "senses": [{"sense": "to deal with something", "level": "B1", "dict_examp": "I thought he handled the problem/situation very well.", "lear_examp": "He couldn't handle it and started to run in the rain, crying, thinking."}, {"sense": "to touch, hold, or pick up something", "level": "C2", "dict_examp": "You must wash your hands before handling food.", "lear_examp": "In India, people tend to handle food with their hands, I have been told most people eat without cutlery."}]}, {"pos": "noun", "senses": [{"sense": "the part of something that you use to hold it or open it", "level": "B2", "dict_examp": "a door handle", "lear_examp": "I saw my chair, my carpet... and my door handle!..."}]}]}, {"word": "handy", "poses": [{"pos": "adjective", "senses": [{"sense": "useful or easy to use", "level": "C2", "dict_examp": "a handy container/tool", "lear_examp": "Such a possession may be something they use all the time, like a fountain pen for a writer, or a handy camera for a photographer, and they have become \"dependent\" on them."}, {"sense": "to be useful at some time in the future", "level": "C2", "dict_examp": "Don't throw those jars away - they might come in handy.", "lear_examp": "There's a washer and a dryer in the basement. I'm sure they'll come in handy with your new bundle of joy and the rest of your lovely bunch."}]}]}, {"word": "happily", "poses": [{"pos": "adverb", "senses": [{"sense": "in a happy way", "level": "B1", "dict_examp": "He was happily married with two young children.", "lear_examp": "Now we are happily married and I cannot stop thinking what would have happened if I had thrown away the e-mail...?"}, {"sense": "in a way that is very willing", "level": "B2", "dict_examp": "I'd happily offer to help him if I thought it would make any difference.", "lear_examp": "I think young people would happily accept it."}, {"sense": "having a good or lucky result", "level": "C1", "dict_examp": "Happily, the operation was a complete success.", "lear_examp": "Happily, I had met a friend who could take me to school!"}]}]}, {"word": "happiness", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being happy", "level": "B1", "dict_examp": "It was only later in life that she found happiness and peace of mind.", "lear_examp": "I wish you happiness, you deserve it."}]}]}, {"word": "harmony", "poses": [{"pos": "noun", "senses": [{"sense": "when people are peaceful and agree with each other, or when different things seem right or suitable together", "level": "B2", "dict_examp": "living together in peace and harmony", "lear_examp": "I would like to think my children are going to live in a lovely world where the human being will be able to live in peace and harmony with the environment."}, {"sense": "a pleasant sound in music, made by playing or singing a group of different notes together", "level": "C2", "dict_examp": "The choir sang in perfect harmony.", "lear_examp": "Having some singing knowledge myself, I can say their performance was excellent: the tune was maintained all through the concert, the rhythm was also carefully kept and they sounded in perfect harmony."}]}]}, {"word": "hard-working", "poses": [{"pos": "adjective", "senses": [{"sense": "doing a job seriously and with a lot of effort", "level": "B2", "dict_examp": "She's a very hard-working student.", "lear_examp": "I think I am suitable for the job because, apart from all the above, I am hard-working, well-educated and imaginative."}]}]}, {"word": "hatred", "poses": [{"pos": "noun", "senses": [{"sense": "an extremely strong feeling of dislike", "level": "C1", "dict_examp": "What is very clear in these letters is Clark's passionate hatred of his father.", "lear_examp": "The producers create situations involving different feelings such as love, hatred, anger, fear,..."}]}]}, {"word": "harsh", "poses": [{"pos": "adjective", "senses": [{"sense": "very cold, dangerous, or unpleasant and difficult to live in", "level": "C1", "dict_examp": "harsh conditions", "lear_examp": "Furthermore, I have been trained for a year in living in harsh conditions."}, {"sense": "cruel, unkind, or unpleasant in a way that seems unfair", "level": "C1", "dict_examp": "harsh criticism/punishment", "lear_examp": "Sorry if I sounded so harsh in the letter but I felt it was important to make these points."}, {"sense": "too strong, bright, loud, etc.", "level": "C1", "dict_examp": "harsh chemicals/lighting", "lear_examp": "It only contains herbs and plant extracts so it would not be too harsh a product for the skin and will not destroy the skin's natural defenses."}]}]}, {"word": "have", "poses": [{"pos": "auxiliary verb", "senses": [{"sense": "used with the past participle of another verb to form the present and past perfect tenses", "level": "A2", "dict_examp": "Have you seen Jake?", "lear_examp": "Dear Jo, Sorry I haven't written sooner."}]}, {"pos": "modal verb", "senses": [{"sense": "to need to do something or be forced to do something", "level": "A2", "dict_examp": "I've got to buy some new shoes.", "lear_examp": "It is important for me because I have to study for my History test."}, {"sense": "used when you are telling someone how to do something", "level": "A2", "dict_examp": "You have to wait for the green light and then record your voice.", "lear_examp": "To get to my house, you have to get the bus number 30 to town, and there you have to get the bus number 15 to Spring Bank."}, {"sense": "used to say that you feel certain that something is true or will happen", "level": "C2", "dict_examp": "Interest rates have to come down at some point.", "lear_examp": "There has to be a solution to this."}]}, {"pos": "verb", "senses": [{"sense": "to own or possess", "level": "A1", "dict_examp": "They have a big house.", "lear_examp": "I had a big house in Somalia, now I have a  small house."}, {"sense": "If you have a particular illness, you suffer from it.", "level": "A1", "dict_examp": "I have a cold.", "lear_examp": "I know you had the flu."}, {"sense": "to eat or drink something", "level": "A1", "dict_examp": "I had a turkey sandwich for lunch.", "lear_examp": "I have dinner at 5 pm."}, {"sense": "to give birth to a baby", "level": "A2", "dict_examp": "Elaine had a baby girl yesterday.", "lear_examp": "And later, we can go to Mary's house, because she has had a baby, and I would like to see her."}, {"sense": "to experience something", "level": "A2", "dict_examp": "Have a nice day!", "lear_examp": "We played a lot of games and had fun."}, {"sense": "used with nouns to say that someone does or will do something", "level": "A2", "dict_examp": "We have a committee meeting next week.", "lear_examp": "Last weekend, I had an argument with my parents, and I was angry, so I left my home and took a walk outside."}, {"sense": "to think of a question/idea/plan, etc.", "level": "B1", "dict_examp": "Do you have any other ideas?", "lear_examp": "I have a question for you!"}, {"sense": "to pay someone to do something for you", "level": "B1", "dict_examp": "We had our washing machine repaired.", "lear_examp": "My mother is having her car repaired."}, {"sense": "If you have something stolen/taken, etc., someone takes something that belongs to you.", "level": "B1", "dict_examp": "She had her car stolen last week.", "lear_examp": "He told me over the phone that he had arrived in London with his wife, but shortly after the arrival, he had had his wallet stolen in the underground station."}, {"sense": "to cause something to be in  a particular state", "level": "B1", "dict_examp": "He had dinner ready by the time we got home.", "lear_examp": "We had everything ready in case of an emergency or a chaos situation."}, {"sense": "used to say that someone is holding something, or that someone or something is with them", "level": "B1", "dict_examp": "He had a pen in his hand.", "lear_examp": "Maria had the phone in her hand."}, {"sense": "to not know", "level": "B1", "dict_examp": "\"Where's Tina?\" \"I have no idea.\"", "lear_examp": "I have no idea about how his children are."}, {"sense": "If you have someone over/to stay, etc., you arrange for someone to visit you in your home.", "level": "B2", "dict_examp": "We had David and Amy over for dinner last week.", "lear_examp": "It happened when I had a friend over for dinner."}, {"sense": "to be completely unable to guess, understand, or deal with something", "level": "B2", "dict_examp": "I don't have a clue what you're talking about.", "lear_examp": "I just don't know which clothes to take with me because I don't have a clue about the Scottish weather."}, {"sense": "to have no connection or influence with someone or something", "level": "B2", "dict_examp": "He made his own decision - I had nothing to do with it.", "lear_examp": "Of course, I tried to explain to him that I had nothing to do with the vanishing of the cake but he didn't trust me."}, {"sense": "If something has nothing to do with you, you have no good reason to know about it or be involved with it.", "level": "B2", "dict_examp": "Stop asking questions. This has nothing to do with you.", "lear_examp": "The party was horrible: the guests were all talking about things that had nothing to do with me."}, {"sense": "to have a reason not to like someone or something", "level": "C1", "dict_examp": "Ellen doesn't have anything against bowling either, so let's go!", "lear_examp": "If you have nothing against taking public transport, I suggest taking a bus."}, {"sense": "to ask, arrange for, or pay  someone to do something", "level": "C2", "dict_examp": "We need to have someone fix the radiator in the bedroom.", "lear_examp": "I would like to request you, as a manager, to either have someone fix the problem with the microwave or simply replace it."}, {"sense": "to dislike someone and want to cause problems for them", "level": "C2", "dict_examp": "She really has it in for me - I don't know what I did to upset her.", "lear_examp": "Only then did she realize that somebody had it in for her."}, {"sense": "to be in a stronger position than someone else so that you control a situation", "level": "C2", "dict_examp": "Government troops are gradually gaining the upper hand over the rebels.", "lear_examp": "Humans vs. machines - who has the upper hand?"}, {"sense": "If you have clothes or shoes on, you are wearing them.", "level": "B1", "dict_examp": "He's got a red shirt on.", "lear_examp": "I looked over my shoulder and there was Nora as white as the dress she had on."}]}]}, {"word": "hazard", "poses": [{"pos": "noun", "senses": [{"sense": "something that is dangerous", "level": "C1", "dict_examp": "a fire hazard", "lear_examp": "Like all things, mobile phones have advantages and disadvantages. ... It is said that they produce cancer and that they are a health hazard."}]}]}, {"word": "harmless", "poses": [{"pos": "adjective", "senses": [{"sense": "not able or not likely to cause harm", "level": "B2", "dict_examp": "Most mushrooms are completely/totally harmless, but some are poisonous.", "lear_examp": "In conclusion, cars are not as harmless as they look so we must stop using them so much."}, {"sense": "not likely to shock or upset people or to cause problems", "level": "C2", "dict_examp": "Their jokes seemed harmless enough.", "lear_examp": "He seemed harmless enough so I decided to take a nap. Suddenly I heard a strange noise and I was terrified to hear his loud voice booming in my ear."}]}]}, {"word": "hate", "poses": [{"pos": "verb", "senses": [{"sense": "to dislike someone or something very much", "level": "A2", "dict_examp": "Kelly hates her teacher.", "lear_examp": "I love rock and techno but I hate rap."}]}, {"pos": "noun", "senses": [{"sense": "a strong dislike for someone or something", "level": "C1", "dict_examp": "Hate and bigotry can only make our lives more difficult.", "lear_examp": "Feelings of hate and disgust may fill us, but we may love somebody. Many people say that love and hate go together."}]}]}, {"word": "haunt", "poses": [{"pos": "verb", "senses": [{"sense": "If a ghost haunts a place, it appears there often.", "level": "B2", "dict_examp": "They say that the house is haunted by the soldier's ghost.", "lear_examp": "The castle is 500 years old, and it is said to be haunted by a lady ghost."}, {"sense": "If an unpleasant memory or feeling haunts you, you think about or feel it often.", "level": "B2", "dict_examp": "Fighting in Vietnam was an experience that would haunt him for the rest of his life.", "lear_examp": "And so John remained alone, haunted by the terrible loss."}]}]}, {"word": "harvest", "poses": [{"pos": "noun", "senses": [{"sense": "when crops are cut and gathered from fields", "level": "B2", "dict_examp": "the wheat/corn/grape harvest", "lear_examp": "Well I can tell you about our annual harvest festival."}]}]}, {"word": "harshly", "poses": [{"pos": "adverb", "senses": [{"sense": "in an unkind, strict, or unpleasant way", "level": "C2", "dict_examp": "Violators are being dealt with harshly.", "lear_examp": "I am writing in response to a letter published in last week's issue of the newspaper \"Society today\", in which \"An Inspector Calls\", is harshly criticized."}]}]}, {"word": "hardship", "poses": [{"pos": "noun", "senses": [{"sense": "a problem or situation that makes you suffer a lot, especially because you are very poor", "level": "C1", "dict_examp": "They have suffered years of financial hardship.", "lear_examp": "However, I have to say that this plan would cause much inconvenience and hardship for our local residents."}]}]}, {"word": "hat", "poses": [{"pos": "noun", "senses": [{"sense": "something you wear to cover your head, for fashion or protection", "level": "A1", "dict_examp": "a straw hat", "lear_examp": "I want to wear this hat when I go to my grandmother's house."}]}]}, {"word": "harm", "poses": [{"pos": "verb", "senses": [{"sense": "to hurt someone or damage something", "level": "B2", "dict_examp": "Thankfully, no one was harmed in the accident.", "lear_examp": "But in those places animals were harmed and died easily."}]}, {"pos": "noun", "senses": [{"sense": "hurt or damage", "level": "B2", "dict_examp": "Alan would never do anyone any harm.", "lear_examp": "It is true that the car does us harm."}, {"sense": "used to say that something is not a bad thing to do and could possibly have a good effect", "level": "C1", "dict_examp": "I suppose there's no harm in trying.", "lear_examp": "There is no lack of good language schools and there is no harm in trying another one the next time."}]}]}, {"word": "harmful", "poses": [{"pos": "adjective", "senses": [{"sense": "causing harm", "level": "B2", "dict_examp": "This group of chemicals is known to be harmful to people with asthma.", "lear_examp": "In addition, books are not harmful to our health as computers sometimes are."}]}]}, {"word": "hardware", "poses": [{"pos": "noun", "senses": [{"sense": "the physical and electronic parts of a computer, rather than the programs", "level": "B1", "dict_examp": "We need to include new hardware in our budget.", "lear_examp": "Computer technology keeps improving all the time and consumers like me and you definitely have to pay our money to keep our personal computer up to date and able to work with new computer software that requires better and better performance of computer hardware."}]}]}, {"word": "haul", "poses": [{"pos": "verb", "senses": [{"sense": "to pull something somewhere slowly and with difficulty", "level": "C2", "dict_examp": "They hauled the piano into the living room.", "lear_examp": "\"When I'm finished, you can jump whenever you like. Remember to hold on to each other, and we'll haul you up when it's all over.\""}]}, {"pos": "noun", "senses": [{"sense": "an amount of something, often something that has been stolen or that is owned illegally", "level": "C2", "dict_examp": "a haul of arms/drugs", "lear_examp": "Because of the loud noise of the running engine, she wasn't aware of the man behind her grabbing the smaller bag and turning round ready to escape with his haul."}]}]}, {"word": "healthy", "poses": [{"pos": "adjective", "senses": [{"sense": "physically strong and well", "level": "A2", "dict_examp": "She's a normal, healthy child.", "lear_examp": "Hope you are fine and healthy!"}, {"sense": "good for your health", "level": "A2", "dict_examp": "a healthy diet", "lear_examp": "Lithuanian people eat natural (but not healthy) food."}, {"sense": "successful and strong", "level": "C2", "dict_examp": "a healthy economy", "lear_examp": "Still, these investments are needed, as they are essential for a healthy economy."}]}]}, {"word": "heart attack", "poses": [{"pos": "noun", "senses": [{"sense": "a serious medical condition in which the heart does not get enough blood, causing great pain and often leading to death", "level": "B1", "dict_examp": "John had a heart attack three years ago.", "lear_examp": "I was really surprised when I read the e-mail, and discovered that our father had had a heart attack."}]}]}, {"word": "headache", "poses": [{"pos": "noun", "senses": [{"sense": "a pain you feel inside your head", "level": "A2", "dict_examp": "I have a splitting  headache.", "lear_examp": "He said he feels sick and has a headache."}]}]}, {"word": "hazardous", "poses": [{"pos": "adjective", "senses": [{"sense": "dangerous", "level": "C2", "dict_examp": "hazardous chemicals", "lear_examp": "They are faced with hazardous chemical reactions when trying to gain new knowledge and therefore people should be very grateful to them."}]}]}, {"word": "heading", "poses": [{"pos": "noun", "senses": [{"sense": "words at the top of a piece of writing that tell you what it is about", "level": "C1", "dict_examp": "You'll find it under the heading 'Information for new students'.", "lear_examp": "As the advertisement included the heading \"Come and discover the career of your dreams!\", my attention was drawn to it."}]}]}, {"word": "health care", "poses": [{"pos": "noun", "senses": [{"sense": "the set of services provided by a country or an organization for treating people who are ill", "level": "C1", "dict_examp": "A large proportion of these taxes go towards providing health care.", "lear_examp": "In Britain, the NHS provides free health care for every citizen."}]}]}, {"word": "he", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to refer to a man, boy, or male animal that has already been mentioned", "level": "A1", "dict_examp": "You can  ask Andrew - he may know.", "lear_examp": "He is from Hungary."}]}]}, {"word": "headquarters", "poses": [{"pos": "noun", "senses": [{"sense": "the place from where an organization is controlled", "level": "B2", "dict_examp": "The bank's headquarters are in New York.", "lear_examp": "I took my car and drove to the Police headquarters."}]}]}, {"word": "health", "poses": [{"pos": "noun", "senses": [{"sense": "the condition of your body", "level": "A2", "dict_examp": "to be in good/poor health", "lear_examp": "I like it very much because I think playing football is good for my health."}]}]}, {"word": "heart", "poses": [{"pos": "noun", "senses": [{"sense": "the organ in your chest that sends the blood around your body", "level": "A2", "dict_examp": "heart disease/failure", "lear_examp": "My father is going to have heart surgery."}, {"sense": "someone's deepest feelings and true character", "level": "B1", "dict_examp": "She has a kind heart.", "lear_examp": "She's very nice, a person with a good heart."}, {"sense": "the center of something or the most important part of something", "level": "B1", "dict_examp": "Kansas City is in the heart of cattle country.", "lear_examp": "This restaurant is in the heart of Tepec, and it is open from 10.00am to 6.00pm except on Friday."}, {"sense": "a shape that represents a heart and is used to mean love", "level": "B2", "dict_examp": "The card had a big heart on the front.", "lear_examp": "It had a red rose in its hand and a t-shirt with a big red heart saying \"I love you.\" That was it!"}, {"sense": "used to say that you feel something very strongly", "level": "B2", "dict_examp": "I thank you with all my heart.", "lear_examp": "With this letter, I want to thank you with all my heart for your hospitality during my visit to you."}, {"sense": "so that you can remember all of something", "level": "B2", "dict_examp": "She has read the stories so oftent that she knows them by heart.", "lear_examp": "I know all his songs by heart and I was singing all the time."}, {"sense": "to make someone feel extremely sad", "level": "B2", "dict_examp": "She really broke his heart when she left.", "lear_examp": "I saw them kissing each other. That was it - when I saw that scene, it broke my heart."}, {"sense": "used to say what you really feel or think", "level": "C1", "dict_examp": "In his heart, he knew she was right.", "lear_examp": "I have to admit that it was only a sensible decision, because deep in my heart I knew I wanted to learn English."}, {"sense": "If something comes from the heart it is something you strongly feel or believe", "level": "C2", "dict_examp": "Her speech came from the heart.", "lear_examp": "It is much more than that, it is something you feel proud of, which comes from the heart."}, {"sense": "used to say what someone is really like", "level": "C2", "dict_examp": "I'm just a kid at heart.", "lear_examp": "I also thought that she was brave at heart."}, {"sense": "to tell someone your secret thoughts and feelings", "level": "C2", "dict_examp": "That night, she opened her heart to me.", "lear_examp": "It is during this excessively dramatic conversation that George opening up his heart, tells her about his interpretation of her unhappiness with Cecil."}, {"sense": "If you take criticism or advice to heart, you think about it seriously.", "level": "C2", "dict_examp": "Don't take it to heart - he was only joking about your hair.", "lear_examp": "I hope you will take my advice to heart."}, {"sense": "If you do or say something with a heavy heart, you feel very sad or anxious", "level": "C2", "dict_examp": "It was with a heavy heart that he packed his bags and left his home of many years.", "lear_examp": "I started to clear the table with a heavy heart, and was still in the process of washing up when the bell rang and, on dashing to open the door - I was the only one that was still up - I was relieved to find that my friends had come to greet me, as is their wont."}, {"sense": "If something is dear to someone or dear to someone's heart, it is very important to them.", "level": "C2", "dict_examp": "The charity was very dear to his heart.", "lear_examp": "Among all the places I enjoyed visiting, the city of Singapore is especially dear to my heart."}, {"sense": "If you have a change of heart, you change your opinion or feelings about something.", "level": "C2", "dict_examp": "At first he said he wouldn't help us, but he seems to have had a change of heart.", "lear_examp": "The narrator didn't tell her big secret to Inder Lal and after a change of heart she decides to keep the baby."}]}]}, {"word": "head", "poses": [{"pos": "noun", "senses": [{"sense": "the part of the body above the neck that contains your brain, eyes, nose, mouth, ears, etc., and on which your hair grows", "level": "A1", "dict_examp": "Put this hat on to keep your head warm.", "lear_examp": "You must wear a cap on your head."}, {"sense": "the person who is in charge of an organization or a part of an organization", "level": "B1", "dict_examp": "the head of an oil company", "lear_examp": "Joshua was the head of security of the international airport of New York."}, {"sense": "the mind and mental abilities", "level": "B1", "dict_examp": "All these thoughts were going through my head.", "lear_examp": "Since I have never been there, I imagine all the places in my head."}, {"sense": "to stop being calm in a difficult situation", "level": "C1", "dict_examp": "I saw the fire and I lost my head.", "lear_examp": "She has never lost her head in dangerous situations and she always knows what to do."}, {"sense": "to remain calm in a difficult situation", "level": "C2", "dict_examp": "To be successful in business, you need to keep a cool head in negotiations.", "lear_examp": "Kevin managed to keep a cool head and took over the navigation."}, {"sense": "to have just enough money to live or to continue a business", "level": "C2", "dict_examp": "With extra income from private sponsorship, the club is just about managing to keep its head above water.", "lear_examp": "I also started to realize how much she had on her plate, how very little help she had and how, at times, she had to struggle just like me to keep her head above water."}, {"sense": "to laugh/shout/scream, etc., very much and very loudly", "level": "C2", "dict_examp": "The show was great! I laughed my head off.", "lear_examp": "Other pupils were laughing their heads off as she went."}, {"sense": "the front or top part of something", "level": "C2", "dict_examp": "Who is that at the head of the table?", "lear_examp": "There, at the head of the line, her uncle with his two daughters waited for her."}]}, {"pos": "verb", "senses": [{"sense": "to move in a particular direction", "level": "B2", "dict_examp": "I was heading out of the room when she called me back.", "lear_examp": "Then I headed for the dining room."}, {"sense": "to be in charge of a group, organization, etc.", "level": "B2", "dict_examp": "She heads a thriving software business.", "lear_examp": "When Carlos headed the government, the country saw important changes, such as Free Trade among Canada, USA and Mexico; the selling of the banks; \"democratic\" elections."}, {"sense": "to be at the front or top of something", "level": "C1", "dict_examp": "Jo headed a very short list of candidates.", "lear_examp": "When it comes to money paid to the families, Germany headed the list with 2%, followed by Spain with 0.25% and the USA with 0.2%."}, {"sense": "to be likely to experience a bad situation soon", "level": "B2", "dict_examp": "They'll be heading for trouble if they're not careful.", "lear_examp": "Mankind is heading for the future sometimes faster than we think."}, {"sense": "to start to leave a place or begin a trip, walk, etc.", "level": "C1", "dict_examp": "We'll head off after lunch.", "lear_examp": "After being snowed in, the following morning we headed off to Las Vegas."}]}]}, {"word": "heap", "poses": [{"pos": "noun", "senses": [{"sense": "a messy pile of things", "level": "C2", "dict_examp": "a garbage heap", "lear_examp": "Her mother was often out and Sue had nobody to share her thoughts with except for an .... old red diary with a .... lock. She kept it in her bedroom under the heap of old toys nobody cared for anymore."}, {"sense": "a lot of something", "level": "C2", "dict_examp": "He has heaps of money.", "lear_examp": "Apart from that, my overseas stay has made me believe that children who are brought up in families that do not have heaps of money are prepared for their life as an adult in a way that people who have always had money may never understand."}]}]}, {"word": "headline", "poses": [{"pos": "noun", "senses": [{"sense": "the title of a newspaper story that is printed in large letters above it", "level": "B1", "dict_examp": "a front-page headline", "lear_examp": "The headline was \"FAILURE OF FESTIVAL\"."}, {"sense": "the main stories in newspapers, on television, etc.", "level": "B2", "dict_examp": "That story made headlines all over the world.", "lear_examp": ""}]}]}, {"word": "hear", "poses": [{"pos": "verb", "senses": [{"sense": "to be aware of a sound through your ears", "level": "A1", "dict_examp": "She heard a noise outside.", "lear_examp": "I can hear birds singing there."}, {"sense": "to listen to someone or something", "level": "A2", "dict_examp": "I heard on the radio that it's going to rain.", "lear_examp": "I like soft rock music, and I would like to hear it at the concert."}, {"sense": "to be told some information", "level": "B1", "dict_examp": "Have you heard the news?", "lear_examp": "After, she told me that my mother-in-law had arrived in the city and, obviously, when I heard that, I started to cry."}, {"sense": "the last time someone heard anything about someone or something", "level": "C2", "dict_examp": "The last I heard, they will arrive Tuesday night.", "lear_examp": "That was the last I heard of her for a long time."}, {"sense": "If you hear from someone, you get a letter, a message, or a telephone call from them, or they tell you something.", "level": "B1", "dict_examp": "We haven't heard from her for a long time.", "lear_examp": "I didn't hear from my friend for a long time."}, {"sense": "If you have heard of someone or something, you know that that person or thing exists.", "level": "B2", "dict_examp": "I'd never heard of him before he won the prize.", "lear_examp": "The old man had never heard of the Dark Duck, so he asked Paul what it was."}]}]}, {"word": "heal", "poses": [{"pos": "verb", "senses": [{"sense": "If a wound or broken bone heals, it becomes healthy again, and if something heals it, it makes it healthy again.", "level": "B2", "dict_examp": "The wound on his head had begun to heal (up).", "lear_examp": "Biotechnology is providing us with the latest discoveries to heal or improve the human body."}]}]}, {"word": "help", "poses": [{"pos": "verb", "senses": [{"sense": "to make it easier for someone to do something by doing part of the work yourself", "level": "A1", "dict_examp": "Thank you for helping.", "lear_examp": "But the people help me and it's okay."}, {"sense": "to provide advice, money, support, etc. to make it possible or easier for someone to do something", "level": "A2", "dict_examp": "I wonder if you could help me - I'd like some information about flights to New Zealand.", "lear_examp": "I hope that my information helps you to plan your trip."}, {"sense": "to be unable to stop yourself from doing something or to stop something from happening", "level": "B1", "dict_examp": "I can't help laughing when I think about what happened to you both!", "lear_examp": "I got so sad that I couldn't help crying."}, {"sense": "to take something, especially food or drink, without asking", "level": "B1", "dict_examp": "Please help yourself to some coffee.", "lear_examp": "Some tables with sandwiches, salads and drinks are going to be available for you to help yourselves."}, {"sense": "to make something better", "level": "B2", "dict_examp": "When you're nervous or scared, it helps to breathe slowly and deeply.", "lear_examp": "Everybody agrees with the importance of doing exercise regularly, it helps to take out the toxins from the body."}, {"sense": "to help someone, especially by giving them money or working for them", "level": "B2", "dict_examp": "Sophia has been helping out in the store this week.", "lear_examp": "I helped out my friend by writing huge billboards and making some light refreshments."}]}, {"pos": "noun", "senses": [{"sense": "when someone helps another person", "level": "A2", "dict_examp": "I was too embarrassed to ask for help.", "lear_examp": "If you need any help, I can bring food and drinks, but I can only come on Sundays."}, {"sense": "using something", "level": "B1", "dict_examp": "She walks to the beach every day with the help of a cane.", "lear_examp": "The film was full of special effects created with the help of computer graphics, and it was very good."}, {"sense": "something or someone that helps", "level": "B2", "dict_examp": "Having a new computer would be a help.", "lear_examp": "Two weeks ago I made a trip to Britain, and 'The Student Tourist Guidebook' was a great help when I visited Lampton."}]}, {"pos": "exclamation", "senses": [{"sense": "something that you shout when you are in danger", "level": "A2", "dict_examp": "Help! I'm drowning!", "lear_examp": "She was really shocked and she screamed \"Help!\""}]}]}, {"word": "hello", "poses": [{"pos": "exclamation", "senses": [{"sense": "used to greet someone", "level": "A1", "dict_examp": "Hello, Paul. I haven't seen you for a while!", "lear_examp": "Hello Fatima, how are you?"}, {"sense": "used to start a conversation on the phone", "level": "A1", "dict_examp": "\"Hello, I'd like some information about your hotel, please.\"", "lear_examp": ""}]}]}, {"word": "helpful", "poses": [{"pos": "adjective", "senses": [{"sense": "willing to help, or useful", "level": "B1", "dict_examp": "She's such a sweet, helpful girl!", "lear_examp": "The teacher is wonderful, she is so kind and helpful to everyone."}]}]}, {"word": "helmet", "poses": [{"pos": "noun", "senses": [{"sense": "a hard hat that protects your head", "level": "B2", "dict_examp": "a crash helmet", "lear_examp": "Some good advice is: first of all get yourself a good bicycle, a helmet and some protective clothes, in case the weather changes."}]}]}, {"word": "heavily", "poses": [{"pos": "adverb", "senses": [{"sense": "a lot or to a great degree", "level": "B1", "dict_examp": "It was raining heavily.", "lear_examp": "One day, when I was walking out in the park with my friend, it started raining heavily."}]}]}, {"word": "here", "poses": [{"pos": "adverb", "senses": [{"sense": "in the place where you are", "level": "A1", "dict_examp": "Does Jane live near here?", "lear_examp": "He lives in Galicia, but now he's here in Cambridge to study English."}, {"sense": "used when you are giving someone something", "level": "A2", "dict_examp": "Here's a present for you.", "lear_examp": "Dear Jo, Here is some information about the art class."}, {"sense": "used when you see someone or something you have been looking for or waiting for", "level": "A2", "dict_examp": "Here she is at last.", "lear_examp": ""}, {"sense": "at this point in a discussion or piece of writing", "level": "B2", "dict_examp": "I don't have time here to go into all the details.", "lear_examp": "My idea here is to highlight the fact that computers are going to control our lives."}, {"sense": "in several different places or directions but without any pattern", "level": "B2", "dict_examp": "Tall trees were growing here and there.", "lear_examp": "A lot of people rushed here and there."}]}]}, {"word": "heaven", "poses": [{"pos": "noun", "senses": [{"sense": "according to some religions, the place where good people go when they die", "level": "B2", "dict_examp": "They told us that she had gone to heaven.", "lear_examp": "\"Now she is in heaven - don't worry she will be okay.\" I started crying."}, {"sense": "something very nice that gives you great pleasure", "level": "B2", "dict_examp": "I just lay in the sun for a week and did nothing - it was heaven.", "lear_examp": "These little islands are just heaven."}]}]}, {"word": "heat", "poses": [{"pos": "noun", "senses": [{"sense": "the system that keeps a building warm", "level": "A2", "dict_examp": "Could you turn up/down the heat a little?", "lear_examp": ""}, {"sense": "the quality of being hot or warm, or the temperature of something", "level": "B1", "dict_examp": "the heat of the sun/fire", "lear_examp": "The weather is magnificent, it's very hot but you can't feel the heat because if you go swimming it passes."}]}, {"pos": "verb", "senses": [{"sense": "to make food hot so that it can be eaten", "level": "B2", "dict_examp": "I'll just heat up the soup.", "lear_examp": "Do not spend your money on fast-food restaurants, and do not buy meals to heat up in your microwave."}]}]}, {"word": "heater", "poses": [{"pos": "noun", "senses": [{"sense": "a machine that heats air or water", "level": "B1", "dict_examp": "The heater comes on automatically.", "lear_examp": "I have decided to buy a new carpet and a little heater."}]}]}, {"word": "height", "poses": [{"pos": "noun", "senses": [{"sense": "how tall or high something or someone is", "level": "B1", "dict_examp": "She's about my height.", "lear_examp": "I would prefer not to stay in a tent because of my height, I am so tall that I could never stand up."}, {"sense": "how far above the ground something is", "level": "B1", "dict_examp": "The aircraft was flying at a height of about 11,000 feet.", "lear_examp": "All the pictures we took were nice, but the most beautiful one was the picture of Patricia and me at the top of the mountain \"Kala Pattar\", which is situated at a height of 5,600 meters!"}, {"sense": "the strongest, most important or most successful part of something", "level": "C2", "dict_examp": "I met him when he was at the height of his fame.", "lear_examp": "At the height of his success, he was told he had cancer and he had to interrupt his career, but only to come back some years later to show off his best."}]}]}, {"word": "hence", "poses": [{"pos": "adverb", "senses": [{"sense": "for this reason", "level": "C1", "dict_examp": "He has an interview today, hence the suit.", "lear_examp": "Hence, the more competition there is, the more benefits are given to both people and society."}]}]}, {"word": "helper", "poses": [{"pos": "noun", "senses": [{"sense": "someone who helps another person to do something", "level": "B2", "dict_examp": "The tutoring progam needs more helpers.", "lear_examp": "I'll be more than happy to work as a helper."}]}]}, {"word": "heel", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a shoe that is under your heel", "level": "B1", "dict_examp": "The boots had very high heels.", "lear_examp": "I hate wearing tight clothes, or shoes with high heels."}, {"sense": "the back part of your foot", "level": "B2", "dict_examp": "I got blisters on my heels from my new shoes.", "lear_examp": ""}]}]}, {"word": "helicopter", "poses": [{"pos": "noun", "senses": [{"sense": "an aircraft that flies using long, thin parts on top of it that turn around and around very fast", "level": "A2", "dict_examp": "The injured were flown to the hospital by helicopter.", "lear_examp": "I got here by boat because it doesn't have an airport and it's too difficult for helicopters to land."}]}]}, {"word": "her", "poses": [{"pos": "pronoun", "senses": [{"sense": "used after a verb or preposition to refer to someone female who has already been talked about", "level": "A1", "dict_examp": "Where's Kath - have you seen her?", "lear_examp": "She can learn many English words because she is working with people, and then I learn these words from her."}]}, {"pos": "determiner", "senses": [{"sense": "belonging to or relating to someone female who has already been talked about", "level": "A1", "dict_examp": "That's her house on the corner.", "lear_examp": "Every Sunday, she goes to see her mother."}]}]}, {"word": "hectic", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely busy and full of activity", "level": "C1", "dict_examp": "a hectic day/week", "lear_examp": "Alongside today's hectic life we need to adapt fashion to our lives and interests."}]}]}, {"word": "helpless", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to defend yourself or do things without help", "level": "C1", "dict_examp": "a helpless animal/child", "lear_examp": "I remember one day in school how helpless I felt because I had forgotten my glasses at home."}]}]}, {"word": "heir", "poses": [{"pos": "noun", "senses": [{"sense": "a person who will have the legal right to someone's money and possessions when they die", "level": "C2", "dict_examp": "He is the heir to a huge fortune.", "lear_examp": "The new will stated that Emma was the sole heir and inheritor of the property and money of her father."}]}]}, {"word": "heavy", "poses": [{"pos": "adjective", "senses": [{"sense": "Heavy objects or people weigh a lot.", "level": "A2", "dict_examp": "heavy equipment", "lear_examp": "My phone is awesome. It is very small and I like it because it isn't heavy and I can listen to music with it."}, {"sense": "used to ask how much someone or something weighs", "level": "A2", "dict_examp": "How heavy is your backpack?", "lear_examp": ""}, {"sense": "large in amount or degree", "level": "B1", "dict_examp": "heavy traffic", "lear_examp": "There is fresh air, no heavy traffic and, more important for me, it is a quiet and calm place."}, {"sense": "using a lot of force", "level": "C2", "dict_examp": "a heavy blow", "lear_examp": "Every time planes from your airport fly overhead he imagines the horrors of the war he's lived through and experiences ... distress in the form of his palms sweating, heavy breathing, and increased pulse and heart beat."}, {"sense": "If you do or say something with a heavy heart, you feel very sad or anxious", "level": "C2", "dict_examp": "It was with a heavy heart that he packed his bags and left his home of many years.", "lear_examp": "I started to clear the table with a heavy heart, and was still in the process of washing up when the bell rang and, on dashing to open the door - I was the only one that was still up - I was relieved to find that my friends had come to greet me, as is their wont."}]}]}, {"word": "heavenly", "poses": [{"pos": "adjective", "senses": [{"sense": "very good", "level": "C1", "dict_examp": "a heavenly day", "lear_examp": "The Art Gallery was well presented and the exhibits were heavenly."}]}]}, {"word": "hedge", "poses": [{"pos": "noun", "senses": [{"sense": "a row of bushes growing close together, often used to divide land into separate areas", "level": "B2", "dict_examp": "The tennis court was surrounded by a thick hedge.", "lear_examp": "Besides, people should be allowed to sit under the trees. At present, the lawn, bushes and hedges aren't open to people."}]}]}, {"word": "herb", "poses": [{"pos": "noun", "senses": [{"sense": "a plant that is used in cooking to add flavor to food or is used in medicines", "level": "B1", "dict_examp": "dried/fresh herbs", "lear_examp": "He was chattering with his parents and drinking warm milk with the smell of fresh herbs and flowers."}]}]}, {"word": "hell", "poses": [{"pos": "noun", "senses": [{"sense": "according to some religions, the place where bad people go when they die", "level": "B2", "dict_examp": "I'll go to hell for this.", "lear_examp": "We decided to enter the attic and then, as if coming from hell, a big, dirty, old cat ran away through our legs."}, {"sense": "an experience that is very unpleasant", "level": "B2", "dict_examp": "It's been hell working with him.", "lear_examp": "However, this apparently relaxed activity can sometimes turn into a living hell; you may only be able to go shopping at the weekend and then, if you do go, you will find yourself in the middle of a huge crowd of people, unable to get to any product or even shop and feeling dizzy by the mixture of smells that come from the people."}, {"sense": "used to emphasize something in a rude or angry way", "level": "B2", "dict_examp": "What the hell are you doing here?", "lear_examp": "He was yelling again: \"What the hell is going on?\""}, {"sense": "used to say that someone or something is very good, big, etc.", "level": "C2", "dict_examp": "a hell of a noise", "lear_examp": "Secondly, I particularly appreciated the length of classes confined to some 5 hours a day, which offered the possibility of studying at length on your own and a hell of a lot of time to spare."}]}]}, {"word": "high-tech", "poses": [{"pos": "adjective", "senses": [{"sense": "using or involved with the most recent and advanced electronic machines, computers, etc.", "level": "B2", "dict_examp": "His new car has a high-tech sound system.", "lear_examp": "We can build up a high-tech computer lab, and last but not least, we can provide some talented students with scholarships."}]}]}, {"word": "here", "poses": [{"pos": "adverb", "senses": [{"sense": "in the place where you are", "level": "A1", "dict_examp": "Does Jane live near here?", "lear_examp": "He lives in Galicia, but now he's here in Cambridge to study English."}, {"sense": "used when you are giving someone something", "level": "A2", "dict_examp": "Here's a present for you.", "lear_examp": "Dear Jo, Here is some information about the art class."}, {"sense": "used when you see someone or something you have been looking for or waiting for", "level": "A2", "dict_examp": "Here she is at last.", "lear_examp": ""}, {"sense": "at this point in a discussion or piece of writing", "level": "B2", "dict_examp": "I don't have time here to go into all the details.", "lear_examp": "My idea here is to highlight the fact that computers are going to control our lives."}, {"sense": "in several different places or directions but without any pattern", "level": "B2", "dict_examp": "Tall trees were growing here and there.", "lear_examp": "A lot of people rushed here and there."}]}]}, {"word": "hinder", "poses": [{"pos": "verb", "senses": [{"sense": "to make it difficult to do something or for something to develop", "level": "C2", "dict_examp": "His performance at the Olympics was hindered by a knee injury.", "lear_examp": "Nothing, however, could hinder him from gaining more power and money."}]}]}, {"word": "hers", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to show that something belongs to or is connected with a woman, girl, or female animal that has just been mentioned", "level": "A2", "dict_examp": "Jenny and I both have red hair, but hers is lighter than mine.", "lear_examp": "The CD is important to me because I have to give it back to my sister. It is hers."}]}]}, {"word": "hide", "poses": [{"pos": "verb", "senses": [{"sense": "to put something in a place where it cannot be seen or found", "level": "B1", "dict_examp": "She used to hide her diary under her pillow.", "lear_examp": "Lord Alloway hid the suitcase to protect it."}, {"sense": "to go to a place where you cannot be seen or found", "level": "B1", "dict_examp": "She ran off and hid behind a tree.", "lear_examp": "The plan is to bring him to my house, and everybody will hide in the living room. When he enters the room, we will shout 'Surprise'."}, {"sense": "to keep a feeling or information secret", "level": "B1", "dict_examp": "He couldn't hide his embarrassment.", "lear_examp": "I knew that you loved each other more than anything in this world, but I couldn't hide my surprise when you told me that you're getting married."}]}]}, {"word": "hesitate", "poses": [{"pos": "verb", "senses": [{"sense": "to pause before doing something, especially because you are nervous or not certain", "level": "B2", "dict_examp": "Richard hesitated before answering.", "lear_examp": "So, don't hesitate to buy that CD, it's a masterpiece and undoubtedly you'll love it."}, {"sense": "used to encourage someone to do something", "level": "B2", "dict_examp": "Please don't hesitate to get in touch if you need any more advice.", "lear_examp": "If you have more questions, do not hesitate to contact me."}]}]}, {"word": "hill", "poses": [{"pos": "noun", "senses": [{"sense": "a raised area of land, smaller than a mountain", "level": "A2", "dict_examp": "We walked up/down the hill to the village.", "lear_examp": "We can travel to Sierra de la Fentene, it is a nice village, and there are a lot of hills and streams."}]}]}, {"word": "hiking", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of going for a long walk for pleasure outdoors", "level": "A2", "dict_examp": "We're going hiking in the mountains this weekend.", "lear_examp": "We will drive to a place in the mountains and go hiking to another place there."}]}]}, {"word": "hi", "poses": [{"pos": "exclamation", "senses": [{"sense": "hello", "level": "A1", "dict_examp": "Hi, there!", "lear_examp": "Hi Ramesh."}]}]}, {"word": "hero", "poses": [{"pos": "noun", "senses": [{"sense": "someone who does something brave or good, which people respect or admire them for", "level": "B1", "dict_examp": "a war hero", "lear_examp": "I couldn't believe it and while I was wondering if this was a dream, Mike Skinner, my hero, appeared and instantly started chatting with me as if we had been friends for years."}, {"sense": "the main male character in a book or movie, who is usually good", "level": "B1", "dict_examp": "the hero of her latest novel", "lear_examp": "The film was very exciting because it was an action film and the hero was strong."}]}]}, {"word": "him", "poses": [{"pos": "pronoun", "senses": [{"sense": "used after a verb or preposition to refer to someone male who has already been talked about", "level": "A1", "dict_examp": "If you see Kevin, give him my love.", "lear_examp": "His name is Christopher but we all call him Hóby."}]}]}, {"word": "high school", "poses": [{"pos": "noun", "senses": [{"sense": "a school for students aged between about 14 and 18", "level": "A2", "dict_examp": "Rory will be starting high school in September.", "lear_examp": "Jan, Peter and our friends from high school came to my party."}]}]}, {"word": "hierarchy", "poses": [{"pos": "noun", "senses": [{"sense": "a system or organization in which people or things are arranged according to their importance", "level": "C2", "dict_examp": "There is a very strict hierarchy where I work.", "lear_examp": "It is well known that clothes used to reflect the position that each individual had in the social hierarchy of our societies."}]}]}, {"word": "hesitation", "poses": [{"pos": "noun", "senses": [{"sense": "when you are very willing to do something because you know it is the right thing to do", "level": "C1", "dict_examp": "He had no hesitation in signing with the team.", "lear_examp": "I think that Juan Pablo is a very well qualified applicant for this job, and I have no hesitation in supporting him wholeheartedly."}, {"sense": "when you pause before doing something, especially because you are nervous or not certain", "level": "C2", "dict_examp": "After a moment's hesitation, he unlocked the door.", "lear_examp": "Despite being a two-dimensional character, Mrs Kingshaw's existence aids in the flow of events as she forces Charles into committing suicide without the slightest hesitation."}]}]}, {"word": "herself", "poses": [{"pos": "pronoun", "senses": [{"sense": "the reflexive form of the pronoun \"she\"", "level": "A2", "dict_examp": "She kept telling herself that nothing was wrong.", "lear_examp": "She wanted to kill herself!"}, {"sense": "alone or without anyone else's help", "level": "A2", "dict_examp": "She lives by herself in an enormous house.", "lear_examp": "The food was delicious, especially the cake, which Sandra had cooked herself."}, {"sense": "used to emphasize the pronoun \"she\" or the particular female person you are referring to", "level": "B2", "dict_examp": "She herself admitted that it was wrong.", "lear_examp": "She herself, through her books, transfers to mature and elderly people too."}]}]}, {"word": "himself", "poses": [{"pos": "pronoun", "senses": [{"sense": "the reflexive form of the pronoun \"he\"", "level": "A2", "dict_examp": "He cut himself shaving.", "lear_examp": "He woke up and the suitcase wasn't there... that day he threw himself from the 10th floor of a building."}, {"sense": "alone or without anyone else's help", "level": "A2", "dict_examp": "He built the house all by himself.", "lear_examp": "And Ramundo gave me one special T-shirt, because he made that by himself!"}, {"sense": "used to emphasize the pronoun \"he\" or the particular male person you are referring to", "level": "B2", "dict_examp": "Do you want to talk to my brother himself, or can I help you?", "lear_examp": "But no one would like to be behind bars himself."}]}]}, {"word": "highlight", "poses": [{"pos": "verb", "senses": [{"sense": "to emphasize something or make people notice something", "level": "B2", "dict_examp": "to highlight a problem/danger", "lear_examp": "Electricity in general has been absorbed into our daily activities in such an intense way that we tend to take it for granted and it is exactly when it is not available that our dependency on it is highlighted."}, {"sense": "to make something a different color so that is is more easily noticed, especially written words", "level": "B2", "dict_examp": "The spelling mistakes in the text had been highlighted in yellow.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the best or most important part of something", "level": "B2", "dict_examp": "The boat trip was one of the highlights of our vacation.", "lear_examp": "The Festival is one of the highlights of the year for me and many others."}]}]}, {"word": "heroic", "poses": [{"pos": "adjective", "senses": [{"sense": "very brave", "level": "C1", "dict_examp": "a heroic figure", "lear_examp": "I would be thrilled if I could lead thousands of warriors into heroic battles to conquer the world."}, {"sense": "If someone makes a heroic effort to do something, they work very hard to try to do it.", "level": "C1", "dict_examp": "In spite of the team's heroic efforts, they lost the game.", "lear_examp": "Individually or in organized groups, those who worry about the subject are making a heroic attempt to convince others of the importance of recycling, caring about the wildlife and sparing the woods from fire or massive exploitation."}]}]}, {"word": "hilarious", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely funny", "level": "C1", "dict_examp": "They all thought the movie was hilarious.", "lear_examp": "In addition to this, the hosts and actors of the show have very few boundaries and are not afraid to make fools out of themselves, which means that they can do things that most people find very embarrassing, and this is something that contributes to making the show hilarious."}]}]}, {"word": "highly", "poses": [{"pos": "adverb", "senses": [{"sense": "at a high level", "level": "B2", "dict_examp": "a highly paid job", "lear_examp": "I am a 24-year-old highly educated Turkish boy."}, {"sense": "very or to a large degree", "level": "C1", "dict_examp": "a highly effective treatment", "lear_examp": "Now it features a highly effective searching system."}, {"sense": "to have or express a very good opinion of someone or something", "level": "C2", "dict_examp": "The course is very highly thought of.", "lear_examp": "This in itself would speak highly of the school and will attract many candidates and parents."}]}]}, {"word": "high", "poses": [{"pos": "adjective", "senses": [{"sense": "having a large distance from the bottom to the top", "level": "A2", "dict_examp": "a high building/mountain", "lear_examp": "And also you can see high mountains and beautiful lakes."}, {"sense": "a large distance above the ground or the level of the sea", "level": "B1", "dict_examp": "a high window", "lear_examp": "Looking out of the window, I can see the birds high up on the trees."}, {"sense": "great in amount, size or level", "level": "B1", "dict_examp": "a high temperature", "lear_examp": "Be careful while you are in Brazil because sometimes people charge really high prices for everything just because you are a tourist."}, {"sense": "very good", "level": "B1", "dict_examp": "high standards/quality", "lear_examp": "There were lots of CD players and everything was high quality."}, {"sense": "important, powerful, or at the top level of something", "level": "B2", "dict_examp": "a high rank", "lear_examp": "Living is definitely the highest priority all over the world."}, {"sense": "If a food is high in something, it contains a lot of it.", "level": "C1", "dict_examp": "Avoid foods that are high in salt.", "lear_examp": "Since there is no time even for cooking a healthy meal, they get used to ready meals that are high in fat and salt."}]}, {"pos": "adverb", "senses": [{"sense": "at or to a large distance above the ground", "level": "B1", "dict_examp": "We flew high above the city.", "lear_examp": "Being in the cabin high above Vienna both of them thought about killing the other."}, {"sense": "at or to a large amount or level", "level": "C1", "dict_examp": "Temperatures rose as high as 105 degrees in the summer.", "lear_examp": "Can we expect to see the world unemployment rate reach as high as fifty percent?"}]}]}, {"word": "heritage", "poses": [{"pos": "noun", "senses": [{"sense": "the buildings, paintings, customs, etc. which are important in a culture or society because they have existed for a long time", "level": "C2", "dict_examp": "our architectural/cultural/religious heritage", "lear_examp": "We have already created a list of possible destinations with rich cultural heritage."}]}]}, {"word": "highway", "poses": [{"pos": "noun", "senses": [{"sense": "a public road, especially a long, wide, important road that joins cities or towns together  or that is used by traffic traveling long distances", "level": "A2", "dict_examp": "a coastal/interstate highway", "lear_examp": "Yesterday I heard that our government is going to build a bypass road around our city and connect it with the highway."}]}]}, {"word": "hidden", "poses": [{"pos": "adjective", "senses": [{"sense": "A hidden thing or place is not easy to find.", "level": "B1", "dict_examp": "a hidden valley", "lear_examp": "But to her surprise the policeman laughed and said, \"You are the winner of our hidden camera contest\"."}, {"sense": "If something is hidden, most people do not know about it.", "level": "B2", "dict_examp": "hidden costs/taxes", "lear_examp": "I think this is a hidden danger of having a mobile phone and therefore the disadvantages are not as obvious as the advantage."}]}]}, {"word": "high-profile", "poses": [{"pos": "adjective", "senses": [{"sense": "A high-profile person or event is known about by a lot of people and receives a lot of attention from television, newspapers, etc.", "level": "C2", "dict_examp": "a high-profile campaign/case", "lear_examp": "This is the main significant reason why sportsmen and sportswomen are now considered as high-profile celebrities."}]}]}, {"word": "hey", "poses": [{"pos": "exclamation", "senses": [{"sense": "used as a way of attracting someone's attention, or as a greeting", "level": "A2", "dict_examp": "Hey! What are you doing with my car?", "lear_examp": "Jesse: Hey, how are you?"}]}]}, {"word": "hierarchical", "poses": [{"pos": "adjective", "senses": [{"sense": "using a system that arranges things according to their importance", "level": "C2", "dict_examp": "The company has a very hierarchical structure.", "lear_examp": "On the other hand, being too submissive will not help you in going up in a hierarchical structure."}]}]}, {"word": "hint", "poses": [{"pos": "noun", "senses": [{"sense": "when you say something that suggests what you think or want, but not in a direct way", "level": "B2", "dict_examp": "He's dropped  several hints to the boss that he'll quit if he doesn't get a promotion.", "lear_examp": "He didn't take a hint. When that day had come, I timidly approached him and gave him my final words of warning."}, {"sense": "a small piece of advice", "level": "B2", "dict_examp": "The magazine gives lots of useful hints on how to save money.", "lear_examp": "I would like to make use of this offer, therefore I am writing down some helpful hints about Lampton."}, {"sense": "a small amount of something", "level": "C2", "dict_examp": "There was a hint of anger in her voice.", "lear_examp": "The sky was leaden and overcast and there was a hint of drizzle in the air."}]}]}, {"word": "history", "poses": [{"pos": "noun", "senses": [{"sense": "the whole series of events in the past that relate to the development of a country, subject, or person", "level": "A2", "dict_examp": "The Civil War was a terrible time in American history.", "lear_examp": "I liked it very much because it was about Chinese history."}, {"sense": "the study of events in the past", "level": "A2", "dict_examp": "He's very interested in modern European history.", "lear_examp": "Dear Nicolas, I think I left my history book in your house."}, {"sense": "If you have a history of a particular problem or illness, you have already suffered from it.", "level": "C1", "dict_examp": "Our family has a history of diabetes.", "lear_examp": "The characteristic we are born with is to a certain level affected by genetic factors, e.g., if a mother has a history of depression her daughter or son will also have higher chance of getting depression."}]}]}, {"word": "historian", "poses": [{"pos": "noun", "senses": [{"sense": "someone who writes about or studies history", "level": "C1", "dict_examp": "His father was a famous historian.", "lear_examp": "I would be very willing to help historians solve the enigma about the origin of Thailand."}]}]}, {"word": "historical", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to events or people in the past, or to the study of history", "level": "B1", "dict_examp": "Many important historical documents were destroyed when the library was bombed.", "lear_examp": "Budapest is very beautiful with a lot of historical buildings and churches."}]}]}, {"word": "hip-hop", "poses": [{"pos": "noun", "senses": [{"sense": "a kind of music that originally developed among African Americans, where the words to songs are spoken and not sung", "level": "A2", "dict_examp": "The station plays mainly hip-hop and R&B music.", "lear_examp": "Nick, I like hip hop and rock very much and most of the students agree with me."}]}]}, {"word": "historically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is connected to history", "level": "C1", "dict_examp": "The film makes no attempt to be historically accurate.", "lear_examp": "Well, maybe this brief description of my travel in time is not historically accurate; nevertheless I hope that you have enjoyed yourself reading it as much as I did writing it, and I hope you will consider it worthy of publication in your magazine."}]}]}, {"word": "his", "poses": [{"pos": "determiner", "senses": [{"sense": "belonging to or relating to someone male who has already been talked about", "level": "A1", "dict_examp": "Alex is sitting over there with his daughter.", "lear_examp": "I like his cooking very much."}]}, {"pos": "pronoun", "senses": [{"sense": "the things that belong or relate to someone male who has already been talked about", "level": "A2", "dict_examp": "That's Frank's coat over there - at least I think it's his.", "lear_examp": "When he looked at the suitcase carefully, he realised it wasn't his."}]}]}, {"word": "hold", "poses": [{"pos": "verb", "senses": [{"sense": "to have something in your hand or arms", "level": "A2", "dict_examp": "He was holding a glass of wine.", "lear_examp": "I like to hold the cat tightly because her fur is so soft and lovely."}, {"sense": "to keep something in a particular position", "level": "B1", "dict_examp": "Can you hold the door open, please?", "lear_examp": "I looked at the letter again and now I understood why I didn't understand anything. I held it up side down, so I couldn't read it."}, {"sense": "to organize an event", "level": "B1", "dict_examp": "to hold talks/an election", "lear_examp": "Every evening the concerts are held in the open air, so you can have lots of fun."}, {"sense": "to contain or be able to contain something", "level": "B1", "dict_examp": "This pitcher holds up to  two quarts.", "lear_examp": "Big companies which hold a huge amount of information would not be able to work without a computer."}, {"sense": "to keep someone in a place so that they cannot leave", "level": "B2", "dict_examp": "The terrorists held him hostage for 18 months.", "lear_examp": "All around the world animals are held as prisoners in zoos."}, {"sense": "to keep air in your lungs and not let it out", "level": "B2", "dict_examp": "How long can you hold your breath under water?", "lear_examp": "My heart was beating fast. I was holding my breath."}, {"sense": "to have a particular position in a competition", "level": "B2", "dict_examp": "to hold the world record", "lear_examp": "Nowadays she is an excellent sportswoman, she holds the world record."}, {"sense": "to have a particular job, position, diploma, etc.", "level": "C1", "dict_examp": "He currently holds the position of managing editor.", "lear_examp": "In fact 90% males hold the skilled vocational diploma whereas only 10% females hold the same degree."}, {"sense": "to believe something", "level": "C1", "dict_examp": "He holds unpopular views on many subjects.", "lear_examp": "Nowadays, some people hold the opinion that children who do not have good living conditions are better prepared to deal with the problems which they will encounter later on."}, {"sense": "to have a conversation", "level": "C1", "dict_examp": "I can just about hold a conversation in Italian.", "lear_examp": "I know the grammar and many different expressions, and I can hold a conversation with other people."}, {"sense": "to keep someone interested in something", "level": "C1", "dict_examp": "The movie held my attention from beginning to end.", "lear_examp": "The plot is so intricately constructed that it will not only hold your attention right up to the last page, but also last in your memory for a very long time."}, {"sense": "to wait for something to happen, often feeling anxious", "level": "C2", "dict_examp": "While the leaders negotiated, the world held its breath.", "lear_examp": "They, the critics, the fans and friends and his wife, held their breath and crossed their fingers, hoping to once again hear his enchanting voice."}, {"sense": "to be as successful as other people or things", "level": "C2", "dict_examp": "Alison could always hold her own in political debates.", "lear_examp": ""}, {"sense": "If you say that an argument doesn't hold water, you mean that it can't be true.", "level": "C2", "dict_examp": "The jury convicted her because her story just didn’t hold water.", "lear_examp": "It remains to us to prove that the opinions of some scientists are far-fetched and don't hold water."}, {"sense": "to like or respect someone less because they have done something wrong or behaved badly", "level": "C2", "dict_examp": "It was his mistake but I won't hold it against him.", "lear_examp": "When my Dad was about sixteen, he had to get a job. ... My uncle on the other hand was allowed to study until he was 21. They have never held it against each other, as far as I know."}, {"sense": "to prevent someone or something from moving forward", "level": "C1", "dict_examp": "The police held back the protesters.", "lear_examp": "At last, the guards were able to temporarily hold them back."}, {"sense": "to prevent someone or something from making progress", "level": "C2", "dict_examp": "She felt staying in the same job would hold her back.", "lear_examp": "For years, nothing could hold her back, and she didn't realize how her huge amount of self-confidence prevented her from seeing life as it really was."}, {"sense": "to not tell everything you know about something", "level": "C1", "dict_examp": "I think she suspected I was holding something back.", "lear_examp": "To be honest, I am holding back a lot more things special about the cottage, because I want you to come and have a look."}, {"sense": "to stop yourself from showing an emotion", "level": "C2", "dict_examp": "She couldn't hold back the tears.", "lear_examp": "In the last scenes, I could not hold back my tears any longer and I just burst into tears."}, {"sense": "to keep a job", "level": "C2", "dict_examp": "It can be difficult for a mother to hold down a full-time job.", "lear_examp": "I don't know how long I'd manage to hold down a job that I didn't like, and that didn't bring me anything other than money."}, {"sense": "to wait before doing something", "level": "C2", "dict_examp": "We'll hold off making a decision until we hear from Nick.", "lear_examp": ""}, {"sense": "to wait for a short time", "level": "B1", "dict_examp": "Hold on - I have another call coming in.", "lear_examp": "I've a lot of good stories to tell you about so hold on."}, {"sense": "something you say when you are confused or surprised by something that you have just heard or read and want to understand it", "level": "C1", "dict_examp": "Hold on, if Sara's not coming, why are we asking for a table for six?", "lear_examp": ""}, {"sense": "to hold something firmly or to keep something", "level": "C2", "dict_examp": "Hold onto the rope and don't let go.", "lear_examp": "I take my poetry book with me all the time to hold onto something so important to me."}, {"sense": "to think that something is likely to succeed or have a good result", "level": "C2", "dict_examp": "Few people hold out any hope of finding more survivors of the earthquake.", "lear_examp": "To be honest, I don't hold out much hope that this problem will ever be solved, because homelessness doesn't affect MPs personally."}, {"sense": "to make something or someone slow or late", "level": "B1", "dict_examp": "We got held up by the traffic.", "lear_examp": "Then I was held up in a traffic jam."}]}, {"pos": "noun", "senses": [{"sense": "when you hold something or someone, or the way you do this", "level": "B2", "dict_examp": "Keep a tight hold on your tickets.", "lear_examp": "When I got up on my feet again, I reached out my arm to get a hold on something, but there wasn't anything to hold on to."}, {"sense": "to start holding something or someone", "level": "B2", "dict_examp": "He took hold of one end of the rug and tugged.", "lear_examp": "\"I'm scared!\" said Nora trembling, as she took hold of my arm."}, {"sense": "to obtain something, or to manage to speak to someone", "level": "B2", "dict_examp": "I got hold of a copy at the library.", "lear_examp": "I had also forgotten to remind my friends and teachers to bring their own knife and fork to our lunch, but fortunately one of my friends managed to get hold of some spare knives and forks."}, {"sense": "If a plan or activity is on hold, it will not be done until a later time.", "level": "C1", "dict_examp": "The project is on hold until we raise more money.", "lear_examp": "What's more, it might, intentionally or not, raise awareness on issues that might have been put on hold by authorities, such as the legalization of soft drugs."}, {"sense": "waiting to speak to someone on the telephone", "level": "C1", "dict_examp": "His secretary put me on hold.", "lear_examp": "The day after, I called your office and after being put on hold, the person answering the phone was unwilling to come up with a proper reply."}, {"sense": "power or control over something or someone", "level": "C2", "dict_examp": "Their company has a strong hold on the computer market.", "lear_examp": "They send the money directly to his father and now have a hold on Chen."}]}]}, {"word": "hit", "poses": [{"pos": "verb", "senses": [{"sense": "to touch someone or something quickly and with force using your hand or an object in your hand", "level": "A2", "dict_examp": "She hit him on the head with her tennis racket.", "lear_examp": "When I went in, somebody hit me with a pan!"}, {"sense": "to touch someone or something quickly and with force, usually causing injury or damage", "level": "B1", "dict_examp": "The car went out of control and hit a wall.", "lear_examp": "He hit a boy on the main road but fortunately the boy was okay."}, {"sense": "to affect something badly", "level": "B2", "dict_examp": "The economy has been hit by high unemployment.", "lear_examp": "Penalties for parking in the wrong place can really hit you in the pocket."}, {"sense": "to reach a place, position, or state", "level": "C1", "dict_examp": "Our profits have already hit $1 million.", "lear_examp": "Having already hit the 50% boundary in 1991, we still see that the teachers' salaries experienced a significant rise."}, {"sense": "If an idea or thought hits you, you suddenly think of it.", "level": "C2", "dict_examp": "The idea for the book hit me in the middle of the night.", "lear_examp": "I climbed out of the shower, staggered into my room and then it hit me! \"My diary! For crying out loud, that's it!\""}, {"sense": "If people hit it off, they like each other and become friendly immediately.", "level": "B2", "dict_examp": "Carla and Nina didn't really hit it off.", "lear_examp": "They hit it off immediately."}]}, {"pos": "noun", "senses": [{"sense": "a thing or person that is very popular or successful", "level": "B1", "dict_examp": "The Beatles had a string of number-one hits in the 1960s.", "lear_examp": "The group RADIANT played their big hits from the 1980s for an hour."}, {"sense": "a request to see a document on the Internet that is then counted to calculate the number of people looking at the page", "level": "B2", "dict_examp": "There have been over 10,000 hits on the site since Wednesday.", "lear_examp": ""}]}]}, {"word": "hitchhike", "poses": [{"pos": "verb", "senses": [{"sense": "to get free rides in someone's vehicle, by standing next to the road and waiting for someone to pick you up", "level": "B1", "dict_examp": "We hitchhiked from Chicago to New Orleans.", "lear_examp": "We hitchhiked to the nearest city."}]}]}, {"word": "hockey", "poses": [{"pos": "noun", "senses": [{"sense": "a game played on ice in which two teams try to hit a small hard object into a goal using long curved sticks", "level": "A2", "dict_examp": "We skate or play hockey with the kids' friends.", "lear_examp": "I just watched the hockey game with Newsha."}]}]}, {"word": "historic", "poses": [{"pos": "adjective", "senses": [{"sense": "important or likely to be important in history", "level": "B1", "dict_examp": "historic buildings", "lear_examp": "I know you and I understand that you are coming to my country to visit ancient castles and historic buildings, so I recommend you to visit Rome: a fantastic city!"}]}]}, {"word": "hire", "poses": [{"pos": "verb", "senses": [{"sense": "to begin to to employ someone", "level": "B2", "dict_examp": "I was hired by the first company I applied to.", "lear_examp": "The interview was OK and my friend and I were hired!"}]}]}, {"word": "hi-tech", "poses": [{"pos": "adjective", "senses": [{"sense": "using or involved with the most recent and advanced electronic machines, computers, etc.", "level": "B2", "dict_examp": "This database system is an affordable, hi-tech solution.", "lear_examp": "With the development of science and technology, many new inventions have entered our life, especially some hi-tech products."}]}]}, {"word": "hip", "poses": [{"pos": "noun", "senses": [{"sense": "one of the two parts of your body above your leg and below your waist", "level": "B2", "dict_examp": "She stood waiting with her hands on her hips.", "lear_examp": "She had a fractured ankle, a dislocated collar-bone and something was also wrong with her hips."}]}]}, {"word": "hobby", "poses": [{"pos": "noun", "senses": [{"sense": "an activity that you enjoy and do regularly when you are not working", "level": "A2", "dict_examp": "Ben's hobby is restoring old motorcycles.", "lear_examp": "My hobby is playing the guitar."}]}]}, {"word": "hint", "poses": [{"pos": "noun", "senses": [{"sense": "when you say something that suggests what you think or want, but not in a direct way", "level": "B2", "dict_examp": "He's dropped  several hints to the boss that he'll quit if he doesn't get a promotion.", "lear_examp": "He didn't take a hint. When that day had come, I timidly approached him and gave him my final words of warning."}, {"sense": "a small piece of advice", "level": "B2", "dict_examp": "The magazine gives lots of useful hints on how to save money.", "lear_examp": "I would like to make use of this offer, therefore I am writing down some helpful hints about Lampton."}, {"sense": "a small amount of something", "level": "C2", "dict_examp": "There was a hint of anger in her voice.", "lear_examp": "The sky was leaden and overcast and there was a hint of drizzle in the air."}]}]}, {"word": "holiday", "poses": [{"pos": "noun", "senses": [{"sense": "a day for celebration when many people are allowed to stay away from work or school", "level": "A1", "dict_examp": "a national holiday", "lear_examp": "It is a holiday for us."}]}]}, {"word": "honor", "poses": [{"pos": "noun", "senses": [{"sense": "when people respect you because you have what you believe is honest and right, or the quality of doing this", "level": "B2", "dict_examp": "a man of honor", "lear_examp": "Furthermore, whenever they do everything, they have to consider whether it will affect the honor of their family or parent or not."}, {"sense": "in order to celebrate or show respect for someone or something", "level": "B2", "dict_examp": "a banquet in honor of the president", "lear_examp": "Finally we went to Corinth, where there are a lot of ancient sanctuaries which were built in honor of their gods."}, {"sense": "something that makes you feel proud and pleased", "level": "B2", "dict_examp": "It's an honor to be the team captain.", "lear_examp": "It's an honor for me, to play for my country."}]}]}, {"word": "homeless", "poses": [{"pos": "adjective", "senses": [{"sense": "without a place to live", "level": "C1", "dict_examp": "10,000 people were made homeless by the floods.", "lear_examp": "As a result, there are a lot of homeless people in our local community."}]}, {"pos": "noun", "senses": [{"sense": "people who are homeless", "level": "C1", "dict_examp": "They're opening a new shelter for the homeless.", "lear_examp": "The money spent on the royal family could be used for something else like building houses for the homeless."}]}]}, {"word": "holy", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to a religion or a god", "level": "C1", "dict_examp": "the holy city of Jerusalem", "lear_examp": "I'd like to go inside and see for myself but only the holy priests are allowed to be in there and only on special occasions."}]}]}, {"word": "hop", "poses": [{"pos": "verb", "senses": [{"sense": "to go somewhere quickly or get into or out of a vehicle quickly", "level": "C1", "dict_examp": "to hop on a plane/train", "lear_examp": "The next thing that happens is that everyone hops in their cars and drives to the restaurant where they have dinner."}, {"sense": "to jump on one foot or to move about in this way", "level": "C2", "dict_examp": "He hopped across the room.", "lear_examp": "He was not to be able to stand still and seemed to be hopping and leaping with his violin while playing."}, {"sense": "If a small animal, bird, or insect hops, it moves by jumping on all of its feet at the same time.", "level": "C2", "dict_examp": "Rabbits were hopping across the field.", "lear_examp": "I advise a quite different restaurant, in a more peaceful area; it is a pavilion facing Monstsouris garden, where you can see birds hopping and flying through the trees, and swans on the lake."}]}]}, {"word": "honestly", "poses": [{"pos": "adverb", "senses": [{"sense": "used to emphasize that you are telling the truth", "level": "B1", "dict_examp": "Thanks, but I honestly couldn't eat another piece of cake.", "lear_examp": "Honestly, I did not know what to do, I wanted to cry."}, {"sense": "in an honest way", "level": "B2", "dict_examp": "They have always dealt honestly and fairly with their customers.", "lear_examp": "If we want to answer this question honestly and sincerely, we should think about the  advantages and disadvantages that keeping animals in zoos results in."}]}]}, {"word": "honey", "poses": [{"pos": "noun", "senses": [{"sense": "a sweet, sticky food that is made by bees", "level": "A2", "dict_examp": "Tea with honey and lemon is good for a sore throat.", "lear_examp": "For breakfast they eat bread with butter, jam or honey."}]}]}, {"word": "homework", "poses": [{"pos": "noun", "senses": [{"sense": "work that teachers give students to do at home", "level": "A1", "dict_examp": "Have you done your homework yet?", "lear_examp": "I like doing my homework."}]}]}, {"word": "honored", "poses": [{"pos": "adjective", "senses": [{"sense": "proud and pleased because you have been given respect or asked to do something special", "level": "C1", "dict_examp": "I am honored to accept your invitation.", "lear_examp": "I would feel greatly honored if I can render any help for this meaningful project, please don't hesitate to ask my assistance."}]}]}, {"word": "homelessness", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being homeless", "level": "C2", "dict_examp": "The government is trying to tackle homelessness.", "lear_examp": "Unemployment is a major problem today and it leads more and more people onto the path of poverty and homelessness."}]}]}, {"word": "hood", "poses": [{"pos": "noun", "senses": [{"sense": "part of a piece of clothing that can be pulled up to cover the top and back of the head", "level": "B2", "dict_examp": "The coat has a hood.", "lear_examp": "He was wearing a black hood."}]}]}, {"word": "hopeful", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling positive about a future event or situation", "level": "B1", "dict_examp": "He was hopeful about the outcome of the meeting.", "lear_examp": "I know that it is quite impossible to find it in a big town like mine, but I am still hopeful."}, {"sense": "If something is hopeful, it gives you reason to believe that what you want to happen will happen.", "level": "C2", "dict_examp": "There are hopeful signs that she will make a full recovery.", "lear_examp": "The hopeful atmosphere darkened somewhat."}]}]}, {"word": "honeymoon", "poses": [{"pos": "noun", "senses": [{"sense": "a vacation taken by two people who have just gotten married", "level": "B1", "dict_examp": "We went to the Bahamas on our honeymoon.", "lear_examp": "Where did you spend your honeymoon?"}]}]}, {"word": "hook", "poses": [{"pos": "noun", "senses": [{"sense": "a curved piece of metal or plastic used for hanging something on, or a similar object used for catching fish", "level": "B2", "dict_examp": "a coat/picture hook", "lear_examp": "A few moments later she took out a rope, which had a hook on one end."}]}, {"pos": "verb", "senses": [{"sense": "to like or start to like doing something very much and want to do it all the time", "level": "B2", "dict_examp": "He's completely hooked on computer games.", "lear_examp": "It is such a great change to listen to well-known singers for those who are hooked on rock music."}]}]}, {"word": "hope", "poses": [{"pos": "verb", "senses": [{"sense": "to want something to happen or be true", "level": "A2", "dict_examp": "I hope (that) the bus won't be late.", "lear_examp": "I hope you can come next time."}, {"sense": "to intend to do something", "level": "B1", "dict_examp": "Dad hopes to retire next year.", "lear_examp": "With this new class I hope to make progress."}]}, {"pos": "noun", "senses": [{"sense": "a positive feeling about the future, or something that you want to happen or be true", "level": "B1", "dict_examp": "a message full of hope", "lear_examp": "Ten minutes later I started to tell them how brave they were and how we fought when there was no hope."}, {"sense": "because you want something good to happen", "level": "C1", "dict_examp": "She went to Paris in the hope of improving her French.", "lear_examp": "Dear Dave Bennington, I am writing to you in the hope that you will attend our next event in July."}, {"sense": "the best/last/only person or thing that can help you and make you succeed", "level": "C2", "dict_examp": "Doctors say his only hope is a transplant.", "lear_examp": "My spirits sank at the same time as the water, our last hope of survival, did."}, {"sense": "to think that something is likely to succeed or have a good result", "level": "C2", "dict_examp": "Few people hold out any hope of finding more survivors.", "lear_examp": "To be honest, I don't hold out much hope that this problem will ever be solved, because homelessness doesn't affect MPs personally."}]}]}, {"word": "honest", "poses": [{"pos": "adjective", "senses": [{"sense": "sincere and telling the truth", "level": "B1", "dict_examp": "If you want my honest answer/opinion, I think your hair looks awful.", "lear_examp": "I tell everything to my mother in order to be honest."}, {"sense": "not likely to lie, cheat, or steal", "level": "B1", "dict_examp": "an honest man", "lear_examp": "I know it is an illusion, but I want to think that in the world there are some honest people."}, {"sense": "used to express your real opinion", "level": "B1", "dict_examp": "To be honest, I didn't really enjoy the party.", "lear_examp": "To be honest, I do hate shopping for clothes."}]}]}, {"word": "honesty", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being honest", "level": "B2", "dict_examp": "I appreciate your honesty.", "lear_examp": "He's an extraordinary person and the TV viewers will love him because of his good sense of humor and his honesty."}]}]}, {"word": "home", "poses": [{"pos": "noun", "senses": [{"sense": "the place where you live or feel you belong", "level": "A1", "dict_examp": "I tried to call him, but he wasn't at home.", "lear_examp": "That's why I love my home."}, {"sense": "to feel happy and confident in a place or situation", "level": "B1", "dict_examp": "After a month she felt at home in her new job.", "lear_examp": "I explained: \"I was in Manchester for just 10 months and during that time the people from there made me feel at home so I feel proud to have the accent.\""}, {"sense": "the place where you usually find something or someone, or where they come from", "level": "C1", "dict_examp": "France, the home of good food", "lear_examp": "Every golfer - and those watching golf - know, that the home of golf is St. Andrews in Scotland."}, {"sense": "to behave in a relaxed way in a place, as if it was your own home", "level": "C1", "dict_examp": "Take off your coat and make yourself at home.", "lear_examp": "Please relax and make yourself at home and help yourself."}, {"sense": "a place where a group of people who need special care live", "level": "C1", "dict_examp": "a nursing home", "lear_examp": "I've had a part time job as a nursing assistant at a home for elderly people, I've worked in a souvenir shop in Norway, and I've been away as an au pair in England."}, {"sense": "a family in which the parents do not now live together", "level": "C2", "dict_examp": "Many of these children come from broken homes.", "lear_examp": "The development of the modern society has brought with it a growing number of broken homes, divorces and economic problems which have directly affected the parent-child relationship."}]}, {"pos": "adverb", "senses": [{"sense": "to the place where you live", "level": "A2", "dict_examp": "He didn't come home until midnight.", "lear_examp": "I must go home at midnight because I have to travel tomorrow."}, {"sense": "at or in the place someone lives", "level": "B1", "dict_examp": "Will you be home tomorrow evening?", "lear_examp": "I'll not be home this afternoon."}]}]}, {"word": "hollow", "poses": [{"pos": "adjective", "senses": [{"sense": "having a hole or empty space inside", "level": "C2", "dict_examp": "a hollow shell/tube", "lear_examp": "He had taken the dark red leather-bound book to his hideout in the forest, an old oak tree with a hollow trunk, where he used to play alone."}, {"sense": "without meaning or real feeling", "level": "C2", "dict_examp": "a hollow victory", "lear_examp": "These celebrities tend to encourage a lifestyle that, at first, may be extremely appealing, specially to children and teenagers, but it is nothing more than pure hollow hedonism."}, {"sense": "If something someone says rings hollow, it does not sound true or sincere.", "level": "C2", "dict_examp": "He said he was pleased, but his words rang hollow.", "lear_examp": "Everything rang hollow to her, so she decided to follow him in order to understand what had happened and her fiancé became so friendly and understanding."}]}]}, {"word": "hole", "poses": [{"pos": "noun", "senses": [{"sense": "a hollow space in something, or an opening in a surface", "level": "B1", "dict_examp": "a bullet hole", "lear_examp": "I like wearing jeans with holes in them, they look cool."}]}]}, {"word": "hold", "poses": [{"pos": "verb", "senses": [{"sense": "to have something in your hand or arms", "level": "A2", "dict_examp": "He was holding a glass of wine.", "lear_examp": "I like to hold the cat tightly because her fur is so soft and lovely."}, {"sense": "to keep something in a particular position", "level": "B1", "dict_examp": "Can you hold the door open, please?", "lear_examp": "I looked at the letter again and now I understood why I didn't understand anything. I held it up side down, so I couldn't read it."}, {"sense": "to organize an event", "level": "B1", "dict_examp": "to hold talks/an election", "lear_examp": "Every evening the concerts are held in the open air, so you can have lots of fun."}, {"sense": "to contain or be able to contain something", "level": "B1", "dict_examp": "This pitcher holds up to  two quarts.", "lear_examp": "Big companies which hold a huge amount of information would not be able to work without a computer."}, {"sense": "to keep someone in a place so that they cannot leave", "level": "B2", "dict_examp": "The terrorists held him hostage for 18 months.", "lear_examp": "All around the world animals are held as prisoners in zoos."}, {"sense": "to keep air in your lungs and not let it out", "level": "B2", "dict_examp": "How long can you hold your breath under water?", "lear_examp": "My heart was beating fast. I was holding my breath."}, {"sense": "to have a particular position in a competition", "level": "B2", "dict_examp": "to hold the world record", "lear_examp": "Nowadays she is an excellent sportswoman, she holds the world record."}, {"sense": "to have a particular job, position, diploma, etc.", "level": "C1", "dict_examp": "He currently holds the position of managing editor.", "lear_examp": "In fact 90% males hold the skilled vocational diploma whereas only 10% females hold the same degree."}, {"sense": "to believe something", "level": "C1", "dict_examp": "He holds unpopular views on many subjects.", "lear_examp": "Nowadays, some people hold the opinion that children who do not have good living conditions are better prepared to deal with the problems which they will encounter later on."}, {"sense": "to have a conversation", "level": "C1", "dict_examp": "I can just about hold a conversation in Italian.", "lear_examp": "I know the grammar and many different expressions, and I can hold a conversation with other people."}, {"sense": "to keep someone interested in something", "level": "C1", "dict_examp": "The movie held my attention from beginning to end.", "lear_examp": "The plot is so intricately constructed that it will not only hold your attention right up to the last page, but also last in your memory for a very long time."}, {"sense": "to wait for something to happen, often feeling anxious", "level": "C2", "dict_examp": "While the leaders negotiated, the world held its breath.", "lear_examp": "They, the critics, the fans and friends and his wife, held their breath and crossed their fingers, hoping to once again hear his enchanting voice."}, {"sense": "to be as successful as other people or things", "level": "C2", "dict_examp": "Alison could always hold her own in political debates.", "lear_examp": ""}, {"sense": "If you say that an argument doesn't hold water, you mean that it can't be true.", "level": "C2", "dict_examp": "The jury convicted her because her story just didn’t hold water.", "lear_examp": "It remains to us to prove that the opinions of some scientists are far-fetched and don't hold water."}, {"sense": "to like or respect someone less because they have done something wrong or behaved badly", "level": "C2", "dict_examp": "It was his mistake but I won't hold it against him.", "lear_examp": "When my Dad was about sixteen, he had to get a job. ... My uncle on the other hand was allowed to study until he was 21. They have never held it against each other, as far as I know."}, {"sense": "to prevent someone or something from moving forward", "level": "C1", "dict_examp": "The police held back the protesters.", "lear_examp": "At last, the guards were able to temporarily hold them back."}, {"sense": "to prevent someone or something from making progress", "level": "C2", "dict_examp": "She felt staying in the same job would hold her back.", "lear_examp": "For years, nothing could hold her back, and she didn't realize how her huge amount of self-confidence prevented her from seeing life as it really was."}, {"sense": "to not tell everything you know about something", "level": "C1", "dict_examp": "I think she suspected I was holding something back.", "lear_examp": "To be honest, I am holding back a lot more things special about the cottage, because I want you to come and have a look."}, {"sense": "to stop yourself from showing an emotion", "level": "C2", "dict_examp": "She couldn't hold back the tears.", "lear_examp": "In the last scenes, I could not hold back my tears any longer and I just burst into tears."}, {"sense": "to keep a job", "level": "C2", "dict_examp": "It can be difficult for a mother to hold down a full-time job.", "lear_examp": "I don't know how long I'd manage to hold down a job that I didn't like, and that didn't bring me anything other than money."}, {"sense": "to wait before doing something", "level": "C2", "dict_examp": "We'll hold off making a decision until we hear from Nick.", "lear_examp": ""}, {"sense": "to wait for a short time", "level": "B1", "dict_examp": "Hold on - I have another call coming in.", "lear_examp": "I've a lot of good stories to tell you about so hold on."}, {"sense": "something you say when you are confused or surprised by something that you have just heard or read and want to understand it", "level": "C1", "dict_examp": "Hold on, if Sara's not coming, why are we asking for a table for six?", "lear_examp": ""}, {"sense": "to hold something firmly or to keep something", "level": "C2", "dict_examp": "Hold onto the rope and don't let go.", "lear_examp": "I take my poetry book with me all the time to hold onto something so important to me."}, {"sense": "to think that something is likely to succeed or have a good result", "level": "C2", "dict_examp": "Few people hold out any hope of finding more survivors of the earthquake.", "lear_examp": "To be honest, I don't hold out much hope that this problem will ever be solved, because homelessness doesn't affect MPs personally."}, {"sense": "to make something or someone slow or late", "level": "B1", "dict_examp": "We got held up by the traffic.", "lear_examp": "Then I was held up in a traffic jam."}]}, {"pos": "noun", "senses": [{"sense": "when you hold something or someone, or the way you do this", "level": "B2", "dict_examp": "Keep a tight hold on your tickets.", "lear_examp": "When I got up on my feet again, I reached out my arm to get a hold on something, but there wasn't anything to hold on to."}, {"sense": "to start holding something or someone", "level": "B2", "dict_examp": "He took hold of one end of the rug and tugged.", "lear_examp": "\"I'm scared!\" said Nora trembling, as she took hold of my arm."}, {"sense": "to obtain something, or to manage to speak to someone", "level": "B2", "dict_examp": "I got hold of a copy at the library.", "lear_examp": "I had also forgotten to remind my friends and teachers to bring their own knife and fork to our lunch, but fortunately one of my friends managed to get hold of some spare knives and forks."}, {"sense": "If a plan or activity is on hold, it will not be done until a later time.", "level": "C1", "dict_examp": "The project is on hold until we raise more money.", "lear_examp": "What's more, it might, intentionally or not, raise awareness on issues that might have been put on hold by authorities, such as the legalization of soft drugs."}, {"sense": "waiting to speak to someone on the telephone", "level": "C1", "dict_examp": "His secretary put me on hold.", "lear_examp": "The day after, I called your office and after being put on hold, the person answering the phone was unwilling to come up with a proper reply."}, {"sense": "power or control over something or someone", "level": "C2", "dict_examp": "Their company has a strong hold on the computer market.", "lear_examp": "They send the money directly to his father and now have a hold on Chen."}]}]}, {"word": "hostility", "poses": [{"pos": "noun", "senses": [{"sense": "unfriendly, angry behavior that shows that you dislike someone", "level": "C2", "dict_examp": "He tried to hide his hostility toward outsiders.", "lear_examp": "As Edmund's cruelty and hostility toward Charles intensified, and Charles' attempts to escape failed, his unhappiness increased, which led to his ultimate self-destruction."}]}]}, {"word": "horrified", "poses": [{"pos": "adjective", "senses": [{"sense": "very shocked", "level": "C2", "dict_examp": "When I told him all the money was gone, he was absolutely horrified.", "lear_examp": "When we arrived at the Riverside Lodge I was horrified to find out that there were no ramps in the building."}]}]}, {"word": "hostile", "poses": [{"pos": "adjective", "senses": [{"sense": "unfriendly and not liking or agreeing with something", "level": "C1", "dict_examp": "Some politicians were very hostile to the idea.", "lear_examp": "She is not hostile or aggressive."}, {"sense": "unpleasant or not suitable for living or growing", "level": "C1", "dict_examp": "a hostile climate", "lear_examp": "However, they do not realize that they have to survive in a hostile environment, living in unsafe and unhealthy slums."}]}]}, {"word": "hotel", "poses": [{"pos": "noun", "senses": [{"sense": "a place where you pay to stay when you are away from home", "level": "A1", "dict_examp": "a 4-star hotel", "lear_examp": "Cracow offers a lot of very nice hotels, restaurants and pubs."}]}]}, {"word": "horizontal", "poses": [{"pos": "adjective", "senses": [{"sense": "level and flat, or parallel to the ground or to the bottom of a page", "level": "C1", "dict_examp": "a horizontal line/stripe", "lear_examp": "Years are projected along the horizontal axis."}]}]}, {"word": "horrifying", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely shocking", "level": "C2", "dict_examp": "She sustained horrifying injuries in the attack.", "lear_examp": "Evading his unknown captors he is faced with a horrifying proposition."}]}]}, {"word": "horrible", "poses": [{"pos": "adjective", "senses": [{"sense": "very unpleasant or bad", "level": "A2", "dict_examp": "He has a horrible cold.", "lear_examp": "I got a really nice T-shirt from Janeth, and a horrible pair of socks from Simon."}]}]}, {"word": "host", "poses": [{"pos": "noun", "senses": [{"sense": "someone who invites people to a meal or a party, or to stay in their home", "level": "B2", "dict_examp": "We thanked our hosts for the lovely evening.", "lear_examp": "My experience of living with a host family was very good, so I suggest we should look for a nice place for both of us."}, {"sense": "a large number of people or things", "level": "C1", "dict_examp": "They serve lunches and perform a host of other duties.", "lear_examp": "In this day and age, we can buy Nike clothes, Head & Shoulders shampoos and a host of other products in the UK as well as other places in the world."}, {"sense": "someone who introduces the guests on a radio or television program", "level": "C2", "dict_examp": "a talk show host", "lear_examp": "For a lot of youngsters some television hosts are regarded as role models because they are famous and do not seem to have problems with anything at all."}]}, {"pos": "verb", "senses": [{"sense": "If a place hosts an event, people there arrange it and it happens there.", "level": "C1", "dict_examp": "The town hosts an annual jazz festival.", "lear_examp": "The city's largest hotels have conference rooms, able to host a large number of people."}]}]}, {"word": "hopefully", "poses": [{"pos": "adverb", "senses": [{"sense": "used, often at the start of a sentence, to express what you would like to happen", "level": "B1", "dict_examp": "Hopefully it won't rain.", "lear_examp": "Hopefully he likes me, too."}, {"sense": "in a hopeful way", "level": "B2", "dict_examp": "\"Are there any tickets left?\" she asked hopefully.", "lear_examp": "I'll be waiting hopefully for your letter."}]}]}, {"word": "hour", "poses": [{"pos": "noun", "senses": [{"sense": "a period of 60 minutes", "level": "A1", "dict_examp": "The exam lasted an hour and a half.", "lear_examp": "I study English for four hours per week."}, {"sense": "a long time", "level": "B1", "dict_examp": "I spent hours doing my homework.", "lear_examp": "We spent hours talking, but at ten o'clock he took me home."}, {"sense": "very late at night, until early morning, or almost all the time", "level": "C1", "dict_examp": "Our neighbors play loud music at all hours of the day and night.", "lear_examp": "This causes traffic jams at all hours of the day."}, {"sense": "the hours between midnight and the time in the morning when people usually begin their day", "level": "C2", "dict_examp": "She worked into the wee hours of the morning.", "lear_examp": ""}]}]}, {"word": "horn", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment used to make a loud sound as a warning or signal", "level": "B2", "dict_examp": "a car/fog horn", "lear_examp": "How happy I was, hearing the sound of a car horn."}, {"sense": "one of the two hard, pointed growths on the heads of cows, goats, and some other animals", "level": "C1", "dict_examp": "These cows have curved horns.", "lear_examp": "Far in the south of Chile, you will find the smallest deer of the world called \"Pudù\". It is only 25 cm. tall, doesn't have big horns and eats fruit."}, {"sense": "a curved musical instrument that you blow into to make a sound", "level": "C2", "dict_examp": "He blew his horn.", "lear_examp": "At last, when the first notes came out of the orchestra, a spotlight showed the enormous figure of Ludwig van Mill strolling in the forest, blowing his horn and grinning at the trees."}]}]}, {"word": "hopeful", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling positive about a future event or situation", "level": "B1", "dict_examp": "He was hopeful about the outcome of the meeting.", "lear_examp": "I know that it is quite impossible to find it in a big town like mine, but I am still hopeful."}, {"sense": "If something is hopeful, it gives you reason to believe that what you want to happen will happen.", "level": "C2", "dict_examp": "There are hopeful signs that she will make a full recovery.", "lear_examp": "The hopeful atmosphere darkened somewhat."}]}]}, {"word": "hospitable", "poses": [{"pos": "adjective", "senses": [{"sense": "A hospitable person or place is friendly, pleasant, and welcomes visitors.", "level": "C1", "dict_examp": "We always find them very hospitable.", "lear_examp": "First of all, the families you will be staying with are exceptionally hospitable, always willing to show you around in the local area."}]}]}, {"word": "hostage", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is kept as a prisoner and may be hurt or killed in order to force other people to do something", "level": "C2", "dict_examp": "Three hostages died in the attack.", "lear_examp": "The most extraordinary bond, however, develops between two of the hostages, namely Mr. Hosokawa himself and the American opera singer Roxanne Coss."}, {"sense": "to catch or keep someone as a prisoner", "level": "C2", "dict_examp": "Two tourists were held hostage by terrorists.", "lear_examp": "At the party, however, things take an unexpected turn when all the visitors are taken hostage by a group of terrorists."}]}]}, {"word": "hourly", "poses": [{"pos": "adjective", "senses": [{"sense": "done or happening every hour", "level": "B2", "dict_examp": "There's an hourly bus service into town.", "lear_examp": ""}, {"sense": "for each hour", "level": "B2", "dict_examp": "an hourly rate", "lear_examp": "I'll also call the shop and ask about the hourly rate and the working hours."}]}, {"pos": "adverb", "senses": [{"sense": "once every hour", "level": "C1", "dict_examp": "The train runs hourly on weekends.", "lear_examp": "This train runs hourly and takes about 90 minutes to Kassel which is the second stop."}]}]}, {"word": "hostel", "poses": [{"pos": "noun", "senses": [{"sense": "a place like a cheap hotel, where you can live when you are away from home", "level": "B1", "dict_examp": "a youth hostel", "lear_examp": "We'll stay in a hostel because it's cheap."}]}]}, {"word": "household", "poses": [{"pos": "noun", "senses": [{"sense": "a family or group of people who live together in a house", "level": "B2", "dict_examp": "By the 1960s, most households had a TV.", "lear_examp": "In Japan, for example, the vast majority of households have at least one car nowadays."}]}]}, {"word": "hospital", "poses": [{"pos": "noun", "senses": [{"sense": "a place where ill or injured people go to be treated by doctors and nurses", "level": "A1", "dict_examp": "I have  to go to the hospital to have an operation.", "lear_examp": "She works in a hospital."}]}]}, {"word": "hot", "poses": [{"pos": "adjective", "senses": [{"sense": "having a high temperature", "level": "A1", "dict_examp": "a hot, sunny day", "lear_examp": "I like this place because in the summer it is very hot."}, {"sense": "Hot food contains strong spices that cause a burning feeling in your mouth.", "level": "B1", "dict_examp": "hot chili peppers", "lear_examp": "I really like the hot and spicy chicken with zucchini."}, {"sense": "a subject which people discuss and have strong feelings about", "level": "C1", "dict_examp": "Health care  is still a hot topic.", "lear_examp": "Whether to compete or to cooperate has become a hot issue in today's society, both in public and private."}, {"sense": "exciting or interesting", "level": "C1", "dict_examp": "Hollywood's hottest new actress", "lear_examp": "That would mean that Bill Gates is the hottest celebrity on earth, but he is not."}]}]}, {"word": "horse", "poses": [{"pos": "noun", "senses": [{"sense": "a large animal with four legs, which people ride on or use for carrying things or pulling vehicles", "level": "A1", "dict_examp": "to ride a horse", "lear_examp": "I also like to be with horses."}]}]}, {"word": "horror", "poses": [{"pos": "noun", "senses": [{"sense": "a film or story that entertains people by shocking or frightening them", "level": "B1", "dict_examp": "I love reading horror stories.", "lear_examp": "I'll buy a DVD called \"Scream\", it's a horror movie - you know I love scary movies."}, {"sense": "a strong feeling of shock or fear", "level": "B2", "dict_examp": "She watched in horror as the car skidded across the road.", "lear_examp": "I approached the door but to my horror, it was locked."}]}]}, {"word": "horizon", "poses": [{"pos": "noun", "senses": [{"sense": "to increase the number of things that you know about, have experienced, or can do", "level": "C1", "dict_examp": "Traveling certainly broadens your horizons.", "lear_examp": "Overall, I can say the conference was a success and definitely broadened my horizons."}, {"sense": "likely to happen soon", "level": "C1", "dict_examp": "Economic recovery is on the horizon.", "lear_examp": "Often this is justified as a result of society being collectively afraid that a shortage of fuel is on the horizon."}, {"sense": "the line in the distance where the sky seems to touch the land or sea", "level": "C2", "dict_examp": "We could see a large ship on the horizon.", "lear_examp": "The view from here is also very beautiful and I remember that when I looked out over the sea, I could see the boats dotted around between the bay and the horizon."}]}]}, {"word": "hopelessly", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely, or in a way that makes you lose hope", "level": "C2", "dict_examp": "hopelessly lost", "lear_examp": "It's never easy to be young and hopelessly in love."}]}]}, {"word": "hot dog", "poses": [{"pos": "noun", "senses": [{"sense": "a long thin cooked sausage, usually eaten on a special type of bread", "level": "B1", "dict_examp": "We can get some hot dogs at the game.", "lear_examp": "We both had a coke and a hot dog."}]}]}, {"word": "house", "poses": [{"pos": "noun", "senses": [{"sense": "a building where people live, usually one family or group", "level": "A1", "dict_examp": "a three-bedroom house", "lear_examp": "Come to my house for dinner tomorrow."}, {"sense": "the people watching a performance or the area where they sit", "level": "C2", "dict_examp": "The actors played to a full house.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to provide space for something", "level": "C2", "dict_examp": "The museum houses a huge collection of paintings.", "lear_examp": "Her study houses a really huge collection of books on history, architecture, and geography of the places we have been to."}, {"sense": "to give a person or animal a place to live", "level": "C2", "dict_examp": "This development will house over 100 families.", "lear_examp": "To have long-lived people is to have more people to be housed, fed, educated, hospitalized, etc."}]}]}, {"word": "hopeless", "poses": [{"pos": "adjective", "senses": [{"sense": "without hope", "level": "B1", "dict_examp": "a hopeless situation", "lear_examp": "When my uncle heard about my new hobby, he bought me a chess-computer to train for my first real match. At the moment I'm trying to win against it but I think it is hopeless."}, {"sense": "very bad at a particular activity", "level": "B2", "dict_examp": "I'm hopeless at sports.", "lear_examp": ""}]}]}, {"word": "hospitality", "poses": [{"pos": "noun", "senses": [{"sense": "when people are friendly and welcoming to guests and visitors", "level": "C1", "dict_examp": "The local people showed me great hospitality.", "lear_examp": "Our members were ever so pleased with the families and your kind hospitality."}]}]}, {"word": "humid", "poses": [{"pos": "adjective", "senses": [{"sense": "Humid air or weather is hot and slightly wet.", "level": "B1", "dict_examp": "It's very humid today.", "lear_examp": "The north of Iran is wet but the south of Iran is humid and hot."}]}]}, {"word": "humorous", "poses": [{"pos": "adjective", "senses": [{"sense": "funny, or making you laugh", "level": "C1", "dict_examp": "a humorous book", "lear_examp": "To be more specific, the articles will include events taken from our college life, written in a humorous, chatty way."}]}]}, {"word": "humiliating", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel stupid or ashamed", "level": "C2", "dict_examp": "a humiliating defeat", "lear_examp": "How humiliating it had been to have her parental abilities questioned."}]}]}, {"word": "hunt", "poses": [{"pos": "verb", "senses": [{"sense": "to chase and kill wild animals", "level": "B1", "dict_examp": "Some animals hunt at night.", "lear_examp": "As I was saying, you can also go to jungle hotels - comfortable hotels in the middle of the forest, just crossing the Amazon River, where you can keep in touch with nature, feed monkeys and even \"hunt\" alligators (all sizes, believe me!)."}, {"sense": "to search for something or someone", "level": "B2", "dict_examp": "I've hunted all over the place, but I can't find that book.", "lear_examp": "You don't have to hunt for a place to park your car and to worry what will happen when you're out of gas."}]}, {"pos": "noun", "senses": [{"sense": "a search for something or someone", "level": "C1", "dict_examp": "After a long hunt we finally found a house we liked.", "lear_examp": "What is more, it helps to face problems which could occur during the hunt for a \"lifetime\" job."}]}]}, {"word": "hunger", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling you have when you need to eat or have not eaten enough", "level": "B1", "dict_examp": "Drinks don't satisfy your hunger the way solid food does.", "lear_examp": "It was what I expected, a baby crying from hunger."}, {"sense": "when you do not have enough food", "level": "B2", "dict_examp": "All over the world, people die of hunger every day.", "lear_examp": "Many changes are coming and many problems are coming too, because overpopulation, contamination, pollution, hunger, and poverty besides come with this technological revolution and that is something that the human being will have to solve soon."}, {"sense": "a strong wish for something", "level": "C1", "dict_examp": "a hunger for knowledge/adventure", "lear_examp": "The most important factor when learning English is the hunger for knowledge, the hunger for the unknown."}]}]}, {"word": "how", "poses": [{"pos": "adverb", "senses": [{"sense": "used to ask someone if they are well and happy", "level": "A1", "dict_examp": "\"Hi, Maya, how are you?\" \"Fine, thanks, how are you?\"", "lear_examp": "Dear Ramesh, How are you?"}, {"sense": "used to ask or talk about quantity, size, age, etc.", "level": "A1", "dict_examp": "Do you know how many  people are coming?", "lear_examp": "How much does it cost?"}, {"sense": "used to make a suggestion", "level": "A2", "dict_examp": "How about some lunch?", "lear_examp": "How about going on Monday evening?"}, {"sense": "used to ask or talk about the way something happens or is done", "level": "A2", "dict_examp": "How do we get to the mall from here?", "lear_examp": "How did you know I liked skateboards?"}, {"sense": "used to ask about someone's health", "level": "A2", "dict_examp": "How is your mother?", "lear_examp": "How are you feeling? I hope you are feeling better."}, {"sense": "a formal greeting for someone that you have not met before", "level": "A2", "dict_examp": "\"I'm Jack Stewart.\" \"How do you do?  I'm Angela Black.\"", "lear_examp": "How do you do? My name is Tom. I'm a Chinese."}, {"sense": "used to ask or talk about what an experience or event was like", "level": "B1", "dict_examp": "How was your flight?", "lear_examp": "How was your birthday?"}, {"sense": "used for emphasis", "level": "B1", "dict_examp": "I can't tell you how happy I am  that you came.", "lear_examp": "It's quite amazing how quickly she could change my reason to learn English."}, {"sense": "used to ask someone for a suggestion, opinion, or fact", "level": "B1", "dict_examp": "Okay, so hot dogs for the kids - how about the grownups?", "lear_examp": "I don't like shopping with my mum because she wants me to wear weird clothes. How about you?"}, {"sense": "used to express anger about something someone has done", "level": "C1", "dict_examp": "How dare you talk to me like that!", "lear_examp": "How dare you call that high standards?!"}, {"sense": "used to talk about how true something is", "level": "C1", "dict_examp": "How far do politicians represent the views of ordinary people?", "lear_examp": "How far and to what extent would the characteristics we are born with influence our future development in life?"}, {"sense": "used to ask why or how something has happened", "level": "C1", "dict_examp": "How come you didn't go to the party?", "lear_examp": "Off the record: How come that your reporter can print such lies, knowing they are perhaps hurting certain people in this important matter?"}, {"sense": "said to mean that something is strange/silly, etc.", "level": "C2", "dict_examp": "I found my keys in the fridge - how silly is that?", "lear_examp": "I was astonished to find no Barbie or Lilou dolls in her room - she played only with computer-like devices and her automatic bike.  Now, how peculiar is that?"}]}]}, {"word": "humility", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of not being proud or not thinking that you are better than other people", "level": "C2", "dict_examp": "Try to show a little humility.", "lear_examp": "This growing shopping mania is also said to create an increasingly materialistic society; hence, our children grow up forgetting the basic values of life - simplicity, integrity, humility and plain hard work."}]}]}, {"word": "human", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to people or their characteristics", "level": "B1", "dict_examp": "the human body", "lear_examp": "As for me, the last good program I saw was a scientific episode about the abilities of the human brain."}, {"sense": "to not be perfect", "level": "C2", "dict_examp": "Of course Tom makes mistakes - he's only human.", "lear_examp": "In theory, it is easy to say \"We should learn from the mistakes of the past\" but is it easy to do so in practice? Many people would say \"No\" to this question, as we are only human."}]}, {"pos": "noun", "senses": [{"sense": "a man, woman or child", "level": "B1", "dict_examp": "The greatest damage being done to our planet today is that being done by humans.", "lear_examp": "I don't believe that people want to hurt each other for money and power but this has happened all the time in the history of human beings."}]}]}, {"word": "hug", "poses": [{"pos": "verb", "senses": [{"sense": "to put your arms around someone and hold them tightly, usually because you love or like them", "level": "B1", "dict_examp": "They hugged each other when they met at the station.", "lear_examp": "We walked in the street together and spoke to each other for more than for four hours and at the end we hugged and kissed."}]}, {"pos": "noun", "senses": [{"sense": "when you put your arms around someone and hold them tightly", "level": "B1", "dict_examp": "Come here and give me a big hug.", "lear_examp": "The singer of the band ,\"Green Day\" was coming towards me. He took my hand and then gave me a hug."}]}]}, {"word": "humiliated", "poses": [{"pos": "adjective", "senses": [{"sense": "made to feel stupid or ashamed", "level": "C2", "dict_examp": "She felt completely humiliated.", "lear_examp": "Never again in my life have I felt so miserable and humiliated."}]}]}, {"word": "housework", "poses": [{"pos": "noun", "senses": [{"sense": "the work of keeping a house clean and neat", "level": "B1", "dict_examp": "I hate doing housework.", "lear_examp": "I ran out of vegetables and cans, and as I was not at home the housework wasn't done, and the children almost destroyed my furniture."}]}]}, {"word": "huge", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely large", "level": "B1", "dict_examp": "They live in a huge house.", "lear_examp": "I live in a huge old house in the suburbs with my family."}]}]}, {"word": "however", "poses": [{"pos": "adverb", "senses": [{"sense": "used when you are about to say something that is surprising compared with what you have just said", "level": "A2", "dict_examp": "This is one possible solution to the problem. However, there are others.", "lear_examp": "I will be very happy to go fishing and swimming in the lake like the last time.  However, if you don't want to do it, it's not a problem for me."}, {"sense": "used to say that it does not make any difference how cold/difficult/slowly, etc.", "level": "B2", "dict_examp": "We're not going to get there in time, however fast we drive.", "lear_examp": "We think that we are careful and that we can avoid traffic accidents, but however careful we may be, some other people might be careless and hit us."}]}, {"pos": "conjunction", "senses": [{"sense": "in whatever way", "level": "C2", "dict_examp": "However you look at it, it's still a mess.", "lear_examp": "However you do it, the important part is that you relax."}]}]}, {"word": "hum", "poses": [{"pos": "verb", "senses": [{"sense": "to sing without opening your mouth", "level": "C2", "dict_examp": "She walked around the house, humming a song.", "lear_examp": "Secretly, when nobody can hear them, they hum a little tune or whistle a melody, their faces beam, and their hearts grow warm."}]}]}, {"word": "housewife", "poses": [{"pos": "noun", "senses": [{"sense": "a woman whose work is inside the home, doing the cleaning, cooking, etc., and who usually does not have any other job", "level": "A2", "dict_examp": "My grandmother was the perfect housewife.", "lear_examp": "I have also enjoyed \"Desperate housewives\", \"the O.C\" and of course \"the Oprah show\" recently."}]}]}, {"word": "humor", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to understand funny things and to be funny yourself", "level": "B1", "dict_examp": "Carol has a wicked sense of humor.", "lear_examp": "She is a very nice person with a very good sense of humor and moral values."}, {"sense": "the quality of being funny", "level": "B2", "dict_examp": "There's a lot of humor in her work.", "lear_examp": "Jem Merlyn's horse thieving is shown by the writer with humor."}, {"sense": "the way you are feeling, or your mood", "level": "C2", "dict_examp": "good/bad humor", "lear_examp": "That unusual mixture of strong will, good humor, smartness and charm have led him to where he is today and in my view, he certainly deserves his world-wide success."}]}]}, {"word": "hungry", "poses": [{"pos": "adjective", "senses": [{"sense": "wanting or needing food", "level": "A1", "dict_examp": "By four o'clock I felt/was really hungry.", "lear_examp": "I'm very happy about this dinner, because after work I'm so hungry."}, {"sense": "to have a strong wish for something", "level": "C2", "dict_examp": "The journalists were hungry for more details of the accident.", "lear_examp": "I am always fascinated with people who are well-educated and do not stop being hungry for information."}]}]}, {"word": "humanitarian", "poses": [{"pos": "adjective", "senses": [{"sense": "connected with improving people's lives and reducing suffering", "level": "C2", "dict_examp": "The UN is sending humanitarian aid to the refugees.", "lear_examp": "Indeed, the conflicts in the Balkans are so deeply rooted and complex that they can be likened to a political quagmire: once you go in, a withdrawal of humanitarian aid and military forces becomes difficult to undertake."}]}]}, {"word": "hundred", "poses": [{"pos": "number", "senses": [{"sense": "the number 100", "level": "A2", "dict_examp": "We've driven a/one hundred miles in the last two hours.", "lear_examp": "It cost nine hundred yuan at least."}]}]}, {"word": "human rights", "poses": [{"pos": "noun", "senses": [{"sense": "the basic rights that every person should have, such as justice and freedom to say what you think", "level": "B2", "dict_examp": "international laws protecting human rights", "lear_examp": "My main interest is the way of life during the so-called French Period; that period is very important for the foundation of human rights and the way parliament ought to work."}]}]}, {"word": "humanity", "poses": [{"pos": "noun", "senses": [{"sense": "all people", "level": "C1", "dict_examp": "The massacre was a crime against humanity.", "lear_examp": "All humanity enjoys the numerous advances in modern technology and in our day,  life has become more interesting and easier."}, {"sense": "kindness and sympathy toward others", "level": "C2", "dict_examp": "Mother Teresa was famous for her compassion and humanity.", "lear_examp": "When he sees Faber's intelligence and humanity, he is once more convinced of the fact that books are a good thing and that they should be preserved rather than destroyed and he decides to fight for this."}, {"sense": "the condition of being human", "level": "C2", "dict_examp": "War robs these people of their humanity.", "lear_examp": "At last they will be back home, but they are sure that nobody could give them again that humanity that the war took away."}]}]}, {"word": "housing", "poses": [{"pos": "noun", "senses": [{"sense": "buildings for people to live in", "level": "C1", "dict_examp": "a shortage of affordable housing", "lear_examp": "Many trees have been cut in order to make roads or used for housing and making furniture."}]}]}, {"word": "humble", "poses": [{"pos": "adjective", "senses": [{"sense": "not proud or not believing that you are important", "level": "C2", "dict_examp": "He's very humble about his success.", "lear_examp": "I am aware that this may be perceived by some people as a naive point of view, as such humble values are becoming less and less popular in today's materialistic world."}, {"sense": "poor or of a low social rank", "level": "C2", "dict_examp": "She rose from humble beginnings to become Prime Minister.", "lear_examp": "As a result of it, he never forgot his humble origins in a small region of Spain."}, {"sense": "used to give your opinion about something, often when you are sure you are right", "level": "C2", "dict_examp": "In my humble opinion, that's the wrong decision.", "lear_examp": "In my humble opinion, there's no such thing as a uniform celebrity, good, bad or otherwise."}]}]}, {"word": "hunting", "poses": [{"pos": "noun", "senses": [{"sense": "the sport of chasing and killing animals", "level": "B2", "dict_examp": "deer hunting", "lear_examp": "And of course hunting won't be allowed."}]}]}, {"word": "hunt", "poses": [{"pos": "verb", "senses": [{"sense": "to chase and kill wild animals", "level": "B1", "dict_examp": "Some animals hunt at night.", "lear_examp": "As I was saying, you can also go to jungle hotels - comfortable hotels in the middle of the forest, just crossing the Amazon River, where you can keep in touch with nature, feed monkeys and even \"hunt\" alligators (all sizes, believe me!)."}, {"sense": "to search for something or someone", "level": "B2", "dict_examp": "I've hunted all over the place, but I can't find that book.", "lear_examp": "You don't have to hunt for a place to park your car and to worry what will happen when you're out of gas."}]}, {"pos": "noun", "senses": [{"sense": "a search for something or someone", "level": "C1", "dict_examp": "After a long hunt we finally found a house we liked.", "lear_examp": "What is more, it helps to face problems which could occur during the hunt for a \"lifetime\" job."}]}]}, {"word": "hurt", "poses": [{"pos": "verb", "senses": [{"sense": "to cause pain", "level": "A2", "dict_examp": "Sam hurt his knee playing football.", "lear_examp": "I hurt myself one week ago so I can't help you."}, {"sense": "If a part of your body hurts, it feels painful.", "level": "A2", "dict_examp": "My eyes really hurt.", "lear_examp": "I'm going to see the dentist, because my tooth is hurting and I really need to go."}, {"sense": "to cause emotional pain to someone", "level": "B1", "dict_examp": "She called me stupid and fat, and that really hurt.", "lear_examp": "My heart was hurt and nobody will be able to repair the damage."}]}, {"pos": "adjective", "senses": [{"sense": "injured or in pain", "level": "B1", "dict_examp": "Let me help you up. Are you hurt?", "lear_examp": "He told me: \"Your father got hurt in a traffic accident!\""}, {"sense": "upset or unhappy", "level": "B1", "dict_examp": "I feel very hurt by what you said.", "lear_examp": "I know you got very hurt when you and Brian broke up."}]}]}, {"word": "hygienic", "poses": [{"pos": "adjective", "senses": [{"sense": "very clean, so that bacteria cannot spread", "level": "C2", "dict_examp": "hygienic conditions", "lear_examp": "That was not only extremely uncomfortable, but also inconvenient and not very hygienic."}]}]}, {"word": "hysterical", "poses": [{"pos": "adjective", "senses": [{"sense": "If someone is hysterical, they cannot control their feelings or behavior because they are extremely frightened, angry, excited, etc.", "level": "C1", "dict_examp": "Calm down, you're getting hysterical.", "lear_examp": "I became hysterical and started shouting at him."}]}]}, {"word": "husband", "poses": [{"pos": "noun", "senses": [{"sense": "the man a woman is married to", "level": "A1", "dict_examp": "I've never met Fiona's husband.", "lear_examp": "On Sunday afternoons, she goes with her husband and her son to the swimming pool."}]}]}, {"word": "hyphen", "poses": [{"pos": "noun", "senses": [{"sense": "a mark (-) used to join two words together, or to show that a word has been divided and continues on the next line", "level": "B2", "dict_examp": "There should be a hyphen in \"high-tech.\"", "lear_examp": ""}]}]}, {"word": "hypocrisy", "poses": [{"pos": "noun", "senses": [{"sense": "when someone pretends to believe something that they do not really believe or that is the opposite of what they do or say at another time", "level": "C2", "dict_examp": "I can't stand their hypocrisy - they say they care about the poor but then they go home and drink champagne.", "lear_examp": "I would recommend Hartley's novel to people who would like to see the world once more from the point of view of a child: a world too strange, too full of hypocrisy and egotism to be understood by a boy."}]}]}, {"word": "hygiene", "poses": [{"pos": "noun", "senses": [{"sense": "the process of keeping things clean, especially to prevent disease", "level": "C1", "dict_examp": "health and hygiene regulations", "lear_examp": "The ones that need medical services at home have hardly got anyone, and no one has helped them with personal hygiene."}]}]}, {"word": "hypocritical", "poses": [{"pos": "adjective", "senses": [{"sense": "Hypocritical people pretend to believe things that they do not really believe or that are the opposite of what they do or say at another time.", "level": "C2", "dict_examp": "Having told Tom that he should not accept any money from her, it would be rather hypocritical if I did.", "lear_examp": "One unique thought haunted her: go away from the environment she was living in and which she couldn't stand: the four-hour teas, the incessant discussions about Mrs X who was pregnant and Mr X who had lost his fortune in a game, the hypocritical smiles, the narrow-minded people blinded by money... all those details which enraged Lucy."}]}]}, {"word": "hypothesis", "poses": [{"pos": "noun", "senses": [{"sense": "a suggested explanation for something which has not yet been proved to be true", "level": "C2", "dict_examp": "They are investigating the hypothesis that obesity may be caused by a virus.", "lear_examp": "The first impression that comes to my mind is that when you live longer, you gain more experience and wisdom, which you can convey to your children, therefore the society becomes more experienced, responsible etc. (unfortunately, real life does not back up this hypothesis)."}]}]}, {"word": "hut", "poses": [{"pos": "noun", "senses": [{"sense": "a small, simple building, often made of wood", "level": "B1", "dict_examp": "a mountain hut", "lear_examp": "Finally, we reached a hut near a river, where we stayed until the following day, when we returned home by bus."}]}]}, {"word": "hurry", "poses": [{"pos": "verb", "senses": [{"sense": "to move or do things more quickly than normal, or to make someone do this", "level": "A2", "dict_examp": "Hurry, or you'll be late.", "lear_examp": "I will start painting at 3:45 pm but you don't have to hurry."}, {"sense": "to do something more quickly", "level": "B1", "dict_examp": "Hurry up, or we'll miss the bus.", "lear_examp": "I woke up at 9 a.m. I had to hurry up because my flight was at 11 a.m."}, {"sense": "to make someone do something more quickly, or to make something happen sooner", "level": "B2", "dict_examp": "Can't you hurry the kids up so we can get there on time?", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the need to move or do things more quickly than normal", "level": "B1", "dict_examp": "We left in such a hurry that we forgot our tickets.", "lear_examp": "Maybe she was nervous or in a hurry and wrote my e-mail adress instead of his."}]}]}]