[{"word": "ice", "poses": [{"pos": "noun", "senses": [{"sense": "water that has frozen and become solid", "level": "A2", "dict_examp": "Gerry slipped on the ice and broke his arm.", "lear_examp": "It's fun when you slide on the ice."}, {"sense": "to make people feel more relaxed in a social situation", "level": "B2", "dict_examp": "I told everyone a joke, which helped to break the ice.", "lear_examp": "And, of course, don't forget that a warm smile is one of the best ways to break the ice."}]}]}, {"word": "ice hockey", "poses": [{"pos": "noun", "senses": [{"sense": "the game of hockey", "level": "A2", "dict_examp": "He loves ice hockey.", "lear_examp": "I like watching ice hockey, because I play this game too."}]}]}, {"word": "icy", "poses": [{"pos": "adjective", "senses": [{"sense": "covered in ice", "level": "B1", "dict_examp": "icy roads", "lear_examp": "She had fallen off it on an icy street and had got injured."}, {"sense": "extremely cold", "level": "B1", "dict_examp": "an icy wind", "lear_examp": "Fast as the wind, she was falling down and down, until her long thin finger touched the icy cold water."}, {"sense": "without showing any emotion", "level": "B2", "dict_examp": "an icy stare", "lear_examp": "FOGG is the typical rich English man: cold with an icy heart, uncommunicative."}]}]}, {"word": "icon", "poses": [{"pos": "noun", "senses": [{"sense": "a small picture on a computer screen that you choose in order to make the computer do something", "level": "B2", "dict_examp": "Click on the print icon.", "lear_examp": "He clicked on the icon on the screen which started the operation."}, {"sense": "a person or thing that is famous because it represents a particular idea or way of life", "level": "B2", "dict_examp": "He's a musical innovator and cultural icon.", "lear_examp": "I think he is still very famous because he is an icon and kickboxing is still very popular because of him."}]}]}, {"word": "idiom", "poses": [{"pos": "noun", "senses": [{"sense": "a group of words used together with a meaning that you cannot guess from the meanings of the separate words", "level": "B2", "dict_examp": "To \"bite off more than you can chew\" is an idiom that means to try to do something that is too difficult for you.", "lear_examp": "Greek has many verbs, adjectives and idioms and the grammar can be very complicated."}]}]}, {"word": "idealistic", "poses": [{"pos": "adjective", "senses": [{"sense": "believing that it is possible to achieve very good things, even when others do not think this is likely", "level": "C1", "dict_examp": "When I was young and idealistic, I believed it was possible to change the world.", "lear_examp": "Carolina has conquered the world, not only through her impressive results but through her appearance in front of the cameras, her idealistic ideas and her constantly happy mood."}]}]}, {"word": "identical", "poses": [{"pos": "adjective", "senses": [{"sense": "exactly the same", "level": "B2", "dict_examp": "I've got three identical blue suits.", "lear_examp": "We have identical tastes which is pretty unusual, I think, particularly in adults."}]}]}, {"word": "idea", "poses": [{"pos": "noun", "senses": [{"sense": "a suggestion or plan", "level": "A2", "dict_examp": "a bad/brilliant/great/stupid idea", "lear_examp": "Nick, it's a wonderful idea!"}, {"sense": "to not know", "level": "B1", "dict_examp": "\"Where's George?\" \"I have no idea.\"", "lear_examp": "I have no idea about how his children are."}, {"sense": "an opinion or belief", "level": "B1", "dict_examp": "We have very different ideas about the environment.", "lear_examp": "Have you changed your ideas after the exhibition about the future of your town?"}, {"sense": "an understanding, thought or picture in your mind", "level": "B2", "dict_examp": "Do you have any idea what he looks like?", "lear_examp": "For children it's great to get an idea of how these \"big\" animals eat, drink and live."}, {"sense": "the aim or purpose of something", "level": "C1", "dict_examp": "The idea is to give the students a chance to voice their opinions.", "lear_examp": "This was the idea behind this new product: although made in New Zealand, the new product would have its name, packaging, marketing and advertising support in keeping with the Russian traditions."}, {"sense": "the principle of something", "level": "C2", "dict_examp": "We all admire the idea of dignity.", "lear_examp": "Many of us sit there with watery eyes, as we're moved by the idea of unification, equality and brotherhood among the different nations of the world."}, {"sense": "used to emphasize that you do not know something", "level": "C2", "dict_examp": "I haven't the faintest idea what you're talking about.", "lear_examp": "Some twenty years ago, when I left my parents' home to go and live on my own, I was given four mugs. By whom? I haven't the faintest idea."}]}]}, {"word": "ID card", "poses": [{"pos": "noun", "senses": [{"sense": "a card that shows your name, photograph, and information to prove who you are", "level": "A2", "dict_examp": "You will need a passport or an ID card.", "lear_examp": "Last night I left my ID card in your house."}]}]}, {"word": "identification", "poses": [{"pos": "noun", "senses": [{"sense": "an official document that shows or proves who you are", "level": "A2", "dict_examp": "We were asked to show some identification before the security guards would let us in.", "lear_examp": "It's important to send my wallet back as I can't withdraw money from my account without any proof of identification."}, {"sense": "when you recognize and can name someone or something", "level": "B2", "dict_examp": "Identification of the victims of the plane crash still is not complete.", "lear_examp": "In the home of the future, we might even be using voice identification and fingerprints instead of keys."}]}]}, {"word": "ice cream", "poses": [{"pos": "noun", "senses": [{"sense": "a sweet, frozen food made from milk or cream, sugar, and a flavor", "level": "A1", "dict_examp": "chocolate/vanilla/strawberry ice cream", "lear_examp": "I like chocolate and ice cream with fruit."}]}]}, {"word": "iceberg", "poses": [{"pos": "noun", "senses": [{"sense": "a very large piece of ice in the coldest waters of the ocean", "level": "C1", "dict_examp": "The ship hit an iceberg.", "lear_examp": "Another animal you cannot miss is the Humboldt penguin - you can see thousands of them all over an iceberg."}, {"sense": "to be a small part of a very big problem", "level": "C2", "dict_examp": "We've corrected a few errors, but they're just the tip of the iceberg.", "lear_examp": "He racked his brain trying to remember where he might have left it and finally realized that his problems were just a tip of the iceberg, if her mother knew about the loss."}]}]}, {"word": "ice skating", "poses": [{"pos": "noun", "senses": [{"sense": "the activity or sport of moving across ice using ice skates", "level": "B1", "dict_examp": "We're going ice skating.", "lear_examp": "Last year, I went ice-skating with some friends and it was not as easy as I thought it would be, but I liked it anyway."}]}]}, {"word": "idol", "poses": [{"pos": "noun", "senses": [{"sense": "someone who you admire and respect very much", "level": "C1", "dict_examp": "Baseball players were his childhood idols.", "lear_examp": "The reason for the choice is that it was the time when Bill Gates, my idol, started his business and when people began to use computers."}, {"sense": "a statue or picture that represents a god, which people pray to as part of their religion", "level": "C2", "dict_examp": "H has a small stone idol of a Hindu deity.", "lear_examp": "Buddha idols stand in rows protected by glass cases."}]}]}, {"word": "idiot", "poses": [{"pos": "noun", "senses": [{"sense": "a stupid person or someone who is behaving in a stupid way", "level": "B2", "dict_examp": "Some idiot left the faucet on in the bathroom and there's water everywhere.", "lear_examp": "Everybody was treating me like a big idiot."}]}]}, {"word": "idle", "poses": [{"pos": "adjective", "senses": [{"sense": "not working or not doing anything", "level": "C1", "dict_examp": "It was break time and both the machines and the workers sat idle.", "lear_examp": "I saw some people from the group wandering here and there in Piccadilly Circus & Street, but most of them were sitting idle in their rooms watching TV or just spending their time in the hotel bar or restaurant."}, {"sense": "not serious or having no real purpose", "level": "C2", "dict_examp": "idle chatter/speculation", "lear_examp": "However, as soon as it became a plan of action rather than an idle thought, it began to grow on her."}]}]}, {"word": "I", "poses": [{"pos": "pronoun", "senses": [{"sense": "used when the person speaking or writing is the subject of the verb", "level": "A1", "dict_examp": "I love you.", "lear_examp": "I don't understand much English."}]}]}, {"word": "ideal", "poses": [{"pos": "adjective", "senses": [{"sense": "perfect, or the best possible", "level": "B2", "dict_examp": "the ideal job", "lear_examp": "The market on Wednesday is an ideal occasion to meet and photograph the local people."}]}]}, {"word": "identify", "poses": [{"pos": "verb", "senses": [{"sense": "to recognize someone or something and say or prove who or what they are", "level": "B2", "dict_examp": "Even the smallest baby can identify its mother by her voice.", "lear_examp": "Mainly for children, zoos teach them many things about animals; for instance, their habits, their relationship to each other and the original propose: to know many kinds of animals and identify them."}, {"sense": "to find a particular thing or all the things of a particular group", "level": "B2", "dict_examp": "You need to identify your priorities.", "lear_examp": "The purpose of this report is to identify which lessons or other activities should be filmed."}, {"sense": "to feel that you are similar to someone, and can understand them or their situation because of this", "level": "B2", "dict_examp": "Readers can easily identify with the hero's sense of frustration at the beginning of the novel.", "lear_examp": "Orwell gives the animals human characteristics and we can identify with them."}]}]}, {"word": "identity", "poses": [{"pos": "noun", "senses": [{"sense": "who someone is", "level": "B2", "dict_examp": "to hide/protect your identity", "lear_examp": "But this idea fell through when the real Martine revealed her identity."}, {"sense": "the things that make one person or group of people different from others", "level": "B2", "dict_examp": "cultural/national identity", "lear_examp": "There were many people and many speakers who talked about all sorts of subjects such as politics, religion, gender identity, and art."}]}]}, {"word": "ID", "poses": [{"pos": "noun", "senses": [{"sense": "an official document that shows or proves who you are", "level": "A2", "dict_examp": "Make sure you carry some ID with you.", "lear_examp": "Please could you check if you have it because it contains my ID."}]}]}, {"word": "if", "poses": [{"pos": "conjunction", "senses": [{"sense": "used to say that something will happen only after something else happens or is true", "level": "A2", "dict_examp": "We'll have the party on the deck if the weather's good.", "lear_examp": "If you want me to, I'll bring you some of my CDs."}, {"sense": "used to say what the situation will be if something does not happen", "level": "A2", "dict_examp": "I hope to see you there but, if not, I'll call you.", "lear_examp": "I'm going to paint my bedroom with the pink paint. Remember to put on your old clothes. If not, your clothes will become pinky and you can't use them anymore."}, {"sense": "used when you offer someone something", "level": "A2", "dict_examp": "If you like, I could drive you there.", "lear_examp": "If you like, we can go to a night club."}, {"sense": "used to mean always or every time", "level": "B1", "dict_examp": "If water is heated to 212°F it turns to steam.", "lear_examp": "If I think it's pretty, I buy it."}, {"sense": "used to talk about something that might happen", "level": "B1", "dict_examp": "If I won the lottery, I'd buy a boat.", "lear_examp": "It would be great if you came to the city."}, {"sense": "whether", "level": "B1", "dict_examp": "I wonder if he'll get the job?", "lear_examp": "But let's see if a friend can lend me his notebook, so that way I will catch up easily."}, {"sense": "used when you give someone advice", "level": "B1", "dict_examp": "I think I'd take the job if I were you.", "lear_examp": "But you enjoy clubbing and discos, so, if I were you, I would choose the city."}, {"sense": "used to say you wish for something or you wish something was so", "level": "B1", "dict_examp": "If only I had more money.", "lear_examp": "If only I had been more careful."}, {"sense": "used to talk about what would/might/could, etc. have happened", "level": "B2", "dict_examp": "If we had the money, we'd get a new car.", "lear_examp": "If she had gone home by taxi, she would have not risked her life."}, {"sense": "used when you want to say how doing something simple would make it possible to avoid something unpleasant", "level": "B2", "dict_examp": "If only she'd listened to me, she wouldn’t be in this mess.", "lear_examp": "Therefore I think that if only the zoo owners take good care of the animals, they won't suffer if they are locked up."}, {"sense": "if this is the case", "level": "B2", "dict_examp": "It might rain this afternoon, and if so, we'll have to have the party indoors.", "lear_examp": "Let me know if you can come, and if so, whether you prefer the 15th or 22nd of February."}, {"sense": "used to describe how a situation seems to be", "level": "B2", "dict_examp": "It looks as if it's going to rain.", "lear_examp": "The sun was up in the sky, there were no clouds and it looked as if it was going to be a wonderful day."}, {"sense": "said when you are giving your opinion", "level": "B2", "dict_examp": "If you ask me, you should take that job.", "lear_examp": "If you ask me, I don't think that TV can replace books."}, {"sense": "if it is necessary", "level": "C2", "dict_examp": "If need be, we can take two cars.", "lear_examp": "On the one hand I won't indulge my children's whims and I will lecture them or punish them if need be."}]}]}, {"word": "ideally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a perfect way", "level": "B2", "dict_examp": "She seemed ideally suited for the job.", "lear_examp": "I believe I am ideally suited for this job."}, {"sense": "used to talk about how something would be in a perfect situation", "level": "B2", "dict_examp": "Ideally, I'd like to work at home.", "lear_examp": "Ideally, through this camp, I would like to teach Japanese songs and dance to them and I would also like to learn about their culture."}]}]}, {"word": "imagine", "poses": [{"pos": "verb", "senses": [{"sense": "to form an idea or picture of something in your mind", "level": "B1", "dict_examp": "Imagine Bob when he was young - that's what John looks like.", "lear_examp": "Just imagine the sun, the sea and all that fun on the beach."}, {"sense": "to have an idea of what something is like or might be like", "level": "B1", "dict_examp": "Imagine how it feels to be away from home for the first time.", "lear_examp": "You can't imagine how tired I am."}, {"sense": "to think that you hear or see something that does not really exist", "level": "B1", "dict_examp": "\"Did you hear a noise?\" \"No, you're imagining things.\"", "lear_examp": "I turned back but I didn't see anyone, so I thought that I had imagined it."}, {"sense": "to guess that something is probably true or real", "level": "B2", "dict_examp": "I imagine they charge extra for dessert.", "lear_examp": "I imagine that the watch is in your bedroom."}]}]}, {"word": "illusion", "poses": [{"pos": "noun", "senses": [{"sense": "an idea or belief that is not true", "level": "C2", "dict_examp": "He had no illusions about his talents as a singer.", "lear_examp": "Just one detail turning out to be not as expected or not perfect is often enough to shatter their illusions and cause arguing."}, {"sense": "something that is not really as it appears to be", "level": "C2", "dict_examp": "There is a large mirror at one end to create the illusion of more space.", "lear_examp": "This architectural solution creates an illusion of space, one may feel as inside a vast hall."}]}]}, {"word": "imitation", "poses": [{"pos": "noun", "senses": [{"sense": "a copy of something that is made to look like the real thing", "level": "C2", "dict_examp": "It wasn't a genuine designer handbag, just a cheap imitation.", "lear_examp": "The word spread out so fast that the vast majority of people ended up purchasing genuine Versace jeans or even cheap imitations just to catch up with the fashion."}]}]}, {"word": "illustrate", "poses": [{"pos": "verb", "senses": [{"sense": "to add pictures to something such as a book or magazine", "level": "B2", "dict_examp": "She writes children’s books and also  illustrates them.", "lear_examp": "Last year I illustrated two children's books by H. J. Simons."}, {"sense": "to give information through diagrams, lists of numbers, etc.", "level": "C1", "dict_examp": "This process is illustrated in the diagram below.", "lear_examp": "The pie chart illustrates the primary causes of agricultural land becoming less productive worldwide."}, {"sense": "to give more information or examples to explain or prove something", "level": "C1", "dict_examp": "To illustrate her point,  she told a story about how her family felt when they moved here.", "lear_examp": "Secondly, the careers that were presented illustrated very well the possibilities in the selected fields."}]}]}, {"word": "image", "poses": [{"pos": "noun", "senses": [{"sense": "the way that other people think someone or something is", "level": "B2", "dict_examp": "He wants to improve his public image.", "lear_examp": "In conclusion, I do not think that there are many things to do for Turin, but what I said before could really improve the image of our wonderful town."}, {"sense": "a picture, especially on film or television or in a mirror", "level": "B2", "dict_examp": "a digital/satellite/video image", "lear_examp": "On the one hand, the first obvious advantage of watching television is that it shows us images, for example, that do not appear in the books, like a movie."}, {"sense": "a picture in your mind or an idea of how someone or something is", "level": "C2", "dict_examp": "I have an image in my mind of the way I want the garden to look.", "lear_examp": "It conjures up images of brightly lit and decorated malls, big stores, little stores proudly showing off their wares."}]}]}, {"word": "illegal", "poses": [{"pos": "adjective", "senses": [{"sense": "not allowed by law", "level": "B2", "dict_examp": "Fireworks are illegal in many states.", "lear_examp": "Although he has a very charming personality, he uses it to take part in illegal activities and he has been in trouble with the law several times."}]}]}, {"word": "immigrant", "poses": [{"pos": "noun", "senses": [{"sense": "someone who comes to live in a different country", "level": "B2", "dict_examp": "My grandparents arrived here as immigrants from Russia in  1910.", "lear_examp": "Leonardo is an Italian immigrant who has a restaurant near the primary school."}]}]}, {"word": "immensely", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely", "level": "C1", "dict_examp": "Country music is immensely popular.", "lear_examp": "People who were previously nothing more than peasants grew immensely rich, while the former aristocracy of land owners lost its dominant position."}]}]}, {"word": "immediately", "poses": [{"pos": "adverb", "senses": [{"sense": "now or without waiting or thinking about something", "level": "A2", "dict_examp": "We really ought to leave immediately.", "lear_examp": "Can you send me it immediately?"}, {"sense": "next to something, or close to something in time", "level": "C1", "dict_examp": "Milton Street is on the left, immediately after the bank.", "lear_examp": "Tickets are on the ground floor, immediately to your right when you have entered the building."}]}]}, {"word": "immigration", "poses": [{"pos": "noun", "senses": [{"sense": "the place where people's official documents are checked when they enter a country at an airport, port, border, etc.", "level": "B1", "dict_examp": "After you've been through immigration (control), you can go and get your luggage.", "lear_examp": "The immigration officers looked at her as if she was suspected of doing something wrong."}, {"sense": "when someone comes to live in a different country", "level": "B2", "dict_examp": "immigration policy", "lear_examp": "The purpose of the party is to give a treat to my family members, as my immigration into New Zealand is approved."}]}]}, {"word": "ignore", "poses": [{"pos": "verb", "senses": [{"sense": "to pay no attention to something or someone", "level": "B2", "dict_examp": "I smiled at her but she just ignored me.", "lear_examp": "Paul ignored it at first and continued his shopping but the dog kept following him."}]}]}, {"word": "immediate", "poses": [{"pos": "adjective", "senses": [{"sense": "happening or done without delay or very soon after something else", "level": "B2", "dict_examp": "The directors have demanded his immediate resignation.", "lear_examp": "I hope you will give this matter your immediate attention."}, {"sense": "important now and needing attention", "level": "B2", "dict_examp": "We have no immediate plans.", "lear_examp": "It can't be an immediate objective, of course, but we mustn't give up."}, {"sense": "closest to  something or someone", "level": "C1", "dict_examp": "There are stores, movie theaters, parks, schools - all right in the immediate area.", "lear_examp": "In the first place, there are beautiful landscapes in the immediate vicinity of both hotels."}]}]}, {"word": "imaginative", "poses": [{"pos": "adjective", "senses": [{"sense": "new or clever and often unusual", "level": "C1", "dict_examp": "an imaginative use of color", "lear_examp": "Her imaginative stories are very popular with children of all ages."}, {"sense": "able to create new and interesting ideas or things", "level": "C1", "dict_examp": "He's a very imaginative little boy.", "lear_examp": "She is a very imaginative girl and she always invents new games for our children, so that they have never felt bored in her presence."}]}]}, {"word": "immature", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving in a way that is childish and not in the emotionally well-developed way people expect from someone your age", "level": "C2", "dict_examp": "Some of the kids are so immature - they're always doing silly things and don't pay attention.", "lear_examp": "You might regard me as an immature, seventeen-year-old girl for I like decorating my diary."}]}]}, {"word": "immense", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely large", "level": "C1", "dict_examp": "This computer can store an immense amount of data.", "lear_examp": "Another reason for the immense popularity of shopping as a leisure activity is economics."}]}]}, {"word": "illegally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not allowed by law", "level": "B2", "dict_examp": "They entered the country illegally.", "lear_examp": "He was afraid and bought a gun illegally."}]}]}, {"word": "ignorant", "poses": [{"pos": "adjective", "senses": [{"sense": "not having enough knowledge, understanding, or information about something", "level": "C2", "dict_examp": "He was a newcomer to Formula One and ignorant of many of the circuits.", "lear_examp": "It is often claimed by scientists that people's modern lifestyle has resulted in this plight our world is facing and that unfortunately people are either ignorant of it or indifferent."}]}]}, {"word": "ignorance", "poses": [{"pos": "noun", "senses": [{"sense": "when someone does not have enough knowledge, understanding, or information about something", "level": "C2", "dict_examp": "There is widespread ignorance about how disease spreads.", "lear_examp": "However, living in ignorance about the history and the origins of things that one is surrounded with is like showing disrespect to those who helped to create the modern world as it is known today."}]}]}, {"word": "illness", "poses": [{"pos": "noun", "senses": [{"sense": "a disease of the body or mind", "level": "B1", "dict_examp": "He died at home after a long illness.", "lear_examp": "It's because my aunt has a terrible illness and I have to go and see her."}, {"sense": "when you are ill", "level": "B2", "dict_examp": "She had five days off work due to illness.", "lear_examp": "There was a little paper on the door which informed us that the restaurant was closed due to illness."}]}]}, {"word": "imminent", "poses": [{"pos": "adjective", "senses": [{"sense": "coming or happening very soon", "level": "C2", "dict_examp": "A rain storm was imminent.", "lear_examp": "How to cope with this now demographic development and the imminent dangers?"}]}]}, {"word": "imagination", "poses": [{"pos": "noun", "senses": [{"sense": "the part of your mind that creates ideas or pictures of things that are not real or that you have not seen", "level": "B1", "dict_examp": "There's nothing out here - it's just your imagination.", "lear_examp": "I thought it was my imagination, because it was very late and the concert had been so long."}, {"sense": "the ability to create ideas or pictures in your mind", "level": "B1", "dict_examp": "The job needs someone with creativity and imagination.", "lear_examp": "Endless imagination and the development of technology will lead us to future fashion."}, {"sense": "to make someone very excited or interested in something", "level": "C2", "dict_examp": "His paintings really fired my imagination.", "lear_examp": "The newspaper article on education that I read really fired my imagination and urged me to think about the points raised."}]}]}, {"word": "immoral", "poses": [{"pos": "adjective", "senses": [{"sense": "morally wrong", "level": "B2", "dict_examp": "immoral behavior", "lear_examp": "At this time - the early 20's -, tango was considered an immoral type of music; but Carlos Gardel changed this belief."}]}]}, {"word": "illiterate", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to read or write", "level": "C2", "dict_examp": "Most of the children are illiterate.", "lear_examp": "It is well known that many European charity workers travel to developing countries in order to educate illiterate children or to rebuild ruined villages."}]}]}, {"word": "imaginary", "poses": [{"pos": "adjective", "senses": [{"sense": "not real but imagined in your mind", "level": "C1", "dict_examp": "The story takes place in an imaginary world.", "lear_examp": "Mickey Mouse ... describes stories that can happen to humans whereas Sponge Bob lives in an imaginary world underwater."}]}]}, {"word": "imitate", "poses": [{"pos": "verb", "senses": [{"sense": "to copy the way someone or something looks, sounds, or behaves", "level": "C1", "dict_examp": "My four-year-old daughter is always trying to imitate her older sister.", "lear_examp": "Although not all celebrities are so altruistic, it is true that those who take action stimulate their followers to imitate them."}]}]}, {"word": "illustration", "poses": [{"pos": "noun", "senses": [{"sense": "a drawing, painting, photograph, or other picture", "level": "C1", "dict_examp": "Look at the illustration on page 37.", "lear_examp": "When you read about that period of time in history books and see pictures and illustrations, you can almost \"feel\" the atmosphere and sense the power the Monarchy possessed at the time."}, {"sense": "an example that explains or proves something", "level": "C2", "dict_examp": "This delay is a perfect illustration of why we need a new computer system.", "lear_examp": "And it seems to me that this difference inevitably affects not only the range of foods which are available in those countries but also their appearances: a good illustration of this is probably the case of French cuisine which is always served in a decorative way on beautiful plates."}]}]}, {"word": "if", "poses": [{"pos": "conjunction", "senses": [{"sense": "used to say that something will happen only after something else happens or is true", "level": "A2", "dict_examp": "We'll have the party on the deck if the weather's good.", "lear_examp": "If you want me to, I'll bring you some of my CDs."}, {"sense": "used to say what the situation will be if something does not happen", "level": "A2", "dict_examp": "I hope to see you there but, if not, I'll call you.", "lear_examp": "I'm going to paint my bedroom with the pink paint. Remember to put on your old clothes. If not, your clothes will become pinky and you can't use them anymore."}, {"sense": "used when you offer someone something", "level": "A2", "dict_examp": "If you like, I could drive you there.", "lear_examp": "If you like, we can go to a night club."}, {"sense": "used to mean always or every time", "level": "B1", "dict_examp": "If water is heated to 212°F it turns to steam.", "lear_examp": "If I think it's pretty, I buy it."}, {"sense": "used to talk about something that might happen", "level": "B1", "dict_examp": "If I won the lottery, I'd buy a boat.", "lear_examp": "It would be great if you came to the city."}, {"sense": "whether", "level": "B1", "dict_examp": "I wonder if he'll get the job?", "lear_examp": "But let's see if a friend can lend me his notebook, so that way I will catch up easily."}, {"sense": "used when you give someone advice", "level": "B1", "dict_examp": "I think I'd take the job if I were you.", "lear_examp": "But you enjoy clubbing and discos, so, if I were you, I would choose the city."}, {"sense": "used to say you wish for something or you wish something was so", "level": "B1", "dict_examp": "If only I had more money.", "lear_examp": "If only I had been more careful."}, {"sense": "used to talk about what would/might/could, etc. have happened", "level": "B2", "dict_examp": "If we had the money, we'd get a new car.", "lear_examp": "If she had gone home by taxi, she would have not risked her life."}, {"sense": "used when you want to say how doing something simple would make it possible to avoid something unpleasant", "level": "B2", "dict_examp": "If only she'd listened to me, she wouldn’t be in this mess.", "lear_examp": "Therefore I think that if only the zoo owners take good care of the animals, they won't suffer if they are locked up."}, {"sense": "if this is the case", "level": "B2", "dict_examp": "It might rain this afternoon, and if so, we'll have to have the party indoors.", "lear_examp": "Let me know if you can come, and if so, whether you prefer the 15th or 22nd of February."}, {"sense": "used to describe how a situation seems to be", "level": "B2", "dict_examp": "It looks as if it's going to rain.", "lear_examp": "The sun was up in the sky, there were no clouds and it looked as if it was going to be a wonderful day."}, {"sense": "said when you are giving your opinion", "level": "B2", "dict_examp": "If you ask me, you should take that job.", "lear_examp": "If you ask me, I don't think that TV can replace books."}, {"sense": "if it is necessary", "level": "C2", "dict_examp": "If need be, we can take two cars.", "lear_examp": "On the one hand I won't indulge my children's whims and I will lecture them or punish them if need be."}]}]}, {"word": "ill", "poses": [{"pos": "adjective", "senses": [{"sense": "not feeling well, or suffering from a disease", "level": "B2", "dict_examp": "He is in the hospital,  critically ill.", "lear_examp": "I had to make some phone calls home because my brother was a little ill, but I would like to pay you for them."}, {"sense": "bad", "level": "C1", "dict_examp": "He suffered no ill effects from his fall.", "lear_examp": "Working long hours can have ill effects on the health."}, {"sense": "feeling anxious and not relaxed", "level": "C2", "dict_examp": "He looked ill at ease in the room full of reporters.", "lear_examp": "I was a bit annoyed, or rather, ill at ease at first; but his kindness soon made me feel relaxed in his company."}]}]}, {"word": "immortal", "poses": [{"pos": "adjective", "senses": [{"sense": "living or lasting forever", "level": "C2", "dict_examp": "Teenagers think they are immortal.", "lear_examp": "Biotechnology seems to be the key to all the yet unsolved problems humans are facing. It might even make us immortal."}, {"sense": "famous or remembered for a very long time", "level": "C2", "dict_examp": "In Yogi Barra's immortal words: \"You can observe a lot by watching.\"", "lear_examp": "In the immortal words of the bard \"... if music be the food of love....... play on!\""}]}]}, {"word": "impact", "poses": [{"pos": "noun", "senses": [{"sense": "the effect that a person, event or situation has on someone or something", "level": "B2", "dict_examp": "These charges will have a damaging impact on the governor’s reputation.", "lear_examp": "I could live without watching TV, but it would make a serious impact on my life."}, {"sense": "the force or action of one object hitting another", "level": "C2", "dict_examp": "The impact of the crash reduced the car to a third of its original length.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to affect something or someone", "level": "C1", "dict_examp": "Rising interest rates are sure to impact (on) the housing market.", "lear_examp": "Those extra calories, the fat and salt in our food and the decrease in vitamin rich food, impacts on our health."}]}]}, {"word": "imprison", "poses": [{"pos": "verb", "senses": [{"sense": "to put someone in prison or keep them as a prisoner", "level": "C1", "dict_examp": "Taylor was imprisoned in 2005 for burglary.", "lear_examp": "DMX was a criminal and was imprisoned."}]}]}, {"word": "immune", "poses": [{"pos": "adjective", "senses": [{"sense": "not affected by a particular type of behavior or emotion", "level": "C2", "dict_examp": "He is immune to flattery.", "lear_examp": "Bad news on the other hand is so common that in order to cope with it, we simply ignore it - we have become immune to bad news, and television, radio stations and newspapers are aware of it."}]}]}, {"word": "impersonal", "poses": [{"pos": "adjective", "senses": [{"sense": "not showing any interest or feeling", "level": "C1", "dict_examp": "He sent me a cold and impersonal letter.", "lear_examp": "To sum up, the only thing we can do is to find out a way to survive in such an impersonal working environment and create a more friendly and intimate atmosphere as before."}]}]}, {"word": "imply", "poses": [{"pos": "verb", "senses": [{"sense": "to suggest or show something, without saying it directly", "level": "C2", "dict_examp": "He implied (that) the error was mine.", "lear_examp": "I am not implying that the other options will not be to our advantage but I think that this one is what we really need."}, {"sense": "to involve\n something as a necessary part or condition", "level": "C2", "dict_examp": "Democracy implies free elections.", "lear_examp": "Such mergers do unfortunately imply a massive loss of jobs, not only in Europe but also all over the world."}, {"sense": "used to show that the name of something tells you something about it", "level": "C2", "dict_examp": "A \"suggested price\" is, as the name implies, the sale price suggested by the manufacturer.", "lear_examp": "Sour Sweet, as the name implies, is originally a Chinese restaurant."}]}]}, {"word": "improved", "poses": [{"pos": "adjective", "senses": [{"sense": "better than before", "level": "B2", "dict_examp": "A new and improved version of this software was released last week.", "lear_examp": "The improved economic condition gave us the possibility to buy one or more cars for each family and this results in other big problems."}]}]}, {"word": "impression", "poses": [{"pos": "noun", "senses": [{"sense": "an idea, feeling or opinion about something or someone", "level": "B2", "dict_examp": "I get the impression that he’s rather shy.", "lear_examp": "You can look back fifty years to get an impression of what changes have happened."}, {"sense": "the way that something seems, looks or feels to a particular person", "level": "B2", "dict_examp": "All our warnings made little impression on him.", "lear_examp": "I was afraid of being late or saying something wrong because I really wanted to make a good impression on this man."}, {"sense": "to think or understand a particular stated thing", "level": "B2", "dict_examp": "I was under the impression (that) you didn't get on too well.", "lear_examp": "I am under the impression that people generally exercise a little, but if they eat the wrong food every day, it won't help."}]}]}, {"word": "impress", "poses": [{"pos": "verb", "senses": [{"sense": "to cause someone to admire or respect you", "level": "B2", "dict_examp": "She impressed us with her sincerity.", "lear_examp": "All groups did their best to impress the public and every group played professionally."}]}]}, {"word": "improve", "poses": [{"pos": "verb", "senses": [{"sense": "to get better or to make something better", "level": "A2", "dict_examp": "Her health has improved.", "lear_examp": "I always love studying History and I'm sure I will improve my vocabulary and English Grammar."}]}]}, {"word": "impose", "poses": [{"pos": "verb", "senses": [{"sense": "to create a rule, tax, law, etc., and force people to accept it", "level": "C1", "dict_examp": "The city imposed a ban on outdoor water use during the drought.", "lear_examp": "First of all, I believe that the local administration should impose some sort of regulations, so that the traditional architecture will be respected."}, {"sense": "to force someone to accept something, especially a belief or way of living", "level": "C1", "dict_examp": "Settlers often imposed their culture on indigenous peoples.", "lear_examp": "Above all, never allow others to impose their ideas on you."}]}]}, {"word": "impatience", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is impatient", "level": "C2", "dict_examp": "His impatience was obvious.", "lear_examp": "She remained silent for a while, taking no notice of my growing impatience."}]}]}, {"word": "impulse", "poses": [{"pos": "noun", "senses": [{"sense": "a sudden feeling that you must do something, without thinking about the results", "level": "C2", "dict_examp": "Her first impulse was to run away.", "lear_examp": "He is, therefore, a sort of intellectual and represents the force of reason as opposed to the violent impulses of the other boys."}, {"sense": "suddenly and without thinking first", "level": "C2", "dict_examp": "I tend to act on impulse.", "lear_examp": "I'm seeing Milly as a capricious girl who, like most teenagers, enjoys buying, although I think that she buys on impulse."}]}]}, {"word": "imprisonment", "poses": [{"pos": "noun", "senses": [{"sense": "the action of putting someone in prison, or keeping someone in prison", "level": "C2", "dict_examp": "We were shocked by the imprisonment of the young students.", "lear_examp": "The reason for More's imprisonment was his refusing to swear to the Act of Succession."}]}]}, {"word": "import", "poses": [{"pos": "verb", "senses": [{"sense": "to buy or bring in products from another country", "level": "B2", "dict_examp": "We import a large number of cars from Japan.", "lear_examp": "Moreover they say we must be independent of the Near East countries from whom we import oil."}]}, {"pos": "noun", "senses": [{"sense": "a product that is imported from another country", "level": "C1", "dict_examp": "food/oil imports", "lear_examp": "In my opinion, one of the reasons for these changes is that our country became wealthier after World War II, which led to an increase in food imports."}, {"sense": "the activity of importing something into a country", "level": "C2", "dict_examp": "The FDA oversees the import of seafood, fruits, and vegetables.", "lear_examp": "One of them, which is the most important for a government, is the import of foreign money."}]}]}, {"word": "importantly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is important", "level": "B2", "dict_examp": "She has a pleasant personality, but more importantly, she is well qualified for the job.", "lear_examp": "Lastly, and most importantly, what is the cost?"}]}]}, {"word": "imperfect", "poses": [{"pos": "adjective", "senses": [{"sense": "not perfect and with some mistakes", "level": "C1", "dict_examp": "an imperfect solution", "lear_examp": "It goes without saying that native speakers are the best to talk to when learning the language (of course, if they don't mind your practicing your imperfect English on them.)"}]}]}, {"word": "immune system", "poses": [{"pos": "noun", "senses": [{"sense": "the cells and other parts of the body that work together to protect the body against infection", "level": "C2", "dict_examp": "Healthy eating will help boost your immune system.", "lear_examp": "When you have lupus, your immune system produces antibodies against your own vital organs."}]}]}, {"word": "impatiently", "poses": [{"pos": "adverb", "senses": [{"sense": "in an impatient way", "level": "B2", "dict_examp": "\"Yes, you said that before,\" she said, impatiently.", "lear_examp": "I hope you will come soon because we are all impatiently waiting for your talk."}]}]}, {"word": "impolite", "poses": [{"pos": "adjective", "senses": [{"sense": "not polite", "level": "B2", "dict_examp": "It is impolite to point at people.", "lear_examp": "Besides, the serving speed was too slow and some waiters were even impolite to customers."}]}]}, {"word": "important", "poses": [{"pos": "adjective", "senses": [{"sense": "valuable, useful or necessary", "level": "A1", "dict_examp": "It’s important to tell the doctor all your symptoms.", "lear_examp": "This is not important for me."}, {"sense": "having a lot of power, influence or effect", "level": "B1", "dict_examp": "He was one of the most important writers of that period.", "lear_examp": "Tom was a director of a very important company in Mexico."}]}]}, {"word": "implication", "poses": [{"pos": "noun", "senses": [{"sense": "a result or effect that seems likely in the future", "level": "C1", "dict_examp": "What are the implications of the new regulations?", "lear_examp": "Another implication of this fashion change in Japanese society is perhaps the liberation of our spirits."}, {"sense": "a suggestion of something that you make without saying it directly", "level": "C2", "dict_examp": "The implication was that the school had to do much better or it would be closed.", "lear_examp": "In spite of that, the implication that famous sportsmen are worth paying more than other famous people, for example well-known scientists, is an over-simplification."}, {"sense": "the involvement of someone with something bad", "level": "C2", "dict_examp": "His career was ruined by his implication in the financial scandal.", "lear_examp": "I even thought that the maid could have taken it off my desk and used it as fuel for the boiler, but I checked with her and she denied any implication in the disappearance of the diary."}]}]}, {"word": "impatient", "poses": [{"pos": "adjective", "senses": [{"sense": "easily annoyed by someone's mistakes or because you have to wait", "level": "B2", "dict_examp": "He's a good teacher, but he can be impatient with slow learners.", "lear_examp": "Hours passed and she became impatient and thought he had forgotten about their date."}, {"sense": "wanting something to happen as soon as possible", "level": "B2", "dict_examp": "He's got a lot of exciting ideas and he's impatient to get started.", "lear_examp": "I'm impatient to discover this country."}]}]}, {"word": "implicit", "poses": [{"pos": "adjective", "senses": [{"sense": "suggested but not stated directly", "level": "C2", "dict_examp": "an implicit threat", "lear_examp": "There was an implicit social code, which influenced people's relationships."}]}]}, {"word": "impossible", "poses": [{"pos": "adjective", "senses": [{"sense": "If an action or event is impossible, it cannot happen or be done.", "level": "B1", "dict_examp": "It’s almost impossible to get them to agree on anything.", "lear_examp": "I tried to find it but it was impossible!"}, {"sense": "very difficult to deal with", "level": "C2", "dict_examp": "Traffic at rush hour is just impossible.", "lear_examp": "I couldn't help laughing at the impossible situation that had resulted from the combination of my personal musings by the side of this wishing-well, and the boy's very straightforward and impulsive character."}]}]}, {"word": "importance", "poses": [{"pos": "noun", "senses": [{"sense": "how important someone or something is", "level": "B1", "dict_examp": "Your views are of great importance to us.", "lear_examp": "Now I know the importance of electricity."}]}]}, {"word": "impressive", "poses": [{"pos": "adjective", "senses": [{"sense": "Someone or something that is impressive makes you admire and respect them.", "level": "B2", "dict_examp": "She's a very impressive public speaker.", "lear_examp": "I think that the Westfield Music Festival was really impressive."}]}]}, {"word": "impossibility", "poses": [{"pos": "noun", "senses": [{"sense": "when something is impossible", "level": "C2", "dict_examp": "What you're asking just can't be done - it's an impossibility.", "lear_examp": "Simple tasks like watching television or listening to music become an impossibility when every five minutes or so they get drowned in a sea of noise."}]}]}, {"word": "implementation", "poses": [{"pos": "noun", "senses": [{"sense": "the process of putting a plan or system is put into operation", "level": "C2", "dict_examp": "Implementation of the new computer system went smoothly.", "lear_examp": "I think that the development and implementation of new energy-saving technologies may contribute significantly to the prevention of further air, water and soil pollution."}]}]}, {"word": "improvement", "poses": [{"pos": "noun", "senses": [{"sense": "progress in becoming better, or when something has been made better", "level": "B1", "dict_examp": "We are seeing significant improvements in test scores.", "lear_examp": "Just twenty to thirty minutes riding every day gives you a considerable improvement in your general state of health."}, {"sense": "a change to something that makes it better", "level": "B1", "dict_examp": "home/road/transportation improvements", "lear_examp": "It is very important to make improvements to the student library in our college."}]}]}, {"word": "implement", "poses": [{"pos": "verb", "senses": [{"sense": "to make an idea, system, law, plan, etc., start to happen or operate", "level": "B2", "dict_examp": "The bill that would implement tax reforms was not passed.", "lear_examp": "Rare species protection, on the other hand, can be implemented, e.g., by means of wildlife reserves and national parks."}]}]}, {"word": "impressed", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling admiration or respect for someone or something", "level": "B2", "dict_examp": "I was impressed by her professionalism.", "lear_examp": "I am really impressed by your offer to paint me."}]}]}, {"word": "imperative", "poses": [{"pos": "noun", "senses": [{"sense": "the form of a verb which is usually used for giving orders", "level": "B2", "dict_examp": "In the phrase \"Leave him alone,\" the verb \"leave\" is an imperative/is in the imperative.", "lear_examp": ""}]}, {"pos": "adjective", "senses": [{"sense": "When an action or process is imperative, it is extremely important that it happens or is done.", "level": "C2", "dict_examp": "It is imperative (that) I speak with him at once.", "lear_examp": "It was imperative to see her father again and confront him with the truth."}]}]}, {"word": "impulse", "poses": [{"pos": "noun", "senses": [{"sense": "a sudden feeling that you must do something, without thinking about the results", "level": "C2", "dict_examp": "Her first impulse was to run away.", "lear_examp": "He is, therefore, a sort of intellectual and represents the force of reason as opposed to the violent impulses of the other boys."}, {"sense": "suddenly and without thinking first", "level": "C2", "dict_examp": "I tend to act on impulse.", "lear_examp": "I'm seeing Milly as a capricious girl who, like most teenagers, enjoys buying, although I think that she buys on impulse."}]}]}, {"word": "impulsive", "poses": [{"pos": "adjective", "senses": [{"sense": "Impulsive people do things suddenly, without planning or thinking carefully, because they want to.", "level": "C2", "dict_examp": "I thought she seemed very bright, but also impulsive and unpredictable.", "lear_examp": "On the other hand Lily is more impulsive and energetic. At the beginning she reacts better than Mui because she faces straight away the problems."}]}]}, {"word": "in", "poses": [{"pos": "preposition", "senses": [{"sense": "inside or toward the inside of a container, place or area", "level": "A1", "dict_examp": "There's milk in the refrigerator.", "lear_examp": "He works in Austria now."}, {"sense": "during part or all of a period of time", "level": "A1", "dict_examp": "We're going to Italy in April.", "lear_examp": "I like my country in March because spring is coming."}, {"sense": "needing or using no more time than a particular amount of time", "level": "A2", "dict_examp": "Can you finish the job in two weeks?", "lear_examp": "We can  finish in two days."}, {"sense": "forming a part of something", "level": "A2", "dict_examp": "He used to be the lead singer in a rock band.", "lear_examp": "My sister sings in a pop group."}, {"sense": "close to the front part of something or where someone can see or hear you", "level": "A2", "dict_examp": "He parked the car in front of the house.", "lear_examp": "We can meet in front of the museum."}, {"sense": "wearing", "level": "B1", "dict_examp": "Do you recognize that man in the grey suit?", "lear_examp": "The man has to be dressed in black."}, {"sense": "early or at the right time", "level": "B1", "dict_examp": "We arrived in time to catch the train.", "lear_examp": "If I don't come back in time you can put a note on my desk."}, {"sense": "before a particular time, or before doing a particular thing", "level": "B1", "dict_examp": "If you're going to come, please let me know in advance.", "lear_examp": "I can help you if you want to book your room in advance."}, {"sense": "used to emphasize what is really true, or to give more information", "level": "B1", "dict_examp": "We met Rebecca for lunch. In fact, we spent the whole afternoon with her.", "lear_examp": "The club has its own small clubhouse, with many things in it. For example, there was a big pinball-game and some computers.  In fact it was the best clubhouse I've ever seen."}, {"sense": "further forward than someone or something else", "level": "B1", "dict_examp": "The car in front suddenly stopped and I ran into the back of it.", "lear_examp": "As the concert finished, I heard someone call my name. I believed it was my imagination or perhaps a dream because I couldn't see anyone in front, behind or opposite me."}, {"sense": "liking someone very much and having romantic or sexual feelings for them", "level": "B1", "dict_examp": "Have you ever been in love?", "lear_examp": "I think I am in love with him."}, {"sense": "experiencing an emotion or condition", "level": "B1", "dict_examp": "She's in a bad/good mood this morning.", "lear_examp": "I hope you are in a good mood today, because we are planning to go to Cinepolis."}, {"sense": "arranged or divided in a particular way", "level": "B1", "dict_examp": "We all sat down in a circle.", "lear_examp": "We often work in groups where we can talk in English."}, {"sense": "as well (as)", "level": "B1", "dict_examp": "In addition to his flat in London, he has a villa in Italy and a castle in Scotland.", "lear_examp": "And in addition, I'm going to paint a few pictures for my room, I like painting very much!"}, {"sense": "finally, after something has been thought about or discussed a lot", "level": "B1", "dict_examp": "We were thinking about going to Switzerland, but in the end we went to Austria.", "lear_examp": "He wrote me about his plans for the future but in the end he invited me to go to France with him."}, {"sense": "including or considering all the information about something or every part of something", "level": "B1", "dict_examp": "We haven't discussed the matter in detail yet.", "lear_examp": "I'm really sorry that I didn't write back earlier, but to make up for this I will answer your questions in detail!"}, {"sense": "completely and with nothing missing", "level": "B1", "dict_examp": "The bill must be paid in full by the end of the month.", "lear_examp": "On the whole, I would like to say that the lessons together with the social events will show daily life at my school in full."}, {"sense": "beginning from now", "level": "B1", "dict_examp": "Could you be more careful in the future?", "lear_examp": "I hope to see it again and I'll be more careful in the future with my objects."}, {"sense": "usually, or in most situations", "level": "B1", "dict_examp": "In general, men are taller than women.", "lear_examp": "In general I like reading in my free time, when I have nothing to do..."}, {"sense": "crying", "level": "B1", "dict_examp": "I found him in tears in his bedroom.", "lear_examp": "By the end of it, Mary Anne was nearly in tears."}, {"sense": "with the purpose of achieving something", "level": "B1", "dict_examp": "He came home early in order to see the children before they went to bed.", "lear_examp": "She will go to the United States in order to improve her English."}, {"sense": "expressed or written in a particular way", "level": "B1", "dict_examp": "They spoke in Russian the whole time.", "lear_examp": "I also speak in English during the break."}, {"sense": "especially", "level": "B1", "dict_examp": "Are you looking for anything in particular?", "lear_examp": "I've read a lot of books recently, and in particular I liked: \"Eleven minutes\" and \"Veronica decides to die\", written by Paulo Coelho."}, {"sense": "involved or connected with a particular subject or activity", "level": "B1", "dict_examp": "a degree in philosophy", "lear_examp": "He is my age and we have the same tastes in music and art."}, {"sense": "because of a possibility of something happening, being needed, etc.", "level": "B1", "dict_examp": "I don't think I'll need any money but I'll bring some just in case.", "lear_examp": "You can't forget to bring comfortable shoes in case you have to walk long distances while you are sightseeing."}, {"sense": "when something happens, or in preparation for when something happens", "level": "B1", "dict_examp": "We keep a bucket of water backstage, in case of fire.", "lear_examp": "It is about how to rescue people in case of an accident or a natural disaster."}, {"sense": "considering the whole of someone or something, and not just a particular part of them", "level": "B2", "dict_examp": "So, apart from the bad ankle, how are you in general?", "lear_examp": "I think that I, as well as people in general, would have been more depressed if we didn't have light."}, {"sense": "to agree with or approve of a plan or idea", "level": "B2", "dict_examp": "Most people are in favor of reducing traffic in cities.", "lear_examp": "I am more in favor of longer opening hours during the week, and of shorter ones on the weekend."}, {"sense": "divided into two equal parts", "level": "B2", "dict_examp": "Cut the potatoes in two.", "lear_examp": "They were very surprised when they found the gold was cut in half."}, {"sense": "used to emphasize what is really true, or to give more information", "level": "B2", "dict_examp": "I thought she was Portuguese, but in actual fact she's Brazilian.", "lear_examp": "Nowadays almost all people own a car and in actual fact more and more people have been facing death as a consequence of careless driving."}, {"sense": "used to give another reason for something you are saying, or that you have done", "level": "B2", "dict_examp": "I don't want to go and in any case, I haven't been invited.", "lear_examp": "In any case I will meet you at the opening party at the end of the month."}, {"sense": "because of the mentioned situation", "level": "B2", "dict_examp": "There's no coffee left? In that case I'll have tea.", "lear_examp": "You could try kayaking. In that case, of course, you need to pay for the equipment."}, {"sense": "used to show the total amount of something", "level": "B2", "dict_examp": "Some of the children came, so there were 15 of us in all.", "lear_examp": "Secondly, even though most people liked the group RADIANT, they only played for 35 minutes in all."}, {"sense": "used when referring to something that is done as a result of something else", "level": "B2", "dict_examp": "I'd like to do something for you in return/exchange for everything you've done for me.", "lear_examp": "I am writing to you in response to your advertisement of 1st December in the Times."}, {"sense": "using only a few words", "level": "B2", "dict_examp": "world news in brief", "lear_examp": "Now I will tell you in brief what exactly happened to me."}, {"sense": "in someone's opinion", "level": "B2", "dict_examp": "In my parents' eyes, I'll always be a child.", "lear_examp": "To answer your question right away, the boat trip is highly recommendable in my eyes!"}, {"sense": "used to introduce the last part of a speech or a piece of writing", "level": "B2", "dict_examp": "In conclusion, I would like to thank our guest speaker for her fascinating talk.", "lear_examp": "In conclusion, music, TV and clothes are very important in a young person's life and can reflect each person's character."}, {"sense": "used to say what something is about", "level": "B2", "dict_examp": "I am writing in connection with the above job advertised in The Daily Press on Monday 12th February.", "lear_examp": "Dear Mrs Brown, I am writing in connection with a surprise birthday party for your husband, Mr Brown."}, {"sense": "at a suitable time in the future", "level": "B2", "dict_examp": "The results will be sent to you in due course.", "lear_examp": "I look forward to hearing from you in due course."}, {"sense": "toward someone", "level": "B2", "dict_examp": "She keeps looking in my direction.", "lear_examp": "I didn't know why she was talking to me but suddenly she walked in my direction and told me: \"I need to know your name\"."}, {"sense": "used to explain what something means in a different way", "level": "B2", "dict_examp": "He said he's too busy - in other words he isn't interested.", "lear_examp": "They had had a great time before and had drunk too much alcohol. In other words, they were totally drunk."}, {"sense": "An agreement that is in writing is official and is proof of that agreement.", "level": "B2", "dict_examp": "Please confirm your reservation in writing.", "lear_examp": "I am telling you in writing that I would like to help you."}, {"sense": "if vegetables or fruit are in season, they are available and ready to eat.", "level": "B2", "dict_examp": "Asparagus is in season at the moment.", "lear_examp": "They celebrate Halloween in October when pumpkins are in season, that's why in the decorations they include them very often; most of the people carve the pumpkins and put some lights inside."}, {"sense": "without telling other people", "level": "B2", "dict_examp": "For years they met in secret.", "lear_examp": "We met in secret when Mary was busy."}, {"sense": "feeling good/excited/unhappy, etc.", "level": "B2", "dict_examp": "The whole class was in good spirits that day.", "lear_examp": "I was in high spirits until I got my paper back."}, {"sense": "because of", "level": "B2", "dict_examp": "In view of recent events, we have decided to cancel the meeting.", "lear_examp": "In view of what happened, I would advise you not to try to mislead people like this again."}, {"sense": "in order to celebrate or show great respect for someone or something", "level": "B2", "dict_examp": "a banquet in honor of the president", "lear_examp": "Besides, if you come these days you will see the local fiesta at which the local people celebrate special events in honor of our saints."}, {"sense": "If you do something in person, you go somewhere to do it yourself.", "level": "B2", "dict_examp": "You have to collect the document in person.", "lear_examp": "I am looking forward to meeting you in person."}, {"sense": "instead of something", "level": "B2", "dict_examp": "Try adding fruit to your cereal in place of sugar.", "lear_examp": "In the advertisement, it said that Danny Brook was starring, but in place of him there was a different actor and he was really disappointing."}, {"sense": "at the start of a situation", "level": "B2", "dict_examp": "Why did you invite her in the first place?", "lear_examp": "In the first place, you were unknown people for me, but now you are my special foreign friends."}, {"sense": "If something is true in practice, this is the real situation.", "level": "B2", "dict_examp": "In practice, the new laws have had little effect.", "lear_examp": "When you leave school, you have knowledge but you do not know how to use it in practice."}, {"sense": "in a place where nobody else can hear you or see what you are doing", "level": "B2", "dict_examp": "The meeting was held in private.", "lear_examp": "I agree that this should be in private."}, {"sense": "happening or being done now", "level": "B2", "dict_examp": "Repair work is in progress on the south-bound lane of the motorway and will continue until June.", "lear_examp": "In the lower part of your advertisement, it also said there was a theatre restaurant, but in fact, it was closed because internal decoration was in progress."}, {"sense": "when compared with something", "level": "B2", "dict_examp": "Salaries are low in relation to the cost of living.", "lear_examp": "I think television has several advantages but also disadvantages in relation to books."}, {"sense": "about or relating to something", "level": "B2", "dict_examp": "I'd like to ask you something in relation to what you said earlier.", "lear_examp": "In relation to last month's social program, the sightseeing tour of London was divine, although we didn't get to see the entire city."}, {"sense": "in a particular way, or in many ways", "level": "B2", "dict_examp": "The school has changed in many respects.", "lear_examp": "How's your friend Mike? He is in many respects better than a computer, isn't he? (Teasing you again, sorry)."}, {"sense": "as an answer to", "level": "B2", "dict_examp": "I'm writing in response to your letter of February 14.", "lear_examp": "I am writing in response to your advertisement, which appeared in the newspaper on November the 23rd, looking for a person to work at weekends in your cafe."}, {"sense": "one after another without a break", "level": "B2", "dict_examp": "He's just won the tournament for the fifth year in a row.", "lear_examp": "Maradona was the captain of the team, and since he arrived, the team won three championships in a row."}, {"sense": "available in a store or other place", "level": "B2", "dict_examp": "Do you have the book in stock?", "lear_examp": "Shopping could be annoying if you look at it as a waste of time because you do it every day.  Reorganize your behavior when shopping and plan to keep food in stock!"}, {"sense": "in the way described by a rule, law, or wish", "level": "C1", "dict_examp": "Both companies have insisted that they were acting in accordance with the law.", "lear_examp": "Although they do not earn much money in this profession, they try to do their best and judge in accordance with the law which they also have to interpret."}, {"sense": "working together with", "level": "C1", "dict_examp": "The event was organized in association with the Student Council.", "lear_examp": "This service, which will be provided in association with Foster Loft, will be available at the end of 2005."}, {"sense": "in large amounts", "level": "C1", "dict_examp": "to buy in bulk", "lear_examp": "I suggest that you buy food in bulk so that you not only save money but also save time."}, {"sense": "if something happens", "level": "C1", "dict_examp": "An airbag could save your life in the event of an accident.", "lear_examp": "In the event of bad weather, it would be wise to plan an alternative to the boat trip, for example a visit of Buckingham Palace or the Houses of Parliament."}, {"sense": "whatever happens", "level": "C1", "dict_examp": "I'm not sure if I'm coming on Friday, but in any event, I'll see you next week.", "lear_examp": "In any event, it is incumbent upon all of us to carefully plan our travel matters, so as to take advantage of their several benefits."}, {"sense": "the particular way in which something appears or exists", "level": "C1", "dict_examp": "The novel is written in the form of a series of letters.", "lear_examp": "For all this, I can only say that I want my money back immediately, or some compensation in the form of a real trip to a real country."}, {"sense": "used to say what you really feel or think", "level": "C1", "dict_examp": "In his heart, he knew she was right.", "lear_examp": "I have to admit that it was only a sensible decision, because deep in my heart I knew I wanted to learn English."}, {"sense": "because you want something good to happen", "level": "C1", "dict_examp": "She went to Paris in the hope of improving her French.", "lear_examp": "Dear Dave Bennington, I am writing to you in the hope that you will attend our next event in July."}, {"sense": "to help someone and give them an advantage", "level": "C1", "dict_examp": "It may not be in your interest to change jobs so soon.", "lear_examp": "It is in my interests to meet new people and I find it easy to go and talk to people I do not know."}, {"sense": "If something is done or happens in the light of facts, it is done or happens because of those facts.", "level": "C1", "dict_examp": "In  light of                     the problems we’re having, we have no choice but to close the business.", "lear_examp": "In light of all the things mentioned above, I strongly recommend Alexandra for the job."}, {"sense": "to be lucky or to be able to have or do what you want", "level": "C1", "dict_examp": "\"Do you have any tuna sandwiches?\" \"You're in luck - there's one left.\"", "lear_examp": "I was in luck, because my friend, who lived in the same area, had his private car and gave me a lift every day."}, {"sense": "If you do something in moderation, you do not do it too much.", "level": "C1", "dict_examp": "I only drink alcohol in moderation.", "lear_examp": "While shopping can make one feel good and even has its positive impact on the retail economy, I think it should be done in moderation."}, {"sense": "something that you say when you are describing something using as few words as possible", "level": "C1", "dict_examp": "The answer, in a nutshell, is yes.", "lear_examp": "To put it in a nutshell, they all provide good food at reasonable prices."}, {"sense": "approximately", "level": "C1", "dict_examp": "It probably cost somewhere in the region of £900.", "lear_examp": "I am willing to pay rent in the region of £1000 to £1200 monthly."}, {"sense": "ready to be used if or when you need it", "level": "C1", "dict_examp": "She keeps a little money in reserve.", "lear_examp": "It would be an idea to have some activity in reserve if you have to cancel something, such as the boat trip on the Thames."}, {"sense": "very soon", "level": "C1", "dict_examp": "We'll be home in no time.", "lear_examp": "Team work is very important for us and you will make many friends in no time."}, {"sense": "singing or playing the right notes", "level": "C1", "dict_examp": "Try to stay in tune.", "lear_examp": "The public was singing in tune with Jag, hands were raised and bodies were slowly swaying."}, {"sense": "as a result of something that is part of a series of events", "level": "C1", "dict_examp": "This could result in the loss of certain species of fish and this in turn poses a serious threat to the fishing communities along the river banks.", "lear_examp": "This, in turn, enabled them to find jobs and become financially independent from their husbands."}, {"sense": "one after the other in an agreed order", "level": "C1", "dict_examp": "She spoke to each of the guests in turn.", "lear_examp": "We had two different teachers in the mornings and in the afternoons, in turn."}, {"sense": "without any success", "level": "C1", "dict_examp": "I tried in vain to start a conversation.", "lear_examp": "We looked in vain for the guide through three London parks."}, {"sense": "not at all", "level": "C1", "dict_examp": "This is in no way your fault.", "lear_examp": "This magazine will be loved by students as it will help them learn English in the best way and in no way will students find it boring."}, {"sense": "being cared for or dealt with by someone skilled", "level": "C1", "dict_examp": "The project is in safe hands - Jan has lots of experience.", "lear_examp": "He has also been trained as a lifeguard so the residents of your hotel would probably be in safe hands."}, {"sense": "similarly", "level": "C1", "dict_examp": "In the same way, there are many citizens who feel unprotected by the police.", "lear_examp": "In the same way, grandmothers may be shocked when seeing their little children wearing extravagant clothes or really short skirts."}, {"sense": "thinking about something in a particular way", "level": "C1", "dict_examp": "In a sense, he's right.", "lear_examp": "In a sense this is correct, since you have to leave your natural environment to visit a place where no human being is meant to survive."}, {"sense": "in a few words", "level": "C1", "dict_examp": "In short, we need more staff.", "lear_examp": "In short, ancient Chinese poems, mainly from the Jang Dynasty, constitute the background for Chinese culture and set a touchstone for judgement in our life."}, {"sense": "going to happen soon", "level": "C1", "dict_examp": "You never know what's in store for you.", "lear_examp": "Nobody knows what the future will have in store!"}, {"sense": "expecting something to happen or in preparation for something happening", "level": "C2", "dict_examp": "She's even decorated the spare room in anticipation of your visit.", "lear_examp": "This has sometimes resulted in the comic phenomenon of people traveling to a distant country, in anticipation of encountering strange and original lifestyles, only to come across situations not very different from the one they have left in their own countries."}, {"sense": "present at an event", "level": "C2", "dict_examp": "They have doctors in attendance at every match.", "lear_examp": "Professional coaches are in attendance and the members can have proper lessons."}, {"sense": "to feel great respect for and sometimes fear of someone", "level": "C2", "dict_examp": "As children we were rather in awe of our grandfather.", "lear_examp": "As I was the eldest of the siblings, they used to respect all my orders and even now, they are a bit in awe of me."}, {"sense": "as well as everything else", "level": "C2", "dict_examp": "Caffeine has no good effects on health and is mildly addictive in the bargain.", "lear_examp": "More or less few people are, in the bargain, prepared to adapt themselves to the others in order to be accepted."}, {"sense": "extremely quickly", "level": "C2", "dict_examp": "In the blink of an eye, he was gone.", "lear_examp": "I got dressed in the blink of an eye and I got down to the kitchen almost rolling down the stairs."}, {"sense": "to be in the same unpleasant situation as other people", "level": "C2", "dict_examp": "She complains that she doesn't have enough money, but we're all in the same boat.", "lear_examp": "Unemployment and its consequences is still a major problem. Now we are in the same boat."}, {"sense": "not knowing about something because other people are not telling you", "level": "C2", "dict_examp": "They kept us in the dark about their plans.", "lear_examp": "Peter had always kept her in the dark about the reason for their fight."}, {"sense": "wanted or needed in large numbers", "level": "C2", "dict_examp": "Good teachers are always in demand.", "lear_examp": "Many goods are not in demand because each family produces its own goods."}, {"sense": "used to say what the real situation is", "level": "C2", "dict_examp": "This means, in effect, that the plan has been scrapped.", "lear_examp": "However, if the government increases the amount of money they pay to the unemployed, that in effect means higher taxes for the citizens which will cause strikes and various other problems."}, {"sense": "used to emphasize the most important idea or quality of something", "level": "C2", "dict_examp": "In essence, its purpose is to contain information.", "lear_examp": "In essence, homelessness means that you don't have a home and because of this you are living on the streets."}, {"sense": "while having to deal with a difficult situation or problem", "level": "C2", "dict_examp": "They left home in the face of strong opposition from their families.", "lear_examp": "No doubt, it was rather difficult to like Enid X. She was hardly likely to arouse sympathy in anybody even in the face of death."}, {"sense": "in a difficult situation that causes you trouble or problems", "level": "C2", "dict_examp": "He’s in a fix and needs our help.", "lear_examp": "She felt happy when I was down in the dumps or in a fix and kept on being jealous of me concerning trivial matters."}, {"sense": "immediately, or very quickly", "level": "C2", "dict_examp": "I'll be back in a flash.", "lear_examp": "He took it and, in a flash, he came up to the surface."}, {"sense": "If a law, rule, etc. is in force, it exists and is being used.", "level": "C2", "dict_examp": "New regulations limiting fishing on this river are now in force.", "lear_examp": "Because the measures are only in Patra they are not very powerful because it isn't an official law so that it is always in force."}, {"sense": "being worked on or dealt with now", "level": "C2", "dict_examp": "Don't worry – we have the situation  in hand.", "lear_examp": "Miss Kenton keeps asking Stevens whether everything is in hand and whether her help is required."}, {"sense": "used to give your opinion about something, often when you are sure you are right", "level": "C2", "dict_examp": "In my humble opinion, that's the wrong decision.", "lear_examp": "In my humble opinion, there's no such thing as a uniform celebrity, good, bad or otherwise."}, {"sense": "Something that is in its infancy has only just begun to develop.", "level": "C2", "dict_examp": "In the 1950s, space travel was in its infancy.", "lear_examp": ""}, {"sense": "in order to achieve a particular situation or quality", "level": "C2", "dict_examp": "In the interest of safety, passengers are advised to wear their seat belts at all times.", "lear_examp": "First of all, do make sure that the front door is always locked. In the interests of everybody's security, it is essential to remember this."}, {"sense": "alone, or separately from other people, places, or things", "level": "C2", "dict_examp": "These poems cannot be considered in isolation.", "lear_examp": "In conclusion, it is my opinion that the problem of parking space cannot be solved in isolation."}, {"sense": "almost certainly", "level": "C2", "dict_examp": "The facilities are wasted on people who in all likelihood will not use them.", "lear_examp": "In all likelihood, you will have to work during the weekends, even in summer, so I firmly believe that loving your job is very important."}, {"sense": "to be similar to and suitable for something", "level": "C2", "dict_examp": "They were offered a pay increase in line with inflation.", "lear_examp": "The other two courses, at 5%, are still in line with the national average."}, {"sense": "If you do something in memory of a dead person, you do it to show your respect or love for them.", "level": "C2", "dict_examp": "They built a statue in memory of those who died in the fire.", "lear_examp": "You see, every year our family performs a certain gathering in memory of my brother who was killed in a plane crash in 1991 known as the C130 disaster."}, {"sense": "in your imagination or memory", "level": "C2", "dict_examp": "In my mind's eye, I imagined the building painted white, with a beautiful garden around it.", "lear_examp": "He sees her in his mind's eye, running around barefoot, laughing and squealing, wading in the water and running back out, screaming, trying to get away from the breaking waves."}, {"sense": "If something is in miniature, it is a very small copy of something else.", "level": "C2", "dict_examp": "a model of the ship in miniature", "lear_examp": "Thirdly a co-educational school is a society in miniature and it has many practical advantages."}, {"sense": "If bad things are done in the name of something, they are done in order to help that thing succeed.", "level": "C2", "dict_examp": "Are you willing to work yourself to death in the name of competition?", "lear_examp": "There are things one cannot trifle with: friendship for example should not be sacrificed in the name of success."}, {"sense": "combined into a single thing", "level": "C2", "dict_examp": "It's a vacation and art course all in one.", "lear_examp": "The Internet is like combining a television, a telephone and an airplane all in one."}, {"sense": "partly", "level": "C2", "dict_examp": "He is in part to blame for the accident.", "lear_examp": "Technology is in part to blame."}, {"sense": "when things are in perspective, you think about them in a sensible and  realistic way, and understand how important or unimportant they really are", "level": "C2", "dict_examp": "You must keep things in perspective - the overall situation isn't really that bad.", "lear_examp": "I think it will enable me to see things more in perspective."}, {"sense": "in the correct position", "level": "C2", "dict_examp": "The chairs are all in place.", "lear_examp": "I looked neat and clean even after the wildest games in the school yard, with all the ribbons that tied my long hair in place."}, {"sense": "If a rule, system, etc. is in place, it has started to exist.", "level": "C2", "dict_examp": "There are now laws in place to prevent this from happening.", "lear_examp": "Let's take the example of Mexico City, where such restrictions have been in place since early 2000."}, {"sense": "used to mean that something is very likely", "level": "C2", "dict_examp": "She will, in all probability, have left before we arrive.", "lear_examp": "Anybody who can fulfill the above conditions will in all probability be successful."}, {"sense": "If something changes in proportion to another thing, it changes to the same degree as that thing.", "level": "C2", "dict_examp": "Your tax payment increases in proportion to your salary.", "lear_examp": "One aspect of the question is the fact that a sportsman's salary is supposedly not in proportion to the number of hours he works."}, {"sense": "the person or thing that is being discussed", "level": "C2", "dict_examp": "He sais that he was at a restaurant with his friends on the night in question.", "lear_examp": "While this is not necessarily false, it should be borne in mind that the events in question are by no means boring or uninteresting."}, {"sense": "thinking back to something that happened  before", "level": "C2", "dict_examp": "In retrospect, I should probably have told her.", "lear_examp": "To cut a long story short I decided to go, though half-heartedly as I still had doubts about it. In retrospect, it turned out to be an unforgettable experience."}, {"sense": "in a bad situation where you do the same things all the time, or where it is impossible to make progress", "level": "C2", "dict_examp": "He seems to be stuck in a rut at the moment.", "lear_examp": "Financial security, all the, let me call them, background benefits are important, but if you do not love what you do, soon you will become bitter, stuck in a rut or worse - you will suffer from depression."}, {"sense": "to be acceptable in a way that will not upset or anger people", "level": "C2", "dict_examp": "His speech was in good taste.", "lear_examp": "I therefore thought that it would be in good taste to write about two of them."}, {"sense": "to be unacceptable in a way that will upset or anger people", "level": "C2", "dict_examp": "He told a joke about a plane crash which I thought was in rather poor taste.", "lear_examp": ""}, {"sense": "in a direct and often angry way", "level": "C2", "dict_examp": "I told him to go away in no uncertain terms.", "lear_examp": "Intellectuals are used to saying in no uncertain terms that money represents the bad side of the sport."}, {"sense": "to understand what someone wants or needs or to understand a situation and act in a way that is suitable for it", "level": "C2", "dict_examp": "The congress is not in tune with the voters.", "lear_examp": "I am not exactly in tune with all the latest trends but I know which styles give me the most satisfaction."}, {"sense": "in the area near a place", "level": "C2", "dict_examp": "A number of buildings in the vicinity of the fire were damaged.", "lear_examp": "Just to briefly introduce myself, my name is Prashant Sharma and I live in the vicinity of the college campus."}, {"sense": "used to say that someone or something does something to a large degree", "level": "C2", "dict_examp": "They celebrate birthdays in a big way.", "lear_examp": "Tourism helps Greece's national economy - which is not at its best - in a big way."}, {"sense": "to be likely to happen", "level": "C2", "dict_examp": "Do you think marriage is in the cards?", "lear_examp": ""}, {"sense": "not in a difficult situation or having problems any more", "level": "C2", "dict_examp": "We had some large debts, but we should be in the clear by next year.", "lear_examp": "\"You're in the clear, you don't have to be afraid any more,\" it said."}, {"sense": "in a cruel way, without showing any emotion", "level": "C2", "dict_examp": "He shot three policemen in cold blood.", "lear_examp": "Returning to the story, when I arrived, I went directly to Hillton Avenue where I should have met 005, but when I arrived at the meeting point I found him lying on the floor with two shots in his back; he had been murdered in cold blood."}, {"sense": "If you tell something to someone in confidence, you do not want them to tell anyone else.", "level": "C2", "dict_examp": "I'm sorry, she told me that in confidence.", "lear_examp": "His real name isn't Piggy but he told Ralph in confidence that they called him that in school because of his appearance."}, {"sense": "working, used, or happening with something or someone else", "level": "C2", "dict_examp": "Our librarians use their knowledge in conjunction with the computer network.", "lear_examp": "Therefore if the banning of private cars takes place in conjunction with development in the public transportation system in that city, this whole development will have more advantages despite some slight difficulties at the start."}, {"sense": "because of or for this reason", "level": "C2", "dict_examp": "This course is good in that it provides a very practical training.", "lear_examp": "Nowadays it is widely argued that professional sports are damaging to people's health in that they involve grueling training sessions as an integral part of the occupation."}]}, {"pos": "adverb", "senses": [{"sense": "into an area or space from the outside of it", "level": "A2", "dict_examp": "Could you bring the clothes in for me?", "lear_examp": "First I brought in the big cake that my father had bought."}, {"sense": "at the place where a person usually lives or works", "level": "B1", "dict_examp": "Mr Ellis isn't in this week.", "lear_examp": "We go in at 8:15."}, {"sense": "having arrived at the place where people can get on or off", "level": "B1", "dict_examp": "What time is Roz's flight due in?", "lear_examp": ""}, {"sense": "given or sent to someone official in order to be read", "level": "B2", "dict_examp": "When does your essay have to be in?", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the details of a particular subject", "level": "C2", "dict_examp": "the ins and outs of the legal system", "lear_examp": "I knew all the ins and outs of every story but I couldn't stay one single day in bed without reading it."}]}]}, {"word": "in", "poses": [{"pos": "preposition", "senses": [{"sense": "inside or toward the inside of a container, place or area", "level": "A1", "dict_examp": "There's milk in the refrigerator.", "lear_examp": "He works in Austria now."}, {"sense": "during part or all of a period of time", "level": "A1", "dict_examp": "We're going to Italy in April.", "lear_examp": "I like my country in March because spring is coming."}, {"sense": "needing or using no more time than a particular amount of time", "level": "A2", "dict_examp": "Can you finish the job in two weeks?", "lear_examp": "We can  finish in two days."}, {"sense": "forming a part of something", "level": "A2", "dict_examp": "He used to be the lead singer in a rock band.", "lear_examp": "My sister sings in a pop group."}, {"sense": "close to the front part of something or where someone can see or hear you", "level": "A2", "dict_examp": "He parked the car in front of the house.", "lear_examp": "We can meet in front of the museum."}, {"sense": "wearing", "level": "B1", "dict_examp": "Do you recognize that man in the grey suit?", "lear_examp": "The man has to be dressed in black."}, {"sense": "early or at the right time", "level": "B1", "dict_examp": "We arrived in time to catch the train.", "lear_examp": "If I don't come back in time you can put a note on my desk."}, {"sense": "before a particular time, or before doing a particular thing", "level": "B1", "dict_examp": "If you're going to come, please let me know in advance.", "lear_examp": "I can help you if you want to book your room in advance."}, {"sense": "used to emphasize what is really true, or to give more information", "level": "B1", "dict_examp": "We met Rebecca for lunch. In fact, we spent the whole afternoon with her.", "lear_examp": "The club has its own small clubhouse, with many things in it. For example, there was a big pinball-game and some computers.  In fact it was the best clubhouse I've ever seen."}, {"sense": "further forward than someone or something else", "level": "B1", "dict_examp": "The car in front suddenly stopped and I ran into the back of it.", "lear_examp": "As the concert finished, I heard someone call my name. I believed it was my imagination or perhaps a dream because I couldn't see anyone in front, behind or opposite me."}, {"sense": "liking someone very much and having romantic or sexual feelings for them", "level": "B1", "dict_examp": "Have you ever been in love?", "lear_examp": "I think I am in love with him."}, {"sense": "experiencing an emotion or condition", "level": "B1", "dict_examp": "She's in a bad/good mood this morning.", "lear_examp": "I hope you are in a good mood today, because we are planning to go to Cinepolis."}, {"sense": "arranged or divided in a particular way", "level": "B1", "dict_examp": "We all sat down in a circle.", "lear_examp": "We often work in groups where we can talk in English."}, {"sense": "as well (as)", "level": "B1", "dict_examp": "In addition to his flat in London, he has a villa in Italy and a castle in Scotland.", "lear_examp": "And in addition, I'm going to paint a few pictures for my room, I like painting very much!"}, {"sense": "finally, after something has been thought about or discussed a lot", "level": "B1", "dict_examp": "We were thinking about going to Switzerland, but in the end we went to Austria.", "lear_examp": "He wrote me about his plans for the future but in the end he invited me to go to France with him."}, {"sense": "including or considering all the information about something or every part of something", "level": "B1", "dict_examp": "We haven't discussed the matter in detail yet.", "lear_examp": "I'm really sorry that I didn't write back earlier, but to make up for this I will answer your questions in detail!"}, {"sense": "completely and with nothing missing", "level": "B1", "dict_examp": "The bill must be paid in full by the end of the month.", "lear_examp": "On the whole, I would like to say that the lessons together with the social events will show daily life at my school in full."}, {"sense": "beginning from now", "level": "B1", "dict_examp": "Could you be more careful in the future?", "lear_examp": "I hope to see it again and I'll be more careful in the future with my objects."}, {"sense": "usually, or in most situations", "level": "B1", "dict_examp": "In general, men are taller than women.", "lear_examp": "In general I like reading in my free time, when I have nothing to do..."}, {"sense": "crying", "level": "B1", "dict_examp": "I found him in tears in his bedroom.", "lear_examp": "By the end of it, Mary Anne was nearly in tears."}, {"sense": "with the purpose of achieving something", "level": "B1", "dict_examp": "He came home early in order to see the children before they went to bed.", "lear_examp": "She will go to the United States in order to improve her English."}, {"sense": "expressed or written in a particular way", "level": "B1", "dict_examp": "They spoke in Russian the whole time.", "lear_examp": "I also speak in English during the break."}, {"sense": "especially", "level": "B1", "dict_examp": "Are you looking for anything in particular?", "lear_examp": "I've read a lot of books recently, and in particular I liked: \"Eleven minutes\" and \"Veronica decides to die\", written by Paulo Coelho."}, {"sense": "involved or connected with a particular subject or activity", "level": "B1", "dict_examp": "a degree in philosophy", "lear_examp": "He is my age and we have the same tastes in music and art."}, {"sense": "because of a possibility of something happening, being needed, etc.", "level": "B1", "dict_examp": "I don't think I'll need any money but I'll bring some just in case.", "lear_examp": "You can't forget to bring comfortable shoes in case you have to walk long distances while you are sightseeing."}, {"sense": "when something happens, or in preparation for when something happens", "level": "B1", "dict_examp": "We keep a bucket of water backstage, in case of fire.", "lear_examp": "It is about how to rescue people in case of an accident or a natural disaster."}, {"sense": "considering the whole of someone or something, and not just a particular part of them", "level": "B2", "dict_examp": "So, apart from the bad ankle, how are you in general?", "lear_examp": "I think that I, as well as people in general, would have been more depressed if we didn't have light."}, {"sense": "to agree with or approve of a plan or idea", "level": "B2", "dict_examp": "Most people are in favor of reducing traffic in cities.", "lear_examp": "I am more in favor of longer opening hours during the week, and of shorter ones on the weekend."}, {"sense": "divided into two equal parts", "level": "B2", "dict_examp": "Cut the potatoes in two.", "lear_examp": "They were very surprised when they found the gold was cut in half."}, {"sense": "used to emphasize what is really true, or to give more information", "level": "B2", "dict_examp": "I thought she was Portuguese, but in actual fact she's Brazilian.", "lear_examp": "Nowadays almost all people own a car and in actual fact more and more people have been facing death as a consequence of careless driving."}, {"sense": "used to give another reason for something you are saying, or that you have done", "level": "B2", "dict_examp": "I don't want to go and in any case, I haven't been invited.", "lear_examp": "In any case I will meet you at the opening party at the end of the month."}, {"sense": "because of the mentioned situation", "level": "B2", "dict_examp": "There's no coffee left? In that case I'll have tea.", "lear_examp": "You could try kayaking. In that case, of course, you need to pay for the equipment."}, {"sense": "used to show the total amount of something", "level": "B2", "dict_examp": "Some of the children came, so there were 15 of us in all.", "lear_examp": "Secondly, even though most people liked the group RADIANT, they only played for 35 minutes in all."}, {"sense": "used when referring to something that is done as a result of something else", "level": "B2", "dict_examp": "I'd like to do something for you in return/exchange for everything you've done for me.", "lear_examp": "I am writing to you in response to your advertisement of 1st December in the Times."}, {"sense": "using only a few words", "level": "B2", "dict_examp": "world news in brief", "lear_examp": "Now I will tell you in brief what exactly happened to me."}, {"sense": "in someone's opinion", "level": "B2", "dict_examp": "In my parents' eyes, I'll always be a child.", "lear_examp": "To answer your question right away, the boat trip is highly recommendable in my eyes!"}, {"sense": "used to introduce the last part of a speech or a piece of writing", "level": "B2", "dict_examp": "In conclusion, I would like to thank our guest speaker for her fascinating talk.", "lear_examp": "In conclusion, music, TV and clothes are very important in a young person's life and can reflect each person's character."}, {"sense": "used to say what something is about", "level": "B2", "dict_examp": "I am writing in connection with the above job advertised in The Daily Press on Monday 12th February.", "lear_examp": "Dear Mrs Brown, I am writing in connection with a surprise birthday party for your husband, Mr Brown."}, {"sense": "at a suitable time in the future", "level": "B2", "dict_examp": "The results will be sent to you in due course.", "lear_examp": "I look forward to hearing from you in due course."}, {"sense": "toward someone", "level": "B2", "dict_examp": "She keeps looking in my direction.", "lear_examp": "I didn't know why she was talking to me but suddenly she walked in my direction and told me: \"I need to know your name\"."}, {"sense": "used to explain what something means in a different way", "level": "B2", "dict_examp": "He said he's too busy - in other words he isn't interested.", "lear_examp": "They had had a great time before and had drunk too much alcohol. In other words, they were totally drunk."}, {"sense": "An agreement that is in writing is official and is proof of that agreement.", "level": "B2", "dict_examp": "Please confirm your reservation in writing.", "lear_examp": "I am telling you in writing that I would like to help you."}, {"sense": "if vegetables or fruit are in season, they are available and ready to eat.", "level": "B2", "dict_examp": "Asparagus is in season at the moment.", "lear_examp": "They celebrate Halloween in October when pumpkins are in season, that's why in the decorations they include them very often; most of the people carve the pumpkins and put some lights inside."}, {"sense": "without telling other people", "level": "B2", "dict_examp": "For years they met in secret.", "lear_examp": "We met in secret when Mary was busy."}, {"sense": "feeling good/excited/unhappy, etc.", "level": "B2", "dict_examp": "The whole class was in good spirits that day.", "lear_examp": "I was in high spirits until I got my paper back."}, {"sense": "because of", "level": "B2", "dict_examp": "In view of recent events, we have decided to cancel the meeting.", "lear_examp": "In view of what happened, I would advise you not to try to mislead people like this again."}, {"sense": "in order to celebrate or show great respect for someone or something", "level": "B2", "dict_examp": "a banquet in honor of the president", "lear_examp": "Besides, if you come these days you will see the local fiesta at which the local people celebrate special events in honor of our saints."}, {"sense": "If you do something in person, you go somewhere to do it yourself.", "level": "B2", "dict_examp": "You have to collect the document in person.", "lear_examp": "I am looking forward to meeting you in person."}, {"sense": "instead of something", "level": "B2", "dict_examp": "Try adding fruit to your cereal in place of sugar.", "lear_examp": "In the advertisement, it said that Danny Brook was starring, but in place of him there was a different actor and he was really disappointing."}, {"sense": "at the start of a situation", "level": "B2", "dict_examp": "Why did you invite her in the first place?", "lear_examp": "In the first place, you were unknown people for me, but now you are my special foreign friends."}, {"sense": "If something is true in practice, this is the real situation.", "level": "B2", "dict_examp": "In practice, the new laws have had little effect.", "lear_examp": "When you leave school, you have knowledge but you do not know how to use it in practice."}, {"sense": "in a place where nobody else can hear you or see what you are doing", "level": "B2", "dict_examp": "The meeting was held in private.", "lear_examp": "I agree that this should be in private."}, {"sense": "happening or being done now", "level": "B2", "dict_examp": "Repair work is in progress on the south-bound lane of the motorway and will continue until June.", "lear_examp": "In the lower part of your advertisement, it also said there was a theatre restaurant, but in fact, it was closed because internal decoration was in progress."}, {"sense": "when compared with something", "level": "B2", "dict_examp": "Salaries are low in relation to the cost of living.", "lear_examp": "I think television has several advantages but also disadvantages in relation to books."}, {"sense": "about or relating to something", "level": "B2", "dict_examp": "I'd like to ask you something in relation to what you said earlier.", "lear_examp": "In relation to last month's social program, the sightseeing tour of London was divine, although we didn't get to see the entire city."}, {"sense": "in a particular way, or in many ways", "level": "B2", "dict_examp": "The school has changed in many respects.", "lear_examp": "How's your friend Mike? He is in many respects better than a computer, isn't he? (Teasing you again, sorry)."}, {"sense": "as an answer to", "level": "B2", "dict_examp": "I'm writing in response to your letter of February 14.", "lear_examp": "I am writing in response to your advertisement, which appeared in the newspaper on November the 23rd, looking for a person to work at weekends in your cafe."}, {"sense": "one after another without a break", "level": "B2", "dict_examp": "He's just won the tournament for the fifth year in a row.", "lear_examp": "Maradona was the captain of the team, and since he arrived, the team won three championships in a row."}, {"sense": "available in a store or other place", "level": "B2", "dict_examp": "Do you have the book in stock?", "lear_examp": "Shopping could be annoying if you look at it as a waste of time because you do it every day.  Reorganize your behavior when shopping and plan to keep food in stock!"}, {"sense": "in the way described by a rule, law, or wish", "level": "C1", "dict_examp": "Both companies have insisted that they were acting in accordance with the law.", "lear_examp": "Although they do not earn much money in this profession, they try to do their best and judge in accordance with the law which they also have to interpret."}, {"sense": "working together with", "level": "C1", "dict_examp": "The event was organized in association with the Student Council.", "lear_examp": "This service, which will be provided in association with Foster Loft, will be available at the end of 2005."}, {"sense": "in large amounts", "level": "C1", "dict_examp": "to buy in bulk", "lear_examp": "I suggest that you buy food in bulk so that you not only save money but also save time."}, {"sense": "if something happens", "level": "C1", "dict_examp": "An airbag could save your life in the event of an accident.", "lear_examp": "In the event of bad weather, it would be wise to plan an alternative to the boat trip, for example a visit of Buckingham Palace or the Houses of Parliament."}, {"sense": "whatever happens", "level": "C1", "dict_examp": "I'm not sure if I'm coming on Friday, but in any event, I'll see you next week.", "lear_examp": "In any event, it is incumbent upon all of us to carefully plan our travel matters, so as to take advantage of their several benefits."}, {"sense": "the particular way in which something appears or exists", "level": "C1", "dict_examp": "The novel is written in the form of a series of letters.", "lear_examp": "For all this, I can only say that I want my money back immediately, or some compensation in the form of a real trip to a real country."}, {"sense": "used to say what you really feel or think", "level": "C1", "dict_examp": "In his heart, he knew she was right.", "lear_examp": "I have to admit that it was only a sensible decision, because deep in my heart I knew I wanted to learn English."}, {"sense": "because you want something good to happen", "level": "C1", "dict_examp": "She went to Paris in the hope of improving her French.", "lear_examp": "Dear Dave Bennington, I am writing to you in the hope that you will attend our next event in July."}, {"sense": "to help someone and give them an advantage", "level": "C1", "dict_examp": "It may not be in your interest to change jobs so soon.", "lear_examp": "It is in my interests to meet new people and I find it easy to go and talk to people I do not know."}, {"sense": "If something is done or happens in the light of facts, it is done or happens because of those facts.", "level": "C1", "dict_examp": "In  light of                     the problems we’re having, we have no choice but to close the business.", "lear_examp": "In light of all the things mentioned above, I strongly recommend Alexandra for the job."}, {"sense": "to be lucky or to be able to have or do what you want", "level": "C1", "dict_examp": "\"Do you have any tuna sandwiches?\" \"You're in luck - there's one left.\"", "lear_examp": "I was in luck, because my friend, who lived in the same area, had his private car and gave me a lift every day."}, {"sense": "If you do something in moderation, you do not do it too much.", "level": "C1", "dict_examp": "I only drink alcohol in moderation.", "lear_examp": "While shopping can make one feel good and even has its positive impact on the retail economy, I think it should be done in moderation."}, {"sense": "something that you say when you are describing something using as few words as possible", "level": "C1", "dict_examp": "The answer, in a nutshell, is yes.", "lear_examp": "To put it in a nutshell, they all provide good food at reasonable prices."}, {"sense": "approximately", "level": "C1", "dict_examp": "It probably cost somewhere in the region of £900.", "lear_examp": "I am willing to pay rent in the region of £1000 to £1200 monthly."}, {"sense": "ready to be used if or when you need it", "level": "C1", "dict_examp": "She keeps a little money in reserve.", "lear_examp": "It would be an idea to have some activity in reserve if you have to cancel something, such as the boat trip on the Thames."}, {"sense": "very soon", "level": "C1", "dict_examp": "We'll be home in no time.", "lear_examp": "Team work is very important for us and you will make many friends in no time."}, {"sense": "singing or playing the right notes", "level": "C1", "dict_examp": "Try to stay in tune.", "lear_examp": "The public was singing in tune with Jag, hands were raised and bodies were slowly swaying."}, {"sense": "as a result of something that is part of a series of events", "level": "C1", "dict_examp": "This could result in the loss of certain species of fish and this in turn poses a serious threat to the fishing communities along the river banks.", "lear_examp": "This, in turn, enabled them to find jobs and become financially independent from their husbands."}, {"sense": "one after the other in an agreed order", "level": "C1", "dict_examp": "She spoke to each of the guests in turn.", "lear_examp": "We had two different teachers in the mornings and in the afternoons, in turn."}, {"sense": "without any success", "level": "C1", "dict_examp": "I tried in vain to start a conversation.", "lear_examp": "We looked in vain for the guide through three London parks."}, {"sense": "not at all", "level": "C1", "dict_examp": "This is in no way your fault.", "lear_examp": "This magazine will be loved by students as it will help them learn English in the best way and in no way will students find it boring."}, {"sense": "being cared for or dealt with by someone skilled", "level": "C1", "dict_examp": "The project is in safe hands - Jan has lots of experience.", "lear_examp": "He has also been trained as a lifeguard so the residents of your hotel would probably be in safe hands."}, {"sense": "similarly", "level": "C1", "dict_examp": "In the same way, there are many citizens who feel unprotected by the police.", "lear_examp": "In the same way, grandmothers may be shocked when seeing their little children wearing extravagant clothes or really short skirts."}, {"sense": "thinking about something in a particular way", "level": "C1", "dict_examp": "In a sense, he's right.", "lear_examp": "In a sense this is correct, since you have to leave your natural environment to visit a place where no human being is meant to survive."}, {"sense": "in a few words", "level": "C1", "dict_examp": "In short, we need more staff.", "lear_examp": "In short, ancient Chinese poems, mainly from the Jang Dynasty, constitute the background for Chinese culture and set a touchstone for judgement in our life."}, {"sense": "going to happen soon", "level": "C1", "dict_examp": "You never know what's in store for you.", "lear_examp": "Nobody knows what the future will have in store!"}, {"sense": "expecting something to happen or in preparation for something happening", "level": "C2", "dict_examp": "She's even decorated the spare room in anticipation of your visit.", "lear_examp": "This has sometimes resulted in the comic phenomenon of people traveling to a distant country, in anticipation of encountering strange and original lifestyles, only to come across situations not very different from the one they have left in their own countries."}, {"sense": "present at an event", "level": "C2", "dict_examp": "They have doctors in attendance at every match.", "lear_examp": "Professional coaches are in attendance and the members can have proper lessons."}, {"sense": "to feel great respect for and sometimes fear of someone", "level": "C2", "dict_examp": "As children we were rather in awe of our grandfather.", "lear_examp": "As I was the eldest of the siblings, they used to respect all my orders and even now, they are a bit in awe of me."}, {"sense": "as well as everything else", "level": "C2", "dict_examp": "Caffeine has no good effects on health and is mildly addictive in the bargain.", "lear_examp": "More or less few people are, in the bargain, prepared to adapt themselves to the others in order to be accepted."}, {"sense": "extremely quickly", "level": "C2", "dict_examp": "In the blink of an eye, he was gone.", "lear_examp": "I got dressed in the blink of an eye and I got down to the kitchen almost rolling down the stairs."}, {"sense": "to be in the same unpleasant situation as other people", "level": "C2", "dict_examp": "She complains that she doesn't have enough money, but we're all in the same boat.", "lear_examp": "Unemployment and its consequences is still a major problem. Now we are in the same boat."}, {"sense": "not knowing about something because other people are not telling you", "level": "C2", "dict_examp": "They kept us in the dark about their plans.", "lear_examp": "Peter had always kept her in the dark about the reason for their fight."}, {"sense": "wanted or needed in large numbers", "level": "C2", "dict_examp": "Good teachers are always in demand.", "lear_examp": "Many goods are not in demand because each family produces its own goods."}, {"sense": "used to say what the real situation is", "level": "C2", "dict_examp": "This means, in effect, that the plan has been scrapped.", "lear_examp": "However, if the government increases the amount of money they pay to the unemployed, that in effect means higher taxes for the citizens which will cause strikes and various other problems."}, {"sense": "used to emphasize the most important idea or quality of something", "level": "C2", "dict_examp": "In essence, its purpose is to contain information.", "lear_examp": "In essence, homelessness means that you don't have a home and because of this you are living on the streets."}, {"sense": "while having to deal with a difficult situation or problem", "level": "C2", "dict_examp": "They left home in the face of strong opposition from their families.", "lear_examp": "No doubt, it was rather difficult to like Enid X. She was hardly likely to arouse sympathy in anybody even in the face of death."}, {"sense": "in a difficult situation that causes you trouble or problems", "level": "C2", "dict_examp": "He’s in a fix and needs our help.", "lear_examp": "She felt happy when I was down in the dumps or in a fix and kept on being jealous of me concerning trivial matters."}, {"sense": "immediately, or very quickly", "level": "C2", "dict_examp": "I'll be back in a flash.", "lear_examp": "He took it and, in a flash, he came up to the surface."}, {"sense": "If a law, rule, etc. is in force, it exists and is being used.", "level": "C2", "dict_examp": "New regulations limiting fishing on this river are now in force.", "lear_examp": "Because the measures are only in Patra they are not very powerful because it isn't an official law so that it is always in force."}, {"sense": "being worked on or dealt with now", "level": "C2", "dict_examp": "Don't worry – we have the situation  in hand.", "lear_examp": "Miss Kenton keeps asking Stevens whether everything is in hand and whether her help is required."}, {"sense": "used to give your opinion about something, often when you are sure you are right", "level": "C2", "dict_examp": "In my humble opinion, that's the wrong decision.", "lear_examp": "In my humble opinion, there's no such thing as a uniform celebrity, good, bad or otherwise."}, {"sense": "Something that is in its infancy has only just begun to develop.", "level": "C2", "dict_examp": "In the 1950s, space travel was in its infancy.", "lear_examp": ""}, {"sense": "in order to achieve a particular situation or quality", "level": "C2", "dict_examp": "In the interest of safety, passengers are advised to wear their seat belts at all times.", "lear_examp": "First of all, do make sure that the front door is always locked. In the interests of everybody's security, it is essential to remember this."}, {"sense": "alone, or separately from other people, places, or things", "level": "C2", "dict_examp": "These poems cannot be considered in isolation.", "lear_examp": "In conclusion, it is my opinion that the problem of parking space cannot be solved in isolation."}, {"sense": "almost certainly", "level": "C2", "dict_examp": "The facilities are wasted on people who in all likelihood will not use them.", "lear_examp": "In all likelihood, you will have to work during the weekends, even in summer, so I firmly believe that loving your job is very important."}, {"sense": "to be similar to and suitable for something", "level": "C2", "dict_examp": "They were offered a pay increase in line with inflation.", "lear_examp": "The other two courses, at 5%, are still in line with the national average."}, {"sense": "If you do something in memory of a dead person, you do it to show your respect or love for them.", "level": "C2", "dict_examp": "They built a statue in memory of those who died in the fire.", "lear_examp": "You see, every year our family performs a certain gathering in memory of my brother who was killed in a plane crash in 1991 known as the C130 disaster."}, {"sense": "in your imagination or memory", "level": "C2", "dict_examp": "In my mind's eye, I imagined the building painted white, with a beautiful garden around it.", "lear_examp": "He sees her in his mind's eye, running around barefoot, laughing and squealing, wading in the water and running back out, screaming, trying to get away from the breaking waves."}, {"sense": "If something is in miniature, it is a very small copy of something else.", "level": "C2", "dict_examp": "a model of the ship in miniature", "lear_examp": "Thirdly a co-educational school is a society in miniature and it has many practical advantages."}, {"sense": "If bad things are done in the name of something, they are done in order to help that thing succeed.", "level": "C2", "dict_examp": "Are you willing to work yourself to death in the name of competition?", "lear_examp": "There are things one cannot trifle with: friendship for example should not be sacrificed in the name of success."}, {"sense": "combined into a single thing", "level": "C2", "dict_examp": "It's a vacation and art course all in one.", "lear_examp": "The Internet is like combining a television, a telephone and an airplane all in one."}, {"sense": "partly", "level": "C2", "dict_examp": "He is in part to blame for the accident.", "lear_examp": "Technology is in part to blame."}, {"sense": "when things are in perspective, you think about them in a sensible and  realistic way, and understand how important or unimportant they really are", "level": "C2", "dict_examp": "You must keep things in perspective - the overall situation isn't really that bad.", "lear_examp": "I think it will enable me to see things more in perspective."}, {"sense": "in the correct position", "level": "C2", "dict_examp": "The chairs are all in place.", "lear_examp": "I looked neat and clean even after the wildest games in the school yard, with all the ribbons that tied my long hair in place."}, {"sense": "If a rule, system, etc. is in place, it has started to exist.", "level": "C2", "dict_examp": "There are now laws in place to prevent this from happening.", "lear_examp": "Let's take the example of Mexico City, where such restrictions have been in place since early 2000."}, {"sense": "used to mean that something is very likely", "level": "C2", "dict_examp": "She will, in all probability, have left before we arrive.", "lear_examp": "Anybody who can fulfill the above conditions will in all probability be successful."}, {"sense": "If something changes in proportion to another thing, it changes to the same degree as that thing.", "level": "C2", "dict_examp": "Your tax payment increases in proportion to your salary.", "lear_examp": "One aspect of the question is the fact that a sportsman's salary is supposedly not in proportion to the number of hours he works."}, {"sense": "the person or thing that is being discussed", "level": "C2", "dict_examp": "He sais that he was at a restaurant with his friends on the night in question.", "lear_examp": "While this is not necessarily false, it should be borne in mind that the events in question are by no means boring or uninteresting."}, {"sense": "thinking back to something that happened  before", "level": "C2", "dict_examp": "In retrospect, I should probably have told her.", "lear_examp": "To cut a long story short I decided to go, though half-heartedly as I still had doubts about it. In retrospect, it turned out to be an unforgettable experience."}, {"sense": "in a bad situation where you do the same things all the time, or where it is impossible to make progress", "level": "C2", "dict_examp": "He seems to be stuck in a rut at the moment.", "lear_examp": "Financial security, all the, let me call them, background benefits are important, but if you do not love what you do, soon you will become bitter, stuck in a rut or worse - you will suffer from depression."}, {"sense": "to be acceptable in a way that will not upset or anger people", "level": "C2", "dict_examp": "His speech was in good taste.", "lear_examp": "I therefore thought that it would be in good taste to write about two of them."}, {"sense": "to be unacceptable in a way that will upset or anger people", "level": "C2", "dict_examp": "He told a joke about a plane crash which I thought was in rather poor taste.", "lear_examp": ""}, {"sense": "in a direct and often angry way", "level": "C2", "dict_examp": "I told him to go away in no uncertain terms.", "lear_examp": "Intellectuals are used to saying in no uncertain terms that money represents the bad side of the sport."}, {"sense": "to understand what someone wants or needs or to understand a situation and act in a way that is suitable for it", "level": "C2", "dict_examp": "The congress is not in tune with the voters.", "lear_examp": "I am not exactly in tune with all the latest trends but I know which styles give me the most satisfaction."}, {"sense": "in the area near a place", "level": "C2", "dict_examp": "A number of buildings in the vicinity of the fire were damaged.", "lear_examp": "Just to briefly introduce myself, my name is Prashant Sharma and I live in the vicinity of the college campus."}, {"sense": "used to say that someone or something does something to a large degree", "level": "C2", "dict_examp": "They celebrate birthdays in a big way.", "lear_examp": "Tourism helps Greece's national economy - which is not at its best - in a big way."}, {"sense": "to be likely to happen", "level": "C2", "dict_examp": "Do you think marriage is in the cards?", "lear_examp": ""}, {"sense": "not in a difficult situation or having problems any more", "level": "C2", "dict_examp": "We had some large debts, but we should be in the clear by next year.", "lear_examp": "\"You're in the clear, you don't have to be afraid any more,\" it said."}, {"sense": "in a cruel way, without showing any emotion", "level": "C2", "dict_examp": "He shot three policemen in cold blood.", "lear_examp": "Returning to the story, when I arrived, I went directly to Hillton Avenue where I should have met 005, but when I arrived at the meeting point I found him lying on the floor with two shots in his back; he had been murdered in cold blood."}, {"sense": "If you tell something to someone in confidence, you do not want them to tell anyone else.", "level": "C2", "dict_examp": "I'm sorry, she told me that in confidence.", "lear_examp": "His real name isn't Piggy but he told Ralph in confidence that they called him that in school because of his appearance."}, {"sense": "working, used, or happening with something or someone else", "level": "C2", "dict_examp": "Our librarians use their knowledge in conjunction with the computer network.", "lear_examp": "Therefore if the banning of private cars takes place in conjunction with development in the public transportation system in that city, this whole development will have more advantages despite some slight difficulties at the start."}, {"sense": "because of or for this reason", "level": "C2", "dict_examp": "This course is good in that it provides a very practical training.", "lear_examp": "Nowadays it is widely argued that professional sports are damaging to people's health in that they involve grueling training sessions as an integral part of the occupation."}]}, {"pos": "adverb", "senses": [{"sense": "into an area or space from the outside of it", "level": "A2", "dict_examp": "Could you bring the clothes in for me?", "lear_examp": "First I brought in the big cake that my father had bought."}, {"sense": "at the place where a person usually lives or works", "level": "B1", "dict_examp": "Mr Ellis isn't in this week.", "lear_examp": "We go in at 8:15."}, {"sense": "having arrived at the place where people can get on or off", "level": "B1", "dict_examp": "What time is Roz's flight due in?", "lear_examp": ""}, {"sense": "given or sent to someone official in order to be read", "level": "B2", "dict_examp": "When does your essay have to be in?", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the details of a particular subject", "level": "C2", "dict_examp": "the ins and outs of the legal system", "lear_examp": "I knew all the ins and outs of every story but I couldn't stay one single day in bed without reading it."}]}]}, {"word": "inaccurate", "poses": [{"pos": "adjective", "senses": [{"sense": "not correct or exact", "level": "B2", "dict_examp": "inaccurate information", "lear_examp": "Due to your inaccurate information, I was late and missed part of the show."}]}]}, {"word": "inaccuracy", "poses": [{"pos": "noun", "senses": [{"sense": "something such as a statement or number that is not correct", "level": "C1", "dict_examp": "The report contained many inaccuracies.", "lear_examp": "Apart from these inaccuracies, the group members have a lot of complaints."}]}]}, {"word": "incapable", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to do something or to feel a particular emotion", "level": "C1", "dict_examp": "After the operation he was incapable of taking care of himself for several weeks.", "lear_examp": "Earl has lost most of his eyesight and he is incapable of assembling the planes without my help."}]}]}, {"word": "inch", "poses": [{"pos": "noun", "senses": [{"sense": "a unit used for measuring length that is approximately equal to 2.54 centimeters, sometimes shown by the symbol ″", "level": "B1", "dict_examp": "Twelve inches are equal to one foot.", "lear_examp": "He was one inch tall with strange clothes."}]}]}, {"word": "incidentally", "poses": [{"pos": "adverb", "senses": [{"sense": "used to introduce something additional that is not as\n \n important or to introduce something new", "level": "C1", "dict_examp": "Incidentally, she was a very popular mayor.", "lear_examp": "Incidentally, there is another big Turkish Bath in Ginarah."}]}]}, {"word": "inclination", "poses": [{"pos": "noun", "senses": [{"sense": "what you usually are like or prefer, or the feeling that makes you want to do something", "level": "C2", "dict_examp": "Tony has a strong inclination toward the arts.", "lear_examp": "Young people do not have any opportunity to find out their inclinations and improve their skills as far as art is concerned."}]}]}, {"word": "inclined", "poses": [{"pos": "adjective", "senses": [{"sense": "to have an opinion, but not a strong opinion", "level": "C1", "dict_examp": "I'm inclined to agree with you.", "lear_examp": "I am inclined to believe that the Open Day will reassure all the local residents that our college is one of major importance and our students creative and intelligent people."}, {"sense": "often behaving in a particular way", "level": "C2", "dict_examp": "Tom is inclined to be forgetful.", "lear_examp": "People are naturally inclined to try to earn more at every stage of their career."}, {"sense": "having natural artistic/technical, etc. ability", "level": "C2", "dict_examp": "She's very curious, but not academically inclined.", "lear_examp": "My first suggestion is a pottery class that I think would be greatly appreciated by the more creatively inclined among the students."}]}]}, {"word": "inadequate", "poses": [{"pos": "adjective", "senses": [{"sense": "not good enough or too low in quality", "level": "C1", "dict_examp": "Our equipment is totally inadequate for a job like this.", "lear_examp": "First of all, I found the seats inadequate and my seat belt was broken."}, {"sense": "not enough", "level": "C1", "dict_examp": "inadequate funds", "lear_examp": "So, the inadequate number of computers could not cover students' needs."}]}]}, {"word": "inappropriate", "poses": [{"pos": "adjective", "senses": [{"sense": "not suitable", "level": "C1", "dict_examp": "inappropriate behavior/comments", "lear_examp": "Regarding video facilities, most students characterized them as a nice choice generally, but were not satisfied with the equipment, which they found rather poor and inappropriate."}]}]}, {"word": "incident", "poses": [{"pos": "noun", "senses": [{"sense": "an event, usually one that is either unpleasant or unusual", "level": "B2", "dict_examp": "an isolated/separate/serious incident", "lear_examp": "After that incident I never cheated again and I never talked to that teacher again."}]}]}, {"word": "inability", "poses": [{"pos": "noun", "senses": [{"sense": "lack of ability to do something", "level": "C1", "dict_examp": "I'm concerned about our inability to find someone for this job.", "lear_examp": "The Arnewood's inability to cater for special diets gives the Lawson House the upper hand, since there are 3 vegetarians coming along."}]}]}, {"word": "inappropriately", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not suitable", "level": "C1", "dict_examp": "The meeting was inappropriately handled and an argument broke out.", "lear_examp": "For instance, the refreshment tent was inappropriately located, making it difficult for the participants to reach it."}]}]}, {"word": "incentive", "poses": [{"pos": "noun", "senses": [{"sense": "something that encourages you to act in a particular way", "level": "C2", "dict_examp": "People had little incentive to save.", "lear_examp": "Not surprisingly, they value financial rewards over other kinds of incentives."}]}]}, {"word": "in", "poses": [{"pos": "preposition", "senses": [{"sense": "inside or toward the inside of a container, place or area", "level": "A1", "dict_examp": "There's milk in the refrigerator.", "lear_examp": "He works in Austria now."}, {"sense": "during part or all of a period of time", "level": "A1", "dict_examp": "We're going to Italy in April.", "lear_examp": "I like my country in March because spring is coming."}, {"sense": "needing or using no more time than a particular amount of time", "level": "A2", "dict_examp": "Can you finish the job in two weeks?", "lear_examp": "We can  finish in two days."}, {"sense": "forming a part of something", "level": "A2", "dict_examp": "He used to be the lead singer in a rock band.", "lear_examp": "My sister sings in a pop group."}, {"sense": "close to the front part of something or where someone can see or hear you", "level": "A2", "dict_examp": "He parked the car in front of the house.", "lear_examp": "We can meet in front of the museum."}, {"sense": "wearing", "level": "B1", "dict_examp": "Do you recognize that man in the grey suit?", "lear_examp": "The man has to be dressed in black."}, {"sense": "early or at the right time", "level": "B1", "dict_examp": "We arrived in time to catch the train.", "lear_examp": "If I don't come back in time you can put a note on my desk."}, {"sense": "before a particular time, or before doing a particular thing", "level": "B1", "dict_examp": "If you're going to come, please let me know in advance.", "lear_examp": "I can help you if you want to book your room in advance."}, {"sense": "used to emphasize what is really true, or to give more information", "level": "B1", "dict_examp": "We met Rebecca for lunch. In fact, we spent the whole afternoon with her.", "lear_examp": "The club has its own small clubhouse, with many things in it. For example, there was a big pinball-game and some computers.  In fact it was the best clubhouse I've ever seen."}, {"sense": "further forward than someone or something else", "level": "B1", "dict_examp": "The car in front suddenly stopped and I ran into the back of it.", "lear_examp": "As the concert finished, I heard someone call my name. I believed it was my imagination or perhaps a dream because I couldn't see anyone in front, behind or opposite me."}, {"sense": "liking someone very much and having romantic or sexual feelings for them", "level": "B1", "dict_examp": "Have you ever been in love?", "lear_examp": "I think I am in love with him."}, {"sense": "experiencing an emotion or condition", "level": "B1", "dict_examp": "She's in a bad/good mood this morning.", "lear_examp": "I hope you are in a good mood today, because we are planning to go to Cinepolis."}, {"sense": "arranged or divided in a particular way", "level": "B1", "dict_examp": "We all sat down in a circle.", "lear_examp": "We often work in groups where we can talk in English."}, {"sense": "as well (as)", "level": "B1", "dict_examp": "In addition to his flat in London, he has a villa in Italy and a castle in Scotland.", "lear_examp": "And in addition, I'm going to paint a few pictures for my room, I like painting very much!"}, {"sense": "finally, after something has been thought about or discussed a lot", "level": "B1", "dict_examp": "We were thinking about going to Switzerland, but in the end we went to Austria.", "lear_examp": "He wrote me about his plans for the future but in the end he invited me to go to France with him."}, {"sense": "including or considering all the information about something or every part of something", "level": "B1", "dict_examp": "We haven't discussed the matter in detail yet.", "lear_examp": "I'm really sorry that I didn't write back earlier, but to make up for this I will answer your questions in detail!"}, {"sense": "completely and with nothing missing", "level": "B1", "dict_examp": "The bill must be paid in full by the end of the month.", "lear_examp": "On the whole, I would like to say that the lessons together with the social events will show daily life at my school in full."}, {"sense": "beginning from now", "level": "B1", "dict_examp": "Could you be more careful in the future?", "lear_examp": "I hope to see it again and I'll be more careful in the future with my objects."}, {"sense": "usually, or in most situations", "level": "B1", "dict_examp": "In general, men are taller than women.", "lear_examp": "In general I like reading in my free time, when I have nothing to do..."}, {"sense": "crying", "level": "B1", "dict_examp": "I found him in tears in his bedroom.", "lear_examp": "By the end of it, Mary Anne was nearly in tears."}, {"sense": "with the purpose of achieving something", "level": "B1", "dict_examp": "He came home early in order to see the children before they went to bed.", "lear_examp": "She will go to the United States in order to improve her English."}, {"sense": "expressed or written in a particular way", "level": "B1", "dict_examp": "They spoke in Russian the whole time.", "lear_examp": "I also speak in English during the break."}, {"sense": "especially", "level": "B1", "dict_examp": "Are you looking for anything in particular?", "lear_examp": "I've read a lot of books recently, and in particular I liked: \"Eleven minutes\" and \"Veronica decides to die\", written by Paulo Coelho."}, {"sense": "involved or connected with a particular subject or activity", "level": "B1", "dict_examp": "a degree in philosophy", "lear_examp": "He is my age and we have the same tastes in music and art."}, {"sense": "because of a possibility of something happening, being needed, etc.", "level": "B1", "dict_examp": "I don't think I'll need any money but I'll bring some just in case.", "lear_examp": "You can't forget to bring comfortable shoes in case you have to walk long distances while you are sightseeing."}, {"sense": "when something happens, or in preparation for when something happens", "level": "B1", "dict_examp": "We keep a bucket of water backstage, in case of fire.", "lear_examp": "It is about how to rescue people in case of an accident or a natural disaster."}, {"sense": "considering the whole of someone or something, and not just a particular part of them", "level": "B2", "dict_examp": "So, apart from the bad ankle, how are you in general?", "lear_examp": "I think that I, as well as people in general, would have been more depressed if we didn't have light."}, {"sense": "to agree with or approve of a plan or idea", "level": "B2", "dict_examp": "Most people are in favor of reducing traffic in cities.", "lear_examp": "I am more in favor of longer opening hours during the week, and of shorter ones on the weekend."}, {"sense": "divided into two equal parts", "level": "B2", "dict_examp": "Cut the potatoes in two.", "lear_examp": "They were very surprised when they found the gold was cut in half."}, {"sense": "used to emphasize what is really true, or to give more information", "level": "B2", "dict_examp": "I thought she was Portuguese, but in actual fact she's Brazilian.", "lear_examp": "Nowadays almost all people own a car and in actual fact more and more people have been facing death as a consequence of careless driving."}, {"sense": "used to give another reason for something you are saying, or that you have done", "level": "B2", "dict_examp": "I don't want to go and in any case, I haven't been invited.", "lear_examp": "In any case I will meet you at the opening party at the end of the month."}, {"sense": "because of the mentioned situation", "level": "B2", "dict_examp": "There's no coffee left? In that case I'll have tea.", "lear_examp": "You could try kayaking. In that case, of course, you need to pay for the equipment."}, {"sense": "used to show the total amount of something", "level": "B2", "dict_examp": "Some of the children came, so there were 15 of us in all.", "lear_examp": "Secondly, even though most people liked the group RADIANT, they only played for 35 minutes in all."}, {"sense": "used when referring to something that is done as a result of something else", "level": "B2", "dict_examp": "I'd like to do something for you in return/exchange for everything you've done for me.", "lear_examp": "I am writing to you in response to your advertisement of 1st December in the Times."}, {"sense": "using only a few words", "level": "B2", "dict_examp": "world news in brief", "lear_examp": "Now I will tell you in brief what exactly happened to me."}, {"sense": "in someone's opinion", "level": "B2", "dict_examp": "In my parents' eyes, I'll always be a child.", "lear_examp": "To answer your question right away, the boat trip is highly recommendable in my eyes!"}, {"sense": "used to introduce the last part of a speech or a piece of writing", "level": "B2", "dict_examp": "In conclusion, I would like to thank our guest speaker for her fascinating talk.", "lear_examp": "In conclusion, music, TV and clothes are very important in a young person's life and can reflect each person's character."}, {"sense": "used to say what something is about", "level": "B2", "dict_examp": "I am writing in connection with the above job advertised in The Daily Press on Monday 12th February.", "lear_examp": "Dear Mrs Brown, I am writing in connection with a surprise birthday party for your husband, Mr Brown."}, {"sense": "at a suitable time in the future", "level": "B2", "dict_examp": "The results will be sent to you in due course.", "lear_examp": "I look forward to hearing from you in due course."}, {"sense": "toward someone", "level": "B2", "dict_examp": "She keeps looking in my direction.", "lear_examp": "I didn't know why she was talking to me but suddenly she walked in my direction and told me: \"I need to know your name\"."}, {"sense": "used to explain what something means in a different way", "level": "B2", "dict_examp": "He said he's too busy - in other words he isn't interested.", "lear_examp": "They had had a great time before and had drunk too much alcohol. In other words, they were totally drunk."}, {"sense": "An agreement that is in writing is official and is proof of that agreement.", "level": "B2", "dict_examp": "Please confirm your reservation in writing.", "lear_examp": "I am telling you in writing that I would like to help you."}, {"sense": "if vegetables or fruit are in season, they are available and ready to eat.", "level": "B2", "dict_examp": "Asparagus is in season at the moment.", "lear_examp": "They celebrate Halloween in October when pumpkins are in season, that's why in the decorations they include them very often; most of the people carve the pumpkins and put some lights inside."}, {"sense": "without telling other people", "level": "B2", "dict_examp": "For years they met in secret.", "lear_examp": "We met in secret when Mary was busy."}, {"sense": "feeling good/excited/unhappy, etc.", "level": "B2", "dict_examp": "The whole class was in good spirits that day.", "lear_examp": "I was in high spirits until I got my paper back."}, {"sense": "because of", "level": "B2", "dict_examp": "In view of recent events, we have decided to cancel the meeting.", "lear_examp": "In view of what happened, I would advise you not to try to mislead people like this again."}, {"sense": "in order to celebrate or show great respect for someone or something", "level": "B2", "dict_examp": "a banquet in honor of the president", "lear_examp": "Besides, if you come these days you will see the local fiesta at which the local people celebrate special events in honor of our saints."}, {"sense": "If you do something in person, you go somewhere to do it yourself.", "level": "B2", "dict_examp": "You have to collect the document in person.", "lear_examp": "I am looking forward to meeting you in person."}, {"sense": "instead of something", "level": "B2", "dict_examp": "Try adding fruit to your cereal in place of sugar.", "lear_examp": "In the advertisement, it said that Danny Brook was starring, but in place of him there was a different actor and he was really disappointing."}, {"sense": "at the start of a situation", "level": "B2", "dict_examp": "Why did you invite her in the first place?", "lear_examp": "In the first place, you were unknown people for me, but now you are my special foreign friends."}, {"sense": "If something is true in practice, this is the real situation.", "level": "B2", "dict_examp": "In practice, the new laws have had little effect.", "lear_examp": "When you leave school, you have knowledge but you do not know how to use it in practice."}, {"sense": "in a place where nobody else can hear you or see what you are doing", "level": "B2", "dict_examp": "The meeting was held in private.", "lear_examp": "I agree that this should be in private."}, {"sense": "happening or being done now", "level": "B2", "dict_examp": "Repair work is in progress on the south-bound lane of the motorway and will continue until June.", "lear_examp": "In the lower part of your advertisement, it also said there was a theatre restaurant, but in fact, it was closed because internal decoration was in progress."}, {"sense": "when compared with something", "level": "B2", "dict_examp": "Salaries are low in relation to the cost of living.", "lear_examp": "I think television has several advantages but also disadvantages in relation to books."}, {"sense": "about or relating to something", "level": "B2", "dict_examp": "I'd like to ask you something in relation to what you said earlier.", "lear_examp": "In relation to last month's social program, the sightseeing tour of London was divine, although we didn't get to see the entire city."}, {"sense": "in a particular way, or in many ways", "level": "B2", "dict_examp": "The school has changed in many respects.", "lear_examp": "How's your friend Mike? He is in many respects better than a computer, isn't he? (Teasing you again, sorry)."}, {"sense": "as an answer to", "level": "B2", "dict_examp": "I'm writing in response to your letter of February 14.", "lear_examp": "I am writing in response to your advertisement, which appeared in the newspaper on November the 23rd, looking for a person to work at weekends in your cafe."}, {"sense": "one after another without a break", "level": "B2", "dict_examp": "He's just won the tournament for the fifth year in a row.", "lear_examp": "Maradona was the captain of the team, and since he arrived, the team won three championships in a row."}, {"sense": "available in a store or other place", "level": "B2", "dict_examp": "Do you have the book in stock?", "lear_examp": "Shopping could be annoying if you look at it as a waste of time because you do it every day.  Reorganize your behavior when shopping and plan to keep food in stock!"}, {"sense": "in the way described by a rule, law, or wish", "level": "C1", "dict_examp": "Both companies have insisted that they were acting in accordance with the law.", "lear_examp": "Although they do not earn much money in this profession, they try to do their best and judge in accordance with the law which they also have to interpret."}, {"sense": "working together with", "level": "C1", "dict_examp": "The event was organized in association with the Student Council.", "lear_examp": "This service, which will be provided in association with Foster Loft, will be available at the end of 2005."}, {"sense": "in large amounts", "level": "C1", "dict_examp": "to buy in bulk", "lear_examp": "I suggest that you buy food in bulk so that you not only save money but also save time."}, {"sense": "if something happens", "level": "C1", "dict_examp": "An airbag could save your life in the event of an accident.", "lear_examp": "In the event of bad weather, it would be wise to plan an alternative to the boat trip, for example a visit of Buckingham Palace or the Houses of Parliament."}, {"sense": "whatever happens", "level": "C1", "dict_examp": "I'm not sure if I'm coming on Friday, but in any event, I'll see you next week.", "lear_examp": "In any event, it is incumbent upon all of us to carefully plan our travel matters, so as to take advantage of their several benefits."}, {"sense": "the particular way in which something appears or exists", "level": "C1", "dict_examp": "The novel is written in the form of a series of letters.", "lear_examp": "For all this, I can only say that I want my money back immediately, or some compensation in the form of a real trip to a real country."}, {"sense": "used to say what you really feel or think", "level": "C1", "dict_examp": "In his heart, he knew she was right.", "lear_examp": "I have to admit that it was only a sensible decision, because deep in my heart I knew I wanted to learn English."}, {"sense": "because you want something good to happen", "level": "C1", "dict_examp": "She went to Paris in the hope of improving her French.", "lear_examp": "Dear Dave Bennington, I am writing to you in the hope that you will attend our next event in July."}, {"sense": "to help someone and give them an advantage", "level": "C1", "dict_examp": "It may not be in your interest to change jobs so soon.", "lear_examp": "It is in my interests to meet new people and I find it easy to go and talk to people I do not know."}, {"sense": "If something is done or happens in the light of facts, it is done or happens because of those facts.", "level": "C1", "dict_examp": "In  light of                     the problems we’re having, we have no choice but to close the business.", "lear_examp": "In light of all the things mentioned above, I strongly recommend Alexandra for the job."}, {"sense": "to be lucky or to be able to have or do what you want", "level": "C1", "dict_examp": "\"Do you have any tuna sandwiches?\" \"You're in luck - there's one left.\"", "lear_examp": "I was in luck, because my friend, who lived in the same area, had his private car and gave me a lift every day."}, {"sense": "If you do something in moderation, you do not do it too much.", "level": "C1", "dict_examp": "I only drink alcohol in moderation.", "lear_examp": "While shopping can make one feel good and even has its positive impact on the retail economy, I think it should be done in moderation."}, {"sense": "something that you say when you are describing something using as few words as possible", "level": "C1", "dict_examp": "The answer, in a nutshell, is yes.", "lear_examp": "To put it in a nutshell, they all provide good food at reasonable prices."}, {"sense": "approximately", "level": "C1", "dict_examp": "It probably cost somewhere in the region of £900.", "lear_examp": "I am willing to pay rent in the region of £1000 to £1200 monthly."}, {"sense": "ready to be used if or when you need it", "level": "C1", "dict_examp": "She keeps a little money in reserve.", "lear_examp": "It would be an idea to have some activity in reserve if you have to cancel something, such as the boat trip on the Thames."}, {"sense": "very soon", "level": "C1", "dict_examp": "We'll be home in no time.", "lear_examp": "Team work is very important for us and you will make many friends in no time."}, {"sense": "singing or playing the right notes", "level": "C1", "dict_examp": "Try to stay in tune.", "lear_examp": "The public was singing in tune with Jag, hands were raised and bodies were slowly swaying."}, {"sense": "as a result of something that is part of a series of events", "level": "C1", "dict_examp": "This could result in the loss of certain species of fish and this in turn poses a serious threat to the fishing communities along the river banks.", "lear_examp": "This, in turn, enabled them to find jobs and become financially independent from their husbands."}, {"sense": "one after the other in an agreed order", "level": "C1", "dict_examp": "She spoke to each of the guests in turn.", "lear_examp": "We had two different teachers in the mornings and in the afternoons, in turn."}, {"sense": "without any success", "level": "C1", "dict_examp": "I tried in vain to start a conversation.", "lear_examp": "We looked in vain for the guide through three London parks."}, {"sense": "not at all", "level": "C1", "dict_examp": "This is in no way your fault.", "lear_examp": "This magazine will be loved by students as it will help them learn English in the best way and in no way will students find it boring."}, {"sense": "being cared for or dealt with by someone skilled", "level": "C1", "dict_examp": "The project is in safe hands - Jan has lots of experience.", "lear_examp": "He has also been trained as a lifeguard so the residents of your hotel would probably be in safe hands."}, {"sense": "similarly", "level": "C1", "dict_examp": "In the same way, there are many citizens who feel unprotected by the police.", "lear_examp": "In the same way, grandmothers may be shocked when seeing their little children wearing extravagant clothes or really short skirts."}, {"sense": "thinking about something in a particular way", "level": "C1", "dict_examp": "In a sense, he's right.", "lear_examp": "In a sense this is correct, since you have to leave your natural environment to visit a place where no human being is meant to survive."}, {"sense": "in a few words", "level": "C1", "dict_examp": "In short, we need more staff.", "lear_examp": "In short, ancient Chinese poems, mainly from the Jang Dynasty, constitute the background for Chinese culture and set a touchstone for judgement in our life."}, {"sense": "going to happen soon", "level": "C1", "dict_examp": "You never know what's in store for you.", "lear_examp": "Nobody knows what the future will have in store!"}, {"sense": "expecting something to happen or in preparation for something happening", "level": "C2", "dict_examp": "She's even decorated the spare room in anticipation of your visit.", "lear_examp": "This has sometimes resulted in the comic phenomenon of people traveling to a distant country, in anticipation of encountering strange and original lifestyles, only to come across situations not very different from the one they have left in their own countries."}, {"sense": "present at an event", "level": "C2", "dict_examp": "They have doctors in attendance at every match.", "lear_examp": "Professional coaches are in attendance and the members can have proper lessons."}, {"sense": "to feel great respect for and sometimes fear of someone", "level": "C2", "dict_examp": "As children we were rather in awe of our grandfather.", "lear_examp": "As I was the eldest of the siblings, they used to respect all my orders and even now, they are a bit in awe of me."}, {"sense": "as well as everything else", "level": "C2", "dict_examp": "Caffeine has no good effects on health and is mildly addictive in the bargain.", "lear_examp": "More or less few people are, in the bargain, prepared to adapt themselves to the others in order to be accepted."}, {"sense": "extremely quickly", "level": "C2", "dict_examp": "In the blink of an eye, he was gone.", "lear_examp": "I got dressed in the blink of an eye and I got down to the kitchen almost rolling down the stairs."}, {"sense": "to be in the same unpleasant situation as other people", "level": "C2", "dict_examp": "She complains that she doesn't have enough money, but we're all in the same boat.", "lear_examp": "Unemployment and its consequences is still a major problem. Now we are in the same boat."}, {"sense": "not knowing about something because other people are not telling you", "level": "C2", "dict_examp": "They kept us in the dark about their plans.", "lear_examp": "Peter had always kept her in the dark about the reason for their fight."}, {"sense": "wanted or needed in large numbers", "level": "C2", "dict_examp": "Good teachers are always in demand.", "lear_examp": "Many goods are not in demand because each family produces its own goods."}, {"sense": "used to say what the real situation is", "level": "C2", "dict_examp": "This means, in effect, that the plan has been scrapped.", "lear_examp": "However, if the government increases the amount of money they pay to the unemployed, that in effect means higher taxes for the citizens which will cause strikes and various other problems."}, {"sense": "used to emphasize the most important idea or quality of something", "level": "C2", "dict_examp": "In essence, its purpose is to contain information.", "lear_examp": "In essence, homelessness means that you don't have a home and because of this you are living on the streets."}, {"sense": "while having to deal with a difficult situation or problem", "level": "C2", "dict_examp": "They left home in the face of strong opposition from their families.", "lear_examp": "No doubt, it was rather difficult to like Enid X. She was hardly likely to arouse sympathy in anybody even in the face of death."}, {"sense": "in a difficult situation that causes you trouble or problems", "level": "C2", "dict_examp": "He’s in a fix and needs our help.", "lear_examp": "She felt happy when I was down in the dumps or in a fix and kept on being jealous of me concerning trivial matters."}, {"sense": "immediately, or very quickly", "level": "C2", "dict_examp": "I'll be back in a flash.", "lear_examp": "He took it and, in a flash, he came up to the surface."}, {"sense": "If a law, rule, etc. is in force, it exists and is being used.", "level": "C2", "dict_examp": "New regulations limiting fishing on this river are now in force.", "lear_examp": "Because the measures are only in Patra they are not very powerful because it isn't an official law so that it is always in force."}, {"sense": "being worked on or dealt with now", "level": "C2", "dict_examp": "Don't worry – we have the situation  in hand.", "lear_examp": "Miss Kenton keeps asking Stevens whether everything is in hand and whether her help is required."}, {"sense": "used to give your opinion about something, often when you are sure you are right", "level": "C2", "dict_examp": "In my humble opinion, that's the wrong decision.", "lear_examp": "In my humble opinion, there's no such thing as a uniform celebrity, good, bad or otherwise."}, {"sense": "Something that is in its infancy has only just begun to develop.", "level": "C2", "dict_examp": "In the 1950s, space travel was in its infancy.", "lear_examp": ""}, {"sense": "in order to achieve a particular situation or quality", "level": "C2", "dict_examp": "In the interest of safety, passengers are advised to wear their seat belts at all times.", "lear_examp": "First of all, do make sure that the front door is always locked. In the interests of everybody's security, it is essential to remember this."}, {"sense": "alone, or separately from other people, places, or things", "level": "C2", "dict_examp": "These poems cannot be considered in isolation.", "lear_examp": "In conclusion, it is my opinion that the problem of parking space cannot be solved in isolation."}, {"sense": "almost certainly", "level": "C2", "dict_examp": "The facilities are wasted on people who in all likelihood will not use them.", "lear_examp": "In all likelihood, you will have to work during the weekends, even in summer, so I firmly believe that loving your job is very important."}, {"sense": "to be similar to and suitable for something", "level": "C2", "dict_examp": "They were offered a pay increase in line with inflation.", "lear_examp": "The other two courses, at 5%, are still in line with the national average."}, {"sense": "If you do something in memory of a dead person, you do it to show your respect or love for them.", "level": "C2", "dict_examp": "They built a statue in memory of those who died in the fire.", "lear_examp": "You see, every year our family performs a certain gathering in memory of my brother who was killed in a plane crash in 1991 known as the C130 disaster."}, {"sense": "in your imagination or memory", "level": "C2", "dict_examp": "In my mind's eye, I imagined the building painted white, with a beautiful garden around it.", "lear_examp": "He sees her in his mind's eye, running around barefoot, laughing and squealing, wading in the water and running back out, screaming, trying to get away from the breaking waves."}, {"sense": "If something is in miniature, it is a very small copy of something else.", "level": "C2", "dict_examp": "a model of the ship in miniature", "lear_examp": "Thirdly a co-educational school is a society in miniature and it has many practical advantages."}, {"sense": "If bad things are done in the name of something, they are done in order to help that thing succeed.", "level": "C2", "dict_examp": "Are you willing to work yourself to death in the name of competition?", "lear_examp": "There are things one cannot trifle with: friendship for example should not be sacrificed in the name of success."}, {"sense": "combined into a single thing", "level": "C2", "dict_examp": "It's a vacation and art course all in one.", "lear_examp": "The Internet is like combining a television, a telephone and an airplane all in one."}, {"sense": "partly", "level": "C2", "dict_examp": "He is in part to blame for the accident.", "lear_examp": "Technology is in part to blame."}, {"sense": "when things are in perspective, you think about them in a sensible and  realistic way, and understand how important or unimportant they really are", "level": "C2", "dict_examp": "You must keep things in perspective - the overall situation isn't really that bad.", "lear_examp": "I think it will enable me to see things more in perspective."}, {"sense": "in the correct position", "level": "C2", "dict_examp": "The chairs are all in place.", "lear_examp": "I looked neat and clean even after the wildest games in the school yard, with all the ribbons that tied my long hair in place."}, {"sense": "If a rule, system, etc. is in place, it has started to exist.", "level": "C2", "dict_examp": "There are now laws in place to prevent this from happening.", "lear_examp": "Let's take the example of Mexico City, where such restrictions have been in place since early 2000."}, {"sense": "used to mean that something is very likely", "level": "C2", "dict_examp": "She will, in all probability, have left before we arrive.", "lear_examp": "Anybody who can fulfill the above conditions will in all probability be successful."}, {"sense": "If something changes in proportion to another thing, it changes to the same degree as that thing.", "level": "C2", "dict_examp": "Your tax payment increases in proportion to your salary.", "lear_examp": "One aspect of the question is the fact that a sportsman's salary is supposedly not in proportion to the number of hours he works."}, {"sense": "the person or thing that is being discussed", "level": "C2", "dict_examp": "He sais that he was at a restaurant with his friends on the night in question.", "lear_examp": "While this is not necessarily false, it should be borne in mind that the events in question are by no means boring or uninteresting."}, {"sense": "thinking back to something that happened  before", "level": "C2", "dict_examp": "In retrospect, I should probably have told her.", "lear_examp": "To cut a long story short I decided to go, though half-heartedly as I still had doubts about it. In retrospect, it turned out to be an unforgettable experience."}, {"sense": "in a bad situation where you do the same things all the time, or where it is impossible to make progress", "level": "C2", "dict_examp": "He seems to be stuck in a rut at the moment.", "lear_examp": "Financial security, all the, let me call them, background benefits are important, but if you do not love what you do, soon you will become bitter, stuck in a rut or worse - you will suffer from depression."}, {"sense": "to be acceptable in a way that will not upset or anger people", "level": "C2", "dict_examp": "His speech was in good taste.", "lear_examp": "I therefore thought that it would be in good taste to write about two of them."}, {"sense": "to be unacceptable in a way that will upset or anger people", "level": "C2", "dict_examp": "He told a joke about a plane crash which I thought was in rather poor taste.", "lear_examp": ""}, {"sense": "in a direct and often angry way", "level": "C2", "dict_examp": "I told him to go away in no uncertain terms.", "lear_examp": "Intellectuals are used to saying in no uncertain terms that money represents the bad side of the sport."}, {"sense": "to understand what someone wants or needs or to understand a situation and act in a way that is suitable for it", "level": "C2", "dict_examp": "The congress is not in tune with the voters.", "lear_examp": "I am not exactly in tune with all the latest trends but I know which styles give me the most satisfaction."}, {"sense": "in the area near a place", "level": "C2", "dict_examp": "A number of buildings in the vicinity of the fire were damaged.", "lear_examp": "Just to briefly introduce myself, my name is Prashant Sharma and I live in the vicinity of the college campus."}, {"sense": "used to say that someone or something does something to a large degree", "level": "C2", "dict_examp": "They celebrate birthdays in a big way.", "lear_examp": "Tourism helps Greece's national economy - which is not at its best - in a big way."}, {"sense": "to be likely to happen", "level": "C2", "dict_examp": "Do you think marriage is in the cards?", "lear_examp": ""}, {"sense": "not in a difficult situation or having problems any more", "level": "C2", "dict_examp": "We had some large debts, but we should be in the clear by next year.", "lear_examp": "\"You're in the clear, you don't have to be afraid any more,\" it said."}, {"sense": "in a cruel way, without showing any emotion", "level": "C2", "dict_examp": "He shot three policemen in cold blood.", "lear_examp": "Returning to the story, when I arrived, I went directly to Hillton Avenue where I should have met 005, but when I arrived at the meeting point I found him lying on the floor with two shots in his back; he had been murdered in cold blood."}, {"sense": "If you tell something to someone in confidence, you do not want them to tell anyone else.", "level": "C2", "dict_examp": "I'm sorry, she told me that in confidence.", "lear_examp": "His real name isn't Piggy but he told Ralph in confidence that they called him that in school because of his appearance."}, {"sense": "working, used, or happening with something or someone else", "level": "C2", "dict_examp": "Our librarians use their knowledge in conjunction with the computer network.", "lear_examp": "Therefore if the banning of private cars takes place in conjunction with development in the public transportation system in that city, this whole development will have more advantages despite some slight difficulties at the start."}, {"sense": "because of or for this reason", "level": "C2", "dict_examp": "This course is good in that it provides a very practical training.", "lear_examp": "Nowadays it is widely argued that professional sports are damaging to people's health in that they involve grueling training sessions as an integral part of the occupation."}]}, {"pos": "adverb", "senses": [{"sense": "into an area or space from the outside of it", "level": "A2", "dict_examp": "Could you bring the clothes in for me?", "lear_examp": "First I brought in the big cake that my father had bought."}, {"sense": "at the place where a person usually lives or works", "level": "B1", "dict_examp": "Mr Ellis isn't in this week.", "lear_examp": "We go in at 8:15."}, {"sense": "having arrived at the place where people can get on or off", "level": "B1", "dict_examp": "What time is Roz's flight due in?", "lear_examp": ""}, {"sense": "given or sent to someone official in order to be read", "level": "B2", "dict_examp": "When does your essay have to be in?", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the details of a particular subject", "level": "C2", "dict_examp": "the ins and outs of the legal system", "lear_examp": "I knew all the ins and outs of every story but I couldn't stay one single day in bed without reading it."}]}]}, {"word": "independent", "poses": [{"pos": "adjective", "senses": [{"sense": "not taking help or money from other people", "level": "B1", "dict_examp": "Grandma's very independent and does all her own shopping and cooking.", "lear_examp": "I'm an independent person, and I like to be."}, {"sense": "not influenced or controlled in any way by other people, events or things", "level": "B2", "dict_examp": "an independent inquiry/organization", "lear_examp": "Although the variety of films you display is good, there is still a group of independent films you always seems to skip."}, {"sense": "An independent country is not governed or ruled by another country.", "level": "B2", "dict_examp": "Belize became fully independent from Britain in 1981.", "lear_examp": "After 1918, our city again became the capital of an independent state."}]}]}, {"word": "incorporate", "poses": [{"pos": "verb", "senses": [{"sense": "to include something as part of another thing", "level": "C2", "dict_examp": "He began to incorporate dance and mime into his plays.", "lear_examp": "These are just some of the ideas that I feel can be incorporated into your project."}]}]}, {"word": "indefinite article", "poses": [{"pos": "noun", "senses": [{"sense": "the grammatical name for the words \"a\" and \"an\" in English or words in other languages that have a similar use", "level": "B1", "dict_examp": "", "lear_examp": ""}]}]}, {"word": "indeed", "poses": [{"pos": "adverb", "senses": [{"sense": "really or certainly, often used to emphasize something", "level": "B1", "dict_examp": "Indeed, it could be the worst environmental disaster in Western Europe this century.", "lear_examp": "Thank you very much indeed."}, {"sense": "used when you say more to support or develop what has already been said", "level": "C2", "dict_examp": "For such creatures speed is not important, indeed it is counterproductive.", "lear_examp": "It would be very difficult to define a country's culture by choosing only one characteristic of that country; indeed, it is a great variety of things such as language, politics, religion, customs, etc. that shape the culture of every country."}]}]}, {"word": "include", "poses": [{"pos": "verb", "senses": [{"sense": "to contain something or someone as a part, or to make something or someone part of something", "level": "A2", "dict_examp": "The bill includes tax and tip.", "lear_examp": "It includes some songs."}]}]}, {"word": "increasingly", "poses": [{"pos": "adverb", "senses": [{"sense": "more and more", "level": "B2", "dict_examp": "to be increasingly important/common", "lear_examp": "Among them are the increasingly popular reality shows and all the daily news about gossip and scandal."}]}]}, {"word": "income", "poses": [{"pos": "noun", "senses": [{"sense": "money that you earn by working, investing, or producing goods", "level": "B2", "dict_examp": "Average incomes have risen by 4.5% over the past year.", "lear_examp": "When you are a student, you don't have any income."}]}]}, {"word": "indication", "poses": [{"pos": "noun", "senses": [{"sense": "a sign showing that something exists or is likely to be true", "level": "C1", "dict_examp": "The jury  gave no indication of their decision as they came back into the courtroom.", "lear_examp": "All three categories show an indication of cutbacks compared to last year."}, {"sense": "a sign showing what someone means or what they intend to do", "level": "C2", "dict_examp": "Helen's face gave no indication of what she was thinking.", "lear_examp": "Rumor had it that Peter secretly brought roses early every morning to her doorstep, as an indication of his love for her."}]}]}, {"word": "index", "poses": [{"pos": "noun", "senses": [{"sense": "an alphabetical list, such as one printed at the back of a book showing which page a subject, name, etc. is found on", "level": "C1", "dict_examp": "Try looking up \"heart disease\" in the index.", "lear_examp": "The negative point of the book was its lack of an index."}]}]}, {"word": "independently", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is independent", "level": "B2", "dict_examp": "The two scientists both made the same discovery independently, at roughly the same time.", "lear_examp": "What students should understand is the existence of links among apparently different subjects and the impossibility of studying them independently or, worse, studying one and neglecting the others."}]}]}, {"word": "indispensable", "poses": [{"pos": "adjective", "senses": [{"sense": "completely necessary", "level": "C2", "dict_examp": "an indispensable tool/guide", "lear_examp": "We should not be led to believe that computers are the indispensable ingredient to our well-being, though neither should we deny their wide-ranging potential."}]}]}, {"word": "individual", "poses": [{"pos": "adjective", "senses": [{"sense": "considered separately from the other things in a group", "level": "B1", "dict_examp": "Say the individual letters of each word out loud.", "lear_examp": "Well, this place is a group of small individual islands and there aren't many things that you can do in the capital city as it's so small and crowded."}, {"sense": "given to or relating to one particular person or thing", "level": "B1", "dict_examp": "We deal with each case on an individual basis.", "lear_examp": "The first lesson started with an individual presentation."}]}, {"pos": "noun", "senses": [{"sense": "a person, especially when considered separately and not as part of a group", "level": "B2", "dict_examp": "We try to treat our students as individuals.", "lear_examp": "I can work as part of a team but also as an individual."}, {"sense": "a person with a particular characteristic", "level": "C2", "dict_examp": "a ruthless individual", "lear_examp": "I can understand that he is nervous and that he has turned into a selfish individual who only cares about himself."}]}]}, {"word": "indicate", "poses": [{"pos": "verb", "senses": [{"sense": "to say something or give a signal to show what you mean or what you intend to do", "level": "B2", "dict_examp": "Please indicate which free gift you would like to receive.", "lear_examp": "Please, indicate if you could attend.  I am looking forward to your reply."}, {"sense": "to show that something exists or is likely to be true", "level": "C1", "dict_examp": "Recent evidence indicates that the skeleton is about 3 million years old.", "lear_examp": "In fact, the study also indicates that time spent on watching TV has surged, especially during the last decade."}]}]}, {"word": "incorrect", "poses": [{"pos": "adjective", "senses": [{"sense": "not correct", "level": "B1", "dict_examp": "an incorrect answer", "lear_examp": "Dear Sir or Madam, I am writing to you concerning some incorrect information about Lampton that I have found in the Student Tourist Guidebook."}]}]}, {"word": "indefinitely", "poses": [{"pos": "adverb", "senses": [{"sense": "for a period of time for which no end has been fixed", "level": "C2", "dict_examp": "His visit has been postponed indefinitely.", "lear_examp": "Each one of them tries so painfully to hide away the natural feelings emanating from within. But it is simply impossible to do so indefinitely."}]}]}, {"word": "indisputable", "poses": [{"pos": "adjective", "senses": [{"sense": "obviously and certainly true", "level": "C2", "dict_examp": "an indisputable fact", "lear_examp": "Taking all the aforementioned into consideration, I adamantly believe that the contribution of reading to all aspects of our lives is indisputable."}]}]}, {"word": "indirect", "poses": [{"pos": "adjective", "senses": [{"sense": "not directly caused by or connected with something", "level": "C1", "dict_examp": "Indirect effects of the fighting include disease and food shortages.", "lear_examp": "At school, children should follow many rules. For example, they should finish their homework and respect other students' opinions.  From these experiences, children can experience social life in indirect ways, and can learn how to be good members of society."}, {"sense": "done or caused in a way that is not obvious", "level": "C2", "dict_examp": "indirect costs", "lear_examp": "Do people seem to be the direct cause of this damage or do they also play an indirect part in generating environmental catastrophe?"}]}]}, {"word": "incredible", "poses": [{"pos": "adjective", "senses": [{"sense": "very good, exciting or large", "level": "B1", "dict_examp": "We had an incredible time that summer.", "lear_examp": "The weather here is incredible and we have the most beautiful beaches in the world, in my opinion."}, {"sense": "impossible, or very difficult, to believe", "level": "B2", "dict_examp": "It seems incredible that no one complained.", "lear_examp": "It was incredible but it was true."}]}]}, {"word": "inconceivable", "poses": [{"pos": "adjective", "senses": [{"sense": "impossible to imagine", "level": "C2", "dict_examp": "It's not inconceivable that soon most cars will be battery powered.", "lear_examp": "First of all, it is inconceivable that a young child should be raised almost without his/her parents, surrounded by myriad toys, gadgets and games instead."}]}]}, {"word": "indifference", "poses": [{"pos": "noun", "senses": [{"sense": "when you do not care about something or have any particular opinions about it", "level": "C2", "dict_examp": "an air of indifference", "lear_examp": "On the other hand, there were some voices expressing their indifference towards money."}]}]}, {"word": "incur", "poses": [{"pos": "verb", "senses": [{"sense": "to lose money, owe money, or have to pay money because of something that has happened", "level": "C2", "dict_examp": "The company incurred huge losses as a result of its  investments.", "lear_examp": "One of the principal problems is that governments all around the world are incurring great costs in order to maintain a national health system."}]}]}, {"word": "increase", "poses": [{"pos": "verb", "senses": [{"sense": "to get bigger or to make something bigger in amount or size", "level": "B1", "dict_examp": "Sales of laptops  have increased over the last few years.", "lear_examp": "It is amazing how the violence in Rio increased in these last few years."}]}, {"pos": "noun", "senses": [{"sense": "a rise in the amount or size of something", "level": "B2", "dict_examp": "price/tax increases", "lear_examp": "Since bicycles became so popular, there has been an increase in the number of accidents."}, {"sense": "If something is on the increase, it is happening more often.", "level": "C1", "dict_examp": "Homelessness is on the increase in many cities.", "lear_examp": "The number of motorists is on the increase everywhere in the world."}]}]}, {"word": "individuality", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being different from others", "level": "C2", "dict_examp": "The houses had no character and no individuality.", "lear_examp": "As an intellectual, he refuses to annihilate his individuality and degenerate into savagery."}]}]}, {"word": "indirectly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not direct", "level": "C1", "dict_examp": "She still controls the company indirectly, through her son.", "lear_examp": "Here we make use of rain water, which is indirectly produced by evaporation of sea water by heat produced by the sun."}]}]}, {"word": "incredibly", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely", "level": "B2", "dict_examp": "I think the team played incredibly well.", "lear_examp": "It was incredibly crowded."}, {"sense": "in a way that is difficult to believe", "level": "C1", "dict_examp": "Incredibly, no one was hurt.", "lear_examp": "Incredibly, and against all my expectations, everything started going wrong from the very beginning."}]}]}, {"word": "inclusion", "poses": [{"pos": "noun", "senses": [{"sense": "when you include someone or something, especially in a group, amount, or event", "level": "C1", "dict_examp": "Her self-portrait was chosen for inclusion in the exhibition.", "lear_examp": "In basketball, for instance, changes in the most important competitions, such as the inclusion of foreign players, have given players the opportunity to be successful not only in their country but also worldwide."}]}]}, {"word": "independence", "poses": [{"pos": "noun", "senses": [{"sense": "when someone looks after themselves and does not need money, help or permission from other people", "level": "B2", "dict_examp": "It's important that parents should allow their children some independence.", "lear_examp": "If you follow my instructions, you'll achieve  financial independence sooner than you would have thought."}, {"sense": "when a country has its own government and is not ruled by another country", "level": "B2", "dict_examp": "Mexico gained its independence from Spain in 1821.", "lear_examp": "After gaining back our independence after the First World War, some bright urban ideas came across."}]}]}, {"word": "inconvenience", "poses": [{"pos": "noun", "senses": [{"sense": "something that is causing difficulty and is annoying, or an annoying situation", "level": "C1", "dict_examp": "The manager apologized for the inconvenience.", "lear_examp": "I am sorry for any inconvenience these requirements may cause to you."}]}]}, {"word": "inconsiderate", "poses": [{"pos": "adjective", "senses": [{"sense": "not caring about other people's situations or the way they feel", "level": "C1", "dict_examp": "It was inconsiderate of you to keep everyone waiting.", "lear_examp": "Some of the tenants have been very inconsiderate in discarding their garbage on the back stairway and blocking the fire exits."}]}]}, {"word": "inclined", "poses": [{"pos": "adjective", "senses": [{"sense": "to have an opinion, but not a strong opinion", "level": "C1", "dict_examp": "I'm inclined to agree with you.", "lear_examp": "I am inclined to believe that the Open Day will reassure all the local residents that our college is one of major importance and our students creative and intelligent people."}, {"sense": "often behaving in a particular way", "level": "C2", "dict_examp": "Tom is inclined to be forgetful.", "lear_examp": "People are naturally inclined to try to earn more at every stage of their career."}, {"sense": "having natural artistic/technical, etc. ability", "level": "C2", "dict_examp": "She's very curious, but not academically inclined.", "lear_examp": "My first suggestion is a pottery class that I think would be greatly appreciated by the more creatively inclined among the students."}]}]}, {"word": "inconvenient", "poses": [{"pos": "adjective", "senses": [{"sense": "involving or causing difficulty, such as unexpected changes or effort", "level": "B2", "dict_examp": "I'm sorry, I seem to have called at an inconvenient time.", "lear_examp": "Please call him and make an alternative arrangement if it is inconvenient for you."}]}]}, {"word": "including", "poses": [{"pos": "preposition", "senses": [{"sense": "used to show that a person or thing is part of a larger group, amount or process", "level": "A2", "dict_examp": "Eight people, including two children, were injured during the storm.", "lear_examp": "At my party we danced a lot and everybody was there, including Amanda, Bruna, and Paola."}]}]}, {"word": "incurable", "poses": [{"pos": "adjective", "senses": [{"sense": "impossible to cure", "level": "C2", "dict_examp": "an incurable disease", "lear_examp": "Most of the incurable illnesses of the past are no longer a threat, which means that the people live longer and longer than they used to."}]}]}, {"word": "indicator", "poses": [{"pos": "noun", "senses": [{"sense": "something that shows what a situation is like", "level": "C2", "dict_examp": "Commodity prices can be a useful indicator of inflation.", "lear_examp": "The right-wing thinkers claim that unemployment is one of the indicators in the economy, displaying lack of balance between industrial output and citizens' demands."}]}]}, {"word": "indifferent", "poses": [{"pos": "adjective", "senses": [{"sense": "not caring about or interested in someone or something", "level": "C2", "dict_examp": "They are indifferent to the plight of the unemployed.", "lear_examp": "Being a resident of our area yourself, you may not be entirely indifferent to the plans of the local authorities concerning the construction of a new supermarket."}]}]}, {"word": "inferiority", "poses": [{"pos": "noun", "senses": [{"sense": "when someone feels they are not as good as other people or when something is not as good as another thing", "level": "C2", "dict_examp": "With these talented sisters, I always had a feeling of inferiority.", "lear_examp": "Critics suggest that these policies have not benefited poor black Americans, that they have impeded the development of social problems and that they have inhibited black Americans and other discriminated groups through a deep sense of inferiority."}]}]}, {"word": "industrious", "poses": [{"pos": "adjective", "senses": [{"sense": "Industrious people work hard.", "level": "C2", "dict_examp": "He is good at his work and very industrious.", "lear_examp": "The society wouldn't be as advanced as it is unless we had well educated, efficient and industrious workers."}]}]}, {"word": "infant", "poses": [{"pos": "noun", "senses": [{"sense": "a baby or very young child", "level": "C2", "dict_examp": "Mothers and infants were allowed to board the plane first.", "lear_examp": "The cells are extremely active while we are infants, but as we grow older, their efficiency weakens."}]}]}, {"word": "industrialized", "poses": [{"pos": "adjective", "senses": [{"sense": "Industrialized countries have a lot of industry.", "level": "C1", "dict_examp": "the industrialized nations", "lear_examp": "The role of women has changed during the past 100 years but there are still a lot of changes needed not only in developing countries but also in industrialized countries like Germany."}]}]}, {"word": "influence", "poses": [{"pos": "noun", "senses": [{"sense": "the power to affect how someone thinks or behaves, or how something develops", "level": "B2", "dict_examp": "The drug companies can have a lot of influence on doctors.", "lear_examp": "Today's computers have a massive influence on the whole of  society."}, {"sense": "If someone or something is a bad/good influence on someone, they have a bad/good effect on them.", "level": "B2", "dict_examp": "Television can be a bad influence on children.", "lear_examp": "Some people say that cell phones are a bad influence on the younger generation."}]}, {"pos": "verb", "senses": [{"sense": "to affect or change how someone or something develops, behaves or thinks", "level": "B2", "dict_examp": "Were you influenced by anybody at the beginning of your career?", "lear_examp": "Our life has been influenced by modern technology."}]}]}, {"word": "influential", "poses": [{"pos": "adjective", "senses": [{"sense": "having a lot of influence", "level": "C1", "dict_examp": "an influential figure in modern jazz", "lear_examp": "Although not being directly involved in global politics anymore, he is still a very powerful and influential person."}]}]}, {"word": "infectious", "poses": [{"pos": "adjective", "senses": [{"sense": "An infectious disease can be passed from one person to another.", "level": "C2", "dict_examp": "Hepatitis is an infectious disease.", "lear_examp": "For example, epidemics of major infectious diseases like cholera or meningitis carry the risk of transferring the focus of infection to any part of the world."}, {"sense": "Infectious laughter or feelings quickly spread from one person to another.", "level": "C2", "dict_examp": "infectious enthusiasm", "lear_examp": "I have found that feelings and emotions are infectious and people tend to be happier with people who are fun-loving and take life less seriously."}]}]}, {"word": "inform", "poses": [{"pos": "verb", "senses": [{"sense": "to tell someone about something", "level": "B1", "dict_examp": "If he calls me again, I shall inform the police.", "lear_examp": "This letter is to inform you that I will not be able to attend tomorrow's class due to medical issues."}, {"sense": "to give someone information about something", "level": "B1", "dict_examp": "Patients should be  informed about the risks.", "lear_examp": "Anyway, once a month I read gossip magazines and every day I read newspapers to be informed."}]}]}, {"word": "infinitely", "poses": [{"pos": "adverb", "senses": [{"sense": "very or very much", "level": "C2", "dict_examp": "Travel is infinitely more comfortable now than it used to be.", "lear_examp": "To sum up, I would like to say that instead of engaging in relentless debates about the problem it would be infinitely preferable to take action as soon as possible."}]}]}, {"word": "informative", "poses": [{"pos": "adjective", "senses": [{"sense": "containing a lot of useful facts", "level": "C1", "dict_examp": "a very informative lecture", "lear_examp": "There were presentations from many different industries, some of them very informative and entertaining."}]}]}, {"word": "infer", "poses": [{"pos": "verb", "senses": [{"sense": "to guess that something is true because of the information that you have", "level": "C2", "dict_examp": "I inferred from the number of cups that he was expecting visitors.", "lear_examp": "From the above, it can be inferred that the major causes of land degradation vary according to regions."}]}]}, {"word": "influx", "poses": [{"pos": "noun", "senses": [{"sense": "the arrival of a lot of people or things at the same time", "level": "C2", "dict_examp": "The town’s economy depends on the summer influx of tourists.", "lear_examp": "Countries are known mainly for their history, that is why there is an influx of tourists in places with historical interest."}]}]}, {"word": "inexperienced", "poses": [{"pos": "adjective", "senses": [{"sense": "without much experience or knowledge of something", "level": "B2", "dict_examp": "Abigail Kennedy was young and inexperienced.", "lear_examp": "The advertisement said that Danny Brook was one of the starring actors but he was replaced by another extremely disappointing and inexperienced actor."}]}]}, {"word": "infrastructure", "poses": [{"pos": "noun", "senses": [{"sense": "the basic systems and services, such as transport and power supplies, that a country or organization uses in order to work effectively", "level": "C1", "dict_examp": "The war has badly damaged the country's infrastructure.", "lear_examp": "It is very easy to build homes but at the same time forgetting to upgrade the infrastructure and facilities."}]}]}, {"word": "industrialization", "poses": [{"pos": "noun", "senses": [{"sense": "the process of developing industries in a country", "level": "C1", "dict_examp": "Japan's rapid industrialization", "lear_examp": "With industrialization and economic development, Hong Kong people's standards of living have also improved dramatically."}]}]}, {"word": "informally", "poses": [{"pos": "adverb", "senses": [{"sense": "in an informal way", "level": "C1", "dict_examp": "It's an outdoor party, so dress informally.", "lear_examp": "We dress casually and very informally and you often see body piercings and tattoos being displayed around the place."}]}]}, {"word": "information", "poses": [{"pos": "noun", "senses": [{"sense": "facts about a situation, person, event, etc.", "level": "A2", "dict_examp": "to find out/get information", "lear_examp": "For other information call me on 753784"}]}]}, {"word": "inflation", "poses": [{"pos": "noun", "senses": [{"sense": "the rate at which prices increase, or a continuing increase in prices", "level": "B2", "dict_examp": "high/low inflation", "lear_examp": "In this country of high inflation we could save some money."}]}]}, {"word": "indoors", "poses": [{"pos": "adverb", "senses": [{"sense": "into or inside a building", "level": "B1", "dict_examp": "Come indoors, it's cold outside.", "lear_examp": "I love being indoors, eating or watching TV."}]}]}, {"word": "infect", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone a disease", "level": "C1", "dict_examp": "Thousands of people were infected with the virus.", "lear_examp": "Furthermore, most times the hotels expel their waste to the sea and they pollute the water.  Consequently, a lot of people have been infected by different kinds of ailments."}, {"sense": "If a computer virus infects a computer, it harms it", "level": "C1", "dict_examp": "My computer was infected by a virus.", "lear_examp": "With CLEAN-MAIL, you can protect your computers from getting infected with viruses effectively: virus-mails are deleted before they even arrive at your mailbox."}, {"sense": "If a place, wound, or substance is infected, it contains bacteria or other things that can cause disease.", "level": "C2", "dict_examp": "The wound became infected.", "lear_examp": "Let's try to think to that poor people they caught it in a hospital because they need blood and doctors gave them infected blood without knowing it."}]}]}, {"word": "inferior", "poses": [{"pos": "adjective", "senses": [{"sense": "not good, or not as good as someone or something else", "level": "C1", "dict_examp": "I've never felt inferior to anyone.", "lear_examp": "Young girls often feel inferior to boys in the same class."}]}, {"pos": "noun", "senses": [{"sense": "someone who is considered to be less important than other people", "level": "C2", "dict_examp": "She considered me her inferior.", "lear_examp": "Broadly speaking, he appears to be an inferior, a non-human, in the opinion of the other boys."}]}]}, {"word": "inevitably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that cannot be avoided", "level": "C1", "dict_examp": "Their arguments inevitably end in tears.", "lear_examp": "Should you, my humble reader, happen to reach fame and fortune, try never to forget that appearing always as an ordinary human being would inevitably grant you more empathy from the people surrounding you."}]}]}, {"word": "inedible", "poses": [{"pos": "adjective", "senses": [{"sense": "not suitable for eating", "level": "C1", "dict_examp": "The meat was inedible.", "lear_examp": "The fruit was rotten, the sandwich inedible."}]}]}, {"word": "infancy", "poses": [{"pos": "noun", "senses": [{"sense": "when you are a baby", "level": "C2", "dict_examp": "Their fourth child died in infancy.", "lear_examp": "When the Romans conquered the world, the child death rate was much higher than now and those who survived infancy hardly ever got beyond forty years of age."}, {"sense": "Something that is in its infancy has only just begun to develop.", "level": "C2", "dict_examp": "In the 1950s, space travel was in its infancy.", "lear_examp": ""}]}]}, {"word": "inevitable", "poses": [{"pos": "adjective", "senses": [{"sense": "certain to happen and unable to be avoided or prevented", "level": "C1", "dict_examp": "The accident was the inevitable consequence/result/outcome of carelessness.", "lear_examp": "Strikes always cause some problems but sometimes they are inevitable."}]}]}, {"word": "inexplicable", "poses": [{"pos": "adjective", "senses": [{"sense": "so strange or unusual that you cannot understand or explain it", "level": "C2", "dict_examp": "To me his behavior was totally inexplicable.", "lear_examp": "Although for inexplicable reasons she can be really stubborn sometimes, I admire her courage to admit her mistakes and apologize."}]}]}, {"word": "ingredient", "poses": [{"pos": "noun", "senses": [{"sense": "a food that is used with other foods in the preparation of a particular dish", "level": "B1", "dict_examp": "The list of ingredients included 1/2 cup of almonds.", "lear_examp": "The  chef had used good, fresh ingredients."}, {"sense": "one of the parts of something successful", "level": "B2", "dict_examp": "Trust is an essential ingredient in a successful marriage.", "lear_examp": "In my opinion it is clear that with these \"ingredients\" you can make an  interesting video about daily life at our school."}]}]}, {"word": "indulge", "poses": [{"pos": "verb", "senses": [{"sense": "to let yourself do or have something that you enjoy but which may be bad for you", "level": "C2", "dict_examp": "When I get my first paycheck I’m going to indulge in a shopping spree.", "lear_examp": "Eating disorders of various kinds are certainly not unknown to our culture, yet we seem to be less concerned about what we shouldn't do than what we tend to indulge ourselves in."}, {"sense": "to let someone do or have what they want", "level": "C2", "dict_examp": "She indulged the kids and let them stay up late.", "lear_examp": "In an attempt to give them instant gratification, their parents do their utmost to fulfill their wishes and as a consequence of this, children become utterly indulged."}]}]}, {"word": "informal", "poses": [{"pos": "adjective", "senses": [{"sense": "not formal or official", "level": "B2", "dict_examp": "The two groups agreed to hold an informal meeting.", "lear_examp": "The dress-code is informal but neat and there'll be plenty of drinks and snacks."}]}]}, {"word": "industrial", "poses": [{"pos": "adjective", "senses": [{"sense": "connected with industry, or having a lot of industry and factories, etc.", "level": "B2", "dict_examp": "industrial expansion", "lear_examp": "I am sure that both ideas will improve the look of our industrial town."}]}]}, {"word": "industry", "poses": [{"pos": "noun", "senses": [{"sense": "the people and activities involved in one type of business", "level": "B1", "dict_examp": "the gas/electricity industry", "lear_examp": "As you know, I would like to work in the tourism industry, so I thought this course could be good to improve my English."}, {"sense": "the production of goods in factories", "level": "B2", "dict_examp": "trade and industry", "lear_examp": "If you are interested in local industry, there is the Prefectural Local Industry museum."}]}]}, {"word": "inexpensive", "poses": [{"pos": "adjective", "senses": [{"sense": "cheap but of good quality", "level": "B1", "dict_examp": "inexpensive children's clothes", "lear_examp": "It has far more advantages than the countryside, starting with the excellent accommodation, which is inexpensive and easy to find."}]}]}, {"word": "individually", "poses": [{"pos": "adverb", "senses": [{"sense": "separately rather than with others", "level": "C1", "dict_examp": "I spoke to them all individually.", "lear_examp": "This has the additional advantage that students can work individually on what seems to be most necessary for them."}]}]}, {"word": "infinite", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely large or great", "level": "C2", "dict_examp": "an infinite variety/number of options", "lear_examp": "In the hands of an expert, a computer can be used for an infinite number of things."}]}]}, {"word": "indoor", "poses": [{"pos": "adjective", "senses": [{"sense": "happening, used or situated inside a building", "level": "A2", "dict_examp": "indoor sports/activities", "lear_examp": "We played a lot of indoor games at the party."}]}]}, {"word": "infection", "poses": [{"pos": "noun", "senses": [{"sense": "a disease in a part of your body that is caused by bacteria or a virus", "level": "B2", "dict_examp": "a serious infection", "lear_examp": "He told me that she was suffering from a kidney infection."}]}]}, {"word": "inequality", "poses": [{"pos": "noun", "senses": [{"sense": "when some groups in a society have more advantages than others", "level": "C2", "dict_examp": "social/racial inequality", "lear_examp": "She was surrounded by poverty and inequality and grew more and more dissatisfied with the Government's policies, whether internal or foreign."}]}]}, {"word": "inefficient", "poses": [{"pos": "adjective", "senses": [{"sense": "Inefficient people or things waste time, money or effort, and do not achieve as much as they should.", "level": "C1", "dict_examp": "an inefficient heating system", "lear_examp": "The room-service was inefficient and the rooms were small and uncomfortable."}]}]}, {"word": "infinitive", "poses": [{"pos": "noun", "senses": [{"sense": "the basic form of a verb that usually follows \"to\"", "level": "B1", "dict_examp": "In the sentences \"I had to go\" and \"I must go,\" \"go\" is an infinitive.", "lear_examp": ""}]}]}, {"word": "inner", "poses": [{"pos": "adjective", "senses": [{"sense": "on the inside or near the middle of something", "level": "B2", "dict_examp": "Leading off the main hall is a series of small inner rooms.", "lear_examp": "Even in the inner city,  streets are dark and don't give the feeling of safety after sunset."}, {"sense": "Inner feelings or thoughts are ones that you do not show or tell other people.", "level": "B2", "dict_examp": "Sarah always seemed to have a deep sense of inner peace.", "lear_examp": "Every now and then everybody feels an inner call for changes, and one of those changes might be a journey somewhere in the world."}]}]}, {"word": "injured", "poses": [{"pos": "adjective", "senses": [{"sense": "hurt or physically harmed", "level": "B2", "dict_examp": "She was told to stay in bed to rest her injured back.", "lear_examp": "Zoos can take care of injured animals and help them."}]}]}, {"word": "initiative", "poses": [{"pos": "noun", "senses": [{"sense": "a plan or activity that is done to solve a problem or improve a situation", "level": "C1", "dict_examp": "a new government initiative to reduce crime", "lear_examp": "Any government as well as grass root initiative will have an effect on pollution problems, but firstly, we need to change our society's overall mentality."}, {"sense": "the ability to make decisions and do things without needing to be told what to do", "level": "C1", "dict_examp": "We need someone who can work on their own initiative.", "lear_examp": "It is difficult to judge whether you show more initiative than the others or not."}, {"sense": "to be the first person to do something that solves a problem or improves a situation", "level": "C1", "dict_examp": "Jackson had taken the initiative and prepared a report.", "lear_examp": "I took the initiative to contact Sue Wilton, who is the manager of the restaurant \"El Plato\"."}]}]}, {"word": "inquire", "poses": [{"pos": "verb", "senses": [{"sense": "to ask for information", "level": "B2", "dict_examp": "Should I inquire about the price of tickets?", "lear_examp": "\"Say Mary, when did the war begin?\" inquired the old lady."}]}]}, {"word": "initiate", "poses": [{"pos": "verb", "senses": [{"sense": "to make something begin", "level": "C2", "dict_examp": "The reforms were initiated by Gorbachev.", "lear_examp": "I hope the college will initiate interesting new courses, regardless of financial issues, to promote a good image."}]}]}, {"word": "innocent", "poses": [{"pos": "adjective", "senses": [{"sense": "not guilty of committing a crime", "level": "B2", "dict_examp": "He firmly believes that she is innocent of the crime.", "lear_examp": "The plan works: the jury thinks that the wife is a notorious liar and her husband is found innocent."}, {"sense": "not having much experience of life and not knowing about the bad things that can happen", "level": "B2", "dict_examp": "an innocent young woman", "lear_examp": "She is so innocent and doesn't understand anything which is happening around her."}, {"sense": "used to emphasize that someone who was hurt had done nothing wrong", "level": "B2", "dict_examp": "Several innocent civilians were killed in the bombing.", "lear_examp": "While Jem was stealing horses, his brother was a murderer of innocent people."}, {"sense": "not intended to harm or upset anyone", "level": "C2", "dict_examp": "It was an innocent mistake.", "lear_examp": "On the spur of the moment, I advised him to try it and that's what turned an innocent episode into a nightmare."}]}]}, {"word": "ink", "poses": [{"pos": "noun", "senses": [{"sense": "a colored liquid that you use for writing, printing, or drawing", "level": "B1", "dict_examp": "a bottle of ink", "lear_examp": "Her father had shown her once how to write with an invisible ink."}]}]}, {"word": "insensitive", "poses": [{"pos": "adjective", "senses": [{"sense": "not noticing or not caring about other people's feelings", "level": "C1", "dict_examp": "an insensitive remark", "lear_examp": "This way of thinking is very important because a person who spends a lot of time alone can become self-centered and insensitive to others."}]}]}, {"word": "innovative", "poses": [{"pos": "adjective", "senses": [{"sense": "using new methods or ideas", "level": "C1", "dict_examp": "The new owners introduced  a number of innovative solutions.", "lear_examp": "Problems like this will probably appear again and again but we have to believe that they can be solved in an innovative way."}]}]}, {"word": "input", "poses": [{"pos": "noun", "senses": [{"sense": "ideas, money, effort, etc. that you put into a process or acitivity in order to help it succeed", "level": "B2", "dict_examp": "Input from students is used to develop new and exciting courses.", "lear_examp": "I could go on but my intention was to give you some input to stimulate your brain!"}, {"sense": "information that is put into a computer or the act of putting information into a computer", "level": "B2", "dict_examp": "Data input is carried out by a team based overseas.", "lear_examp": ""}]}]}, {"word": "innovation", "poses": [{"pos": "noun", "senses": [{"sense": "a new idea or method that is being tried for the first time, or the use of such ideas or methods", "level": "C1", "dict_examp": "the latest innovations in education", "lear_examp": "There was a barrage of creativity and innovation rarely seen in human history."}]}]}, {"word": "innate", "poses": [{"pos": "adjective", "senses": [{"sense": "An innate quality or ability is one that you were born with, not one you have learned.", "level": "C2", "dict_examp": "He has an innate desire to win.", "lear_examp": "His innate ability to act as a motivator for other people has helped him obtain excellent leadership skills."}]}]}, {"word": "injury", "poses": [{"pos": "noun", "senses": [{"sense": "damage to someone's body in  an accident or an attack", "level": "B2", "dict_examp": "a head/back/knee injury", "lear_examp": "Then I understood that nobody was seriously hurt but we all had some injuries."}, {"sense": "to make someone's bad situation worse by doing something else to upset them", "level": "C2", "dict_examp": "To add insult to injury, we had to pay for the damage!", "lear_examp": "To add insult to injury, such an approach often turns out to be counterproductive."}]}]}, {"word": "injustice", "poses": [{"pos": "noun", "senses": [{"sense": "a situation or action in which people are treated unfairly", "level": "C1", "dict_examp": "the fight against racial injustice", "lear_examp": "Adults enjoy the stories too, because it somehow reflects the society that we live in, and how justice is always on the stronger side than injustice."}]}]}, {"word": "insect", "poses": [{"pos": "noun", "senses": [{"sense": "a small creature with six legs, for example a bee or a fly", "level": "A2", "dict_examp": "Ants, beetles, butterflies and flies are all insects.", "lear_examp": "There are a lot of butterflies in the park, and they are beautiful insects."}]}]}, {"word": "inseparable", "poses": [{"pos": "adjective", "senses": [{"sense": "Two things that are inseparable are so closely connected that you cannot consider them separately.", "level": "C2", "dict_examp": "Rossetti's work was inseparable from his life.", "lear_examp": "The memory and the experience you have of the object create a special bond between you and the object, and the bond makes you inseparable from the object because you are inseparable from the memory."}, {"sense": "People who are inseparable are always together because they are such good friends.", "level": "C2", "dict_examp": "The two girls got on very well and soon became inseparable.", "lear_examp": "We were inseparable pals playing that favorite game of ours day and night."}]}]}, {"word": "inhibition", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of embarrassment or worry that prevents you from saying or doing what you want", "level": "C2", "dict_examp": "The whole point about dancing is to lose all your inhibitions.", "lear_examp": "Secondly, parents are the closest and most easily accessible wealth of knowledge. Children lose their inhibitions and freely ask their curious questions."}]}]}, {"word": "insane", "poses": [{"pos": "adjective", "senses": [{"sense": "very silly or stupid", "level": "C1", "dict_examp": "an insane decision", "lear_examp": "It was an insane idea to accommodate me so far away from the school (approximately four miles)."}, {"sense": "seriously mentally ill", "level": "C2", "dict_examp": "a hospital for the criminally insane", "lear_examp": "It seemed as if she had become insane but it was only a way of surviving an impossible situation."}]}]}, {"word": "innumerable", "poses": [{"pos": "adjective", "senses": [{"sense": "very many, or too many to count", "level": "C2", "dict_examp": "innumerable problems", "lear_examp": "Modern aviation also created innumerable benefits for the people in general."}]}]}, {"word": "initially", "poses": [{"pos": "adverb", "senses": [{"sense": "at the beginning", "level": "B2", "dict_examp": "Initially, most people approved of the new plan.", "lear_examp": "He initially disagreed with his wife but after much persuasion, he finally gave in."}]}]}, {"word": "inherit", "poses": [{"pos": "verb", "senses": [{"sense": "to receive money or possessions from someone after that person has died", "level": "C2", "dict_examp": "Who will inherit the house when he dies?", "lear_examp": "I wouldn't mind if it was just a scratch to any other piece of furniture, but I couldn't contain myself when my mother burst into tears looking at a broken leg of an antique chair inherited from my grandfather."}, {"sense": "to have the same physical or mental characteristics as one of your parents or grandparents", "level": "C2", "dict_examp": "Miranda has inherited her father's red hair.", "lear_examp": "Her grandparents were from Sweden, and she had inherited blond hair and blue eyes from them."}]}]}, {"word": "insecure", "poses": [{"pos": "adjective", "senses": [{"sense": "having no confidence in yourself and what you can do", "level": "C1", "dict_examp": "a shy, insecure teenager", "lear_examp": "People felt insecure and nervous, their morale went down."}, {"sense": "not safe or protected", "level": "C2", "dict_examp": "Many of our staff are worried because their jobs are insecure.", "lear_examp": ""}]}]}, {"word": "injure", "poses": [{"pos": "verb", "senses": [{"sense": "to hurt a person, animal or part of your  body", "level": "B1", "dict_examp": "A bomb exploded at the embassy, injuring several people.", "lear_examp": "Nobody from my family was injured, so that was one good piece of news."}]}]}, {"word": "insecurity", "poses": [{"pos": "noun", "senses": [{"sense": "the state of not being confident or not feeling safe", "level": "C2", "dict_examp": "We have to live with the insecurity of not knowing if we'll still have a job next week.", "lear_examp": "Many of us have experienced moments of insecurity when everything seems so big and new that you wonder if you can deal with all the pressure or whether you will eventually manage to adapt to the situation at hand."}]}]}, {"word": "inhuman", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely cruel", "level": "C2", "dict_examp": "the inhuman treatment of prisoners", "lear_examp": "Not very long ago, when some of us thought it wasn't possible anymore, the same terrible inhuman mistakes as in the past were happening."}]}]}, {"word": "inhabitant", "poses": [{"pos": "noun", "senses": [{"sense": "a person or animal that lives in a particular place", "level": "B2", "dict_examp": "a city of 5 million inhabitants", "lear_examp": "I think that the town has about 2000 inhabitants in winter."}]}]}, {"word": "innocence", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is not guilty of a crime", "level": "C1", "dict_examp": "She pleaded her innocence, but no one believed her.", "lear_examp": "They were released after seven years in jail and were determined to prove their innocence and find the real murderer."}, {"sense": "when someone does not have much experience of life and does not know about the bad things that happen", "level": "C2", "dict_examp": "the innocence of childhood", "lear_examp": "From the day we're born, our awareness of the world and its people increases. With it comes knowledge and capability but also the loss of innocence."}]}]}, {"word": "inheritance", "poses": [{"pos": "noun", "senses": [{"sense": "money or possessions that becone yours after someone dies", "level": "C2", "dict_examp": "Nick has sold off much of his inheritance.", "lear_examp": "He went to Oxford and by the time he was forty he had set up a good textile factory in London with his inheritance."}]}]}, {"word": "injection", "poses": [{"pos": "noun", "senses": [{"sense": "when someone puts a drug into your body using a needle", "level": "C2", "dict_examp": "an injection of insulin", "lear_examp": "This visit was only to be the beginning of it all, as numerous trips to the hospital, fertility clinics, pills and injections soon became a part of their lives together."}, {"sense": "when a large amount of money is provided for a plan, service, organization, etc.", "level": "C2", "dict_examp": "The university has welcomed the $5 million cash injection.", "lear_examp": "There are few areas such as the information technology, library resources and overseas visits, that need this financial injection."}]}]}, {"word": "inquiry", "poses": [{"pos": "noun", "senses": [{"sense": "a question that you ask when you want more information", "level": "B1", "dict_examp": "I've made some inquiries about the cost of a round-the-world ticket.", "lear_examp": "From what I understand from your inquiry you are looking for a babysitter to take care of three children aged 8, 6 and 3 on Saturday evenings and occasionally on Sunday afternoons."}, {"sense": "an official process to discover the facts about something bad that has happened", "level": "C2", "dict_examp": "a judicial inquiry", "lear_examp": "I am very much surprised that such problems had not been foreseen by the public inquiry."}, {"sense": "the process of asking questions in order to get information", "level": "C2", "dict_examp": "Inquiry into the matter is pointless - no one will tell you anything.", "lear_examp": "Upon inquiry, it became clear it was in Tim's possession, more precisely in his diary."}]}]}, {"word": "innocently", "poses": [{"pos": "adverb", "senses": [{"sense": "in an innocent way", "level": "B2", "dict_examp": "\"Have I done something wrong?\" she asked innocently.", "lear_examp": "Denny had innocently turned on the light to see if there was anything of interest in the other room."}]}]}, {"word": "inherent", "poses": [{"pos": "adjective", "senses": [{"sense": "existing as a natural and basic part of something", "level": "C2", "dict_examp": "The desire for freedom is inherent in all people.", "lear_examp": "However, it is important to bear in mind the inherent pressures that come with fortune and fame."}]}]}, {"word": "initial", "poses": [{"pos": "noun", "senses": [{"sense": "the first letter of a name, especially when used to represent a name", "level": "B1", "dict_examp": "He wrote his initials, P.M.R., at the bottom of the page.", "lear_examp": "It was black and my initials were inside it."}]}, {"pos": "adjective", "senses": [{"sense": "first, or happening at the beginning", "level": "B2", "dict_examp": "My initial reaction was one of anger.", "lear_examp": "All this may seem trivial and unimportant to an ordinary man addicted to his TV-set, forgetting the initial impulse that made him choose this way of life."}]}]}, {"word": "inhabit", "poses": [{"pos": "verb", "senses": [{"sense": "to live in a place", "level": "C2", "dict_examp": "an area inhabited by artists and writers", "lear_examp": "Uncountable species inhabit this vast territory of impenetrable, deep forest."}]}]}, {"word": "inspire", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone feel that they want to do something and can do it", "level": "B2", "dict_examp": "A drama teacher at school had  inspired Sam to become an actor.", "lear_examp": "This has inspired me to finally write to you and ask if there is a possibility for me to join the painting course this spring."}, {"sense": "to make someone have a particular feeling or reaction", "level": "B2", "dict_examp": "He inspires great loyalty in his staff.", "lear_examp": "In today's world where everybody is selfish, it is hard to find a person to admire, a role model to be inspired by."}, {"sense": "to give someone an idea for a book, play, painting, etc.", "level": "B2", "dict_examp": "This television drama was inspired by a true story.", "lear_examp": "Most of her books are inspired by her life in Bulgaria and the adventures she had herself."}]}]}, {"word": "institute", "poses": [{"pos": "noun", "senses": [{"sense": "an organization where people do a particular kind of scientific, educational or social work, or the buildings which it uses", "level": "B2", "dict_examp": "the Massachusetts Institute of Technology", "lear_examp": "With this jump she would raise money for a cancer institute in London."}]}]}, {"word": "inspect", "poses": [{"pos": "verb", "senses": [{"sense": "to look at something or someone carefully in order to discover information, especially about their quality or condition", "level": "C1", "dict_examp": "After the crash, both drivers got out and inspected their cars for damage.", "lear_examp": "I invite you to inspect our facilities so that you can persuade yourself about the lack of equipment."}]}]}, {"word": "instruction", "poses": [{"pos": "noun", "senses": [{"sense": "information that explains how to do or use something", "level": "A2", "dict_examp": "You obviously didn't read the instructions properly.", "lear_examp": "Please read these instructions."}, {"sense": "the activity of teaching or training someone, or the information you are being taught", "level": "C2", "dict_examp": "The course gives you basic instruction in car  maintenance and repairs.", "lear_examp": "Notwithstanding, he shared not only his happiness, but also his money, contributing to the formation of an institution that has helped many children and adolescents from lower classes, by providing a wide range of sports activities coupled with educational instruction."}, {"sense": "something that someone tells you to do", "level": "C2", "dict_examp": "He gave me strict instructions to get there by eight.", "lear_examp": "I have given strict instructions to Mr. Jones that expenditures are to be at a minimum, and that the parameters defined in our budget must be strictly adhered to."}]}]}, {"word": "instruct", "poses": [{"pos": "verb", "senses": [{"sense": "to officially tell someone to do something", "level": "C1", "dict_examp": "Employees are instructed not to use the telephones for personal calls.", "lear_examp": "We were instructed to pack all our belongings in the boxes that were provided by your company as well as bubble wrap all furniture as per the instructions."}, {"sense": "to teach someone about something", "level": "C2", "dict_examp": "She is there to instruct people in the safe use of the gym equipment.", "lear_examp": "He instructed her in Chinese boxing, pretending that she was a male, and she spent five years of her childhood performing hard exercises, while Mui was playing with other girls."}]}]}, {"word": "instead of", "poses": [{"pos": "preposition", "senses": [{"sense": "in place of", "level": "B1", "dict_examp": "You can go instead of me, if you want.", "lear_examp": "I had to admit that I would prefer to go with my friends and I decided to go with them instead of being with my parents."}]}]}, {"word": "insignificant", "poses": [{"pos": "adjective", "senses": [{"sense": "not important or large enough to consider or worry about", "level": "C1", "dict_examp": "insignificant differences", "lear_examp": "Second, the \"sudden downpour of rain\" you reported and which \"ruined\" the show was actually a short and insignificant one that only lasted a few minutes."}]}]}, {"word": "instructor", "poses": [{"pos": "noun", "senses": [{"sense": "someone who teaches a particular sport or activity", "level": "B1", "dict_examp": "a driving instructor", "lear_examp": "There are professional instructors working in this club."}]}]}, {"word": "instead", "poses": [{"pos": "adverb", "senses": [{"sense": "in place of someone or something else", "level": "A2", "dict_examp": "There's no coffee - would you like a cup of tea instead?", "lear_examp": "I don't want to use the dark blue paint. I am going to use the sky-blue paint instead."}]}]}, {"word": "inside", "poses": [{"pos": "preposition", "senses": [{"sense": "in or into a room, building, container, etc.", "level": "A1", "dict_examp": "There were some keys inside the box.", "lear_examp": "I kept it inside the jewel box."}]}, {"pos": "adverb", "senses": [{"sense": "in or into a room, building, container, etc.", "level": "A2", "dict_examp": "I'm freezing, let's go back inside.", "lear_examp": "We can stay inside and play with the computer."}, {"sense": "If you have a feeling inside, you have a feeling although you might not show it to other people.", "level": "B2", "dict_examp": "She couldn't cope with the grief she felt inside.", "lear_examp": "They had to go to the vet more often but it wasn't hard for them because of the love that they felt inside."}]}, {"pos": "adjective", "senses": [{"sense": "in or on the part of something under its surface", "level": "B2", "dict_examp": "He put the documents carefully in his inside pocket.", "lear_examp": "At first Chris didn't seem to recognize him, but as soon as he did, his hand reached into his inside pocket."}, {"sense": "information that is only known by people who are part of an organization, group, etc.", "level": "C2", "dict_examp": "I needed someone with inside knowledge to back up my story.", "lear_examp": "I'm pretty sure that getting in touch with the customs and lifestyle of another country will open a completely new horizon to the students and they'll be enchanted by the 'inside knowledge' they will be able to gain."}]}, {"pos": "noun", "senses": [{"sense": "the inner part, space or side of something", "level": "B2", "dict_examp": "Did you clean the inside of the car?", "lear_examp": "Anyway, after the show I felt hungry so I went to the restaurant but it was closed because they were having the inside altered."}, {"sense": "If a piece of clothing is inside out, the part that is usually outside is  on the inside.", "level": "B2", "dict_examp": "She had her sweater on inside out.", "lear_examp": ""}, {"sense": "to know everything about something", "level": "C1", "dict_examp": "He knows the system inside out.", "lear_examp": "The participants got to know Britain inside out and they are happy with the knowledge they gained."}]}]}, {"word": "insight", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to understand what something is really like, or an example of this", "level": "C1", "dict_examp": "The book gives a fascinating insight into the world of art.", "lear_examp": "Special courses were offered, which provided deep insights into fascinating topics - they were great fun."}]}]}, {"word": "inseparable", "poses": [{"pos": "adjective", "senses": [{"sense": "Two things that are inseparable are so closely connected that you cannot consider them separately.", "level": "C2", "dict_examp": "Rossetti's work was inseparable from his life.", "lear_examp": "The memory and the experience you have of the object create a special bond between you and the object, and the bond makes you inseparable from the object because you are inseparable from the memory."}, {"sense": "People who are inseparable are always together because they are such good friends.", "level": "C2", "dict_examp": "The two girls got on very well and soon became inseparable.", "lear_examp": "We were inseparable pals playing that favorite game of ours day and night."}]}]}, {"word": "installation", "poses": [{"pos": "noun", "senses": [{"sense": "the process of putting new equipment into position", "level": "C1", "dict_examp": "Do you have to pay extra for installation?", "lear_examp": "Last but not least, students asked for the installation of a beverage machine - that would be really convenient for them."}, {"sense": "the process of putting a computer program onto a computer", "level": "C1", "dict_examp": "the installation of new software", "lear_examp": "Personally, I believe that the installation of the Japanese Word version could considerably improve the efficiency of my work."}]}]}, {"word": "instantly", "poses": [{"pos": "adverb", "senses": [{"sense": "immediately", "level": "B2", "dict_examp": "Both drivers were killed instantly.", "lear_examp": "To talk to a friend from another city or country instantly online is really nice and exciting."}]}]}, {"word": "insomnia", "poses": [{"pos": "noun", "senses": [{"sense": "when you find it difficult to sleep", "level": "C2", "dict_examp": "Many people suffer from insomnia.", "lear_examp": "If we take the example of the politicians, we will find that those who are honest are the ones who suffer from insomnia (caused by threats and worries) while the most corrupt ones are safe asleep."}]}]}, {"word": "insist", "poses": [{"pos": "verb", "senses": [{"sense": "to demand that something must be done or that you must have a particular thing", "level": "B1", "dict_examp": "He insists we leave at 8:30.", "lear_examp": "But if they insist, you should listen to them because our parents love us and they want the best for us."}, {"sense": "to say firmly that something is true", "level": "B2", "dict_examp": "Greg still insists (that) he did nothing wrong.", "lear_examp": "Mrs. McGillicuddy saw a woman being strangled on a train and, in spite of everybody seeming not to believe her, she insisted that she was right and, with her friend's help, proved it."}, {"sense": "to keep doing something, even if it annoys other people or people think it is not good for you", "level": "C1", "dict_examp": "She insists on cooking all her own meals.", "lear_examp": "Young people often insist on doing everything on their own and consider advice almost an attack on their personal opinion."}]}]}, {"word": "instinct", "poses": [{"pos": "noun", "senses": [{"sense": "the way someone naturally reacts or behaves, without having to think or learn about it", "level": "C2", "dict_examp": "a mother's instinct to protect her children", "lear_examp": "Unfortunately, there is a tendency for parental protection, which is a natural instinct of any parent regarding the safety of one's child."}]}]}, {"word": "inspiration", "poses": [{"pos": "noun", "senses": [{"sense": "someone or something that gives you ideas for doing something", "level": "B2", "dict_examp": "The golden autumn light provided the inspiration for the painting.", "lear_examp": "Working with children makes me happy and gives me inspiration."}, {"sense": "to be so good that someone else admires you and is encouraged by your behavior", "level": "C2", "dict_examp": "The way she has dealt with her illness is an inspiration to us all.", "lear_examp": "She will always be an inspiration to me for her great strength, knowledge and courage."}, {"sense": "a sudden good idea about what you should do", "level": "C2", "dict_examp": "I've had an inspiration about Andy's birthday present.", "lear_examp": ""}]}]}, {"word": "insert", "poses": [{"pos": "verb", "senses": [{"sense": "to put something into something else", "level": "C1", "dict_examp": "Insert the coin in the slot.", "lear_examp": "You just insert the CD-ROM; the rest will happen automatically."}, {"sense": "to add something to the middle of a document or piece of writing", "level": "C1", "dict_examp": "He inserted a new paragraph.", "lear_examp": "In the future it will be possible to buy paintings via the internet. The prices will be inserted under each painting."}]}]}, {"word": "insofar as", "poses": [{"pos": "conjunction", "senses": [{"sense": "to the degree that", "level": "C2", "dict_examp": "The story is based insofar as possible on notes made by Scott himself.", "lear_examp": "Consequently the cited statement is definitely true but understates its point insofar as it neglects any time horizon."}]}]}, {"word": "instance", "poses": [{"pos": "noun", "senses": [{"sense": "for example", "level": "B1", "dict_examp": "In the electronics industry, for instance, 5000 jobs are being lost.", "lear_examp": "For instance, you can do mountain walks."}, {"sense": "an example of a particular type of event, situation, or behavior", "level": "C1", "dict_examp": "There have been several instances of violence in the school.", "lear_examp": "There may be instances when the situation is exactly the opposite, but in this case, it was the way that my friend's sister was brought up that triumphed."}]}]}, {"word": "instant", "poses": [{"pos": "adjective", "senses": [{"sense": "happening immediately, without any delay", "level": "B2", "dict_examp": "This type of account offers you instant access to your money.", "lear_examp": "Therefore, the reception should be functional for students, that is, the students should get an instant answer when they have a question."}]}]}, {"word": "install", "poses": [{"pos": "verb", "senses": [{"sense": "to put a computer program onto a computer so that the computer can use it", "level": "B1", "dict_examp": "Andrew, can you help me install this software?", "lear_examp": "We have learned how to install components like a Soundboard or a CD-Rom drive."}, {"sense": "to put a piece of equipment somewhere and make it ready for use", "level": "B1", "dict_examp": "The plumber is coming tomorrow to install the new washing machine.", "lear_examp": "On my third day I helped them to install the sound system."}]}]}, {"word": "institution", "poses": [{"pos": "noun", "senses": [{"sense": "a large and important organization, such as a university or bank", "level": "B2", "dict_examp": "a medical/educational/financial institution", "lear_examp": "Firstly, it's important to gain information about the institution where we want to work."}, {"sense": "a building where people are sent so they can be looked after, for example a prison or a hospital", "level": "B2", "dict_examp": "a young offenders' institution", "lear_examp": "I was working for a social institution that looks after poor children."}, {"sense": "a custom that has existed for a long time", "level": "C2", "dict_examp": "the institution of marriage", "lear_examp": "Nowadays, the institution of marriage seems to be coming back into fashion, and many youngsters who regrd themselves as mature experience wedlock at an increasingly early age."}]}]}, {"word": "inspector", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to check that things are being done correctly", "level": "B2", "dict_examp": "a health/safety inspector", "lear_examp": "My grandfather was a ticket inspector and he was always telling incredible stories about the old times when train was the fastest way of traveling."}, {"sense": "a police officer of high rank", "level": "B2", "dict_examp": "", "lear_examp": "As you know I am a police inspector."}]}]}, {"word": "inspection", "poses": [{"pos": "noun", "senses": [{"sense": "an official look to check that something is correct, legal, or in good condition", "level": "C1", "dict_examp": "Fire officers carried out an inspection of the building.", "lear_examp": "According to the contract signed with your company on September 25th 2008, an inspection of the goods was done at the time of the packing."}, {"sense": "when you look at something carefully", "level": "C2", "dict_examp": "On closer inspection, the painting was discovered to be a fake.", "lear_examp": ""}]}]}, {"word": "interact", "poses": [{"pos": "verb", "senses": [{"sense": "to talk and do things with other people", "level": "B2", "dict_examp": "At school, teachers said he interacted well with other students.", "lear_examp": "People say that when you use a computer you get addicted and don't interact with people."}]}]}, {"word": "integral", "poses": [{"pos": "adjective", "senses": [{"sense": "necessary and important as part of something", "level": "C1", "dict_examp": "The Internet has become an integral part of modern life.", "lear_examp": "Over the last few years, computers have become an integral part of our lives."}]}]}, {"word": "intent", "poses": [{"pos": "noun", "senses": [{"sense": "when you want and plan to do something", "level": "C2", "dict_examp": "It had not been his intent to hurt anyone.", "lear_examp": "I would suggest some recommendations on how to improve the service of this library with the intent of attracting more people."}, {"sense": "in all the most important ways", "level": "C2", "dict_examp": "To all intents and purposes, the project was a disaster.", "lear_examp": "To all intents and purposes, the qualities needed to achieve success are based on the same ideas."}]}, {"pos": "adjective", "senses": [{"sense": "to be determined to do or achieve something", "level": "C2", "dict_examp": "She seems intent on winning this year's tennis tournament.", "lear_examp": "It is a venue intent on showing alternative music."}]}]}, {"word": "integrity", "poses": [{"pos": "noun", "senses": [{"sense": "honesty and the ability to do or know what is morally right", "level": "C2", "dict_examp": "a woman of great integrity", "lear_examp": "This growing shopping mania is also said to create an increasingly materialistic society, hence, our children grow up forgetting the basic values of life - simplicity, integrity, humility and plain hard work."}]}]}, {"word": "integrate", "poses": [{"pos": "verb", "senses": [{"sense": "to become part of a group or society, or to help someone do this", "level": "C1", "dict_examp": "After a few weeks of training he was fully integrated into the team.", "lear_examp": "I am a determined, spontaneous person and I have the ability to integrate well."}]}]}, {"word": "intelligent", "poses": [{"pos": "adjective", "senses": [{"sense": "showing intelligence, or able to learn and understand things easily", "level": "B1", "dict_examp": "a highly intelligent young man", "lear_examp": "I've met my English teacher - she's very friendly and, I think, very intelligent."}]}]}, {"word": "intact", "poses": [{"pos": "adjective", "senses": [{"sense": "not damaged or destroyed", "level": "C2", "dict_examp": "Many of the old buildings are still intact.", "lear_examp": "I am fortunate that my grandmother kept it intact in her attic until I discovered it two years ago."}]}]}, {"word": "insure", "poses": [{"pos": "verb", "senses": [{"sense": "to make something certain to happen", "level": "B2", "dict_examp": "Please insure that your name is at the top of your examination paper.", "lear_examp": "So in my opinion we can accept keeping animals in zoos but only if we insure them good living conditions and we do not want to gain profits above all."}]}]}, {"word": "interest", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of wanting to give your attention to something or of wanting to discover more about it", "level": "B1", "dict_examp": "I've always had an interest in astronomy.", "lear_examp": "Well, really I don't have much interest in clothes."}, {"sense": "something  that you enjoy doing, studying or experiencing", "level": "B1", "dict_examp": "On his form he lists his interests as cycling, the cinema and cooking.", "lear_examp": "In your next letter tell me about your hobbies and interests."}, {"sense": "the quality that makes you think that something is interesting", "level": "B1", "dict_examp": "Nothing much of interest was  discussed.", "lear_examp": "We visited the Eiffel Tower and lots of other places of interest."}, {"sense": "money which is charged by a bank or other financial organization for borrowing money", "level": "C1", "dict_examp": "Interest charges on credit cards  are can be very high.", "lear_examp": "Extremely high interest rates and high unemployment were a fatal combination for many families."}, {"sense": "money that you earn from keeping your money in an account in a bank or other financial organization", "level": "C1", "dict_examp": "You should put the money in a savings account where it will earn interest.", "lear_examp": ""}, {"sense": "to help someone and give them an advantage", "level": "C1", "dict_examp": "It may not be in your interest to change jobs so soon.", "lear_examp": "It is in my interests to meet new people and I find it easy to go and talk to people I do not know."}, {"sense": "in order to achieve a particular situation or quality", "level": "C2", "dict_examp": "In the interest of safety, passengers are advised to wear their seat belts at all times.", "lear_examp": "First of all, do make sure that the front door is always locked. In the interests of everybody's security, it is essential to remember this."}, {"sense": "something that gives someone or something an advantage", "level": "C2", "dict_examp": "A union looks after the interests of its members.", "lear_examp": "I realize that you are trying to serve your customers the best way you can, but you might want to consider the interests of the people who live in this area."}, {"sense": "a situation where someone cannot make fair decisions because they are influenced by something", "level": "C2", "dict_examp": "She resigned from the committee because of a conflict of interest.", "lear_examp": "It could become a conflict of interest, but he never lets it."}]}, {"pos": "verb", "senses": [{"sense": "If someone or something interests you, you want to give them your attention and discover more about them.", "level": "B1", "dict_examp": "Sports have never really interested me.", "lear_examp": "Fortunately I saw an advertisement for a job in the local newspaper that might interest you."}]}]}, {"word": "insufficient", "poses": [{"pos": "adjective", "senses": [{"sense": "not enough", "level": "C1", "dict_examp": "insufficient information", "lear_examp": "In contrast to your brochure, we did not have any special entertainment at the hotel and the dinner was insufficient in terms of not only its quality but also the quantity."}]}]}, {"word": "interaction", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of talking and doing things with other people, or the way you do this", "level": "C1", "dict_examp": "Our work involves a lot of interaction with the customers.", "lear_examp": "The interaction between the different groups in the Big Brother house is also very entertaining."}]}]}, {"word": "intelligence", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to learn, understand and think about things", "level": "B2", "dict_examp": "an intelligence test", "lear_examp": "The dominant species among animals are pigs with their superior intelligence."}]}]}, {"word": "intellectual", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to your ability to think and to understand things, especially complicated ideas", "level": "B2", "dict_examp": "intellectual and physical development", "lear_examp": "First of all, I don't think your programme needs any improvement: in my opinion, your selection of films is already very satisfying because it includes both spectacular Hollywood movies and intellectual films."}, {"sense": "interested in learning and in thinking about complicated ideas", "level": "C2", "dict_examp": "She's very intellectual.", "lear_examp": "He made a good impression on her from the beginning, dressed in a dark blue evening suit, with a patterned bow tie, glimmering leather shoes and flashing spectacles that made him look very intellectual."}]}, {"pos": "noun", "senses": [{"sense": "someone who enjoys studying and thinking about complicated ideas", "level": "C2", "dict_examp": "She was  a real intellectual.", "lear_examp": "As an intellectual and thinker (the glasses Piggy wears stand for these attributes), he is admired by Ralph, the chief."}]}]}, {"word": "insurance", "poses": [{"pos": "noun", "senses": [{"sense": "an agreement in which you pay a company money and they pay your costs if you have an accident, injury, etc.", "level": "B2", "dict_examp": "life/health/car/travel insurance", "lear_examp": "Lastly, could you please tell me what kind of clothes I should prepare and whether I have to buy insurance myself?"}]}]}, {"word": "intensify", "poses": [{"pos": "verb", "senses": [{"sense": "to become greater, more serious, or more extreme, or to make something do this", "level": "C2", "dict_examp": "The fighting has intensified in the last two weeks.", "lear_examp": "This feeling is intensified when the relationship between Jack and Ralph develops to antagonism."}]}]}, {"word": "intensely", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely", "level": "C2", "dict_examp": "Her book is intensely personal.", "lear_examp": "The sky was intensely blue."}, {"sense": "with strong, serious emotions", "level": "C2", "dict_examp": "She stared at me intensely.", "lear_examp": "She wanted so intensely that her wish should be fulfilled."}, {"sense": "fully, or with great concentration, effort, or attention", "level": "C2", "dict_examp": "He focused intensely on the sheet of music before him.", "lear_examp": "She looked more intensely at her reflection and suddenly realized that it really did not matter whether or not a friend of hers found her diary."}]}]}, {"word": "intellectually", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that relates to your ability to think and to understand things", "level": "C2", "dict_examp": "She's hoping to find a job that is more demanding intellectually.", "lear_examp": "Some people complain that they do not have enough time to develop intellectually when they are in their 20s or 30s because they have to take care of their small children."}]}]}, {"word": "intense", "poses": [{"pos": "adjective", "senses": [{"sense": "extreme or very strong", "level": "C1", "dict_examp": "intense heat/pain", "lear_examp": "Most of the rooms we stayed in did not have air-conditioning, which caused many sleepless nights for the majority of us due to the intense heat."}, {"sense": "Intense people are very serious, and usually have strong emotions or opinions.", "level": "C2", "dict_examp": "He's always been very intense.", "lear_examp": "I admire people with heart and soul, with that real charisma which can only blossom in highly intelligent and spiritual people - this is what we call 'intense personality'."}]}]}, {"word": "integration", "poses": [{"pos": "noun", "senses": [{"sense": "when things or people are mixed, joined or combined", "level": "C1", "dict_examp": "cultural integration", "lear_examp": "This may be explained by the increasing number of exchanges in the European Union, and the stronger economic integration of European Countries."}]}]}, {"word": "insult", "poses": [{"pos": "noun", "senses": [{"sense": "a rude and offensive remark or action", "level": "B2", "dict_examp": "They were shouting insults at each other.", "lear_examp": "Joko's mother would hurl insults at the poor old man, calling him sick and hoping that he'd die soon."}, {"sense": "to make someone's bad situation worse by doing something else to upset them", "level": "C2", "dict_examp": "To add insult to injury, we had to pay for the damage!", "lear_examp": "To add insult to injury, such an approach often turns out to be counterproductive."}]}, {"pos": "verb", "senses": [{"sense": "to say or do something to someone that is rude and offensive", "level": "B2", "dict_examp": "How dare you insult me in front of my friends!", "lear_examp": "After all, in insulting the performers you insult their fans..."}]}]}, {"word": "intensively", "poses": [{"pos": "adverb", "senses": [{"sense": "in way that involves a lot of work in a short period of time", "level": "C1", "dict_examp": "I spent three weeks working intensively on my thesis.", "lear_examp": "Grammar, listening and writing were taught adequately, but less intensively than speaking."}]}]}, {"word": "instrument", "poses": [{"pos": "noun", "senses": [{"sense": "an object that is used for playing music, such as a piano, guitar or drum", "level": "A2", "dict_examp": "They all brought musical instruments with them.", "lear_examp": "I play two instruments, so I can help you with the concert, playing guitar or keyboard."}, {"sense": "a tool that is used for doing something", "level": "C1", "dict_examp": "scientific instruments", "lear_examp": "You can also see Roman medical instruments and tools, for example a pioneer axe and different knives."}, {"sense": "someone or something that is used for achieving something", "level": "C2", "dict_examp": "The Internet is a very powerful instrument of communication.", "lear_examp": "This mechanical dog, harmless when not powered, is an instrument of repression and terror."}]}]}, {"word": "intensive", "poses": [{"pos": "adjective", "senses": [{"sense": "involving a lot of effort or activity in a short period of time", "level": "B2", "dict_examp": "two weeks of intensive training", "lear_examp": "I am 23 years old and speak English fluently due to my intensive study of the language."}]}]}, {"word": "intellect", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to learn and understand something, and to form ideas, judgments, and opinions about what you have learned", "level": "C2", "dict_examp": "His energy and intellect are respected by many people.", "lear_examp": "When I am alone, or in \"qualified\" company, I may listen to music of a sort that appeals to my intellect as much as to my emotions."}]}]}, {"word": "intensity", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being felt strongly or having a very strong effect", "level": "C2", "dict_examp": "the intensity of the blaze", "lear_examp": "As soon as a ray of light reaches the inside of the seashell, it sparkles with an intensity that nearly hurts your eye."}]}]}, {"word": "intention", "poses": [{"pos": "noun", "senses": [{"sense": "something that you want and plan to do", "level": "B2", "dict_examp": "It wasn't my intention to exclude her from the list - I just forgot her.", "lear_examp": "I was very pleased to hear from your club, because it was always my intention to join such a group and make music with other people."}]}]}, {"word": "intend", "poses": [{"pos": "verb", "senses": [{"sense": "to have as a plan or purpose", "level": "B1", "dict_examp": "We intend to go to Australia next year.", "lear_examp": "I intend to invite many friends who were in the same university, but nobody knows this news, so I want to surprise them."}, {"sense": "to be made, designed, or provided for a particular person or purpose", "level": "C1", "dict_examp": "The book is intended for anyone who wants to learn more about the Internet.", "lear_examp": "There are various pieces of software intended for off-line use on the market."}]}]}, {"word": "interactive", "poses": [{"pos": "adjective", "senses": [{"sense": "Interactive computer games, programs, etc. involve the user by reacting to the way they use them.", "level": "B2", "dict_examp": "an interactive game", "lear_examp": "In addition, you can play with several interactive games and learn about the rules of the Olympic Games."}, {"sense": "involving communication between people", "level": "C1", "dict_examp": "interactive teaching methods", "lear_examp": "But I hope you don't mind me suggesting that you should try do these talks in smaller groups, so they'll become more interactive and even more interesting."}]}]}, {"word": "intermission", "poses": [{"pos": "noun", "senses": [{"sense": "a short period of time between the parts of a play, performance, etc.", "level": "B1", "dict_examp": "The show \"Zorro\" had only one intermission of 20 minutes.", "lear_examp": ""}]}]}, {"word": "intervention", "poses": [{"pos": "noun", "senses": [{"sense": "when someone intervenes, especially to influence what happens", "level": "C2", "dict_examp": "Without medical intervention, the child would have died.", "lear_examp": "I write to seek your intervention in a matter that has seriously impacted on the reputation of your retail business."}]}]}, {"word": "intermediate", "poses": [{"pos": "adjective", "senses": [{"sense": "between the highest and lowest levels of knowledge or skill", "level": "B1", "dict_examp": "There are three levels of difficulty in this game: low, intermediate and high.", "lear_examp": "My level is intermediate."}]}]}, {"word": "introduce", "poses": [{"pos": "verb", "senses": [{"sense": "to tell someone another person's name the first time that they meet", "level": "B1", "dict_examp": "I'd like to introduce my younger son, Mark.", "lear_examp": "We were introduced to each other and we talked about our home countries."}, {"sense": "to make something exist, happen or be used for the first time", "level": "B2", "dict_examp": "Ice skating, as an Olympic competition, was introduced in 1908.", "lear_examp": "Mr. Dixon, you and your staff have already introduced a number of alterations that have improved the interior of the building."}, {"sense": "to tell an audience who is going to speak to them or perform for them", "level": "C2", "dict_examp": "I'd like to introduce Rachel Elliott who is our speaker this evening.", "lear_examp": ""}]}]}, {"word": "interfere", "poses": [{"pos": "verb", "senses": [{"sense": "to try to control or become involved in a situation, in a way that is annoying", "level": "B2", "dict_examp": "I know he's worried about us, but I wish he wouldn't interfere.", "lear_examp": "I would like to stress that very often famous people become reserved, bad-tempered and angry with the world for interfering in their lives."}, {"sense": "to prevent something from working effectively or from developing successfully", "level": "C1", "dict_examp": "I try not to let my dancing classes interfere with my schoolwork.", "lear_examp": "The best time would be in the evening so it does not interfere with classes."}]}]}, {"word": "interestingly", "poses": [{"pos": "adverb", "senses": [{"sense": "used to introduce information that you think is\n \n surprising and interesting", "level": "C1", "dict_examp": "Interestingly, he never  actually said that he was innocent.", "lear_examp": "Russians today prefer fast food due to a rapid lifestyle. Interestingly, this refers only to lunch time; about 80% of Russians will prefer eating a traditional Russian meal for dinner."}]}]}, {"word": "intimate", "poses": [{"pos": "adjective", "senses": [{"sense": "private and personal", "level": "C2", "dict_examp": "intimate details of her family life", "lear_examp": "Finally, we have to take into consideration that cultural and educational development opens the path for learning and becoming conscious of our intimate feelings and personality and helps us to become better people."}, {"sense": "having a special relationship with someone who you like or love very much", "level": "C2", "dict_examp": "an intimate friend", "lear_examp": "Finally, before 5 am the couple leaves the party (in desperate need of rest) and so do their intimate friends and family."}, {"sense": "If a place or event is intimate, it is small in a way that feels comfortable or private.", "level": "C2", "dict_examp": "an intimate hotel", "lear_examp": "The dining room is small and intimate, allowing a relaxed and personal atmosphere, which is highlighted by the soft, Indian background music and the dimmed lights."}, {"sense": "when you know all of the facts about something or about how it works", "level": "C2", "dict_examp": "He has an intimate knowledge of the area.", "lear_examp": "The fact that Sinclair spends most of his weekends hiking is easily understood through his intimate knowledge of wilderness lore, of which tidbits pop up now and then in the text."}]}]}, {"word": "intrinsic", "poses": [{"pos": "adjective", "senses": [{"sense": "An intrinsic quality or thing forms part of the basic character of something or someone.", "level": "C2", "dict_examp": "Drama is an intrinsic part of the school curriculum.", "lear_examp": "Working is an intrinsic part of human nature, without which life may be unthinkable for some of us."}]}]}, {"word": "intolerable", "poses": [{"pos": "adjective", "senses": [{"sense": "too bad or unpleasant to deal with or accept", "level": "C2", "dict_examp": "an intolerable situation", "lear_examp": "The situation has become absolutely intolerable."}]}]}, {"word": "interruption", "poses": [{"pos": "noun", "senses": [{"sense": "when an action or activity is interrupted, or something that interrupts someone or something", "level": "B2", "dict_examp": "There were so many interruptions, I couldn't get on with my work.", "lear_examp": "I stayed two or three minutes in the darkness thinking that it was only a brief interruption, but it was not the case."}]}]}, {"word": "intolerance", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is intolerant", "level": "C2", "dict_examp": "He spoke out against racism and intolerance.", "lear_examp": "The process of mutual understanding that emerges from this contact can help solve one of the greatest problems facing mankind, the ethnic, racial or religious intolerance that plagues different parts of the world."}]}]}, {"word": "intriguing", "poses": [{"pos": "adjective", "senses": [{"sense": "very interesting", "level": "C2", "dict_examp": "an intriguing story", "lear_examp": "Only a minority of our citizens make regular use of the library, either by enjoying a quiet few minutes to scour the bookshelves for an intriguing story to keep them going through the next rainy weekend or by reading one of the numerous newspapers on display."}]}]}, {"word": "interview", "poses": [{"pos": "noun", "senses": [{"sense": "a meeting in which someone asks you questions to see if you are suitable for a job or course", "level": "B1", "dict_examp": "a job interview", "lear_examp": "I have to go to a job interview which I'm looking forward to."}, {"sense": "a meeting in which someone is asked questions about themselves for a newspaper article, television show, etc", "level": "B1", "dict_examp": "an exclusive interview with Paul Simon", "lear_examp": "The column also has interviews with a couple of different artists."}]}, {"pos": "verb", "senses": [{"sense": "to ask someone questions in an interview", "level": "B1", "dict_examp": "We've had 200 applicants for the job, but we only plan to interview about 20 of them.", "lear_examp": "We had to interview our partner and to present him to the class."}]}]}, {"word": "interval", "poses": [{"pos": "noun", "senses": [{"sense": "a period of time between two actions, activities, or events", "level": "C2", "dict_examp": "After an interval of three days, the peace talks resumed.", "lear_examp": "When we adopt this perspective, we witness history becoming enmeshed with our present and future, as all cyclical events repeat themselves at regular intervals."}]}]}, {"word": "interior", "poses": [{"pos": "noun", "senses": [{"sense": "the inside part of something", "level": "B2", "dict_examp": "The real estate agent had pictures of the house from the outside but none of its interior.", "lear_examp": "The interior is quite modern and clean."}]}]}, {"word": "internally", "poses": [{"pos": "adverb", "senses": [{"sense": "inside a person, object, organization, place or country", "level": "C1", "dict_examp": "This medicine is for external use only and should not be taken internally.", "lear_examp": "I am actually very interested in taking the course, because recently I have changed my job and one of my functions is to create a page on the intranet to share information about the company internally."}]}]}, {"word": "interference", "poses": [{"pos": "noun", "senses": [{"sense": "when someone tries to interfere in a situation", "level": "C1", "dict_examp": "There have been claims of too much political interference in education.", "lear_examp": "The famous have all their gestures watched and judged. How can anyone live with so much interference?"}, {"sense": "noise or other electronic signals that stop you from getting good pictures or sound on a television, radio, telephone, etc.", "level": "C2", "dict_examp": "Your computer is causing interference - when you turned it on the radio started buzzing.", "lear_examp": "As for the latter, when low flying aircraft are approaching or overflying we are not able to hear or watch anything because these aircraft cause a lot of interference and distortion."}]}]}, {"word": "into", "poses": [{"pos": "preposition", "senses": [{"sense": "toward the inside or middle of something", "level": "A1", "dict_examp": "He's gone into a  store across the street.", "lear_examp": "I think I left my watch in the kitchen of your house, before we went into the swimming-pool."}, {"sense": "used to show when a person or thing changes from one form or condition to another", "level": "A2", "dict_examp": "Peel the cucumber and chop it into small cubes.", "lear_examp": "I like it very much because now I can convert any  language into Bengali."}, {"sense": "moving toward something or someone and hitting them", "level": "B1", "dict_examp": "He's always walking into things when he doesn't have his glasses on.", "lear_examp": "Then I bumped into a man... What a surprise! It was Thom Yorke."}, {"sense": "in the direction of something or someone", "level": "B1", "dict_examp": "She was looking straight into his eyes.", "lear_examp": "After we ate Peter looked into my eyes and said: \"Sarah I love you\", and he kissed me."}, {"sense": "to be very interested in something", "level": "B1", "dict_examp": "Will's really into jazz.", "lear_examp": "You see, the countryside is good for vacation, but I'm not so into it that I would like to live there!"}]}]}, {"word": "intervene", "poses": [{"pos": "verb", "senses": [{"sense": "to become involved in a situation in order to try to stop a fight, argument, problem, etc.", "level": "C2", "dict_examp": "Government officials refused to intervene in the recent disputes.", "lear_examp": "While an old cynic like Bismarck might not have approved of intervening in the Balkans, even he should see the point of this."}]}]}, {"word": "interesting", "poses": [{"pos": "adjective", "senses": [{"sense": "Someone or something that is interesting keeps your attention because they are unusual, exciting, or have a lot of ideas.", "level": "A1", "dict_examp": "She's quite an interesting woman.", "lear_examp": "I like reading interesting books in the Library."}]}]}, {"word": "interim", "poses": [{"pos": "adjective", "senses": [{"sense": "temporary and intended to be used or accepted until something permanent exists", "level": "C2", "dict_examp": "an interim solution", "lear_examp": ""}]}]}, {"word": "the Internet", "poses": [{"pos": "noun", "senses": [{"sense": "the system that connects computers all over the world and allows people who use computers to look at websites", "level": "A1", "dict_examp": "I found out about the book on the Internet.", "lear_examp": "She uses the Internet every day."}]}]}, {"word": "interpret", "poses": [{"pos": "verb", "senses": [{"sense": "to change what someone has said into a different language", "level": "B2", "dict_examp": "We had to ask the guide to interpret for us.", "lear_examp": "My boss decided it was high time I tried to interpret for him outside our office."}, {"sense": "to decide what the intended meaning of something is", "level": "C1", "dict_examp": "It's difficult to interpret these statistics without knowing how they were obtained.", "lear_examp": "Musicians try to interpret it, but admittedly they will never find the whole meaning of it."}]}]}, {"word": "introduction", "poses": [{"pos": "noun", "senses": [{"sense": "the action of telling someone another person's name the first time that they meet", "level": "B2", "dict_examp": "You'll have to do/make the introductions - I don't know everyone's name.", "lear_examp": "As we didn't know each other, the meeting started with the introduction of everybody."}, {"sense": "the opening text of a book, speech, article, etc.", "level": "B2", "dict_examp": "Read the introduction to the article and decide what it will be about.", "lear_examp": "Report introduction: The purpose to this report is to give suggestions of how to make the reception area more welcoming for everyone."}, {"sense": "when you make something exist, happen or be used for the first time", "level": "B2", "dict_examp": "The introduction of new working practices has dramatically improved productivity.", "lear_examp": "With the introduction of the computer, we can now access the Internet to communicate with our relatives and friends living abroad."}, {"sense": "a book or course which provides basic knowledge about a subject", "level": "B2", "dict_examp": "an introduction to psychology", "lear_examp": "Please send me some information about your club and tell me about courses like \"an introduction to flying\"."}, {"sense": "the first time someone experiences something", "level": "C1", "dict_examp": "It was our first introduction to great poetry.", "lear_examp": "In 1998 it was the first introduction to home internet access and as we can see from the chart, less than 10% of people had one at home."}]}]}, {"word": "internal", "poses": [{"pos": "adjective", "senses": [{"sense": "existing or happening inside a person, object, organization, place or country", "level": "B2", "dict_examp": "He sustained injuries to his arms, legs and several internal organs.", "lear_examp": "She met with an accident and this damaged her internal organs."}]}]}, {"word": "intolerant", "poses": [{"pos": "adjective", "senses": [{"sense": "refusing to accept any opinions, beliefs, customs, etc., that are different from your own", "level": "C2", "dict_examp": "She can be very intolerant of other people's opinions.", "lear_examp": "Right now, tolerance and understanding come very naturally to me, in contrast with the narrow-minded, intolerant attitude I had to share when I had hardly ever gone beyond the limits of my home town."}]}]}, {"word": "interrupt", "poses": [{"pos": "verb", "senses": [{"sense": "to stop someone while they are talking or doing something, by saying or doing something yourself", "level": "B1", "dict_examp": "She tried to explain what had happened but he kept interrupting her.", "lear_examp": "Her thoughts were interrupted by Ben, who asked if she wanted to go for a walk with him."}, {"sense": "to stop something from happening for a short period", "level": "B2", "dict_examp": "We had to interrupt our trip when we heard John's mother was sick.", "lear_examp": "Don't you fear that you might get ill if you don't interrupt your work for a meal and for some hours of sleep or a short walk?"}]}]}, {"word": "international", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to or involving two or more countries", "level": "A2", "dict_examp": "international politics", "lear_examp": "Go to the international museum, it's wonderful."}]}]}, {"word": "intransitive", "poses": [{"pos": "adjective", "senses": [{"sense": "An intransitive verb does not have an object.", "level": "B2", "dict_examp": "In the sentence '\"I tried to persuade him, but he wouldn't come'\", \"come\" is an intransitive verb.", "lear_examp": ""}]}]}, {"word": "internationally", "poses": [{"pos": "adverb", "senses": [{"sense": "in many countries", "level": "B1", "dict_examp": "Her internationally acclaimed novel has won several literary prizes.", "lear_examp": "This film was directed by Yasujino-Ozo, who is internationally famous, although his film is very Japanese."}]}]}, {"word": "interpretation", "poses": [{"pos": "noun", "senses": [{"sense": "an explanation or opinion of what something means", "level": "C2", "dict_examp": "traditional interpretations of the Latin text", "lear_examp": "Yet this raises the question of the actual effect travel has on our understanding and interpretation of the world outside our country, as well as on the idea we have of our country itself."}, {"sense": "the way someone performs a particular play, piece of music, etc.", "level": "C2", "dict_examp": "a beautiful interpretation of Swan Lake", "lear_examp": "Every time I think of this memorable day, I wish I could thank my host-family over and over again since then - little did I know that I would be accepted at Paris' Conservatory a few months later, thanks to my interpretation of Mozart's concerto!"}]}]}, {"word": "interested", "poses": [{"pos": "adjective", "senses": [{"sense": "wanting to give your attention to something and discover more about it", "level": "A2", "dict_examp": "He didn't seem very interested in what I was saying.", "lear_examp": "I'm very interested in sports."}]}]}, {"word": "irregular", "poses": [{"pos": "adjective", "senses": [{"sense": "In grammar, an irregular verb, noun, adjective, etc. does not obey the usual rules for words in the language.", "level": "B1", "dict_examp": "a table of irregular verbs", "lear_examp": ""}, {"sense": "Irregular actions or events happen with a different amount of time between each one.", "level": "B2", "dict_examp": "They met at irregular intervals.", "lear_examp": "To make matters worse, the meal times are irregular, so as a result I am skinny."}, {"sense": "not smooth or straight, or having parts that are different sizes", "level": "B2", "dict_examp": "an irregular coastline", "lear_examp": "In my hurry, I never saw the irregular floor and I fell over!"}]}]}, {"word": "involvement", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something is involved in an activity or event", "level": "B2", "dict_examp": "The team's continued involvement in the competition is uncertain.", "lear_examp": "By reading we get a sort of personal involvement with the characters, it's as if it was our own story."}]}]}, {"word": "invade", "poses": [{"pos": "verb", "senses": [{"sense": "to enter a country by force in order to take control of it", "level": "B2", "dict_examp": "Concentrations of troops near the border look set to invade within the next few days.", "lear_examp": "Hitler invaded France."}, {"sense": "to enter a place in large numbers", "level": "C1", "dict_examp": "Every summer the town is invaded by tourists.", "lear_examp": "As tourists invade us in large hoards, the menace of destroying the green values of our land appears."}, {"sense": "to try to learn things about someone's private life when they do not want you to", "level": "C2", "dict_examp": "They were fed up with journalists invading their privacy.", "lear_examp": "He would never invade our privacy or force us to talk about our problems."}, {"sense": "to become a part of someone's life without them asking for or wanting the involvement", "level": "C2", "dict_examp": "Computers are invading our lives.", "lear_examp": "The biggest one, the computer, has invaded our life and changed the whole rhythm."}]}]}, {"word": "invite", "poses": [{"pos": "verb", "senses": [{"sense": "to ask someone to come to a social event or to spend time with you socially", "level": "A1", "dict_examp": "We're invited to Lola's party.", "lear_examp": "I'm really happy you invited me for dinner."}, {"sense": "to ask someone to do something in a formal or official way", "level": "C1", "dict_examp": "I was invited to appear on television.", "lear_examp": "We invite your newspaper to reconsider its position, hoping that the council will think about our proposals."}, {"sense": "to do something that is likely to cause a particular reaction or result, especially a bad one", "level": "C2", "dict_examp": "Unconventional ideas often invite attack/criticism.", "lear_examp": ""}]}]}, {"word": "irony", "poses": [{"pos": "noun", "senses": [{"sense": "a situation that is strange because it is the opposite of what you expected", "level": "C2", "dict_examp": "The irony is now that he's retired, he's busier than ever.", "lear_examp": "The irony of all this is the fact that she lives in the same house with Kingshaw and Hooper and she keeps being unable to notice what is really going on till the very end."}, {"sense": "a type of humor in which people say the opposite of what they really mean", "level": "C2", "dict_examp": "There is a lot of irony in his writing.", "lear_examp": "His strength lies in drawing exact pictures of the human mind by using extraordinary metaphors and idioms and describing our society with his never-ending tone of sarcasm and irony."}]}]}, {"word": "invisible", "poses": [{"pos": "adjective", "senses": [{"sense": "impossible to see", "level": "B2", "dict_examp": "The aircraft is designed to be invisible to radar.", "lear_examp": "At that moment I really wished I could disappear or become invisible!"}]}]}, {"word": "ironic", "poses": [{"pos": "adjective", "senses": [{"sense": "An ironic situation is strange because it is the opposite of what you would expect.", "level": "C2", "dict_examp": "It's ironic that she was hurt by the very person she's trying to help.", "lear_examp": "As I used my stealth to move through the shadows, I thought it ironic that the rich man's expensive and probably imported carpets should assist me in keeping quiet."}]}]}, {"word": "invasion", "poses": [{"pos": "noun", "senses": [{"sense": "when an army enters a country by force in order to take control of it", "level": "B2", "dict_examp": "They were planning to mount an invasion of the north of the country.", "lear_examp": "Then, we went to the North of Denmark to see what remains of the Viking invasions."}, {"sense": "becoming involved in someone's private life when they do not want you to", "level": "C2", "dict_examp": "These phone calls to my home are an invasion of my privacy.", "lear_examp": ""}, {"sense": "when people enter a place in large numbers", "level": "C2", "dict_examp": "Every year, there is an invasion of tourists.", "lear_examp": "The invasion of tourists seems to take away some of the place's privacy and it can even destroy its usually peaceful environment."}]}]}, {"word": "investigator", "poses": [{"pos": "noun", "senses": [{"sense": "a person whose job is to examine a crime, accident, etc. in order to discover the truth", "level": "B2", "dict_examp": "Investigators have studied the possible effects of contamination.", "lear_examp": "My name is Jacques Martinov, and I am a private investigator."}]}]}, {"word": "introvert", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is quiet and shy and prefers to be alone", "level": "C2", "dict_examp": "He's quite an introvert.", "lear_examp": "As an introvert, he had some problems with airing his opinions but when it came to competing with others he was the best."}]}]}, {"word": "inventor", "poses": [{"pos": "noun", "senses": [{"sense": "someone who designs and makes new things", "level": "B2", "dict_examp": "He was the inventor of the vacuum cleaner.", "lear_examp": "Thomas Alva Eddison is probably the greatest inventor of all time with 1093 patents."}]}]}, {"word": "invariably", "poses": [{"pos": "adverb", "senses": [{"sense": "always", "level": "C2", "dict_examp": "The train is invariably packed.", "lear_examp": "Nevertheless, there is invariably an exception to the rule."}]}]}, {"word": "investigation", "poses": [{"pos": "noun", "senses": [{"sense": "when officials try to discover all the facts about something, especially a crime or an accident", "level": "B2", "dict_examp": "to carry out/hold an investigation", "lear_examp": "After a month-long investigation of the environment, I found we still don't do enough to protect the environment."}]}]}, {"word": "intrusion", "poses": [{"pos": "noun", "senses": [{"sense": "when someone becomes involved in a situation which people want to be private", "level": "C2", "dict_examp": "She could not bear the intrusion into her private life.", "lear_examp": "Agatha lay underneath her covers dreading the moment when some intrusion might force her to leave the sanctuary of her four-poster bed."}]}]}, {"word": "iron", "poses": [{"pos": "noun", "senses": [{"sense": "a dark grey metal used to make steel and found in very small amounts in blood and food", "level": "B1", "dict_examp": "an iron bar", "lear_examp": "It wasn't very expensive because it was made of iron without any decoration, but it was important because she gave it to me before she died."}, {"sense": "a piece of electrical equipment that you use for making clothes flat and smooth", "level": "B1", "dict_examp": "a steam iron", "lear_examp": "For example, are there any people who want to buy an iron at midnight?"}]}, {"pos": "verb", "senses": [{"sense": "to make clothes flat and smooth using an iron", "level": "B1", "dict_examp": "I need to iron a shirt to wear tomorrow.", "lear_examp": "I like wearing jeans because they are very comfortable, and are also easy to wash and to iron."}]}]}, {"word": "intrude", "poses": [{"pos": "verb", "senses": [{"sense": "to become involved in a situation which people want to be private", "level": "C2", "dict_examp": "I don't mean to intrude, but are you okay?", "lear_examp": "The fact is that raising a child is a strictly personal matter and also a demanding task nowadays and no one can intrude on a family's privacy, to influence its decision."}]}]}, {"word": "ironing", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of making clothes flat and smooth, using an iron", "level": "B1", "dict_examp": "I must do some ironing tonight.", "lear_examp": "And I would like to do a little bit of work in your household like washing clothes, ironing and so on."}]}]}, {"word": "intuition", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling that you know something without being able to explain why", "level": "C2", "dict_examp": "Her approach to childcare is based on intuition.", "lear_examp": "But Roger had repeatedly told Lindsay that he was innocent, and her intuition told her that he wasn't lying."}]}]}, {"word": "invaluable", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely useful", "level": "C1", "dict_examp": "Her contacts proved invaluable to the company.", "lear_examp": "These materials will be an invaluable source of information for our students."}]}]}, {"word": "invent", "poses": [{"pos": "verb", "senses": [{"sense": "to design or create something which has never existed before", "level": "B1", "dict_examp": "The first safety razor was invented by company founder King C. Gillette in 1903.", "lear_examp": "Lots of different and important things were invented during the 20th century, but  I believe that the most important one is the computer."}, {"sense": "to think of a story or explanation in order  to deceive someone", "level": "B2", "dict_examp": "But I didn't invent the story - everything I told you is true.", "lear_examp": "We knew that our parents wouldn't let us travel alone so we had to invent a story to avoid them realizing what happened."}]}]}, {"word": "invention", "poses": [{"pos": "noun", "senses": [{"sense": "something which has been designed or created for the first time, or the act of creating or designing something", "level": "B1", "dict_examp": "The world changed rapidly after the invention of the telephone.", "lear_examp": "I think that the television is one of the most amazing inventions ever."}]}]}, {"word": "investment", "poses": [{"pos": "noun", "senses": [{"sense": "the money that you put in a bank, business, etc. in order to make a profit, or the act of doing this", "level": "B2", "dict_examp": "Stocks are regarded as good long-term investments.", "lear_examp": "For example, if I want to organize my investments, I can use a suitable computer program for it."}, {"sense": "something that you do or have, in order to have more in the future", "level": "B2", "dict_examp": "Going to college is an investment in the future.", "lear_examp": "Of course I was able to purchase a second-hand one but I thought that it was a good investment to have a new computer provided with up-to-date software."}]}]}, {"word": "involved", "poses": [{"pos": "adjective", "senses": [{"sense": "to do things and be part of an activity or event", "level": "B2", "dict_examp": "How did you get involved in acting?", "lear_examp": "According to your letter, you want to encourage more people to get involved in the swimming club and the chess club."}]}]}, {"word": "investigate", "poses": [{"pos": "verb", "senses": [{"sense": "to try to discover all the facts about something, especially a crime or accident", "level": "B2", "dict_examp": "Police are investigating allegations of corruption involving senior executives.", "lear_examp": "John, who was the husband of Julia, went to his office and started investigating the kidnapping."}]}]}, {"word": "invest", "poses": [{"pos": "verb", "senses": [{"sense": "to give money to a bank, business, etc., or buy something, because you hope to get a profit", "level": "B2", "dict_examp": "The institute will invest 5 million in the project.", "lear_examp": "However, you could invest the extra money in the infrastructure."}, {"sense": "to use a lot of time, effort, or emotions because you want to succeed", "level": "B2", "dict_examp": "You have all invested significant amounts of time and energy in making this project the success that it is.", "lear_examp": "So, investing a bit of time and care on yourself might be the reason for your 90th birthday party!"}]}]}, {"word": "introduction", "poses": [{"pos": "noun", "senses": [{"sense": "the action of telling someone another person's name the first time that they meet", "level": "B2", "dict_examp": "You'll have to do/make the introductions - I don't know everyone's name.", "lear_examp": "As we didn't know each other, the meeting started with the introduction of everybody."}, {"sense": "the opening text of a book, speech, article, etc.", "level": "B2", "dict_examp": "Read the introduction to the article and decide what it will be about.", "lear_examp": "Report introduction: The purpose to this report is to give suggestions of how to make the reception area more welcoming for everyone."}, {"sense": "when you make something exist, happen or be used for the first time", "level": "B2", "dict_examp": "The introduction of new working practices has dramatically improved productivity.", "lear_examp": "With the introduction of the computer, we can now access the Internet to communicate with our relatives and friends living abroad."}, {"sense": "a book or course which provides basic knowledge about a subject", "level": "B2", "dict_examp": "an introduction to psychology", "lear_examp": "Please send me some information about your club and tell me about courses like \"an introduction to flying\"."}, {"sense": "the first time someone experiences something", "level": "C1", "dict_examp": "It was our first introduction to great poetry.", "lear_examp": "In 1998 it was the first introduction to home internet access and as we can see from the chart, less than 10% of people had one at home."}]}]}, {"word": "invitation", "poses": [{"pos": "noun", "senses": [{"sense": "when someone invites you to do something or go somewhere", "level": "A2", "dict_examp": "Thanks for the invitation to your birthday party.", "lear_examp": "Thank you for your invitation."}, {"sense": "something that is likely to cause a particular result, especially a bad one", "level": "C2", "dict_examp": "Leaving your house unlocked is an open invitation to burglars.", "lear_examp": "This was hard to resist for computer programmers who understood it as an invitation to try and fool the examiner with a cunning computer program."}]}]}, {"word": "investor", "poses": [{"pos": "noun", "senses": [{"sense": "a person who puts money into a bank, business, etc.  in order to make a profit", "level": "B2", "dict_examp": "A New York investor offered to acquire the company's stock for $13 a share.", "lear_examp": "This should be done by lowering taxes and preparing other incentives for potential investors."}]}]}, {"word": "irrational", "poses": [{"pos": "adjective", "senses": [{"sense": "Irrational feelings and actions are based on your emotions and not on good reasons.", "level": "C2", "dict_examp": "irrational behavior", "lear_examp": "It was an irrational fear, but try to explain this to a five-year-old girl who constantly dreamt about vampire dolls killing her while she was unable to move!"}]}]}, {"word": "involve", "poses": [{"pos": "verb", "senses": [{"sense": "If a situation or activity involves something, that thing is a necessary part of it.", "level": "B1", "dict_examp": "The trips often involve a lot of walking.", "lear_examp": "It is a competition for schools and it involves many kinds of sport."}, {"sense": "to affect or include someone or something in an activity", "level": "B1", "dict_examp": "The second accident involved two cars and a truck.", "lear_examp": "She had written me to tell me that our friends Todd and Alice had died in an strange accident that involved a vacuum cleaner."}, {"sense": "to make someone be part of an activity or process", "level": "B2", "dict_examp": "I prefer teaching methods that actively involve students in learning.", "lear_examp": "Trying to involve children and young people in general, interactive activities could be really successful."}]}]}, {"word": "intruder", "poses": [{"pos": "noun", "senses": [{"sense": "someone who enters a place where they are not allowed to be, often to commit a crime", "level": "C2", "dict_examp": "I heard intruders at the back of the house.", "lear_examp": "The Police Department did accept that the Jouzalez house was not robbed, but only showed signs of mess and disorder, as if the intruders were looking for something specific, for a certain document."}, {"sense": "someone who goes to a place or  becomes involved in a situation where others do not want them", "level": "C2", "dict_examp": "I felt like an intruder at their dinner table.", "lear_examp": "Hooper considered the newcomer to be an intruder, to be subtly persecuted."}]}]}, {"word": "ironically", "poses": [{"pos": "adverb", "senses": [{"sense": "used to emphasize that a situation is strange because it is the opposite of what you expected", "level": "C2", "dict_examp": "Ironically, the only good book on this subject has gone out of print.", "lear_examp": "Either way, food is a big industry and a vital contributor to our culture, but ironically, food is also the biggest problem in the world."}]}]}, {"word": "irregular", "poses": [{"pos": "adjective", "senses": [{"sense": "In grammar, an irregular verb, noun, adjective, etc. does not obey the usual rules for words in the language.", "level": "B1", "dict_examp": "a table of irregular verbs", "lear_examp": ""}, {"sense": "Irregular actions or events happen with a different amount of time between each one.", "level": "B2", "dict_examp": "They met at irregular intervals.", "lear_examp": "To make matters worse, the meal times are irregular, so as a result I am skinny."}, {"sense": "not smooth or straight, or having parts that are different sizes", "level": "B2", "dict_examp": "an irregular coastline", "lear_examp": "In my hurry, I never saw the irregular floor and I fell over!"}]}]}, {"word": "irreversible", "poses": [{"pos": "adjective", "senses": [{"sense": "Something that is irreversible cannot be changed back to how it was before.", "level": "C2", "dict_examp": "irreversible damage to the heart/lungs", "lear_examp": "It is important to remember that everything done excessively can have irreversible consequences!"}]}]}, {"word": "irrespective", "poses": [{"pos": "adverb", "senses": [{"sense": "used to say that something does not affect a situation", "level": "C2", "dict_examp": "Everyone should be treated equally, irrespective of skin color.", "lear_examp": "He demonstrated that irrespective of the political circumstances, art will always go on, it cannot be subdued."}]}]}, {"word": "irritated", "poses": [{"pos": "adjective", "senses": [{"sense": "annoyed", "level": "B2", "dict_examp": "Ben began to get increasingly irritated by/with her questions.", "lear_examp": "Tom noticed that she was irritated about something."}]}]}, {"word": "irresistible", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely attractive and impossible not to like or want", "level": "C2", "dict_examp": "an irresistible smile", "lear_examp": "For instance, a perfume might make men irresistible to women, or vice versa."}, {"sense": "too powerful to control or ignore", "level": "C2", "dict_examp": "irresistible pressure", "lear_examp": "From time to time we do feel an irresistible desire to get possession of something that is not a must. We are so tempted that we buy it."}]}]}, {"word": "isolation", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being separate from other people, places, or things", "level": "C1", "dict_examp": "the country's economic isolation from the rest of the world", "lear_examp": "Due to the isolation, the country had to feed itself with everything which was needed."}, {"sense": "alone, or separately from other people, places, or things", "level": "C2", "dict_examp": "These poems cannot be considered in isolation.", "lear_examp": "In conclusion, it is my opinion that the problem of parking space cannot be solved in isolation."}, {"sense": "a feeling of being lonely", "level": "C2", "dict_examp": "I had this awful sense of isolation.", "lear_examp": "Unemployment can lead to isolation."}]}]}, {"word": "island", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of land completely surrounded by water", "level": "A2", "dict_examp": "a desert island", "lear_examp": "I'm on the island of Aruba."}]}]}, {"word": "irresponsible", "poses": [{"pos": "adjective", "senses": [{"sense": "not thinking about the possible bad results of what you are doing", "level": "B2", "dict_examp": "irresponsible behavior", "lear_examp": "You can't always rely on the drivers, who are sometimes irresponsible and careless."}]}]}, {"word": "it", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to refer to the thing, situation, or idea that has already been talked about", "level": "A1", "dict_examp": "\"Where's my pen?\" \"You left it by the phone.\"", "lear_examp": "This is a very beautiful place and I like it."}, {"sense": "used as the subject or object of a verb to represent a phrase at the end of the sentence", "level": "A1", "dict_examp": "I liked it in Scotland.", "lear_examp": "It's a nice place."}, {"sense": "used to talk about the time, date, weather or distances", "level": "A2", "dict_examp": "What time is it?", "lear_examp": "It rained and rained and rained and it really didn't want to stop raining."}, {"sense": "used as the subject of verbs such as \"seem,\" \"appear,\" and \"look\"", "level": "B2", "dict_examp": "It seemed unfair to leave her at home.", "lear_examp": "It seemed fantastic but we knew our parents would never agree."}, {"sense": "used to say the name of a person or thing when the person you are speaking to does not know", "level": "B2", "dict_examp": "It's your Dad on the phone.", "lear_examp": ""}, {"sense": "used to emphasize one part of a sentence", "level": "C2", "dict_examp": "It's the children I'm concerned about, not me.", "lear_examp": ""}]}]}, {"word": "itself", "poses": [{"pos": "pronoun", "senses": [{"sense": "the reflexive form of the pronoun \"it\"", "level": "A2", "dict_examp": "The cat licked itself all over.", "lear_examp": ""}, {"sense": "alone or without help", "level": "B1", "dict_examp": "The dog was in the house by itself for several days.", "lear_examp": "If an animal is kept by itself, with no-one to keep it company, it gets lonely and very sad."}, {"sense": "used to put emphasis on a word", "level": "B1", "dict_examp": "The shop itself started 15 years ago but the mail-order side of the business is new.", "lear_examp": "There are lots of trees and bushes,  but the city itself is quite ugly."}, {"sense": "used emphasize that something is true of one particular thing but that other things may have to be considered", "level": "B2", "dict_examp": "The plan wasn't illegal in itself but it would lead to some doubtful practices.", "lear_examp": "To begin with, a car, in my opinion, can't be harmful in itself."}]}]}, {"word": "IT", "poses": [{"pos": "noun", "senses": [{"sense": "information technology: the use of computers and other electronic equipment to store and send information", "level": "A2", "dict_examp": "He's a project manager for a large IT company.", "lear_examp": "I want to study I.T. because it is very useful."}]}]}, {"word": "irritating", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel annoyed", "level": "B2", "dict_examp": "an irritating habit", "lear_examp": "In conclusion, like all things in life, shopping can be pleasant or irritating depending on your patience and on your mood that day."}]}]}, {"word": "item", "poses": [{"pos": "noun", "senses": [{"sense": "a single thing in a set or on a list", "level": "B1", "dict_examp": "the last item on the list", "lear_examp": "I have tasted all the items in that restaurant."}, {"sense": "a piece of news on television or radio, or in a newspaper", "level": "B2", "dict_examp": "a small item on the back page of the local newspaper", "lear_examp": "Last week, in the \"East London Journal\", I read an item about your opening an Investor Club."}]}]}, {"word": "irritation", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being annoyed, or something that makes you annoyed", "level": "C2", "dict_examp": "minor irritations", "lear_examp": "In the daytime, the noise leads to irritation."}]}]}, {"word": "isolated", "poses": [{"pos": "adjective", "senses": [{"sense": "a long way from other places", "level": "C1", "dict_examp": "an isolated village in the mountains", "lear_examp": "You might get lost in an isolated region without anyone to help you."}, {"sense": "alone and not having help or support from other people", "level": "C1", "dict_examp": "Kazuo felt very isolated at his new school.", "lear_examp": "Before you even know it, you'll feel isolated and alone because other people will have forgotten about you."}, {"sense": "a case/event/example, etc. that happens only once", "level": "C2", "dict_examp": "This robbery was not an isolated incident.", "lear_examp": "This is just an isolated example among an endless list."}]}]}, {"word": "itinerary", "poses": [{"pos": "noun", "senses": [{"sense": "a list of places that you plan to visit on a journey", "level": "C1", "dict_examp": "The President's itinerary includes visits to Boston and New York.", "lear_examp": "Finally, although the itinerary involved a visit to St. Andrews, for some unknown reasons we never went there and I was really disappointed."}]}]}, {"word": "irritable", "poses": [{"pos": "adjective", "senses": [{"sense": "becoming annoyed very easily", "level": "C2", "dict_examp": "Jack's been irritable all day.", "lear_examp": "Lord Trimingham remains calm throughout the story whereas Ted Burgess seems quite irritable and impulsive."}]}]}, {"word": "irritate", "poses": [{"pos": "verb", "senses": [{"sense": "to annoy someone", "level": "C1", "dict_examp": "His comments really irritated me.", "lear_examp": "Children get hyperactive and irritate other passengers."}]}]}, {"word": "its", "poses": [{"pos": "determiner", "senses": [{"sense": "belonging to or relating to something that has already been mentioned", "level": "A1", "dict_examp": "The dog hurt its paw.", "lear_examp": "When you touch it, a light bulb appears on its screen."}]}]}, {"word": "issue", "poses": [{"pos": "noun", "senses": [{"sense": "a subject or problem which people are thinking and talking about", "level": "B1", "dict_examp": "environmental/moral/personal issues", "lear_examp": "You're a student so this should be a very important issue for you."}, {"sense": "the newspaper, magazine, etc. that is produced on a particular day/week/month", "level": "B2", "dict_examp": "Have you seen the latest issue of Computer World?", "lear_examp": "Having seen your advertisement in the 4th issue of Asahi News, I hasten to write this letter."}, {"sense": "to disagree with what someone says or writes", "level": "C1", "dict_examp": "Isn’t the need to hire more staff  what’s really at issue here.", "lear_examp": "On behalf of the staff who worked for this event, I would like to take issue with the report's inaccuracies and unfair remarks."}, {"sense": "most important in what is being discussed", "level": "C2", "dict_examp": "The point at issue is what is best for the child.", "lear_examp": "I wouldn't like to fall into the trap of generalizing the matter at issue, but I believe there are two ways of traveling."}]}, {"pos": "verb", "senses": [{"sense": "to officially say something or give someone something", "level": "C2", "dict_examp": "The office will be issuing parking permits on Tuesday and Thursday mornings.", "lear_examp": "Finally, the doctors issued an ultimatum."}]}]}, {"word": "itch", "poses": [{"pos": "verb", "senses": [{"sense": "If a part of your body itches, it feels uncomfortable and you want to rub it with your nails.", "level": "B2", "dict_examp": "Woollen sweaters make my arms itch.", "lear_examp": "On the other hand I loathe jumpers since they make me itch, so I buy them once in a blue moon!"}, {"sense": "to want to do something very much", "level": "C2", "dict_examp": "You could tell that they were itching to leave.", "lear_examp": "The difference between these two kinds of people lies exactly there: the package-tourist is itching to go back home as soon as he sets off whereas the traveler may never go back home."}]}]}]