[{"word": "jealous", "poses": [{"pos": "adjective", "senses": [{"sense": "upset and angry because someone you love seems interested in another person", "level": "B1", "dict_examp": "a jealous husband/wife", "lear_examp": "The problem is that, a few months ago, when he had broken up with me, I wanted him to feel jealous, so I started meeting Fredo, a friend."}, {"sense": "unhappy and angry because you want something that someone else has", "level": "B2", "dict_examp": "He had always been very jealous of his brother's good looks.", "lear_examp": "Why had this man in his nightmare told him that one could be jealous of his success?"}]}]}, {"word": "join", "poses": [{"pos": "verb", "senses": [{"sense": "to become a member of a club, group, or organization", "level": "A2", "dict_examp": "I felt so out of shape after Christmas that I decided to join a gym.", "lear_examp": "It will be great if you join the new art class."}, {"sense": "to do something or go somewhere with someone", "level": "A2", "dict_examp": "I don't have time for a drink now, but I'll join you later.", "lear_examp": "I'm going to Wandsworth Cinema with my friends tonight. Would you like to join us?"}, {"sense": "to fasten or connect things together", "level": "B1", "dict_examp": "A bridge joins the two islands.", "lear_examp": ""}, {"sense": "If roads or rivers join, they meet at a particular point.", "level": "B1", "dict_examp": "Route 440 joins I-287 just over the bridge.", "lear_examp": ""}, {"sense": "When two people or groups join forces, they act or work together.", "level": "C2", "dict_examp": "She joined forces with her sister-in-law to set up the restaurant.", "lear_examp": "Art Garfunkel and Paul Simon, two musicians from the decade of peace and love who had split up a while ago, decided to join forces once again for one last tour of the United States."}, {"sense": "to become involved in an activity with other people", "level": "B1", "dict_examp": "We only need one more person to be able to play a game - can you persuade your sister to join in?", "lear_examp": "Generally I'm not interested in that sort of thing but I found it interesting, so I decided to join in."}]}]}, {"word": "jealously", "poses": [{"pos": "adverb", "senses": [{"sense": "in a jealous way", "level": "B2", "dict_examp": "She eyed Gwen's engagement ring jealously.", "lear_examp": ""}]}]}, {"word": "journalism", "poses": [{"pos": "noun", "senses": [{"sense": "the work of collecting, writing and publishing news stories and articles in newspapers and magazines or broadcasting them on the radio and television", "level": "B2", "dict_examp": "broadcast/print/television journalism", "lear_examp": "She told the leader of the band that she was studying journalism and that her dream was to write for Rolling Stone Magazine."}]}]}, {"word": "jar", "poses": [{"pos": "noun", "senses": [{"sense": "a glass container used for storing food", "level": "B1", "dict_examp": "a jar of coffee/honey", "lear_examp": "I've already bought them a jar of \"Dulce de leche\", that I'm sure they will love."}]}]}, {"word": "jointly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a shared way", "level": "C1", "dict_examp": "Construction of the new high school will be jointly funded by the city and the state.", "lear_examp": "Avesta is now jointly owned by Swedes and Englishmen after merging with British Steel."}]}]}, {"word": "janitor", "poses": [{"pos": "noun", "senses": [{"sense": "a person whose job is to clean and take care of a building", "level": "C2", "dict_examp": "There is a janitor in the building from 6 a.m. to 11 p.m.", "lear_examp": "They began working in a building, he as a janitor and she as a maid in several apartments."}]}]}, {"word": "joke", "poses": [{"pos": "noun", "senses": [{"sense": "something which someone says to make people laugh, usually a short  story with a funny ending", "level": "B1", "dict_examp": "Did I tell you the joke about the chicken crossing the road?", "lear_examp": "In the first lesson, the teacher came in and told us a joke, and the most important thing was . . . the joke was funny!"}, {"sense": "to not be serious or not deserve respect", "level": "C1", "dict_examp": "The investigation was a joke.", "lear_examp": "Talking about restaurants, your \"typical English restaurant\" was a joke."}, {"sense": "to tell a joke", "level": "C1", "dict_examp": "He seemed very relaxed, laughing and cracking jokes.", "lear_examp": "Many members will get the chance to show their talent and we will get to crack some jokes too!"}]}, {"pos": "verb", "senses": [{"sense": "to say funny things, or not be serious", "level": "B1", "dict_examp": "They joked and laughed as they looked at the photos.", "lear_examp": "I thought he was joking!"}]}]}, {"word": "January", "poses": [{"pos": "noun", "senses": [{"sense": "the first month of the year, after December and before February", "level": "A1", "dict_examp": "Her father died in January.", "lear_examp": "The class date is January 12th."}]}]}, {"word": "journey", "poses": [{"pos": "noun", "senses": [{"sense": "when you travel from one place to another", "level": "B2", "dict_examp": "It's a four-hour journey from New York City to Boston by car.", "lear_examp": "I think that with this journey I will learn how other people live and I will also learn to value the things I have."}]}]}, {"word": "jam", "poses": [{"pos": "noun", "senses": [{"sense": "a sweet food made with fruit and sugar that you can put on bread", "level": "A2", "dict_examp": "strawberry/raspberry jam", "lear_examp": "First we can eat some snacks: cheese, jam, toast..."}, {"sense": "something that is stuck in a machine or that prevents the parts of a machine from moving", "level": "C1", "dict_examp": "The photocopier isn't working because of a paper jam.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to get stuck or make something get stuck", "level": "C1", "dict_examp": "My key jammed in the lock.", "lear_examp": "I understand the request for a new printer could be considered expensive, but it would benefit the office in the long run by diminishing the waste of paper and toner due to the paper jamming  the printer."}, {"sense": "to fill a place completely", "level": "C2", "dict_examp": "The streets were jammed with cars.", "lear_examp": "Our quiet roads will be jammed with cars coming from other towns, especially the Saturday morning."}]}]}, {"word": "jogging", "poses": [{"pos": "noun", "senses": [{"sense": "when you jog", "level": "B1", "dict_examp": "Let's go jogging.", "lear_examp": "You can stay in a hotel in Copacabana and go jogging in the morning."}]}]}, {"word": "journal", "poses": [{"pos": "noun", "senses": [{"sense": "a magazine containing articles about a particular subject", "level": "C1", "dict_examp": "a medical journal", "lear_examp": "What I miss, however, in our library are the books and journals devoted to science."}, {"sense": "a book in which you regularly write about what has happened to you", "level": "C2", "dict_examp": "I kept a journal during that time.", "lear_examp": "He looked everywhere but he couldn't find his uncle's personal journal."}]}]}, {"word": "jazz", "poses": [{"pos": "noun", "senses": [{"sense": "a type of music first developed by African-Americans, which often includes parts played without written music", "level": "A2", "dict_examp": "Paul has a lot of jazz on his iPod.", "lear_examp": "I like pop music and jazz."}]}]}, {"word": "jacket", "poses": [{"pos": "noun", "senses": [{"sense": "a short coat", "level": "A1", "dict_examp": "a leather/denim jacket", "lear_examp": "I need to buy a jacket."}]}]}, {"word": "jail", "poses": [{"pos": "noun", "senses": [{"sense": "a place where criminals are kept as a punishment", "level": "B1", "dict_examp": "the country's overcrowded jails", "lear_examp": "Otherwise, they will throw him in jail for his bad past."}]}]}, {"word": "jewelry", "poses": [{"pos": "noun", "senses": [{"sense": "objects made from gold, silver, and valuable stones that you wear for decoration", "level": "A2", "dict_examp": "a jewelry box", "lear_examp": "Talking about accessories, I like using caps, jewelry, belts, purses and all that stuff."}]}]}, {"word": "jet", "poses": [{"pos": "noun", "senses": [{"sense": "an aircraft with a jet engine, which is able to fly very fast", "level": "B1", "dict_examp": "a jet plane", "lear_examp": "After we went in his private jet to his mansion."}]}]}, {"word": "jargon", "poses": [{"pos": "noun", "senses": [{"sense": "words and phrases that are used by particular groups of people and are difficult for other people to understand", "level": "C1", "dict_examp": "legal/technical jargon", "lear_examp": "In general terms Excel is an adequate school for Business English, as they make you speak fluently and with a broader vocabulary, which is very helpful especially when negotiating with non-American English speakers, who usually use different terms (or a particular jargon)."}]}]}, {"word": "jeans", "poses": [{"pos": "noun", "senses": [{"sense": "pants made of denim, a strong cotton material, which are worn informally", "level": "A1", "dict_examp": "jeans and a T-shirt", "lear_examp": "Come to my house tomorrow wearing jeans and a white T-shirt."}]}]}, {"word": "joint", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging to or shared between two or more people", "level": "B2", "dict_examp": "a joint bank account", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "a cheap restaurant or place where people go for drinks or entertainment", "level": "C1", "dict_examp": "a pizza joint", "lear_examp": "The following day a visit was scheduled to \"a typical English restaurant\" which turned out to be a hamburger joint."}, {"sense": "a place in your body where two bones meet", "level": "C2", "dict_examp": "the knee joint", "lear_examp": "Would you really like to have a job in which you would risk not being able to walk because of the damage to your joints?"}]}]}, {"word": "jealousy", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of unhappiness or anger because you want what someone else has or fear that someone will take what you have", "level": "C1", "dict_examp": "He broke his brother's new bike in a fit of jealousy.", "lear_examp": "What is more, the most successful colleagues generated some jealousy and incomprehension in the others."}]}]}, {"word": "joy", "poses": [{"pos": "noun", "senses": [{"sense": "great happiness", "level": "B2", "dict_examp": "They were filled with joy when their first child was born.", "lear_examp": "Well, you should be bouncing up and down with joy (just kidding)!"}, {"sense": "something or someone that makes you feel very happy", "level": "B2", "dict_examp": "Listening to music is one of his greatest joys.", "lear_examp": "It was a real joy to meet Anna and Laca again."}]}]}, {"word": "job", "poses": [{"pos": "noun", "senses": [{"sense": "the regular work that you do in order to earn money", "level": "A1", "dict_examp": "a full-time/part-time job", "lear_examp": "I'm going to do a part-time job on Saturdays."}, {"sense": "a particular piece of work", "level": "A2", "dict_examp": "The builders are aiming to get the job done by the end of the month.", "lear_examp": "It will be a messy job so wear something old."}, {"sense": "something that is your responsibility", "level": "B2", "dict_examp": "She believed her job as a politician was to represent the views of her party and the people who voted for her.", "lear_examp": "One day, my boss said to me: \"Serve tea every morning\". I'm a computer operator. I'm not his wife. It is not my job."}, {"sense": "to do something well/very well, etc.", "level": "B2", "dict_examp": "She did a great job of organizing the event.", "lear_examp": "Dear Bill, I think you did a very good job writing this chapter."}, {"sense": "at the place where you work, or while you work", "level": "C1", "dict_examp": "She's only had two years on the job and has been promoted already.", "lear_examp": "Not managing on the job wouldn't just have been your failure, but also your employer's, who had trusted you."}, {"sense": "If something does the job, it achieves the desired result.", "level": "C2", "dict_examp": "I need somewhere to keep these papers – this folder should do the job.", "lear_examp": "Allow them to bring home friends and therefore develop social skills. In my opinion, that should do the job."}]}]}, {"word": "jelly", "poses": [{"pos": "noun", "senses": [{"sense": "a sweet, slightly solid food made from fruit juice and sugar that you spread on bread", "level": "A2", "dict_examp": "grape/apple jelly", "lear_examp": ""}]}]}, {"word": "jaw", "poses": [{"pos": "noun", "senses": [{"sense": "the lower part of your face which moves when you open your mouth", "level": "B2", "dict_examp": "a broken jaw", "lear_examp": "Some of Jem's features such as his curved nose, his cruel jaw or even his hands, made Mary think of Joss Merlyn."}]}]}, {"word": "jog", "poses": [{"pos": "verb", "senses": [{"sense": "to run slowly for exercise", "level": "B1", "dict_examp": "I jog through the park every morning.", "lear_examp": "When you jog, you can feel your whole body moving."}]}]}, {"word": "journalist", "poses": [{"pos": "noun", "senses": [{"sense": "a person who writes news stories or articles for a newspaper or magazine or broadcasts them on radio or television", "level": "B1", "dict_examp": "a freelance journalist", "lear_examp": "She is a journalist at the local newspaper and we get along very well."}]}]}, {"word": "jewel", "poses": [{"pos": "noun", "senses": [{"sense": "a valuable stone that is used to make jewelry or to decorate objects", "level": "B2", "dict_examp": "She was wearing a large gold necklace set with jewels.", "lear_examp": "We opened it and we were left speechless as in the chest there were the most shiny jewels and coins we had ever seen."}]}]}, {"word": "juicy", "poses": [{"pos": "adjective", "senses": [{"sense": "full of juice", "level": "B1", "dict_examp": "juicy mangoes", "lear_examp": "You must taste the oranges because they are so juicy, so sweet."}, {"sense": "very interesting, exciting, or shocking information", "level": "C2", "dict_examp": "juicy gossip", "lear_examp": "\"That's it,\" she thought, \"somebody must have taken it to their room last night, hoping for some juicy gossip!\""}]}]}, {"word": "June", "poses": [{"pos": "noun", "senses": [{"sense": "the sixth month of the year, after May and before July", "level": "A1", "dict_examp": "Her birthday is June 24th.", "lear_examp": "I would like to travel in July because my examination will be finished on June 15th."}]}]}, {"word": "juggle", "poses": [{"pos": "verb", "senses": [{"sense": "to try to do several things at once, when it is difficult to have enough time", "level": "C2", "dict_examp": "Many women have to juggle work and family.", "lear_examp": "Juggling with time and living the rat-race, I focused my life on my profession."}]}]}, {"word": "jump", "poses": [{"pos": "verb", "senses": [{"sense": "to push your body up and away from the ground using your feet and legs", "level": "A2", "dict_examp": "The children were jumping up and down with excitement.", "lear_examp": "We jumped naked into the swimming pool!"}, {"sense": "to  go over something by moving up into the air", "level": "A2", "dict_examp": "Can you jump over/across this stream?", "lear_examp": "It's a lot of fun to jump streams of water that are formed by the rain."}, {"sense": "to move or act suddenly or quickly", "level": "B1", "dict_examp": "She jumped in/into a taxi and rushed to the station.", "lear_examp": "So I jumped into my car and when I got to the stadium I started to run."}, {"sense": "to make a sudden movement because you are surprised or frightened", "level": "B2", "dict_examp": "The thunder made me jump.", "lear_examp": "The noise of a doorbell made me jump."}, {"sense": "to guess the facts about a situation without having all of the information", "level": "C2", "dict_examp": "It’s not fair to jump to conclusions based on one incident.", "lear_examp": "I think, before jumping to conclusions, we should first try to analyse the situation."}]}, {"pos": "noun", "senses": [{"sense": "a sudden movement off the ground or off a high place", "level": "B1", "dict_examp": "He won with a jump of 8.5 meters.", "lear_examp": "She could not believe that she, the shy and unimportant Laura Wilcox, was standing on the top of a bridge ready for her bungee jump."}]}]}, {"word": "junk mail", "poses": [{"pos": "noun", "senses": [{"sense": "mail sent by companies and other organizations to advertise products and services or ask for money", "level": "C1", "dict_examp": "There’s a letter for you and the rest is junk mail.", "lear_examp": "The facts seem clear, we are being overwhelmed by spamming, junk mail, advertising marathons on TV and radio."}]}]}, {"word": "juice", "poses": [{"pos": "noun", "senses": [{"sense": "the liquid that comes from fruit or vegetables", "level": "A1", "dict_examp": "orange/lemon/grapefruit/tomato juice", "lear_examp": "I danced, ate cakes, drank juice and spoke with friends."}]}]}, {"word": "junior", "poses": [{"pos": "adjective", "senses": [{"sense": "lower or less advanced in rank, position, or time in service", "level": "B2", "dict_examp": "the junior senator from Illinois", "lear_examp": "At the moment I'm a junior member of the Kato Club in Amsterdam and I'm training there because it is so close to the University and my apartment."}, {"sense": "for or relating to young people", "level": "B2", "dict_examp": "a junior tennis tournament", "lear_examp": "I am used to working with children, as an instructor for a junior football team in my city."}]}, {"pos": "noun", "senses": [{"sense": "a student in the third year of a program of study at a high school, college, or university", "level": "B2", "dict_examp": "a high school junior", "lear_examp": "One day my geography teacher gathered the seniors and the juniors in our class, plus the principal and other two or three teachers, so that they could listen to me making a speech on my beautiful home-country."}, {"sense": "10/20, etc. months/years younger than someone", "level": "C2", "dict_examp": "He was born in April, so he’s three months my junior.", "lear_examp": "I have a sister four years my junior and in my opinion we have no reason to complain."}]}]}, {"word": "July", "poses": [{"pos": "noun", "senses": [{"sense": "the seventh month of the year, after June and before August", "level": "A1", "dict_examp": "July 22(nd)", "lear_examp": "The art class after school is on Wednesdays until the end of July."}]}]}, {"word": "jug", "poses": [{"pos": "noun", "senses": [{"sense": "a container with a handle used for pouring out liquids", "level": "C2", "dict_examp": "a plastic jug", "lear_examp": ""}]}]}, {"word": "jury", "poses": [{"pos": "noun", "senses": [{"sense": "a group of people who have been chosen to listen to all the facts in a trial in a law court and to decide whether a person is guilty or not guilty, or whether a claim has been proved", "level": "B2", "dict_examp": "members of the jury", "lear_examp": "The accused is defended by a famous lawyer who tells his wife that a loving wife's confirmation of her husband's alibi will not convince the jury."}, {"sense": "a group of people who decide the winner of a competition", "level": "C1", "dict_examp": "The jury chose an unexpected winner for the literary prize.", "lear_examp": "People who think they are talented enough to sing and appear on TV apply for the show and go to auditions to sing their heart out in front of a jury."}, {"sense": "If the jury is (still) out on a subject, people do not yet know the answer or have a definite opinion about it.", "level": "C2", "dict_examp": "The jury's still out on whether these vitamins protect against cancer.", "lear_examp": "I think that the jury is still out on the effects of television and other media."}]}]}, {"word": "junk", "poses": [{"pos": "noun", "senses": [{"sense": "old things which have little value", "level": "C1", "dict_examp": "His car is just a piece of junk.", "lear_examp": "I would also like to get rid of the junk in the other bedroom."}]}]}, {"word": "junk food", "poses": [{"pos": "noun", "senses": [{"sense": "food that is unhealthy but is quick and easy to eat", "level": "B2", "dict_examp": "He eats a lot of junk food.", "lear_examp": "Well, the best way to keep your body fit and healthy is to practice sports and to have a good meals like vegetables, fruits, cereals, and not to eat junk food like everybody does."}]}]}, {"word": "judge", "poses": [{"pos": "noun", "senses": [{"sense": "someone who decides which person or thing wins a competition", "level": "B1", "dict_examp": "the Olympic judges", "lear_examp": "However, the Astro singing competition is different. The winner will be decided according to the marks given by the judge."}, {"sense": "someone who controls a trial in court, decides how criminals should be punished, and makes decisions about legal matters", "level": "B2", "dict_examp": "The judge ruled that they had acted correctly.", "lear_examp": "To the surprise of everyone in the village, the judge found her guilty but didn't send her to jail because he thought she should take care of Linda, who had no other relatives."}, {"sense": "someone who is usually wrong/usually right, etc. when they judge something", "level": "C2", "dict_examp": "a good judge of character", "lear_examp": "She is a very good judge of character and the institute has reared some very promising scientists."}]}, {"pos": "verb", "senses": [{"sense": "to have or develop an opinion about something or someone, especially after thinking carefully", "level": "B1", "dict_examp": "So far, he seems to be handling the job well, but it's really too soon to judge.", "lear_examp": "It's very difficult to judge, because so many young people leave Poland and go to another country."}, {"sense": "used to express the reasons why you have a particular opinion", "level": "B2", "dict_examp": "Judging by what he said, I think it's very unlikely that he'll be able to support your application.", "lear_examp": "I didn't like San Diego so much - just judging by my first impression."}, {"sense": "to officially decide who will be the winner of a competition", "level": "C1", "dict_examp": "I've been asked to judge the art competition.", "lear_examp": "If you don't object, we would like to see you judging the competition and giving prizes to the winners."}, {"sense": "to have a bad opinion of someone's behavior, often because you think you are better than them", "level": "C2", "dict_examp": "What gives you the right to judge people?", "lear_examp": "\"I'm not judging you, dear,\" I whispered softly."}, {"sense": "to not decide what someone or something is like only by looking at them", "level": "C2", "dict_examp": "You know, his desk is a mess but don't judge a book by it's cover, he does careful, detailed work.", "lear_examp": "I'm simply pointing out one should never judge a book by it's cover as things aren't always what they seem."}]}]}, {"word": "jungle", "poses": [{"pos": "noun", "senses": [{"sense": "a tropical forest in which trees and plants grow very closely together", "level": "B1", "dict_examp": "The Yanomami people live in the South American jungle.", "lear_examp": "It is a little bit far and out of the city, near the jungle and the mountains."}]}]}, {"word": "just", "poses": [{"pos": "adverb", "senses": [{"sense": "a very short time ago", "level": "A2", "dict_examp": "I've just been on a trip to France.", "lear_examp": "I've just had my birthday. It was on Friday."}, {"sense": "now or very soon", "level": "A2", "dict_examp": "I'm just leaving!", "lear_examp": ""}, {"sense": "only", "level": "B1", "dict_examp": "\"Would you like another drink?\" \"OK, just one more.\"", "lear_examp": "It was just a dream..."}, {"sense": "almost not", "level": "B1", "dict_examp": "This dress only just fits!", "lear_examp": "The airplane will arrive at midday, just in time for lunch."}, {"sense": "exactly or equally", "level": "B1", "dict_examp": "This carpet would be just right for the dining room.", "lear_examp": "Secondly, next morning after a stop on the Autobahn, just as we started to pull away - a flat tire!"}, {"sense": "used to emphasize something you say", "level": "B1", "dict_examp": "It's just dreadful what happened to her.", "lear_examp": "That is my best place -  it is just wonderful."}, {"sense": "more or less; almost", "level": "B1", "dict_examp": "\"Can you see the stage?\" \"Yes, just about.\"", "lear_examp": "I was just about 2 months older."}, {"sense": "to be going to do something very soon", "level": "B1", "dict_examp": "I was just about to phone you.", "lear_examp": "I was so amazed that I didn't realize I was just about to fall into the lake."}, {"sense": "equally bad/good/tall/clever, etc.", "level": "B1", "dict_examp": "He's just as talented as his brother.", "lear_examp": "Everywhere he went  was just as good as he expected."}, {"sense": "a little before/over/under, etc. something else", "level": "B1", "dict_examp": "She left just before Michael.", "lear_examp": "He got sick last winter and died just before Christmas."}, {"sense": "at the same time as", "level": "B2", "dict_examp": "She woke up just as we got there.", "lear_examp": "Just as I was turning on the radio somebody knocked at the door."}, {"sense": "used to say that it is lucky that something happened", "level": "C1", "dict_examp": "It's just as well we brought an umbrella.", "lear_examp": "It is just as well that my friends had cars to give me a lift to the school."}, {"sense": "used to say that there is nothing else you can do", "level": "C1", "dict_examp": "We’ll just have to wait and see what happens.", "lear_examp": "We will just have to wait and see."}]}, {"pos": "adjective", "senses": [{"sense": "fair or morally right", "level": "C1", "dict_examp": "a just society", "lear_examp": "He is really involved in what he is doing and does not fear facing the difficulties if it is to defend a just cause."}]}]}, {"word": "justice", "poses": [{"pos": "noun", "senses": [{"sense": "behavior or treatment that is fair and morally correct", "level": "B2", "dict_examp": "There's no justice in the world when people can be made to suffer like that.", "lear_examp": "Both of them symbolize courage, a love of justice, and a fight for freedom, which makes them look like heroes."}, {"sense": "the system of laws which judges and punishes people", "level": "B2", "dict_examp": "the justice system", "lear_examp": "I hope by the time I am out of prison, the justice system will have changed."}, {"sense": "to show the best or real qualities of something or someone", "level": "C2", "dict_examp": "This postcard doesn't do justice to the wonderful scenery.", "lear_examp": "No words can do justice to the indignation that I feel."}]}]}, {"word": "judgment", "poses": [{"pos": "noun", "senses": [{"sense": "an opinion about someone or something that you decide on after thinking carefully", "level": "B2", "dict_examp": "It proved difficult to make any judgments about exactly how well the school was performing.", "lear_examp": "Your judgment about the other performers is completely unfair: they were also very good."}, {"sense": "the ability to make good decisions or to be right in your opinions", "level": "C2", "dict_examp": "to use/show poor/good/bad judgment", "lear_examp": "I would like to end this letter expressing my total support and trust in your judgment when making the final decision."}]}]}, {"word": "justifiable", "poses": [{"pos": "adjective", "senses": [{"sense": "having a good reason", "level": "C2", "dict_examp": "justifiable anger", "lear_examp": "Thus, we can understand that this attitude to reading is, to some extent, justifiable."}]}]}, {"word": "justified", "poses": [{"pos": "adjective", "senses": [{"sense": "fair or having a good reason", "level": "C1", "dict_examp": "justified criticism", "lear_examp": "Finally, I would strongly recommend that steps are taken to remedy matters and feel we are justified in requesting partial compensation."}]}]}, {"word": "justify", "poses": [{"pos": "verb", "senses": [{"sense": "to give or to be a good reason for", "level": "B2", "dict_examp": "I can't really justify taking another day off work.", "lear_examp": "The fact that you want to be the best in your job does not justify your attitude."}, {"sense": "If you justify yourself, you give a good reason for what you have done.", "level": "B2", "dict_examp": "It was the only thing that I could do - I don't have to justify myself to anyone.", "lear_examp": "How we can justify ourselves, when we are completely against captivity?"}]}]}, {"word": "justification", "poses": [{"pos": "noun", "senses": [{"sense": "a reason for something", "level": "C2", "dict_examp": "There's no justification for treating her so unfairly.", "lear_examp": "Unfortunately that day, I took the diary with me, although there was no justification for taking it because I was just going to visit my grandparents and I had no intention of staying there more than one day."}]}]}, {"word": "juvenile", "poses": [{"pos": "adjective", "senses": [{"sense": "by, for, or relating to young people", "level": "C1", "dict_examp": "juvenile crime", "lear_examp": "Among many aspects of crime, researchers have been keenly studying juvenile crime."}]}]}, {"word": "justice", "poses": [{"pos": "noun", "senses": [{"sense": "behavior or treatment that is fair and morally correct", "level": "B2", "dict_examp": "There's no justice in the world when people can be made to suffer like that.", "lear_examp": "Both of them symbolize courage, a love of justice, and a fight for freedom, which makes them look like heroes."}, {"sense": "the system of laws which judges and punishes people", "level": "B2", "dict_examp": "the justice system", "lear_examp": "I hope by the time I am out of prison, the justice system will have changed."}, {"sense": "to show the best or real qualities of something or someone", "level": "C2", "dict_examp": "This postcard doesn't do justice to the wonderful scenery.", "lear_examp": "No words can do justice to the indignation that I feel."}]}]}]