[{"word": "keen", "poses": [{"pos": "adjective", "senses": [{"sense": "very good or well developed", "level": "C1", "dict_examp": "a keen sense of smell", "lear_examp": "Furthermore, she has a keen sense of humor and does not mind a practical joke, which is an advantage with children."}, {"sense": "very interested or enthusiastic", "level": "C1", "dict_examp": "The class is for those who show a keen interest in painting.", "lear_examp": "If everybody thinks that young people are not keen on playing sports, it is just not true, at least, in the International Students' Sports Club."}, {"sense": "wanting to do something", "level": "C2", "dict_examp": "The company is keen to attract new customers.", "lear_examp": "Charity workers are keen to contribute with their work, their hearts and the seeds of hope and peace they leave wherever they go."}]}]}, {"word": "kangaroo", "poses": [{"pos": "noun", "senses": [{"sense": "a large Australian animal that moves by jumping on its back legs", "level": "B1", "dict_examp": "Kangaroos are a danger on the roads.", "lear_examp": "Furthermore it has been my dream since I was five years old to see a kangaroo and play with it."}]}]}, {"word": "keep", "poses": [{"pos": "verb", "senses": [{"sense": "to have something permanently or for the whole of a period of time", "level": "A2", "dict_examp": "Do you want this photograph back or can I keep it?", "lear_examp": "I can't keep the sofa because it is too big."}, {"sense": "to regularly store something in a particular place", "level": "A2", "dict_examp": "Keep medicines in a locked cabinet.", "lear_examp": "All my homework sheets were kept in that file."}, {"sense": "to (cause to) stay in a particular place or condition", "level": "A2", "dict_examp": "I wish you'd keep quiet.", "lear_examp": "In the hotel you have to keep quiet and go to bed early."}, {"sense": "to continue doing something without stopping, or to do it repeatedly", "level": "B1", "dict_examp": "He keeps trying to distract me.", "lear_examp": "I don't know why I wanted to meet her so much but my heart just kept telling me to go after her."}, {"sense": "to communicate or continue to communicate with someone, for example by e-mail or telephone", "level": "B1", "dict_examp": "We've kept in touch by e-mail for the last five years.", "lear_examp": "Please keep in touch with me."}, {"sense": "to delay someone or prevent them from doing something", "level": "B1", "dict_examp": "He's very late, what's keeping him?", "lear_examp": "I'm sure they won't try to keep you from having fun."}, {"sense": "to not tell anyone a secret/about something secret", "level": "B1", "dict_examp": "Mr. Brown apparently delayed the announcement, and managed to keep it secret from the entire group.", "lear_examp": "I had loved Sean since sixth grade but I was keeping it a secret."}, {"sense": "to be late so that someone has to wait for you", "level": "B2", "dict_examp": "I'm sorry to have kept you waiting.", "lear_examp": "A week later, when we were going to have our second lesson, she kept us waiting for almost an hour."}, {"sense": "to do what you promised to do", "level": "B2", "dict_examp": "James kept his promise and repaid all of the money he had borrowed.", "lear_examp": "She didn't keep her promise and she ruined my life."}, {"sense": "to write something down in order to remember it", "level": "B2", "dict_examp": "Remember to keep a record of how much you spend.", "lear_examp": "Furthermore, a computer helps us to keep records by saving files."}, {"sense": "If food or drink keeps, it remains fresh.", "level": "B2", "dict_examp": "Once opened, this product will keep for three days if refrigerated.", "lear_examp": ""}, {"sense": "to have and look after animals", "level": "B2", "dict_examp": "Our neighbors keep chickens.", "lear_examp": "Oh, and I was surprised because your mother finally agreed to keep a dog."}, {"sense": "to watch or look after someone or something", "level": "B2", "dict_examp": "Could you keep an eye on this the soup  for a minute?", "lear_examp": "You have to supply everything they need and keep an eye on them all the time."}, {"sense": "to stay with someone so that they are not alone", "level": "B2", "dict_examp": "Come and keep me company, Isabel.", "lear_examp": "I wish you came and kept me company."}, {"sense": "to remember to consider someone or something that may be useful in the future", "level": "B2", "dict_examp": "I'll keep you in mind if another job comes up.", "lear_examp": "But we should keep in mind that books improve our vocabulary and, what's more, our imagination."}, {"sense": "to continue to know about someone or something", "level": "C1", "dict_examp": "He changes jobs so often I can’t keep track anymore.", "lear_examp": "Trying to keep track of these changes by translating them would be an inappropriate task."}, {"sense": "to do what you said you would do", "level": "C1", "dict_examp": "He agreed to come and I'm sure he'll keep his word.", "lear_examp": "It turned out that the company that had been hired to organize it did not keep their word."}, {"sense": "to provide what someone needs for a short period of time", "level": "C1", "dict_examp": "Dinner is at eight, but I had an apple to keep me going.", "lear_examp": "Because of health concerns, advertisements lately show the people in Holland how important it is to have a good breakfast and that it will keep you going the whole day."}, {"sense": "to move or develop at the same speed as someone or something else", "level": "C1", "dict_examp": "We have to keep pace with the changing times.", "lear_examp": "It was first published a century ago and what amazes people most is that it keeps pace with the development of the country without leaving out references to our history and tradition."}, {"sense": "to try not to be noticed", "level": "C1", "dict_examp": "She has kept a low profile since the divorce.", "lear_examp": "Finally, I believe that the best way to handle these issues is to try to keep a low profile at all times and to remain indifferent to gossip."}, {"sense": "to remain calm", "level": "C1", "dict_examp": "You did well to keep your cool in all that panic.", "lear_examp": "Whatever the problem is, keep your cool, don't panic."}, {"sense": "to remain calm in a difficult situation", "level": "C2", "dict_examp": "To be successful in business, you need to keep a cool head in negotiations.", "lear_examp": "Kevin managed to keep a cool head and took over the navigation."}, {"sense": "to watch carefully for someone or something", "level": "C2", "dict_examp": "Keep your eyes open for anything unusual.", "lear_examp": "While staying in Turkey, for example, people ought to keep their eyes open. Look into life there."}, {"sense": "to watch carefully for someone or something", "level": "C2", "dict_examp": "Keep your eyes peeled, he should be here any minute.", "lear_examp": "Ever since, I try to keep my eyes peeled for anything similar."}, {"sense": "to manage to stop yourself from smiling or laughing", "level": "C2", "dict_examp": "I can never play jokes on people because I can't keep a straight face.", "lear_examp": ""}, {"sense": "to hope that things will happen in the way that you want them to, and to put a finger over the one next to it as a sign of that hope", "level": "C2", "dict_examp": "Let's keep our fingers crossed that she gets the job.", "lear_examp": "Wish me luck, Winnie,\" she sighed \"keep your fingers crossed, please.\""}, {"sense": "to have just enough money to live or to continue a business", "level": "C2", "dict_examp": "With extra income from private sponsorship, the club is just about managing to keep its head above water.", "lear_examp": "I also started to realize how much she had on her plate, how very little help she had and how, at times, she had to struggle just like me to keep her head above water."}, {"sense": "to not talk about something", "level": "C2", "dict_examp": "It might be wise to keep this quiet for a while.", "lear_examp": "They tried to keep it quiet but, somehow, half the village knew about the news in a few days."}, {"sense": "to succeed in staying calm and not becoming angry", "level": "C2", "dict_examp": "It was hard to keep my temper with so many things going wrong.", "lear_examp": "He never offends people and he keeps his temper even if someone insults him."}, {"sense": "to make sure that someone gives all their attention to what they are doing and is ready for anything that might happen", "level": "C2", "dict_examp": "We have random inspections to keep everyone on their toes.", "lear_examp": ""}, {"sense": "to continue working hard at something difficult", "level": "C2", "dict_examp": "Learning a language is hard but you've just got to keep at it.", "lear_examp": "Despite the fact that it requires patience, one should not work oneself up into a frenzy but keep at it."}, {"sense": "to not go somewhere or near something, or to prevent someone from going somewhere or near something", "level": "B2", "dict_examp": "I told them to keep away from the edge of the cliff.", "lear_examp": "But the animals themselves are being kept away from their natural environment in captivity."}, {"sense": "to not go near something, or to prevent someone or something from going past a particular place", "level": "B2", "dict_examp": "The police struggled to keep the crowd back.", "lear_examp": ""}, {"sense": "to stop the number, level, or size of something from increasing", "level": "B2", "dict_examp": "I have to exercise to keep my weight down.", "lear_examp": "That's also a way of keeping down the many accidents we have from fast cycling."}, {"sense": "to prevent someone or something from doing something", "level": "C1", "dict_examp": "Try to keep the children from dropping food all                             over the floor.", "lear_examp": "But its beautiful graphics and very rich text will keep you from complaining too much."}, {"sense": "to not tell someone about something", "level": "C2", "dict_examp": "Is there something you're keeping from me?", "lear_examp": "They kept it from me."}, {"sense": "to make a child stay inside, often as a punishment, or to make someone stay in a hospital", "level": "B1", "dict_examp": "She kept the children in because it was so cold.", "lear_examp": ""}, {"sense": "to not go onto an area, or to stop someone or something going onto an area", "level": "B1", "dict_examp": "Keep off the grass.", "lear_examp": ""}, {"sense": "to stop something touching or harming someone or something", "level": "B2", "dict_examp": "He put a cloth over the food to keep the flies off.", "lear_examp": ""}, {"sense": "to continue to do something, or to do something again and again", "level": "B1", "dict_examp": "She kept on asking me questions the whole time.", "lear_examp": "I kept on looking for him outside my building and in the park, but I still haven't found him."}, {"sense": "to not go into a place, or to stop someone or something from going into a place", "level": "B1", "dict_examp": "The building was unsafe so they put up a sign saying \"Danger - Keep out.\"", "lear_examp": ""}, {"sense": "If you keep to a plan/subject/path, etc., you stay with it.", "level": "B2", "dict_examp": "We need to keep to the agenda or the meeting will take too long.", "lear_examp": "When the zoos keep to these and other important and necessary conditions and rules, I think it is not cruel to keep animals in zoos."}, {"sense": "If you keep something to yourself, you do not tell anyone else about it.", "level": "C2", "dict_examp": "She usually keeps her opinions to herself.", "lear_examp": "She kept her thoughts to herself, her best friend being her diary."}, {"sense": "to continue doing something or not allow it to fall to a lower level", "level": "B1", "dict_examp": "Keep up the good work.", "lear_examp": "This is my advice: give up sports to keep up your music classes."}, {"sense": "to move at the same speed as someone or something that is moving forward so that you stay level with them", "level": "B2", "dict_examp": "She was walking so fast I couldn't keep up with her.", "lear_examp": "Unfortunately he was too fast and I couldn't keep up with him."}, {"sense": "to be able to understand or deal with something that is happening or changing very fast", "level": "B2", "dict_examp": "It's important to keep up with international news.", "lear_examp": "I live in London and I have to keep up with Turkish news for my job."}, {"sense": "to increase or make progress at the same speed as something or someone else so that you stay at the same level as them", "level": "C2", "dict_examp": "Prices have been rising very fast and wages haven't kept up.", "lear_examp": "We need more and more of our natural resources to be able to keep up with the rise in population."}, {"sense": "to continue doing something or continue something without change", "level": "C2", "dict_examp": "He was having trouble keeping up the payments on his car.", "lear_examp": "The reason why a person becomes homeless is that he or she is not able to pay the rent or fails to keep up the mortgage payments."}]}]}, {"word": "kilogram", "poses": [{"pos": "noun", "senses": [{"sense": "a unit of mass equal to 1000 grams, or 2.2 pounds", "level": "A2", "dict_examp": "", "lear_examp": ""}]}]}, {"word": "kid", "poses": [{"pos": "noun", "senses": [{"sense": "a child", "level": "A2", "dict_examp": "He took the kids to the park while I was working.", "lear_examp": "Even small kids came and had fun."}]}, {"pos": "verb", "senses": [{"sense": "to say something as a joke", "level": "B1", "dict_examp": "You're just kidding me, aren't you?", "lear_examp": "I'm going to be a movie star!  Just kidding."}, {"sense": "something you say to show that you are surprised by what someone has said, or do not believe it is true", "level": "B1", "dict_examp": "\"She left on Friday.\" \"You're kidding! Really?\"", "lear_examp": ""}]}]}, {"word": "kingdom", "poses": [{"pos": "noun", "senses": [{"sense": "a country ruled by a king or queen", "level": "B2", "dict_examp": "the kingdom of Sweden", "lear_examp": "The kingdom Chosun lasted until the beginning of the 20th century."}, {"sense": "all animals or plants considered together", "level": "C2", "dict_examp": "The monarch butterfly is one of the most beautiful creatures in the animal kingdom.", "lear_examp": "As well as being of paramount importance for the animal kingdom, Hawley Woods is the only green open space left in our area where we humans can walk, jog or simply lie on the grass."}]}]}, {"word": "key", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of metal cut into a particular shape that is used for opening or closing the lock of a door, starting a car engine, etc.", "level": "A1", "dict_examp": "car/door/house keys", "lear_examp": "I left my keys at your house."}, {"sense": "a list of answers to an exercise, quiz, test, etc.", "level": "A2", "dict_examp": "You can check your answers in the answer key on page 176.", "lear_examp": ""}, {"sense": "a way of explaining or achieving something", "level": "B1", "dict_examp": "Hard work is the key to success.", "lear_examp": "To those who say that money can't buy happiness I answer that money is a key to happiness."}, {"sense": "one of the places that you press with your fingers on a device such as a computer or on a musical instrument to produce letters, numbers, symbols, or produce a sound", "level": "B2", "dict_examp": "Press the shift key to write in capital letters.", "lear_examp": "What is more, you can get the information you need in just one second by pressing the \"enter\" key on a computer."}]}, {"pos": "adjective", "senses": [{"sense": "very important in influencing or achieving something", "level": "B2", "dict_examp": "She was a key figure in the international art world.", "lear_examp": "Unfortunately one day I decided that it was time to become more independent and I didn't ask a key question."}, {"sense": "to be very important in influencing or achieving something", "level": "C1", "dict_examp": "Early diagnosis is key to your chances of surviving.", "lear_examp": "Distribution is key to achieving economic growth and the positioning of domestic and imported goods."}]}]}, {"word": "keep", "poses": [{"pos": "verb", "senses": [{"sense": "to have something permanently or for the whole of a period of time", "level": "A2", "dict_examp": "Do you want this photograph back or can I keep it?", "lear_examp": "I can't keep the sofa because it is too big."}, {"sense": "to regularly store something in a particular place", "level": "A2", "dict_examp": "Keep medicines in a locked cabinet.", "lear_examp": "All my homework sheets were kept in that file."}, {"sense": "to (cause to) stay in a particular place or condition", "level": "A2", "dict_examp": "I wish you'd keep quiet.", "lear_examp": "In the hotel you have to keep quiet and go to bed early."}, {"sense": "to continue doing something without stopping, or to do it repeatedly", "level": "B1", "dict_examp": "He keeps trying to distract me.", "lear_examp": "I don't know why I wanted to meet her so much but my heart just kept telling me to go after her."}, {"sense": "to communicate or continue to communicate with someone, for example by e-mail or telephone", "level": "B1", "dict_examp": "We've kept in touch by e-mail for the last five years.", "lear_examp": "Please keep in touch with me."}, {"sense": "to delay someone or prevent them from doing something", "level": "B1", "dict_examp": "He's very late, what's keeping him?", "lear_examp": "I'm sure they won't try to keep you from having fun."}, {"sense": "to not tell anyone a secret/about something secret", "level": "B1", "dict_examp": "Mr. Brown apparently delayed the announcement, and managed to keep it secret from the entire group.", "lear_examp": "I had loved Sean since sixth grade but I was keeping it a secret."}, {"sense": "to be late so that someone has to wait for you", "level": "B2", "dict_examp": "I'm sorry to have kept you waiting.", "lear_examp": "A week later, when we were going to have our second lesson, she kept us waiting for almost an hour."}, {"sense": "to do what you promised to do", "level": "B2", "dict_examp": "James kept his promise and repaid all of the money he had borrowed.", "lear_examp": "She didn't keep her promise and she ruined my life."}, {"sense": "to write something down in order to remember it", "level": "B2", "dict_examp": "Remember to keep a record of how much you spend.", "lear_examp": "Furthermore, a computer helps us to keep records by saving files."}, {"sense": "If food or drink keeps, it remains fresh.", "level": "B2", "dict_examp": "Once opened, this product will keep for three days if refrigerated.", "lear_examp": ""}, {"sense": "to have and look after animals", "level": "B2", "dict_examp": "Our neighbors keep chickens.", "lear_examp": "Oh, and I was surprised because your mother finally agreed to keep a dog."}, {"sense": "to watch or look after someone or something", "level": "B2", "dict_examp": "Could you keep an eye on this the soup  for a minute?", "lear_examp": "You have to supply everything they need and keep an eye on them all the time."}, {"sense": "to stay with someone so that they are not alone", "level": "B2", "dict_examp": "Come and keep me company, Isabel.", "lear_examp": "I wish you came and kept me company."}, {"sense": "to remember to consider someone or something that may be useful in the future", "level": "B2", "dict_examp": "I'll keep you in mind if another job comes up.", "lear_examp": "But we should keep in mind that books improve our vocabulary and, what's more, our imagination."}, {"sense": "to continue to know about someone or something", "level": "C1", "dict_examp": "He changes jobs so often I can’t keep track anymore.", "lear_examp": "Trying to keep track of these changes by translating them would be an inappropriate task."}, {"sense": "to do what you said you would do", "level": "C1", "dict_examp": "He agreed to come and I'm sure he'll keep his word.", "lear_examp": "It turned out that the company that had been hired to organize it did not keep their word."}, {"sense": "to provide what someone needs for a short period of time", "level": "C1", "dict_examp": "Dinner is at eight, but I had an apple to keep me going.", "lear_examp": "Because of health concerns, advertisements lately show the people in Holland how important it is to have a good breakfast and that it will keep you going the whole day."}, {"sense": "to move or develop at the same speed as someone or something else", "level": "C1", "dict_examp": "We have to keep pace with the changing times.", "lear_examp": "It was first published a century ago and what amazes people most is that it keeps pace with the development of the country without leaving out references to our history and tradition."}, {"sense": "to try not to be noticed", "level": "C1", "dict_examp": "She has kept a low profile since the divorce.", "lear_examp": "Finally, I believe that the best way to handle these issues is to try to keep a low profile at all times and to remain indifferent to gossip."}, {"sense": "to remain calm", "level": "C1", "dict_examp": "You did well to keep your cool in all that panic.", "lear_examp": "Whatever the problem is, keep your cool, don't panic."}, {"sense": "to remain calm in a difficult situation", "level": "C2", "dict_examp": "To be successful in business, you need to keep a cool head in negotiations.", "lear_examp": "Kevin managed to keep a cool head and took over the navigation."}, {"sense": "to watch carefully for someone or something", "level": "C2", "dict_examp": "Keep your eyes open for anything unusual.", "lear_examp": "While staying in Turkey, for example, people ought to keep their eyes open. Look into life there."}, {"sense": "to watch carefully for someone or something", "level": "C2", "dict_examp": "Keep your eyes peeled, he should be here any minute.", "lear_examp": "Ever since, I try to keep my eyes peeled for anything similar."}, {"sense": "to manage to stop yourself from smiling or laughing", "level": "C2", "dict_examp": "I can never play jokes on people because I can't keep a straight face.", "lear_examp": ""}, {"sense": "to hope that things will happen in the way that you want them to, and to put a finger over the one next to it as a sign of that hope", "level": "C2", "dict_examp": "Let's keep our fingers crossed that she gets the job.", "lear_examp": "Wish me luck, Winnie,\" she sighed \"keep your fingers crossed, please.\""}, {"sense": "to have just enough money to live or to continue a business", "level": "C2", "dict_examp": "With extra income from private sponsorship, the club is just about managing to keep its head above water.", "lear_examp": "I also started to realize how much she had on her plate, how very little help she had and how, at times, she had to struggle just like me to keep her head above water."}, {"sense": "to not talk about something", "level": "C2", "dict_examp": "It might be wise to keep this quiet for a while.", "lear_examp": "They tried to keep it quiet but, somehow, half the village knew about the news in a few days."}, {"sense": "to succeed in staying calm and not becoming angry", "level": "C2", "dict_examp": "It was hard to keep my temper with so many things going wrong.", "lear_examp": "He never offends people and he keeps his temper even if someone insults him."}, {"sense": "to make sure that someone gives all their attention to what they are doing and is ready for anything that might happen", "level": "C2", "dict_examp": "We have random inspections to keep everyone on their toes.", "lear_examp": ""}, {"sense": "to continue working hard at something difficult", "level": "C2", "dict_examp": "Learning a language is hard but you've just got to keep at it.", "lear_examp": "Despite the fact that it requires patience, one should not work oneself up into a frenzy but keep at it."}, {"sense": "to not go somewhere or near something, or to prevent someone from going somewhere or near something", "level": "B2", "dict_examp": "I told them to keep away from the edge of the cliff.", "lear_examp": "But the animals themselves are being kept away from their natural environment in captivity."}, {"sense": "to not go near something, or to prevent someone or something from going past a particular place", "level": "B2", "dict_examp": "The police struggled to keep the crowd back.", "lear_examp": ""}, {"sense": "to stop the number, level, or size of something from increasing", "level": "B2", "dict_examp": "I have to exercise to keep my weight down.", "lear_examp": "That's also a way of keeping down the many accidents we have from fast cycling."}, {"sense": "to prevent someone or something from doing something", "level": "C1", "dict_examp": "Try to keep the children from dropping food all                             over the floor.", "lear_examp": "But its beautiful graphics and very rich text will keep you from complaining too much."}, {"sense": "to not tell someone about something", "level": "C2", "dict_examp": "Is there something you're keeping from me?", "lear_examp": "They kept it from me."}, {"sense": "to make a child stay inside, often as a punishment, or to make someone stay in a hospital", "level": "B1", "dict_examp": "She kept the children in because it was so cold.", "lear_examp": ""}, {"sense": "to not go onto an area, or to stop someone or something going onto an area", "level": "B1", "dict_examp": "Keep off the grass.", "lear_examp": ""}, {"sense": "to stop something touching or harming someone or something", "level": "B2", "dict_examp": "He put a cloth over the food to keep the flies off.", "lear_examp": ""}, {"sense": "to continue to do something, or to do something again and again", "level": "B1", "dict_examp": "She kept on asking me questions the whole time.", "lear_examp": "I kept on looking for him outside my building and in the park, but I still haven't found him."}, {"sense": "to not go into a place, or to stop someone or something from going into a place", "level": "B1", "dict_examp": "The building was unsafe so they put up a sign saying \"Danger - Keep out.\"", "lear_examp": ""}, {"sense": "If you keep to a plan/subject/path, etc., you stay with it.", "level": "B2", "dict_examp": "We need to keep to the agenda or the meeting will take too long.", "lear_examp": "When the zoos keep to these and other important and necessary conditions and rules, I think it is not cruel to keep animals in zoos."}, {"sense": "If you keep something to yourself, you do not tell anyone else about it.", "level": "C2", "dict_examp": "She usually keeps her opinions to herself.", "lear_examp": "She kept her thoughts to herself, her best friend being her diary."}, {"sense": "to continue doing something or not allow it to fall to a lower level", "level": "B1", "dict_examp": "Keep up the good work.", "lear_examp": "This is my advice: give up sports to keep up your music classes."}, {"sense": "to move at the same speed as someone or something that is moving forward so that you stay level with them", "level": "B2", "dict_examp": "She was walking so fast I couldn't keep up with her.", "lear_examp": "Unfortunately he was too fast and I couldn't keep up with him."}, {"sense": "to be able to understand or deal with something that is happening or changing very fast", "level": "B2", "dict_examp": "It's important to keep up with international news.", "lear_examp": "I live in London and I have to keep up with Turkish news for my job."}, {"sense": "to increase or make progress at the same speed as something or someone else so that you stay at the same level as them", "level": "C2", "dict_examp": "Prices have been rising very fast and wages haven't kept up.", "lear_examp": "We need more and more of our natural resources to be able to keep up with the rise in population."}, {"sense": "to continue doing something or continue something without change", "level": "C2", "dict_examp": "He was having trouble keeping up the payments on his car.", "lear_examp": "The reason why a person becomes homeless is that he or she is not able to pay the rent or fails to keep up the mortgage payments."}]}]}, {"word": "killer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who kills another person", "level": "B1", "dict_examp": "Police are still hoping to find the dead woman's killer.", "lear_examp": "I opened the window to take a breath of fresh air and I saw the man again, the killer, smoking a cigarette  and looking at me."}]}]}, {"word": "kind", "poses": [{"pos": "noun", "senses": [{"sense": "a type of thing or person", "level": "A1", "dict_examp": "What kind of music do you like?", "lear_examp": "We can go to Hopi Hari, it is a kind of theme park, I think you will like it very much!"}, {"sense": "many different types of something", "level": "A2", "dict_examp": "The cabinet contained all kinds of strange things.", "lear_examp": "To help, I could bring all kinds of CDs."}, {"sense": "used to show that what you have just said is only an example from a larger group of things", "level": "B1", "dict_examp": "I like pasta, pizza - that kind of thing/those kinds of things.", "lear_examp": "I enjoy that kind of thing, going to buy presents."}, {"sense": "used to talk about something when you are not sure of its exact type", "level": "B1", "dict_examp": "He's opening some kind of store.", "lear_examp": "You should try joining some kind of club."}, {"sense": "used to describe something approximately", "level": "B2", "dict_examp": "It's a kind of bike.", "lear_examp": "I know that the Frene Hotel is kind of expensive, but it's just for one night so I think we can make it."}, {"sense": "used to describe someone or something that is completely different from other people or things", "level": "C2", "dict_examp": "My Dad was one of a kind - funny, kind and generous.", "lear_examp": "Pele is indeed one of a kind and can be considered a model for youngsters."}]}, {"pos": "adjective", "senses": [{"sense": "generous, helpful, and thinking about other people's feelings", "level": "A2", "dict_examp": "She's a very kind and thoughtful person.", "lear_examp": "It was very kind of you to come and talk to us about your latest work."}]}]}, {"word": "kilo", "poses": [{"pos": "noun", "senses": [{"sense": "a kilogram", "level": "A2", "dict_examp": "a 200 kilo block of concrete", "lear_examp": "We danced a lot, and I think everybody has lost 2 kilos."}]}]}, {"word": "kick", "poses": [{"pos": "verb", "senses": [{"sense": "to hit someone or something with the foot, or to move the feet and legs suddenly and violently", "level": "A1", "dict_examp": "I kicked the ball as hard as I could.", "lear_examp": "I picked up a ball and kicked it, and the dog ran after it with the phone still in his mouth."}, {"sense": "to be very annoyed with yourself for doing something stupid or wrong", "level": "C2", "dict_examp": "I could have kicked myself for saying that.", "lear_examp": "Nevertheless what kept me kicking myself was that this time my partner was in danger as well."}, {"sense": "to start to be effective or to happen", "level": "C1", "dict_examp": "The new tax rate kicks in next month.", "lear_examp": "It is at this time that the hormones start to kick in resulting in most of them having to suffer the side effects."}, {"sense": "When an event kicks off, it begins.", "level": "C2", "dict_examp": "What time does the parade kick off?", "lear_examp": "Not only did the invention of the wheel improve daily movements, but also it kicked off a much faster and easier way of traveling all over the world."}, {"sense": "When you kick off a discussion or activity, you start it.", "level": "C2", "dict_examp": "Should we kick off the session with a presentation from Lisa?", "lear_examp": ""}, {"sense": "to force someone to leave a place or organization", "level": "C1", "dict_examp": "The store is closing - we should leave before they kick us out.", "lear_examp": "He will kick you out of his house without thanking you."}]}, {"pos": "noun", "senses": [{"sense": "the action of kicking something", "level": "A2", "dict_examp": "She gave him a kick under the table to shut him up.", "lear_examp": "We practiced shooting, passing the ball to each other, and taking a corner kick."}, {"sense": "a special feeling of excitement and energy", "level": "C2", "dict_examp": "She gets a kick out of performing live.", "lear_examp": "I really get a kick out of anything which concerns magic."}]}]}, {"word": "kill", "poses": [{"pos": "verb", "senses": [{"sense": "to cause someone or something to die", "level": "A2", "dict_examp": "Her parents were killed in a plane crash.", "lear_examp": "I like it because you must kill a lot of monsters."}, {"sense": "used to say that someone will be very angry with someone else", "level": "A2", "dict_examp": "Dad will kill me for being late.", "lear_examp": "It's very important to find it because if not my mother will kill me!"}, {"sense": "to do something while you are waiting for something else to happen or have nothing else to do", "level": "B2", "dict_examp": "We killed time playing video games.", "lear_examp": "When you are at home alone and have nothing to do, you can kill time watching television."}, {"sense": "to cause you a lot of pain or effort", "level": "C1", "dict_examp": "My feet are killing me.", "lear_examp": "I didn't have enough room to move and the seat belt was broken so when we finally arrived in Edinburgh my back was killing me."}, {"sense": "to stop an activity or experience completely", "level": "C2", "dict_examp": "This funding cut will kill the program.", "lear_examp": ""}]}]}, {"word": "keeper", "poses": [{"pos": "noun", "senses": [{"sense": "a person who takes care of animals or is in charge of valuable objects, a building, etc.", "level": "B1", "dict_examp": "a zoo keeper", "lear_examp": "Tina was confused because she wasn't a dragon keeper, so normally dragons didn't speak with her."}]}]}, {"word": "killing", "poses": [{"pos": "noun", "senses": [{"sense": "when a person is murdered", "level": "B1", "dict_examp": "a series of brutal killings", "lear_examp": "During the film there were a lot of explosions, killings and action scenes."}]}]}, {"word": "kettle", "poses": [{"pos": "noun", "senses": [{"sense": "a covered container used for boiling water that has a handle and an opening for pouring", "level": "B1", "dict_examp": "", "lear_examp": "If I have an electric kettle in my bedroom, I won't need to go to the kitchen."}]}]}, {"word": "kindness", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being kind", "level": "B2", "dict_examp": "love and kindness", "lear_examp": "Thank you again for your kindness and hospitality."}]}]}, {"word": "kidney", "poses": [{"pos": "noun", "senses": [{"sense": "one of the two organs in your body which remove waste from the blood and produce urine", "level": "C2", "dict_examp": "kidney failure/disease", "lear_examp": "Her kidneys didn't work well enough to keep her healthy and someone had to be found who could give one of his kidneys to her."}]}]}, {"word": "king", "poses": [{"pos": "noun", "senses": [{"sense": "(the title of) a male ruler of a country, who holds this position because of his royal birth", "level": "A2", "dict_examp": "King Richard II", "lear_examp": "The French kings lived at Versailles."}, {"sense": "the best or most important person in a particular activity", "level": "C1", "dict_examp": "He's the new king of pop music.", "lear_examp": "He is the king of football, which is not at all an exaggeration, even though he is retired now."}]}]}, {"word": "kilometer", "poses": [{"pos": "noun", "senses": [{"sense": "a unit of measurement equal to 1000 meters", "level": "A2", "dict_examp": "", "lear_examp": "The cottage is located in the mountains about 300 kilometers north of Oslo."}]}]}, {"word": "keyboard", "poses": [{"pos": "noun", "senses": [{"sense": "a set of keys that you press to use a computer", "level": "A2", "dict_examp": "I got a new keyboard and mouse for my computer.", "lear_examp": "COMPUTER FOR SALE It's one year old so I will give you the monitor and keyboard."}, {"sense": "an electrical musical instrument similar to a piano, or the set of keys on a piano or similar musical instrument", "level": "A2", "dict_examp": "Steve plays keyboards, drums, and saxophone.", "lear_examp": "I play two instruments, so I can help you with the concert, playing guitar or keyboard."}]}]}, {"word": "kindly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a kind way", "level": "B1", "dict_examp": "Stella has very kindly offered to help out with the food for the party.", "lear_examp": "He answers my simple questions kindly."}, {"sense": "to not like something that someone says or does", "level": "C2", "dict_examp": "He doesn't take kindly to criticism.", "lear_examp": "His wife didn't take kindly to his lateness and immediately snarled at him as though she was a tigress snapping her claws in a cat-fight."}]}]}, {"word": "kitten", "poses": [{"pos": "noun", "senses": [{"sense": "a young cat", "level": "B1", "dict_examp": "Our cat's had two kittens.", "lear_examp": ""}]}]}, {"word": "kite", "poses": [{"pos": "noun", "senses": [{"sense": "a toy made from paper or cloth which flies in the air on a long string", "level": "A2", "dict_examp": "We spent the morning flying a kite in the local park.", "lear_examp": "I got a lot of presents: a kite, a ball, shoes, a T-shirt, trousers, jeans, and a dog."}]}]}, {"word": "kitchen", "poses": [{"pos": "noun", "senses": [{"sense": "a room where food is kept, prepared, and cooked and where the dishes are washed", "level": "A1", "dict_examp": "We usually eat breakfast in the kitchen.", "lear_examp": "I think my bag is in your kitchen."}]}]}, {"word": "kneel", "poses": [{"pos": "verb", "senses": [{"sense": "to go down into, or stay in, a position where one or both knees are on the ground", "level": "B2", "dict_examp": "She knelt (down) beside the child.", "lear_examp": "Robert knelt down by her, pronouncing the simple words \"Will you marry me?\""}]}]}, {"word": "knife", "poses": [{"pos": "noun", "senses": [{"sense": "a sharp tool, usually with a metal blade and a handle, used for cutting and spreading food or other substances, or as a weapon", "level": "A1", "dict_examp": "a fish/butter/steak knife", "lear_examp": "I want to sell a beautiful old knife, because it doesn't cut anything."}]}]}, {"word": "knit", "poses": [{"pos": "verb", "senses": [{"sense": "to make clothes, etc. by using two long needles to connect wool or another type of thread into joined rows", "level": "B1", "dict_examp": "She's forever knitting.", "lear_examp": "I would really like to learn how to knit sweaters and hats."}]}]}, {"word": "knowingly", "poses": [{"pos": "adverb", "senses": [{"sense": "If you knowingly do something, you mean to do it although it is wrong.", "level": "C2", "dict_examp": "I would never knowingly hurt her.", "lear_examp": "Separate sex schools unavoidably tend to instill values knowingly or unknowingly."}, {"sense": "showing that you know what another person is really thinking", "level": "C2", "dict_examp": "He smiled knowingly.", "lear_examp": "On staring at the picture, he saw two women smiling enigmatically, rather knowingly."}]}]}, {"word": "known", "poses": [{"pos": "adjective", "senses": [{"sense": "to be called", "level": "B1", "dict_examp": "California is also known as the Sunshine State.", "lear_examp": "He studied in Central College, which is now known as Queen's College."}, {"sense": "recognized by or familiar to most people", "level": "B2", "dict_examp": "a known fact", "lear_examp": ""}]}]}, {"word": "kit", "poses": [{"pos": "noun", "senses": [{"sense": "a collection of things kept in a container for a particular use", "level": "B1", "dict_examp": "a first-aid/tool kit", "lear_examp": "I would rather buy a big travel kit, including a first-aid kit."}]}]}, {"word": "knock", "poses": [{"pos": "verb", "senses": [{"sense": "to repeatedly hit something, making a noise", "level": "B1", "dict_examp": "She knocked on the window to attract his attention.", "lear_examp": "On Monday, a person knocked on my door."}, {"sense": "to hit, especially forcefully, and cause to move or fall", "level": "B1", "dict_examp": "He accidentally knocked the vase off the table.", "lear_examp": "Falling down, I knocked my head on the pavement."}, {"sense": "to hit someone with a vehicle and injure or kill them", "level": "B1", "dict_examp": "She was knocked down by a bus.", "lear_examp": "The man explained that Lime was knocked down by a car and that he died immediately."}, {"sense": "to destroy a building or part of a building", "level": "B2", "dict_examp": "They've knocked down the old movie theater.", "lear_examp": "Since many of the office building are almost empty I also think that we should have them knocked down and replaced by green parks or other areas where no cars are to be allowed."}, {"sense": "to make someone become unconscious, usually by hitting them on the head", "level": "B2", "dict_examp": "He was knocked out halfway through the fight.", "lear_examp": "Chris knocked him out with a strong punch without doubting that he was a criminal."}, {"sense": "to defeat a person or team in a competition so they cannot take part any more", "level": "B2", "dict_examp": "The Canadian team was knocked out in the semifinal.", "lear_examp": ""}, {"sense": "to hit or push something or someone, especially accidentally, so that they fall to the ground or onto their side", "level": "B2", "dict_examp": "I knocked a bottle of wine over while I was reaching for a dish.", "lear_examp": "I knocked over the girl's cup, which was still full of milk."}]}]}, {"word": "knob", "poses": [{"pos": "noun", "senses": [{"sense": "a round handle, or a round button on a machine", "level": "C1", "dict_examp": "a door knob", "lear_examp": "It's so obvious that when we turn a knob on or when we switch on something and there is no electricity, we are at a loss!"}]}]}, {"word": "know", "poses": [{"pos": "verb", "senses": [{"sense": "to have knowledge or information about something in your mind", "level": "A1", "dict_examp": "\"Where did he go?\" - \"I don't know.\"", "lear_examp": "I don't know how long it is."}, {"sense": "used to ask someone to tell you a piece of information", "level": "A1", "dict_examp": "Do you know the time?", "lear_examp": "Do you know why?"}, {"sense": "to be able to do something", "level": "A2", "dict_examp": "Do you know how to ski?", "lear_examp": "Some people know how to play the guitar."}, {"sense": "to be certain", "level": "A2", "dict_examp": "I know (that) she'll be really pleased to hear the news.", "lear_examp": "I can't find the information, but I know the class is on Tuesday."}, {"sense": "to tell someone something", "level": "A2", "dict_examp": "Let me know if you're coming to the party.", "lear_examp": "I just want to let you know that we are going to use blue paint because I really like blue."}, {"sense": "used to emphasize what you are saying, or used before you start to talk about someone or something, or used as something to say while you are thinking what to say next", "level": "B1", "dict_examp": "I'm not stupid, you know!", "lear_examp": ""}, {"sense": "to be familiar with or have experience and understanding of", "level": "B1", "dict_examp": "I've known Daniel since we were in school together.", "lear_examp": "I knew him in London, and when I knew him I was very happy."}, {"sense": "If you know a subject, you are familiar with it and understand it.", "level": "B1", "dict_examp": "Do you know about computers?", "lear_examp": "If you want to know more about Peruvian history, I recommend you visit the city because you can see the old houses and museums."}, {"sense": "to spend time with someone or something so that you gradually learn more about them", "level": "B1", "dict_examp": "The first couple of meetings are for the doctor and patient to get to know each other.", "lear_examp": "I hope you can come here and get to know him."}, {"sense": "used when you have an idea", "level": "B1", "dict_examp": "I know - let's go to Helen's house.", "lear_examp": ""}, {"sense": "used when you are saying something that someone already knows", "level": "B1", "dict_examp": "As you know, we have been trying to contact him.", "lear_examp": "As you know, I am in New York."}, {"sense": "used to say that you think something is true, but you cannot be sure", "level": "B2", "dict_examp": "As far as I know, he isn’t coming until tomorrow.", "lear_examp": "You wrote that you wanted to go next month, and as far as I know, that would be just fine."}, {"sense": "to have the intelligence or judgment not to do something", "level": "B2", "dict_examp": "She should have known better than to eat so much. No wonder she feels sick now.", "lear_examp": "I should have known better but I had to tell it to someone."}, {"sense": "used when you agree with something someone has just said", "level": "B2", "dict_examp": "\"It's a beautiful day, isn't it?\" \"I know - let's hope it lasts.\"", "lear_examp": ""}, {"sense": "used to say that something could be possible although it does not seem likely", "level": "B2", "dict_examp": "It sounds like a nice place to live, but you never know – we may not like it.", "lear_examp": "You never know, maybe I'll find something interesting and I'll change my point of view."}, {"sense": "very soon", "level": "C1", "dict_examp": "We'll be there before you know it.", "lear_examp": "It is a bit dark inside, and especially in winter, it is dark before you know it."}, {"sense": "to know everything about something", "level": "C1", "dict_examp": "He knows the system inside out.", "lear_examp": "The participants got to know Britain inside out and they are happy with the knowledge they gained."}, {"sense": "to understand a subject because of your experience", "level": "C1", "dict_examp": "He doesn't know what he's talking about - he's never even been to Africa.", "lear_examp": "I believe that you don't really know what you're talking about."}, {"sense": "to guess something correctly", "level": "C2", "dict_examp": "I should have  known he wouldn't come.", "lear_examp": "I should have known that he wouldn't understand."}, {"sense": "to be the most suitable person to have responsibility and make important decisions", "level": "C2", "dict_examp": "When it comes to dealing with my own son, I think I know best.", "lear_examp": "How true is that expression \"Father knows best.\" If my father was alive today he would probably be laughing his head off."}, {"sense": "to have enough experience not to do something stupid or something that will not achieve anything", "level": "C2", "dict_examp": "I thought she'd listen to me - I should have known better.", "lear_examp": "Surely two grown-ups should have known better than to shout at each other at the top of their lungs."}, {"sense": "used to talk about part of a story that happens in a sudden and surprising way", "level": "C2", "dict_examp": "A bike came speeding around the corner, and the next thing I knew I was lying on the ground.", "lear_examp": "And the next thing I knew was that I was playing cards with 3 men."}, {"sense": "to know a lot about a subject, or to be very good at doing something", "level": "C2", "dict_examp": "She's an excellent teacher - she really knows her stuff.", "lear_examp": "The thing was that she should have been be able to tell them what to do; she never doubted her own abilities. She knew \"her stuff\" all right."}, {"sense": "to have heard of something or someone and have a little information about them", "level": "B2", "dict_examp": "I know of a good restaurant near the theater.", "lear_examp": "I know of a good restaurant that has opened recently and it's near your new apartment, so I suggest we go and try out the marvelous Chinese dishes the day after the concert."}]}]}, {"word": "knowledgeable", "poses": [{"pos": "adjective", "senses": [{"sense": "knowing a lot", "level": "C1", "dict_examp": "He's very knowledgeable about art.", "lear_examp": "The teaching staff are largely responsible for the quality of the classes, as they're very knowledgeable and patient; being able to find them after classes, though, was impossible."}]}]}, {"word": "knot", "poses": [{"pos": "noun", "senses": [{"sense": "a place where one or more pieces of string, rope, etc. have been tied", "level": "C2", "dict_examp": "Tie a knot in the rope.", "lear_examp": "The man was always wearing a shabby coat and a big red scarf which was tied in a very complicated knot."}, {"sense": "to get married", "level": "C2", "dict_examp": "We're planning to tie the knot in April.", "lear_examp": "She was going to tie the knot in July."}]}]}, {"word": "knee", "poses": [{"pos": "noun", "senses": [{"sense": "the middle part of your leg where it bends", "level": "B1", "dict_examp": "a knee injury", "lear_examp": "He entered the living room drunk and with blood over his knee."}]}]}, {"word": "knowledge", "poses": [{"pos": "noun", "senses": [{"sense": "information and understanding that you have in your mind", "level": "B1", "dict_examp": "Her knowledge of English grammar is very extensive.", "lear_examp": "Actually, I wanted to improve my English knowledge, because I need a good job."}, {"sense": "used to say that you think that something is true, but cannot be sure", "level": "B2", "dict_examp": "To the best of my knowledge, she's never worked abroad.", "lear_examp": "Besides, to the best of my knowledge, nowhere in the city can you try such lovely mushrooms."}, {"sense": "something that a lot of people know", "level": "B2", "dict_examp": "It's common knowledge that four of the teachers will not be returning next year.", "lear_examp": "It is common knowledge that such attention in the mass-media inevitably tells on relationships in the family."}, {"sense": "knowledge about something which is good enough to be useful", "level": "B2", "dict_examp": "She has a working knowledge of German and Russian.", "lear_examp": "Furthermore, I have a working knowledge of English, Spanish, Catalan and Italian."}]}]}, {"word": "knuckle", "poses": [{"pos": "noun", "senses": [{"sense": "one of the parts of your finger where it bends", "level": "C2", "dict_examp": "I grazed my knuckles on the concrete.", "lear_examp": "What he could see was those two skinny figures, holding hands so tightly that their knuckles were white."}]}]}, {"word": "known", "poses": [{"pos": "adjective", "senses": [{"sense": "to be called", "level": "B1", "dict_examp": "California is also known as the Sunshine State.", "lear_examp": "He studied in Central College, which is now known as Queen's College."}, {"sense": "recognized by or familiar to most people", "level": "B2", "dict_examp": "a known fact", "lear_examp": ""}]}]}]