[{"word": "laboratory", "poses": [{"pos": "noun", "senses": [{"sense": "a room used for scientific work", "level": "B1", "dict_examp": "research laboratories", "lear_examp": "I was in my school, in a laboratory, when I lost it."}]}]}, {"word": "lamb", "poses": [{"pos": "noun", "senses": [{"sense": "a young sheep, or the flesh of a young sheep eaten as meat", "level": "B1", "dict_examp": "We were staying on a farm where there were newborn lambs.", "lear_examp": "On the farms, that were along the way, we could see lambs, ducks, cows, horses, dogs, chickens, cats and pigs."}]}]}, {"word": "lamp", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment that produces light", "level": "A2", "dict_examp": "a table/bedside lamp", "lear_examp": "I think it is next to the lamp."}]}]}, {"word": "land", "poses": [{"pos": "noun", "senses": [{"sense": "an area of ground, especially when used for a particular purpose such as farming or building", "level": "B1", "dict_examp": "This land here is good for growing potatoes.", "lear_examp": "One man talked about how people can use their land properly, how they should take care of their poultry farm or dairy farm, and how they can take care of their trees and crops."}, {"sense": "the surface of the earth that is not sea", "level": "B2", "dict_examp": "It is cheaper to drill for oil on land than at sea.", "lear_examp": "Firstly, the car is the fastest way of transportation by land that we have."}, {"sense": "a country", "level": "C2", "dict_examp": "Ireland was my grandmother’s native land.", "lear_examp": "People across the globe like to travel, explore and experience a different land."}]}, {"pos": "verb", "senses": [{"sense": "to arrive at a place in a plane or a boat, or to make a plane or a boat reach the land", "level": "B1", "dict_examp": "We should land in Madrid at 7:00 a.m.", "lear_examp": "When we landed, my suitcase was not there."}, {"sense": "If an object or person lands somewhere, they fall to the ground there.", "level": "C1", "dict_examp": "The ball landed in the neighbor's garden.", "lear_examp": "Then, when your booking form landed on my door mat, I decided to take matters into my own hands and to pay a visit to this conference."}, {"sense": "to get or achieve something, usually something good", "level": "C2", "dict_examp": "He's just landed a new job.", "lear_examp": "To return to our first point, people do not usually land a job in their field of study or childhood dream."}]}]}, {"word": "lane", "poses": [{"pos": "noun", "senses": [{"sense": "part of a road or track that is separated from the other parts, usually by a painted line", "level": "B2", "dict_examp": "the left/right/middle lane", "lear_examp": "For example, most buses drive in an extra lane."}, {"sense": "a narrow road in the countryside or in a town", "level": "B2", "dict_examp": "He drives too fast along those narrow, country lanes.", "lear_examp": "I think the best place to buy all this junk food is from my aunty's sweet shop, just 2 miles down your lane."}, {"sense": "doing or getting the things that lead to rapid success and advancement", "level": "C2", "dict_examp": "Their  hard work and successful software put them in the fast lane.", "lear_examp": "Finally, should you ask why people are not happier than before, the answer is that nowadays they spend more hours on work than before because modern life is mostly a life in the fast lane."}]}]}, {"word": "lack", "poses": [{"pos": "noun", "senses": [{"sense": "not having something, or not having enough of something", "level": "B1", "dict_examp": "Your problem is lack of confidence.", "lear_examp": "If you like nature, wish to see tropical birds, which are rare in your country, or just wish to have a pleasant time, the countryside is the best option, despite the lack of nightlife."}]}, {"pos": "verb", "senses": [{"sense": "to not have any or not have enough of something that is needed or wanted", "level": "B2", "dict_examp": "She just lacks a little confidence.", "lear_examp": "He lacks confidence due to such a terrible appearance."}, {"sense": "to not have a quality", "level": "C1", "dict_examp": "He's totally lacking in charm of any sort.", "lear_examp": "On the other hand, Japanese children are lacking in creativity and originality."}, {"sense": "If something that you need is lacking, you do not have enough of it.", "level": "C2", "dict_examp": "Enthusiasm has been sadly lacking these past few months at work.", "lear_examp": "And, last not least, I would really like to show them the importance and beauty of our cultural heritage which was lacking in my upbringing."}]}]}, {"word": "laid-back", "poses": [{"pos": "adjective", "senses": [{"sense": "very relaxed and not seeming worried about anything, or causing people to feel this way", "level": "C2", "dict_examp": "a laid-back style of teaching", "lear_examp": "It was very nice to be with laid-back people, not only because it led me to forget about unnecessary worries, but also it made me think about myself more thoroughly than before."}]}]}, {"word": "language", "poses": [{"pos": "noun", "senses": [{"sense": "a type of communication used by the people of a particular country or by a particular group of people", "level": "A1", "dict_examp": "How many languages do you speak?", "lear_examp": "I'm learning a new language."}, {"sense": "communication between people, usually using words", "level": "B1", "dict_examp": "She has done research into how children acquire language.", "lear_examp": "Language is very important for communication between people."}, {"sense": "words of a particular type, especially the words used by people in a particular job", "level": "C1", "dict_examp": "legal language", "lear_examp": "English has become the language of science, so it seems, even though some of the papers, studies and publications are hard to read and understand."}, {"sense": "a system of instructions that is used to write computer programs", "level": "C1", "dict_examp": "I'm not familiar with that programming language.", "lear_examp": "Students must have knowledge of at least one programming language, preferably Visual C++."}, {"sense": "very rude and offensive words", "level": "C1", "dict_examp": "There was a lot of foul language in the movie.", "lear_examp": "It is the responsibility of the parents not to fight or use any foul language in front of the kids, as they may learn and use it in front of others."}, {"sense": "words that some people might consider to be offensive", "level": "C1", "dict_examp": "The movie contains strong language.", "lear_examp": "But what I do see is local kids standing on the corner, chatting, smoking and using strong language."}]}]}, {"word": "ladder", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment that is used to reach high places, consisting of short steps attached between two long sides", "level": "B1", "dict_examp": "She was up on a ladder, cleaning the window.", "lear_examp": "My grandfather fell down from the ladder yesterday while he was fixing the broken light bulbs."}, {"sense": "a series of increasingly important jobs or stages in a particular type of work or process", "level": "C1", "dict_examp": "a first step on the employment ladder", "lear_examp": "Far too often it is not \"the key\" but \"the missing link,\" preventing us from taking the next step on the career ladder."}]}]}, {"word": "labor", "poses": [{"pos": "noun", "senses": [{"sense": "work, especially the type of work that needs physical effort", "level": "C1", "dict_examp": "The car parts themselves are not expensive - it's the labor that costs so much.", "lear_examp": "Several jobs did not even require the use of English, but were physical labor."}, {"sense": "workers, especially people who do practical work with their hands", "level": "C1", "dict_examp": "skilled/unskilled labor", "lear_examp": "By working on both draining specific roads and replacing the worn down asphalt simultaneously, the city would be saving money on the labor."}, {"sense": "the number of people in a place who are available and willing to work", "level": "C1", "dict_examp": "The strong economy will create growth in the labor market.", "lear_examp": "The labor market in Russia is greatly influenced by the political situation."}, {"sense": "all of the people available to work or actually employed in a particular area, industry, or company", "level": "C2", "dict_examp": "In this city, over 15 percent of the labor force are in jobs that require a bachelor's degree.", "lear_examp": "Young couples usually don't want to have more then one or two children and the labor force is declining."}, {"sense": "the last stage of pregnancy when the woman gives birth to a baby", "level": "C2", "dict_examp": "She went into labor at twelve o’clock last night.", "lear_examp": ""}, {"sense": "an activity that is hard work but which you do because you enjoy it", "level": "C2", "dict_examp": "He prefers to paint the house himself - it's a labor of love.", "lear_examp": ""}]}]}, {"word": "lab", "poses": [{"pos": "noun", "senses": [{"sense": "a laboratory", "level": "B1", "dict_examp": "a science/computer lab", "lear_examp": "There are computer labs too."}]}]}, {"word": "large", "poses": [{"pos": "adjective", "senses": [{"sense": "big in size or amount", "level": "A2", "dict_examp": "a large house", "lear_examp": "It's the new Nokia 380S. I like its large screen and its video camera."}, {"sense": "in general", "level": "C1", "dict_examp": "By and large, people have welcomed the changes.", "lear_examp": "I would say that, by and large, tourism in the world today is more beneficial than harmful."}, {"sense": "people or things in general", "level": "C2", "dict_examp": "This group is not representative of the population at large.", "lear_examp": "Television - sometimes also described as the \"idiot box\" - has been accused of turning a whole generation into \"couch potatoes\" and blamed for every malady affecting the society at large."}, {"sense": "If something looms large, it becomes very important and often causes worry.", "level": "C2", "dict_examp": "The issue of pay will loom large at this year's conference.", "lear_examp": "It was, she dreaded to admit, a sense of regret. She shock her head as if doing so shooed the feeling away.  On the contrary, however, it was looming large while she was stamping along the busy street."}]}]}, {"word": "landing", "poses": [{"pos": "noun", "senses": [{"sense": "an arrival on the ground of an aircraft or boat", "level": "B2", "dict_examp": "an emergency landing", "lear_examp": "The company said our landing would depend on the weather forecast."}]}]}, {"word": "landscape", "poses": [{"pos": "noun", "senses": [{"sense": "the appearance of an area of land, especially in the countryside", "level": "B1", "dict_examp": "a rural landscape", "lear_examp": "The landscape was beautiful with a lake, a lot of animals, birds, and many flowers."}]}]}, {"word": "landmark", "poses": [{"pos": "noun", "senses": [{"sense": "a place or building that you can easily recognize, especially one that helps you to know where you are", "level": "C1", "dict_examp": "a familiar landmark", "lear_examp": "It is situated on a rocky outcrop overlooking the river and is a landmark visible from many miles."}, {"sense": "a building or other structure that is considered especially important", "level": "C1", "dict_examp": "a landmark skyscraper", "lear_examp": "What they enjoyed most was the bus tour of London, on Tuesday, as it was a chance for them to see all the famous landmarks without walking."}, {"sense": "an event which is famous or important in the history of something", "level": "C2", "dict_examp": "The invention of the silicon chip is a landmark in the history of technology.", "lear_examp": "This film will never be \"Titanic\" successful, or \"Casablanca\" successful, or \"Matrix\" successful, but it will always be a ... landmark in the history of action and martial arts films, forever redefining its genre."}]}]}, {"word": "laptop", "poses": [{"pos": "noun", "senses": [{"sense": "a computer that is small enough to be carried around and used where you are sitting", "level": "A2", "dict_examp": "A laptop would be really useful for when I'm working on the train.", "lear_examp": "I think the laptop is in your bedroom."}]}]}, {"word": "label", "poses": [{"pos": "noun", "senses": [{"sense": "a small piece of paper or other material which gives information about the thing it is attached to", "level": "B1", "dict_examp": "a warning label", "lear_examp": "It was the price label hanging from the skirt belt."}, {"sense": "the name or symbol of a company that produces goods for sale, or the goods themselves or the company itself", "level": "B1", "dict_examp": "The group has signed  with a new record label.", "lear_examp": "Another style which I like is the clothes from big labels like Armani, Dolce and Gabanna and Hugo Boss, but they are very expensive."}, {"sense": "a word or phrase that is used to describe the qualities of someone or something, usually in a way that is not fair", "level": "C2", "dict_examp": "He seems to be stuck with the label \"troublemaker.\"", "lear_examp": "He pointed out that the label of \"traveler\" could only be given to those people who would be willing to spend a long period living in another country, enough time to understand the functioning of society and its rules and to be accepted as an \"informed\" citizen, or at least not to be regarded as a foreigner."}]}, {"pos": "verb", "senses": [{"sense": "to fix a small piece of paper or other material to something which gives information about it", "level": "C1", "dict_examp": "She labeled all the packages and sent them out the same afternoon.", "lear_examp": "When you arrive at the railway station you have to by a ticket at one of the counters labeled \"Fahrkarten.\""}, {"sense": "to describe the qualities of someone or something using a word or phrase", "level": "C2", "dict_examp": "He didn’t want to be labeled a complainer, so he didn’t raise any objection to the extra work.", "lear_examp": "In my concept, these are the real people who deserve to be labeled as celebrities and not the ones who, currently, carry these titles."}]}]}, {"word": "lady", "poses": [{"pos": "noun", "senses": [{"sense": "a polite or old fashioned way of referring to or talking to a woman", "level": "B1", "dict_examp": "There's a young lady here to see you.", "lear_examp": "A very nice lady offered me a ride home but I refused."}]}]}, {"word": "lake", "poses": [{"pos": "noun", "senses": [{"sense": "a large area of water which has land all around it", "level": "A2", "dict_examp": "We used to go boating on that lake.", "lear_examp": "I would like to visit the lake and swim in it."}]}]}, {"word": "landlord", "poses": [{"pos": "noun", "senses": [{"sense": "a man who you rent an apartment, house, room or land from", "level": "B2", "dict_examp": "I asked the landlord to fix the window.", "lear_examp": "I came downstairs and saw my landlord, who seemed very angry."}]}]}, {"word": "landlady", "poses": [{"pos": "noun", "senses": [{"sense": "a woman who you rent an apartment, house, room or land from", "level": "B2", "dict_examp": "Heather's  landlady lowered her rent when she said she might move out.", "lear_examp": "Maybe I should tell my landlady about that."}]}]}, {"word": "laugh", "poses": [{"pos": "verb", "senses": [{"sense": "to smile while making sounds with your voice that show you are happy or think something is funny", "level": "A2", "dict_examp": "They laughed at her jokes.", "lear_examp": "We laughed all the time."}, {"sense": "If a subject is no laughing matter, it is serious and not something that people should joke about.", "level": "C2", "dict_examp": "Being late for a job interview is no laughing matter.", "lear_examp": "Anna and Tom knew this was no laughing matter."}, {"sense": "to show that you think someone or something is stupid", "level": "B1", "dict_examp": "I can't go into work looking like this - everyone will laugh at me.", "lear_examp": "All my friends laughed at me."}]}, {"pos": "noun", "senses": [{"sense": "the act or sound of laughing", "level": "B1", "dict_examp": "a loud/nervous laugh", "lear_examp": "There is a beautiful beach there where you can swim, play football and enjoy a good laugh with your friends."}]}]}, {"word": "the last minute", "poses": [{"pos": "noun", "senses": [{"sense": "the latest possible opportunity for doing something", "level": "B2", "dict_examp": "They only told me at the last minute that they couldn't come.", "lear_examp": "We were very disappointed to hear that the actor was replaced by another at the last minute."}]}]}, {"word": "last", "poses": [{"pos": "adjective", "senses": [{"sense": "the week/year/Monday, etc. before the present one", "level": "A1", "dict_examp": "I went to Boston last month.", "lear_examp": "I am very sorry you had an accident last week."}, {"sense": "the evening or night that has just passed", "level": "A1", "dict_examp": "I didn't sleep well last night.", "lear_examp": "I think I left my coat in your house last night."}, {"sense": "the most recent", "level": "A2", "dict_examp": "What was the last movie you saw?", "lear_examp": "Thank you for your last letter."}, {"sense": "The last book, house, job, etc. is the one before the present one.", "level": "A2", "dict_examp": "My last house was half this size.", "lear_examp": "I like it because my last watch was broken."}, {"sense": "happening or coming at the end", "level": "A2", "dict_examp": "It's the last room on the left.", "lear_examp": "The last day we were in a city in Lithuania named Panevezys."}, {"sense": "only remaining", "level": "B1", "dict_examp": "Who wants the last piece of cake?", "lear_examp": "The cameras watch everybody in the house 24 hours a day. Every Friday, the public decides who should leave. The last person wins this show."}, {"sense": "the least expected or wanted person or thing", "level": "B2", "dict_examp": "Three extra people to feed - that's the last thing I need!", "lear_examp": "I thought it would be the last thing I wanted, but it wasn't. I've really enjoyed this opportunity."}, {"sense": "something that you do because everything else has failed", "level": "C2", "dict_examp": "As a last resort, we could ask your mother to help.", "lear_examp": "As a last resort and a solution for those that don't admire books, I would recommend buying a comic in which you see more pictures than words."}]}, {"pos": "adverb", "senses": [{"sense": "used to talk about the most recent time you did something", "level": "B1", "dict_examp": "When did you last see her?", "lear_examp": "Write back soon and let me know what you have been up to since I heard from you last."}, {"sense": "after everything or everyone else", "level": "B2", "dict_examp": "I wasn't expecting to win the race but I didn't think I'd come last!", "lear_examp": "When I reached the other end of the pool, my heart suddenly stopped and I just couldn't move my legs to continue swimming. So, I arrived last."}, {"sense": "something that you say to introduce the last person or thing on a list", "level": "B2", "dict_examp": "This is Jeremy, this is Cath and, last but not least, this is Eva.", "lear_examp": "And, last but not least, some complaints were made about the entertainment the café provides."}]}, {"pos": "noun", "senses": [{"sense": "finally", "level": "B1", "dict_examp": "At last, I've found a pair of jeans that actually fit.", "lear_examp": "Well, at long last I've decided to put pen to paper and I'm going to answer your question."}, {"sense": "a person or thing that does something after all the others", "level": "B2", "dict_examp": "We were the last to get there.", "lear_examp": "After a short time, the last of Mrs. O'Connell's guests arrived."}, {"sense": "the day, week, year, etc. before the one that has just finished", "level": "B2", "dict_examp": "I only had my hair cut the week before last.", "lear_examp": "The night before last night there was a storm, every thing was a mess!"}, {"sense": "the only part of something that remains", "level": "C2", "dict_examp": "We've just finished the last of the apples.", "lear_examp": "They felt the joy their predecessors must have felt after years of struggle, after risking their lives, after accepting in resignation to be the last of a lineage that had lasted for centuries."}, {"sense": "the last time someone heard anything about someone or something", "level": "C2", "dict_examp": "The last I heard, they will arrive Tuesday night.", "lear_examp": "That was the last I heard of her for a long time."}]}, {"pos": "verb", "senses": [{"sense": "to continue to happen, exist, or be useful", "level": "B1", "dict_examp": "How long will the meeting last?", "lear_examp": "The trip was very tiring because it lasted five hours."}, {"sense": "to be enough for a period of time", "level": "C1", "dict_examp": "I've only got $30 to last me till the end of the month.", "lear_examp": "The most important meal of the day used to contain a lot of energy, enough to last all day."}]}]}, {"word": "last-minute", "poses": [{"pos": "adjective", "senses": [{"sense": "done at the latest possible opportunity", "level": "B2", "dict_examp": "a last-minute cancellation", "lear_examp": "I could come the following day to help you with the last-minute preparations if you want me to."}]}]}, {"word": "late", "poses": [{"pos": "adjective", "senses": [{"sense": "happening or arriving after the planned, expected, usual or necessary time", "level": "A1", "dict_examp": "This train is always late.", "lear_examp": "I hope I am not late."}, {"sense": "happening or being near the end of a period of time", "level": "A1", "dict_examp": "It was late at night.", "lear_examp": "I don't like the time the class finishes. It's too late!"}, {"sense": "describes someone who has died, especially recently", "level": "C2", "dict_examp": "She gave her late husband's clothes to charity.", "lear_examp": "It took me a while to find a person whom I regard as successful, the outcome is a friend of my late father."}, {"sense": "used after a time or date to say that something could happen before but not after that time", "level": "C2", "dict_examp": "She said to be there by 8 o'clock at the latest.", "lear_examp": "As far as employment is concerned, as people take their pensions at the age of 65 at the latest, new staff cannot be recruited."}]}, {"pos": "adverb", "senses": [{"sense": "after the planned, expected, usual or necessary time", "level": "A2", "dict_examp": "Kathryn's just phoned to say she's working late this evening.", "lear_examp": "The party finished late."}, {"sense": "near the end of a period of time", "level": "B2", "dict_examp": "We talked late into the night.", "lear_examp": "Firstly, he usually starts working at eight in the morning and he keeps on writing and phoning till late in the evening."}]}]}, {"word": "latest", "poses": [{"pos": "adjective", "senses": [{"sense": "being the newest or most recent or modern", "level": "A2", "dict_examp": "Have you seen her latest movie?", "lear_examp": "I like it very much, because it is the latest model and nobody at our school has it."}]}]}, {"word": "laughter", "poses": [{"pos": "noun", "senses": [{"sense": "the act or sound of laughing", "level": "B2", "dict_examp": "She roared with laughter.", "lear_examp": "People need music, joy and laughter."}]}]}, {"word": "largely", "poses": [{"pos": "adverb", "senses": [{"sense": "almost completely", "level": "B2", "dict_examp": "a largely male company", "lear_examp": "What I'm trying to say is that images, film-frames, videos and sound clips would be largely accepted by the young people because we're moving into a new high-technology age."}]}]}, {"word": "last name", "poses": [{"pos": "noun", "senses": [{"sense": "the name that you and other members of your family all have", "level": "A2", "dict_examp": "Her first name is Sarah but I don't know her last name.", "lear_examp": "Brown was his last name."}]}]}, {"word": "lastly", "poses": [{"pos": "adverb", "senses": [{"sense": "finally", "level": "B2", "dict_examp": "And lastly, I'd like to thank everyone who took part in the event.", "lear_examp": "Lastly, I'd like to say that it's very kind of you to suggest bringing something back for me."}]}]}, {"word": "large", "poses": [{"pos": "adjective", "senses": [{"sense": "big in size or amount", "level": "A2", "dict_examp": "a large house", "lear_examp": "It's the new Nokia 380S. I like its large screen and its video camera."}, {"sense": "in general", "level": "C1", "dict_examp": "By and large, people have welcomed the changes.", "lear_examp": "I would say that, by and large, tourism in the world today is more beneficial than harmful."}, {"sense": "people or things in general", "level": "C2", "dict_examp": "This group is not representative of the population at large.", "lear_examp": "Television - sometimes also described as the \"idiot box\" - has been accused of turning a whole generation into \"couch potatoes\" and blamed for every malady affecting the society at large."}, {"sense": "If something looms large, it becomes very important and often causes worry.", "level": "C2", "dict_examp": "The issue of pay will loom large at this year's conference.", "lear_examp": "It was, she dreaded to admit, a sense of regret. She shock her head as if doing so shooed the feeling away.  On the contrary, however, it was looming large while she was stamping along the busy street."}]}]}, {"word": "lately", "poses": [{"pos": "adverb", "senses": [{"sense": "recently", "level": "B1", "dict_examp": "Lately, I've been walking to work.", "lear_examp": "I'm sorry I couldn't write back to you before but I've been very busy lately."}]}]}, {"word": "laser", "poses": [{"pos": "noun", "senses": [{"sense": "a machine that produces a strong beam of light that has medical and technical uses or a beam of light produced by a machine like this", "level": "B2", "dict_examp": "laser beam", "lear_examp": "These appliances have been the key to medical achievements, such as laser-based surgery or different kinds of diagnosis and treatment."}]}]}, {"word": "launch", "poses": [{"pos": "verb", "senses": [{"sense": "to start an important plan or activity, or begin something", "level": "B2", "dict_examp": "The program was launched a year ago.", "lear_examp": "Dear Phil, I was very proud last Monday when you asked me to help you to launch this association."}, {"sense": "If a company launches a product or service, it makes it available for the first time.", "level": "B2", "dict_examp": "We’re planning to launch a new Internet company next month.", "lear_examp": "The firm was launching a new product and Peter was the manager in charge of making this product the most desirable thing to buy."}, {"sense": "to send a spacecraft or rocket into the sky, or a ship into the water", "level": "C2", "dict_examp": "On the last shuttle mission, the crew launched a communications satellite.", "lear_examp": "Could our grandparents or grandparents' parents imagine that one day, we would be able to launch rockets, to have satellites in the sky?"}]}, {"pos": "noun", "senses": [{"sense": "the start of a  new plan or activity", "level": "C1", "dict_examp": "The launch of their new campaign began today with a press conference.", "lear_examp": "As for the natural resources, it is not very effective as nothing has changed since the launch of the campaign."}, {"sense": "the introduction of a new product or service, or an event to celebrate this", "level": "C1", "dict_examp": "Frank went to the launch for the company's new LCD TVs.", "lear_examp": "For instance, one of those major companies is about to launch the microwave version of one of our region's most famous meals."}, {"sense": "the launching of a spacecraft, ship, or weapon", "level": "C2", "dict_examp": "The launch of the space shuttle was delayed for 24 hours because of bad weather.", "lear_examp": "If not every member supports every other member, if open handling of errors isn't done at all stages of the project, if not every member commits to the common target, then millions of euros and many years of work will be destroyed within a few seconds during the launch of the satellite."}]}]}, {"word": "later", "poses": [{"pos": "adverb", "senses": [{"sense": "used for saying goodbye to someone you are going to meet again soon, especially during the same day", "level": "A1", "dict_examp": "See you later!", "lear_examp": "See you later!"}, {"sense": "at a time in the future or after the time you have mentioned", "level": "A2", "dict_examp": "He'll be back later.", "lear_examp": "I may pick it up later."}, {"sense": "at a time in the future, or after the time you have mentioned", "level": "B1", "dict_examp": "What are you doing later on this evening?", "lear_examp": "But later on, I could not believe what actually happened."}]}, {"pos": "adjective", "senses": [{"sense": "happening at a time in the future, or after the time you have mentioned", "level": "B2", "dict_examp": "We could catch a later train.", "lear_examp": "He said he'll come at a later date."}, {"sense": "happening toward the end of a period of time or the end of someone's life", "level": "C2", "dict_examp": "He needed round-the-clock care in the later stages of his illness.", "lear_examp": "This also made me a thrifty person and helped me in my later years where I could avoid wasteful expenses."}, {"sense": "more modern or recent", "level": "C2", "dict_examp": "Later versions of the software are much better.", "lear_examp": ""}]}]}, {"word": "latter", "poses": [{"pos": "adjective", "senses": [{"sense": "near or toward the end of something", "level": "B2", "dict_examp": "Construction on the new library should begin in the latter part of next year.", "lear_examp": "I agree with the latter opinion."}]}, {"pos": "pronoun", "senses": [{"sense": "the second of two people, things or groups previously mentioned", "level": "B2", "dict_examp": "They only seats available were off to the side or up in the balcony -  I chose the latter.", "lear_examp": "The former is a Chinese restaurant and the latter an Indian."}]}]}, {"word": "lay", "poses": [{"pos": "verb", "senses": [{"sense": "If an animal lays eggs, it produces them out of its body.", "level": "B2", "dict_examp": "The hens have laid a lot of eggs this week.", "lear_examp": "The only thing they can do is to lay eggs."}, {"sense": "to put something down somewhere carefully", "level": "C1", "dict_examp": "She laid the baby in the crib.", "lear_examp": "Veterans lay flowers on the graves of those who'd died during the War."}, {"sense": "to stop employing someone, usually because there is no work for them to do", "level": "B2", "dict_examp": "Because of falling orders, the company has been forced to lay off several hundred                             workers.", "lear_examp": "Dear Madam, I am John Smith, I work in a factory although it will not be for a long time because the company is beginning to lay off a lot of workers."}, {"sense": "to explain something clearly, usually in writing", "level": "C1", "dict_examp": "We have asked them to lay out their plans for the future of the park.", "lear_examp": "I would like you to rewrite the column, making all the changes I have laid out for you."}, {"sense": "to arrange or design something, or to show how the parts of something will fit together", "level": "C1", "dict_examp": "The designer laid out the book with pictures on every page.", "lear_examp": "By studying the effects of rain and ways to handle the expected amount of water one can plan the laying out of the new roads and correct the deficiencies in the present ones."}, {"sense": "to spend money, especially if it seems like a large amount", "level": "C2", "dict_examp": "He has laid out $40,000 to fund Little League teams in California.", "lear_examp": "It is their character, their interests or maybe some subtle power that makes people lay out a vast sum of money for a picture of a piece of jewelry."}]}]}, {"word": "layout", "poses": [{"pos": "noun", "senses": [{"sense": "the way that something is arranged", "level": "C1", "dict_examp": "Each article in the journal has its own typeface and layout.", "lear_examp": "Enhancements expanded to include building layout and structure."}]}]}, {"word": "leader", "poses": [{"pos": "noun", "senses": [{"sense": "a person in control of a group, country, or situation", "level": "B1", "dict_examp": "a business/community/political leader", "lear_examp": "When I arrived there, the group leader introduced me to all the others, and they all were very friendly."}, {"sense": "someone or something that is first or most important", "level": "C1", "dict_examp": "Her company is a leader in the women’s clothing industry.", "lear_examp": "The work experience with SuNatCo must, without doubt, positively affect your future career, as our firm is a world leader in the sphere of communications."}]}]}, {"word": "laziness", "poses": [{"pos": "noun", "senses": [{"sense": "being lazy", "level": "B2", "dict_examp": "The only thing stopping me from getting to the gym is laziness.", "lear_examp": "Sorry I haven't dropped you a line before now - no excuses really, just laziness."}]}]}, {"word": "law", "poses": [{"pos": "noun", "senses": [{"sense": "the subject or job of understanding and dealing with the official laws of a country", "level": "B1", "dict_examp": "to study/practice law", "lear_examp": "Her name is Martina, she is twenty-one years old and she studies law in Bologna."}, {"sense": "an official rule made by a government", "level": "B2", "dict_examp": "state/federal law", "lear_examp": "There is a special law in Sweden which allows everyone to wander along any private estate unless one causes any harm."}, {"sense": "the system of official rules in a country", "level": "B2", "dict_examp": "Playing loud music late at night is against the law.", "lear_examp": "As a result, the law is being constantly broken."}, {"sense": "If you have to do something by law, it is illegal not to do it.", "level": "C1", "dict_examp": "They have to provide a contract by law.", "lear_examp": "They consist in preparing e-mails or letters, all formal, giving explanations to clients about their fiscal situation in Brazil, preparing and calculating tax returns, providing to the IRS our clients asset positions, which is required by law and also, having meetings with clients - this is the most important and exciting part of our work."}, {"sense": "a statement or relationship that is always true in science, mathematics, etc.", "level": "C2", "dict_examp": "the laws of physics", "lear_examp": "Everything seamed less real or less personal when she thought of the universe as an entity and of people as cells or even atoms circling frenetically around an unseen nucleus bound by laws of physics that could not be broken or avoided."}, {"sense": "to do something illegal in order to punish someone because you know that the law will not punish that person", "level": "C2", "dict_examp": "The police did nothing about the thefts, so they took the law into their own hands.", "lear_examp": "Therefore, locals are scared to death, leading to their taking the law into their own hands."}, {"sense": "the obeying of laws in society", "level": "C2", "dict_examp": "a breakdown in law and order", "lear_examp": "The breakdown in law and order, lack of basic amenities to support life, absence of a fair and enabling environment for citizens to thrive, to mention but a few, are some among many factors that constitute the cogent reason why most Nigerians choose to travel out of their own country."}]}]}, {"word": "laundry", "poses": [{"pos": "noun", "senses": [{"sense": "clothes, sheets, etc. that need to be washed", "level": "B2", "dict_examp": "to do the laundry", "lear_examp": "Does the camp have laundry facilities?"}]}]}, {"word": "lawn", "poses": [{"pos": "noun", "senses": [{"sense": "an area of grass that is cut to keep it short", "level": "C1", "dict_examp": "Will you mow the lawn this weekend?", "lear_examp": "Please find enclosed a map of Brighton. Concerning the house, I ask you to mow the lawn regularly and to water the flowers and the green plants every day."}]}]}, {"word": "lawsuit", "poses": [{"pos": "noun", "senses": [{"sense": "a problem taken to a court of law, by an ordinary person or an organization rather than the police, for a legal decision", "level": "C2", "dict_examp": "The lawsuit is aimed at protecting this species of  salamander.", "lear_examp": "Unless such a plan is presented within a month, we will put high compensation claims in a lawsuit."}]}]}, {"word": "leaf", "poses": [{"pos": "noun", "senses": [{"sense": "a flat, green part of a plant that grows from a stem or branch", "level": "B1", "dict_examp": "a lettuce leaf", "lear_examp": "One of the things that I like about gorillas is that they are strong and they eat leaves, and another thing is that they can move very fast through the trees."}, {"sense": "to start to behave in a better way", "level": "C2", "dict_examp": "I turned over a new leaf and began getting to work on time.", "lear_examp": "She promised to turn over a new leaf."}]}]}, {"word": "league", "poses": [{"pos": "noun", "senses": [{"sense": "a group of teams that compete against each other in a sport", "level": "B1", "dict_examp": "the National League", "lear_examp": "A TV company came to our school yesterday to make a film of our school's basket-ball team after winning first place at the state's league this year."}]}]}, {"word": "leading", "poses": [{"pos": "adjective", "senses": [{"sense": "very important or most important", "level": "B2", "dict_examp": "a leading expert on the country's ecology", "lear_examp": "Indeed hard work plays the leading role concerning both family welfare and the national economy."}]}]}, {"word": "lazy", "poses": [{"pos": "adjective", "senses": [{"sense": "A person who is lazy does not like working or using any effort.", "level": "A2", "dict_examp": "These kids are just too lazy to walk to school!", "lear_examp": "If you like drawing and if you aren't a lazy boy, attend the new art class!"}, {"sense": "slow and gentle or relaxed", "level": "B2", "dict_examp": "a lazy breeze", "lear_examp": "Newly arrived with all of my family on the French coast, we were getting set for a long lazy day on the beach."}]}]}, {"word": "launch", "poses": [{"pos": "verb", "senses": [{"sense": "to start an important plan or activity, or begin something", "level": "B2", "dict_examp": "The program was launched a year ago.", "lear_examp": "Dear Phil, I was very proud last Monday when you asked me to help you to launch this association."}, {"sense": "If a company launches a product or service, it makes it available for the first time.", "level": "B2", "dict_examp": "We’re planning to launch a new Internet company next month.", "lear_examp": "The firm was launching a new product and Peter was the manager in charge of making this product the most desirable thing to buy."}, {"sense": "to send a spacecraft or rocket into the sky, or a ship into the water", "level": "C2", "dict_examp": "On the last shuttle mission, the crew launched a communications satellite.", "lear_examp": "Could our grandparents or grandparents' parents imagine that one day, we would be able to launch rockets, to have satellites in the sky?"}]}, {"pos": "noun", "senses": [{"sense": "the start of a  new plan or activity", "level": "C1", "dict_examp": "The launch of their new campaign began today with a press conference.", "lear_examp": "As for the natural resources, it is not very effective as nothing has changed since the launch of the campaign."}, {"sense": "the introduction of a new product or service, or an event to celebrate this", "level": "C1", "dict_examp": "Frank went to the launch for the company's new LCD TVs.", "lear_examp": "For instance, one of those major companies is about to launch the microwave version of one of our region's most famous meals."}, {"sense": "the launching of a spacecraft, ship, or weapon", "level": "C2", "dict_examp": "The launch of the space shuttle was delayed for 24 hours because of bad weather.", "lear_examp": "If not every member supports every other member, if open handling of errors isn't done at all stages of the project, if not every member commits to the common target, then millions of euros and many years of work will be destroyed within a few seconds during the launch of the satellite."}]}]}, {"word": "leaflet", "poses": [{"pos": "noun", "senses": [{"sense": "on or more pieces of folded paper that gives information or advertises something", "level": "B2", "dict_examp": "They were handing out leaflets outside the supermarket about the school board election.", "lear_examp": "Another idea is to place a table where students, staff and visitors can find some information about the school and their activities, some leaflets and brochures."}]}]}, {"word": "leak", "poses": [{"pos": "verb", "senses": [{"sense": "If a liquid or gas leaks, it comes out of a hole or space by accident, and if a container leaks, it allows liquid or gas to come out when it should not.", "level": "B2", "dict_examp": "Water was leaking from the pipe.", "lear_examp": "There is always a possibility that this tent is leaking."}, {"sense": "If someone leaks secret information, they intentionally tell people about it.", "level": "C2", "dict_examp": "Details of the report had been leaked to the press.", "lear_examp": "\"If these facts were leaked to the press, my career would be done for,\" he said."}]}, {"pos": "noun", "senses": [{"sense": "a hole in something that a liquid or gas comes out of, or the liquid or gas that comes out", "level": "B2", "dict_examp": "There's water on the floor - we must have a leak.", "lear_examp": "The theater restaurant was closed because there was a serious leak in a pipe and the kitchen was flooded."}, {"sense": "secret information that has intentionally been told to someone", "level": "C2", "dict_examp": "The Justice Department was investigating security leaks.", "lear_examp": ""}]}]}, {"word": "layer", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of a substance covering a surface, or one of several amounts of substance, each on top of the other", "level": "B2", "dict_examp": "the ozone layer", "lear_examp": "I think clothes will have many gadgets on them like a small oxygen mask or a hat designed to protect people from the strong rays of the sun at midday because the ozone layer will be destroyed in a hundred years' time."}]}]}, {"word": "leadership", "poses": [{"pos": "noun", "senses": [{"sense": "the set of characteristics that make a good leader", "level": "C1", "dict_examp": "What the company lacks is leadership.", "lear_examp": "I also have strong leadership skills and I can lead a team, if necessary."}, {"sense": "the job of being in control of a group, country, or situation", "level": "C1", "dict_examp": "The group flourished under her firm leadership.", "lear_examp": "Apart from his charismatic leadership and his pioneering spirit, Eleftherios Venizelos was very close to people who were impoverished and deeply disappointed at that time."}, {"sense": "the people in control of a group, country, or situation", "level": "C1", "dict_examp": "There is growing discontent with the leadership.", "lear_examp": "His reappearance is when he wins the leadership of the Social Democratic Party and when a few months later he becomes Prime-Minster."}]}]}, {"word": "lead", "poses": [{"pos": "verb", "senses": [{"sense": "to show someone where to go, usually by taking them to a place or by going in front of them", "level": "B1", "dict_examp": "I don't know the way, so you'd better lead.", "lear_examp": "And you can go to the nearest village, where you can take a mountain walk led by experienced guides."}, {"sense": "If something, for example a path or road, leads somewhere, it goes in that direction.", "level": "B2", "dict_examp": "That path leads to the beach.", "lear_examp": "I discovered a small path which led to an old castle we had never seen before."}, {"sense": "to be winning a game or a competition", "level": "B2", "dict_examp": "Ngomo led by less than two seconds.", "lear_examp": "Marseille led 1-0 versus Milan AC in the match which qualified the winner for the semi-finals."}, {"sense": "to be in control of a group, country, or situation", "level": "B2", "dict_examp": "I think we've chosen the right person to lead the expedition.", "lear_examp": "I also led a group of people cleaning the wood just outside the city."}, {"sense": "to live in a particular way", "level": "B2", "dict_examp": "She retired to Florida and still leads a busy life.", "lear_examp": "Owing to the great speed of technological development, people need to lead a faster life than before."}, {"sense": "to be better than anyone else", "level": "C2", "dict_examp": "I still believe that we lead the world in acting talent.", "lear_examp": ""}, {"sense": "to cause someone to do or think something", "level": "C2", "dict_examp": "What led you to think that?", "lear_examp": "The girl's disappearance leads him to think she was taken away."}, {"sense": "to cause you to think that something is probably true", "level": "C2", "dict_examp": "So you thought I was leaving, did you?  What led you to that conclusion?", "lear_examp": "These results lead us to the conclusion that only people with \"minds tough enough\" will survive."}, {"sense": "to be caused or influenced by something", "level": "C2", "dict_examp": "Her actions were led by greed.", "lear_examp": "The main reason that I believe so is that they do not seem to possess any tendency to fall in love blindly and let themselves be led by instinct."}, {"sense": "to cause something to happen or exist", "level": "B2", "dict_examp": "Reducing speed limits led to fewer fatal highway accidents.", "lear_examp": "People who work very hard are often tired, which could influence their relationship with others. It might lead to unnecessary arguments and spoil the pleasant atmosphere among them for some time."}, {"sense": "to happen before an event", "level": "C2", "dict_examp": "The pilot had no recollection of the events leading up to the crash.", "lear_examp": "We want to know what happened to those civilizations, what were their beliefs, ... what were their dreams and predictions for the future, what events and actions have led up to the present?"}]}, {"pos": "noun", "senses": [{"sense": "a winning position during a race or other situation where people are competing, or  a position ahead of other people", "level": "B2", "dict_examp": "For the first time in the race Harrison is in the lead.", "lear_examp": "In the last lap David took the lead with a professional overtake of Nilsons' Aston Martin."}, {"sense": "the main person in a film or play", "level": "C2", "dict_examp": "She plays the lead in both films.", "lear_examp": "A child who leaves school feeling that he has succeeded in leaving his mark by holding the school record for high jump or getting the lead in the school production is a happy, confident child who is able to face the next chapter in his life knowing he can and will do well."}]}, {"pos": "adjective", "senses": [{"sense": "The lead performer or lead part in a performance is the main performer or part.", "level": "B1", "dict_examp": "Who played the lead role?", "lear_examp": "It was Dave Grohl, the lead singer of Foo Fighters!"}]}]}, {"word": "lavish", "poses": [{"pos": "adjective", "senses": [{"sense": "showing that a lot of money has been spent", "level": "C2", "dict_examp": "a lavish meal/party", "lear_examp": "Wilbur arrived later, too late for the compulsory martini but still on time for the lavish meal of 7 courses."}]}]}, {"word": "lawyer", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to give advice to people about the law and speak for them in court", "level": "B1", "dict_examp": "I want to see my lawyer before I say anything.", "lear_examp": "After that she thanked me and she told me that she is a lawyer."}]}]}, {"word": "learn", "poses": [{"pos": "verb", "senses": [{"sense": "to get knowledge or skill in a new subject or activity", "level": "A1", "dict_examp": "They learn Russian at school.", "lear_examp": "Sometimes we start some game and after that we learn about some new things."}, {"sense": "to make yourself remember a piece of writing by reading it or repeating it many times", "level": "B1", "dict_examp": "I don't know how actors manage to learn all their lines.", "lear_examp": "He was a very famous and popular actor. He's very funny and he shows us very useful tricks to help us learn our roles."}, {"sense": "to be told facts or information that you did not know", "level": "B1", "dict_examp": "Parents learned of the schedule change in a letter from the teacher.", "lear_examp": "I was pleased to learn that you are coming to Switzerland."}, {"sense": "to start to understand that you must change the way you behave", "level": "B2", "dict_examp": "She'll have to learn that she can't have everything she wants.", "lear_examp": "In team sports you can share your feelings with the others and you learn to become extroverted."}, {"sense": "to learn something by experiencing a lot of problems or difficulty", "level": "C2", "dict_examp": "He doesn’t want to take my advice, so I guess he’ll have to learn the hard way.", "lear_examp": "If you don't know the past, you're liable to live through it again as instead of deriving the lessons from someone else's experiences, you'll have to learn them the hard way, by trial and error."}]}]}, {"word": "leather", "poses": [{"pos": "noun", "senses": [{"sense": "the skin of animals that is used to make things such as shoes and bags", "level": "A2", "dict_examp": "a leather jacket/belt/handbag", "lear_examp": "And I got teddy bears, a cool leather jacket, and a pretty bag."}]}]}, {"word": "least", "poses": [{"pos": "adverb", "senses": [{"sense": "as much as, or more than, a number, amount, distance, etc.", "level": "A2", "dict_examp": "It will cost at least $500.", "lear_examp": "I can write at least once a week."}, {"sense": "even if nothing else happens or is true", "level": "B1", "dict_examp": "Please make sure at least the kitchen is clean.", "lear_examp": "We could go shopping or at least go and have an ice-cream somewhere."}, {"sense": "something that you say when you are telling someone about an advantage in a bad situation", "level": "B1", "dict_examp": "It's a small house but at least there's a deck and a big yard.", "lear_examp": "It is not impressive but at least it has some things that I like."}, {"sense": "less than anything or anyone else", "level": "B1", "dict_examp": "I got the least expensive thing on the menu.", "lear_examp": "Every day was the same and I thought that nothing would change but I was wrong - something changed and that something happened on the day I least expected it to."}, {"sense": "used to reduce the effect of a statement", "level": "B2", "dict_examp": "I've met the President - at least, he shook my hand once.", "lear_examp": "But after years of developing my slalom, I wanted to learn something new, so, I started Hot-Dogging. Hot-Dog is great fun.  At least, people say so."}, {"sense": "something that you say to introduce the last person or thing on a list", "level": "B2", "dict_examp": "This is Jeremy, this is Cath and, last but not least, this is Eva.", "lear_examp": "And, last but not least, some complaints were made about the entertainment the café provides."}, {"sense": "especially", "level": "C2", "dict_examp": "The whole trip was fascinating, not least because of the people I met.", "lear_examp": "We are all human beings but we are all different, not least because of a different cultural background."}, {"sense": "not at all", "level": "C2", "dict_examp": "I don't mind staying at home, not in the least.", "lear_examp": "Educating two children was not so easy a task, not in the least!"}]}, {"pos": "pronoun", "senses": [{"sense": "less than anyone or anything else", "level": "B2", "dict_examp": "He contributed least to the workshop.", "lear_examp": "Taking you to the airport was the least I could do for such a good friend."}, {"sense": "not less than, and probably much more than", "level": "C1", "dict_examp": "At the very least, you should apologize.", "lear_examp": "Thus, I trust you will agree that at the very least I deserve a letter of explanation from you and a substantial refund of my money."}, {"sense": "used to emphasize that you could have said something in a much stronger way", "level": "C1", "dict_examp": "We were surprised, to say the least.", "lear_examp": "You get slightly bored, to say the least."}]}, {"pos": "determiner", "senses": [{"sense": "the smallest amount", "level": "B2", "dict_examp": "She earns the least money of all of us.", "lear_examp": "My favorite way to travel is by plane, because I think that the most important point when you are traveling is to arrive at  your destination in the least time."}]}]}, {"word": "learner", "poses": [{"pos": "noun", "senses": [{"sense": "someone who is getting knowledge or a new skill", "level": "B2", "dict_examp": "learners of English", "lear_examp": "She is very shy, so her Japanese didn't improve very rapidly, but she was a very industrious learner."}]}]}, {"word": "lean", "poses": [{"pos": "verb", "senses": [{"sense": "to move the top part of your body in a particular direction", "level": "B2", "dict_examp": "She leaned forward and whispered in my ear.", "lear_examp": "As I was leaning on the glass of the window, it splintered into pieces."}, {"sense": "to rest against something for support, or to move something into this position", "level": "B2", "dict_examp": "She leaned her bike against the wall.", "lear_examp": "She turned around and saw this boy leaning against the wall."}, {"sense": "to be in a position that is not straight or vertical", "level": "C2", "dict_examp": "That fence is leaning to the right.", "lear_examp": "The water they had on the ship poured out as the ship leaned on one side."}, {"sense": "to depend on someone or something", "level": "C2", "dict_examp": "They had leaned on the dictionary as the authority that answered all their questions.", "lear_examp": "I would like to be the person my child can always lean on: I'd like to be able to express my feelings and make him express his."}, {"sense": "to try to convince or force someone do what you want", "level": "C2", "dict_examp": "The other members will probably lean on her to get her to stay.", "lear_examp": "Piggy is the most intelligent boy of the group, but he doesn't have the strength to apply his ideas to the situation they are living in, that is why he leans on Ralph (the perfect leader-type, as he sees him)."}]}]}, {"word": "leave", "poses": [{"pos": "verb", "senses": [{"sense": "to go away from a place or a situation, either permanently or for a temporary period", "level": "A1", "dict_examp": "The bus leaves in five minutes.", "lear_examp": "I leave home at 7:30."}, {"sense": "to put something in a place and forget to take it with you when you go", "level": "A2", "dict_examp": "Hey, you've left your keys on the table.", "lear_examp": "I think I have left my umbrella in the bathroom."}, {"sense": "to put something in a place where it will stay", "level": "A2", "dict_examp": "You can leave your bags by the desk.", "lear_examp": "Can you take my sunglasses and leave them in my house today?"}, {"sense": "to put something somewhere for another person to have later", "level": "A2", "dict_examp": "I left some sandwiches for them to have later.", "lear_examp": "I will leave a short message for you."}, {"sense": "to not use all of something", "level": "A2", "dict_examp": "They ate all the cake but left some cookies.", "lear_examp": "Could you please help me to find out if there are any places left and please let me know, when the course starts and when the course will finish."}, {"sense": "to end a relationship with a husband, wife, or partner", "level": "B1", "dict_examp": "He said he'd never leave.", "lear_examp": "Jose, who is a bus driver, was very unhappy, because his girlfriend had left him."}, {"sense": "to cause something to stay in a particular condition", "level": "B2", "dict_examp": "Leave that chair where it is.", "lear_examp": "And I heard my husband shouting: \"Mag, do you always have to leave all the lights on?\""}, {"sense": "to stop speaking to or annoying someone", "level": "B2", "dict_examp": "Leave me alone! I'm trying to work.", "lear_examp": "I asked him to leave me alone and unplugged the phone."}, {"sense": "If you leave something or someone doing something, you allow them to continue doing it, or they continue doing it when you go away.", "level": "C1", "dict_examp": "I left the children watching television.", "lear_examp": "She also has the tendency to leave the children doing what they want, sometimes without realising the consequences."}, {"sense": "to produce a particular, often bad, situation", "level": "C2", "dict_examp": "Far from improving things, the new law has left many people worse off  than before.", "lear_examp": "He was born on a ranch in Jalisco, the fourth of eight children, and when the youngest was only six months old, my grandfather died, leaving the family penniless."}, {"sense": "to do something later that you could do immediately", "level": "C2", "dict_examp": "Don't leave your packing till the night before you go.", "lear_examp": "I left it until the following day since I was too worn out to go on."}, {"sense": "to arrange for someone to receive something after you die", "level": "C2", "dict_examp": "He left his nieces all his money./He left all his money to his nieces.", "lear_examp": "\"I hate him\", Jane thought, \"and I wonder why on earth Uncle John left him all his money and the most beautiful estate in our country with this old manor house, in which all my ancestors were born.\""}, {"sense": "to leave someone to do what they want to do", "level": "C2", "dict_examp": "With both parents out at work, the kids were often left to their own devices.", "lear_examp": "The moment teenagers leave school, they are left to their own devices."}, {"sense": "to do everything that you can in order to achieve something or to find someone or something", "level": "C2", "dict_examp": "Both sides have vowed to leave no stone unturned in the search for peace.", "lear_examp": "She has left no stone unturned so as to reach her goal, always asserting her assets and views with conviction."}, {"sense": "to leave a place without taking someone or something with you", "level": "B1", "dict_examp": "We were in a hurry and I think I must have left my keys behind.", "lear_examp": "I know you must be disappointed at having to move, leaving all your friends behind, but it's OK, I'm sure you'll make new ones."}, {"sense": "to not include someone or something", "level": "B2", "dict_examp": "You can leave the butter out of this recipe if you're on a low-fat diet.", "lear_examp": "She felt so left out."}]}, {"pos": "noun", "senses": [{"sense": "time allowed away from work for illness or another special purpose", "level": "C2", "dict_examp": "maternity/sick leave", "lear_examp": "A week before Christmas, when I still hadn't heard from your shop, I phoned again, and was told that Mrs Smith was on leave, but could I repeat my problem, which I did."}]}]}, {"word": "learning", "poses": [{"pos": "noun", "senses": [{"sense": "the process of getting knowledge or a new skill", "level": "B2", "dict_examp": "language learning", "lear_examp": "These events are not only to entertain students, they are also a part of the learning process, as by communicating with each other, students learn the language."}]}]}, {"word": "leap", "poses": [{"pos": "verb", "senses": [{"sense": "to suddenly move somewhere", "level": "C2", "dict_examp": "Flames were leaping into the sky.", "lear_examp": "At the split second the man rings the bell, there are over a 100 people suddenly leaping up from behind the desk."}, {"sense": "to accept the chance to have or do something with enthusiasm", "level": "C2", "dict_examp": "I'd leap at the opportunity to work in Japan.", "lear_examp": "I was offered a job abroad, a highly paid one, and I decided to leap at the chance and avail myself of this God-sent opportunity!\""}]}, {"pos": "noun", "senses": [{"sense": "a sudden improvement or increase", "level": "C2", "dict_examp": "There was a big leap in profits last year.", "lear_examp": "Ultimately, we could be taking a \"giant leap\" towards technological excellence."}, {"sense": "If progress or growth happens in leaps and bounds, it happens very quickly.", "level": "C2", "dict_examp": "The company is growing by leaps and bounds this year.", "lear_examp": "To begin with, it is undeniable that technology, which is developing in leaps and bounds, has contributed to the wide range of goods that we enjoy nowadays."}]}]}, {"word": "lecture", "poses": [{"pos": "noun", "senses": [{"sense": "a formal talk on a serious or specialist subject given to a group of people, especially students", "level": "B1", "dict_examp": "We went to a lecture on Italian art.", "lear_examp": "It was a very interesting lecture."}]}, {"pos": "verb", "senses": [{"sense": "to give a formal talk to a group of people, especially students", "level": "C2", "dict_examp": "She’s lecturing on the geology of the region.", "lear_examp": "After having lectured for almost 10 years, he decided to resign and start writing full-time."}]}]}, {"word": "leak", "poses": [{"pos": "verb", "senses": [{"sense": "If a liquid or gas leaks, it comes out of a hole or space by accident, and if a container leaks, it allows liquid or gas to come out when it should not.", "level": "B2", "dict_examp": "Water was leaking from the pipe.", "lear_examp": "There is always a possibility that this tent is leaking."}, {"sense": "If someone leaks secret information, they intentionally tell people about it.", "level": "C2", "dict_examp": "Details of the report had been leaked to the press.", "lear_examp": "\"If these facts were leaked to the press, my career would be done for,\" he said."}]}, {"pos": "noun", "senses": [{"sense": "a hole in something that a liquid or gas comes out of, or the liquid or gas that comes out", "level": "B2", "dict_examp": "There's water on the floor - we must have a leak.", "lear_examp": "The theater restaurant was closed because there was a serious leak in a pipe and the kitchen was flooded."}, {"sense": "secret information that has intentionally been told to someone", "level": "C2", "dict_examp": "The Justice Department was investigating security leaks.", "lear_examp": ""}]}]}, {"word": "lend", "poses": [{"pos": "verb", "senses": [{"sense": "to give something to someone for a short period of time, expecting it to be given back", "level": "A2", "dict_examp": "She doesn't like lending her books.", "lear_examp": "We can meet at 6:00pm. I can ask my father to lend us the car."}, {"sense": "If a bank lends money, it gives money to someone who then pays the money back in small amounts over a period of time.", "level": "B2", "dict_examp": "Does the bank lend to small businesses?", "lear_examp": ""}, {"sense": "to be suitable for a particular purpose", "level": "C2", "dict_examp": "The novel's complex, imaginative style does not lend itself to translation.", "lear_examp": "Last but not least, the fact that he managed to reconquer the realm of rock music for the German tongue lends itself to being displayed, together with similar efforts by bands like Aurhefu, who achieved a similar \"resurrection\" for the Welsh language."}]}]}, {"word": "leisure", "poses": [{"pos": "noun", "senses": [{"sense": "the time when you are not working", "level": "B1", "dict_examp": "leisure activities", "lear_examp": "I don't have much leisure time."}]}]}, {"word": "let", "poses": [{"pos": "verb", "senses": [{"sense": "something that you say when you are making a suggestion", "level": "A2", "dict_examp": "After the film, let's go out to dinner.", "lear_examp": "Let's go shopping."}, {"sense": "to tell someone something", "level": "A2", "dict_examp": "Let me know if you can come on Friday.", "lear_examp": "Please let me know as soon as possible."}, {"sense": "to allow someone to do something, or to allow something to happen", "level": "B1", "dict_examp": "She wanted to go but her parents wouldn't let her.", "lear_examp": "I hope my parents let me go with you to New York."}, {"sense": "to allow someone or something to move to a particular place", "level": "B2", "dict_examp": "They won't let us past the gate.", "lear_examp": "But the security service at the tower refused at first to let us in."}, {"sense": "something that you say when you are offering to help someone", "level": "B2", "dict_examp": "Let me carry your suitcase.", "lear_examp": ""}, {"sense": "used to emphasize that something is more impossible than another thing", "level": "C1", "dict_examp": "You couldn't trust her to look after your dog, let alone your child.", "lear_examp": "We are surrounded by amazing pieces of technology which we do not fully understand, let alone use to their full capacity."}, {"sense": "to be relaxed and enjoy yourself", "level": "C2", "dict_examp": "Just let go and have a little fun!", "lear_examp": "When I finish my homework I listen to music, which can help me relax and let go."}, {"sense": "to stop holding someone or something", "level": "C2", "dict_examp": "Hold onto the rope and don't let go!", "lear_examp": "She let go of the mattress and sat on her bed pondering with her face resting on her hands."}, {"sense": "to stop thinking about, wanting, or being angry about something", "level": "C2", "dict_examp": "I have tried to let go of the past.", "lear_examp": "It was obvious to me that he had had a hard time letting go of the past."}, {"sense": "ssomething that you say before you say something that is unpleasant but true", "level": "C2", "dict_examp": "Let's face it, we're not getting any younger.", "lear_examp": "Let's face it, we live in an era dominated by machines."}, {"sense": "to relax when you should be careful or ready to deal with something", "level": "C2", "dict_examp": "He's worried that if he lets his guard down someone may take advantage of him.", "lear_examp": "That of course will go against anything Stevens has ever done and he never lets his guard down."}, {"sense": "to be very relaxed  and enjoy yourself a lot", "level": "C2", "dict_examp": "I'd love to see Clare let her hair down for once.", "lear_examp": "Thrace hosts every year, festivals and carnivals where all the family can let their hair down and have fun."}, {"sense": "to get rid of your anger, excitement, etc. by being noisy or using a lot of energy", "level": "C2", "dict_examp": "The children need to run around and let off steam.", "lear_examp": "I believe that listening to it on a daily basis will be an ideal way for us to relieve the day's pressure and let off steam."}, {"sense": "to disappoint someone by failing to do what you agreed to do", "level": "B2", "dict_examp": "I promised to go to a movie with Beth and I don't want to let her down.", "lear_examp": "I promise you that I am not going to let you down."}, {"sense": "to not punish someone who has done something wrong, or to not punish them severely", "level": "B2", "dict_examp": "Instead of a prison sentence they were let off with a fine.", "lear_examp": "Although the headmaster let me off with a warning when I explained the matter to him, I was very depressed because I was exhausted."}, {"sense": "to allow a person or animal to leave a place, especially by opening a locked or closed door", "level": "B2", "dict_examp": "I heard a voice from the closet shouting \"Let me out!\"", "lear_examp": "Then, hopefully, the animals can be let out into their natural environment again."}]}]}, {"word": "less", "poses": [{"pos": "adverb", "senses": [{"sense": "not as much", "level": "A2", "dict_examp": "Exercise more and eat less.", "lear_examp": "I prefer summer clothes because they're less heavy than the winter ones."}, {"sense": "almost or approximately", "level": "B2", "dict_examp": "They have more or less completed the work on the house.", "lear_examp": "I will now give you some information, so that you know more or less what you can expect."}]}, {"pos": "determiner", "senses": [{"sense": "not as much", "level": "A2", "dict_examp": "We’ve got to spend less money.", "lear_examp": "I want to pay less money on my bills."}]}, {"pos": "pronoun", "senses": [{"sense": "not as much", "level": "A2", "dict_examp": "I earn less than my brother.", "lear_examp": "My books cost less than the regular price."}]}]}, {"word": "lessen", "poses": [{"pos": "verb", "senses": [{"sense": "to become less or to make something less", "level": "C1", "dict_examp": "Exercise and a healthy diet lessen the chance of heart disease.", "lear_examp": "Should you give back the students' money and take into consideration our complaints, I am sure that you will lessen our disappointment."}]}]}, {"word": "lengthy", "poses": [{"pos": "adjective", "senses": [{"sense": "continuing for a long time", "level": "C1", "dict_examp": "a lengthy discussion/process", "lear_examp": "Also, soap operas are lengthy, some famous ones has even been showing for several years, which makes it possible to focus on different aspects of life and different stages in the characters' lives."}]}]}, {"word": "leopard", "poses": [{"pos": "noun", "senses": [{"sense": "a large wild cat that has yellow fur with black spots on it and lives in Africa and southern Asia", "level": "B2", "dict_examp": "We saw leopards in their natural habitat.", "lear_examp": "We saw different kinds of animals like a leopard, a buffalo and so on."}]}]}, {"word": "legislation", "poses": [{"pos": "noun", "senses": [{"sense": "a law or a set of laws", "level": "C2", "dict_examp": "The government has promised to introduce legislation to limit fuel emissions from cars.", "lear_examp": "And while governments have taken measures to reduce emission of fuels into the atmosphere and prevent toxic waste from being discharged into the oceans, the existing legislation is not rigorously enforced."}]}]}, {"word": "leek", "poses": [{"pos": "noun", "senses": [{"sense": "a long white and green vegetable that smells and tastes similar to an onion", "level": "B2", "dict_examp": "potato and leek soup", "lear_examp": "I had some roasted chicken pieces with some leek and broccoli and roasted potatoes and Jan had his favorite spaghetti with cream sauce."}]}]}, {"word": "leg", "poses": [{"pos": "noun", "senses": [{"sense": "one of the parts of the body of a human or animal that is used for standing and walking", "level": "A1", "dict_examp": "My legs were tired after so much walking.", "lear_examp": "He has broken his leg and I must look after him."}]}]}, {"word": "lenient", "poses": [{"pos": "adjective", "senses": [{"sense": "A lenient punishment is not severe.", "level": "C2", "dict_examp": "He asked the judge to pass a lenient sentence.", "lear_examp": "The Court had been too lenient towards his detested father."}]}]}, {"word": "left-hand", "poses": [{"pos": "adjective", "senses": [{"sense": "on or to the left of something", "level": "A2", "dict_examp": "There's a sign on the left-hand side.", "lear_examp": "When the bus arrives at City Hall, you can jump out, and my house is on the left-hand side by City Hall."}]}]}, {"word": "legacy", "poses": [{"pos": "noun", "senses": [{"sense": "a situation that was caused by something from an earlier time", "level": "C2", "dict_examp": "The war has left a legacy of hatred.", "lear_examp": "Many of his novels deal with the social and political problems facing his country, including the difficulty of the post-colonial legacy."}, {"sense": "money or property that you receive from someone after they die", "level": "C2", "dict_examp": "An elderly cousin had left her a small legacy.", "lear_examp": "Falcon Crest was the name of an estate set in the prosperous vineyards of the California Valley, and the plot dealt with the intrigues woven by a widow, Angela Chaming, to solidify her control over the region, and to leave her beloved grandson a powerful solid legacy."}]}]}, {"word": "length", "poses": [{"pos": "noun", "senses": [{"sense": "the measurement or distance of something from one end to the other", "level": "B1", "dict_examp": "The boat is 20 feet in length.", "lear_examp": "The new one has a length of 2.10 metres."}, {"sense": "the amount of time something takes", "level": "B2", "dict_examp": "the length of a film/speech/play", "lear_examp": "We will need you to start the talk at 7:00 p.m. with a length of one hour."}, {"sense": "the amount of writing in a book or document", "level": "C1", "dict_examp": "He's written books of various lengths on the subject.", "lear_examp": ""}, {"sense": "in every part of a place", "level": "C2", "dict_examp": "They traveled the length and breadth of the country together.", "lear_examp": "It is the reason that we can easily see the foreigners wandering the length and breadth of the museum being unaware of the origin of items they look at."}, {"sense": "If you talk about something at length, you talk for a long time.", "level": "C2", "dict_examp": "We discussed both topics at length.", "lear_examp": "Since we have already arranged for your family to come to stay in my home and discussed the arrangements at length and in detail, I will no longer bother you with terms of payment and other information that, judging by your letter, seems to be quite irrelevant."}, {"sense": "to not allow someone to become too friendly with you", "level": "C2", "dict_examp": "I always had the feeling she was keeping me at arm's length.", "lear_examp": "At first she keeps them at arm's length, but Mr. Emerson is direct and advises Lucy to behave in a more natural way instead of doing what some old ladies say."}]}]}, {"word": "legal", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the law", "level": "B2", "dict_examp": "the legal profession", "lear_examp": "I'm sure you will accept my request; if not I intend to take legal action against your company."}, {"sense": "allowed by the law", "level": "B2", "dict_examp": "Is it legal to cross the border and buy prescription drugs in another country?", "lear_examp": "Can anybody say how any enterprise should or must work? Is it legal?"}]}]}, {"word": "legend", "poses": [{"pos": "noun", "senses": [{"sense": "an old story or set of stories from ancient times", "level": "B2", "dict_examp": "The dance was based on several Hindu legends.", "lear_examp": "You know I'm fond of medieval tales and legends, so while we're in Scotland, let's visit a haunted castle!"}, {"sense": "a famous person", "level": "C1", "dict_examp": "a living legend", "lear_examp": "They didn't even knew it of course that they would become legends for the generations to come and this fact makes this hypothetical travel such a fascinating experience only on the thought of it!"}]}]}, {"word": "legally", "poses": [{"pos": "adverb", "senses": [{"sense": "as stated or allowed by the law", "level": "B2", "dict_examp": "The contract is legally binding.", "lear_examp": "He already had a driving license, so by that time he could legally drive his own Ferrari."}]}]}, {"word": "left", "poses": [{"pos": "adjective", "senses": [{"sense": "on or toward the side of your body that is to the west when you are facing north", "level": "A2", "dict_examp": "He injured his left eye.", "lear_examp": "Tomorrow I must to go to the doctor because of my left leg, I can't walk any more."}]}, {"pos": "adverb", "senses": [{"sense": "to the side of your body that is west when you are facing north", "level": "A2", "dict_examp": "Turn left at the light.", "lear_examp": "When you go out of Kilburn station, you turn left and you go straight."}]}, {"pos": "noun", "senses": [{"sense": "the left side of your body, or the direction toward this side", "level": "A2", "dict_examp": "First I'll introduce the speaker sitting on my left.", "lear_examp": "It's on the left."}, {"sense": "political groups that support economic equality and believe government should provide social services", "level": "C2", "dict_examp": "The proposals were sharply criticized by the left.", "lear_examp": ""}]}]}, {"word": "left-wing", "poses": [{"pos": "adjective", "senses": [{"sense": "supporting economic equality and government-funded social services", "level": "C1", "dict_examp": "He is interested in left-wing politics.", "lear_examp": "Women's politics are usually followed by the left-wing parties in Austria."}]}]}, {"word": "lemonade", "poses": [{"pos": "noun", "senses": [{"sense": "a cold drink made with the juice of lemons, water, and sugar", "level": "A2", "dict_examp": "There's both lemonade and iced tea in the fridge.", "lear_examp": "You can even just relax and sunbathe while you drink a nice, cold lemonade."}]}]}, {"word": "lemon", "poses": [{"pos": "noun", "senses": [{"sense": "an oval, yellow fruit that has sour juice", "level": "A2", "dict_examp": "lemon juice", "lear_examp": "We drink juice and tea with lemon."}]}]}, {"word": "lesson", "poses": [{"pos": "noun", "senses": [{"sense": "a period of time when a teacher teaches people", "level": "A1", "dict_examp": "How can we make science lessons more interesting?", "lear_examp": "One lesson takes 45 minutes."}, {"sense": "an experience that teaches you how to behave better in a similar situation in the future", "level": "B2", "dict_examp": "There is a lesson in this tragic accident.", "lear_examp": "I think he learned a valuable lesson."}, {"sense": "to decide not to do something again because it has caused you problems in the past", "level": "B2", "dict_examp": "I'm not going out without my umbrella again - I've learned my lesson!", "lear_examp": "Actually, I am happy to hear that journalists have learned their lesson from the death of Princess Diana and try to let her children and the Royal family have more privacy."}, {"sense": "to punish someone so that they will not behave badly again", "level": "C2", "dict_examp": "The next time she's late, go without her. That should teach her a lesson.", "lear_examp": "He didn't want to hurt Diane just teach her a lesson."}]}]}, {"word": "lengthen", "poses": [{"pos": "verb", "senses": [{"sense": "to become longer or to make something longer", "level": "C1", "dict_examp": "There are plans to lengthen the school day.", "lear_examp": "Furthermore, I suggest ... that you lengthen the stay in Cambridge which was definitely too short."}]}]}, {"word": "legitimate", "poses": [{"pos": "adjective", "senses": [{"sense": "reasonable and acceptable", "level": "C2", "dict_examp": "He claimed that the restaurant bill was a legitimate business expense.", "lear_examp": "Not even when he mentioned acts of violence as a legitimate way of achieving one's goals did she react."}, {"sense": "allowed by law", "level": "C2", "dict_examp": "The army must give power back to the legitimate government.", "lear_examp": "After all, Ralph has the conch, which symbolizes legitimate power, and has been democratically elected."}]}]}, {"word": "legendary", "poses": [{"pos": "adjective", "senses": [{"sense": "famous for being excellent", "level": "C1", "dict_examp": "the legendary guitarist Jimi Hendrix", "lear_examp": "If I went back to the beginning of the 70s, then I would probably have had a chance to work with Bill Gates and his legendary crew."}, {"sense": "from an ancient legend", "level": "C1", "dict_examp": "a legendary Greek hero", "lear_examp": "The last article concerned Hercules, the legendary hero."}]}]}, {"word": "lie", "poses": [{"pos": "verb", "senses": [{"sense": "to say or write something which is not true in order to deceive someone", "level": "B1", "dict_examp": "Are you lying to me?", "lear_examp": "She lied to me and said she could not come with me because she had work."}]}, {"pos": "noun", "senses": [{"sense": "something that you say which you know is not true", "level": "B1", "dict_examp": "I told a lie when I said I liked her haircut.", "lear_examp": "The e-mail was full of lies about things that I had never done."}]}]}, {"word": "lid", "poses": [{"pos": "noun", "senses": [{"sense": "a cover on a container, which can be lifted up or removed", "level": "B2", "dict_examp": "Can you get the lid off this jar?", "lear_examp": ""}]}]}, {"word": "liberal", "poses": [{"pos": "adjective", "senses": [{"sense": "accepting beliefs and behavior that are new or different from your own", "level": "C1", "dict_examp": "a liberal society/attitude", "lear_examp": "In a liberal society everything depends on a mixture of wise legislation and responsible individual behavior."}, {"sense": "Liberal political ideas emphasize the need to make new laws as society changes and the need for government to provide social services.", "level": "C1", "dict_examp": "a liberal policy/position", "lear_examp": "He studied law in Paris and got involved in politics as a member of the liberal party during the first years of the last century."}]}]}, {"word": "liability", "poses": [{"pos": "noun", "senses": [{"sense": "when you are legally responsible for something", "level": "C1", "dict_examp": "They have admitted liability for the damage caused.", "lear_examp": "As soon as I had noticed it, I went to complain to the driver and he just disclaimed liability."}, {"sense": "someone or something that is likely to cause you a lot of trouble", "level": "C1", "dict_examp": "Wherever we go she upsets someone - she's a real liability.", "lear_examp": "It destroys the individual, brings shame to his family, and he becomes a liability instead of an asset to his society."}]}]}, {"word": "level", "poses": [{"pos": "noun", "senses": [{"sense": "someone's ability compared to other people", "level": "A2", "dict_examp": "a course for beginner/intermediate/advanced level students", "lear_examp": "The level is elementary."}, {"sense": "the amount or number of something", "level": "B2", "dict_examp": "He achieved a high level of skill as an interpreter.", "lear_examp": "Your body requires a high level of nutrients to keep body functions working smoothly."}, {"sense": "the height of something", "level": "B2", "dict_examp": "The water level in the lake is much higher after a heavy rain.", "lear_examp": "Also, due to global warming, sea levels might rise and the risk of flooding will also rise."}, {"sense": "a position within a system in which people are arranged according to their importance", "level": "C1", "dict_examp": "These are subjects for discussion at management level.", "lear_examp": "But there is one big problem if the women can reach the upper management level: those women won't have any children."}]}, {"pos": "adjective", "senses": [{"sense": "flat or horizontal", "level": "B2", "dict_examp": "The floor isn't level.", "lear_examp": ""}]}]}, {"word": "letter", "poses": [{"pos": "noun", "senses": [{"sense": "a written message that you send to someone, usually in the mail", "level": "A1", "dict_examp": "I got a letter from Francine this morning.", "lear_examp": "I got your letter yesterday."}, {"sense": "a symbol that is used in written language and that represents a sound in that language", "level": "A2", "dict_examp": "the letter D", "lear_examp": "I bought a pair of yellow and blue jeans. . . . And also a green T-shirt with letters on it."}]}]}, {"word": "liberty", "poses": [{"pos": "noun", "senses": [{"sense": "the freedom to live as you wish or go where you want", "level": "B2", "dict_examp": "individual liberties", "lear_examp": "Personally, I think a zoo is a cruel way to imprison them after such a long period of time when they have been useful to Man, who is now depriving them of their liberty, preventing them from hunting and forcing them to eat what they are given."}, {"sense": "to do something that will have an effect on someone else, without asking their permission", "level": "C1", "dict_examp": "I took the liberty of booking theater seats for us.", "lear_examp": "I have taken the liberty of listing some of my ideas and suggestions and hope they will be of interest to you."}, {"sense": "to be allowed to do something", "level": "C2", "dict_examp": "I'm not at liberty to discuss the matter at present.", "lear_examp": "On the one hand the child is at liberty to do whatever it pleases to do but on the other hand it was never taught the responsibilities implicitly tied to such actions."}]}]}, {"word": "lettuce", "poses": [{"pos": "noun", "senses": [{"sense": "a plant with large green leaves, eaten raw in salads", "level": "B1", "dict_examp": "Do you want lettuce and tomato on your sandwich?", "lear_examp": "It contains two burgers, cheese, lettuce, tomato and anything else that you want to put in it."}]}]}, {"word": "liberation", "poses": [{"pos": "noun", "senses": [{"sense": "when something or someone is released or made free", "level": "C1", "dict_examp": "the liberation of France from Nazi occupation", "lear_examp": "Moreover, with the liberation of Greece, he was appointed as the First Governor of the new state."}]}]}, {"word": "liar", "poses": [{"pos": "noun", "senses": [{"sense": "someone who tells lies", "level": "B2", "dict_examp": "He's such a liar - you can't trust a word he says.", "lear_examp": "The plan works: the jury thinks that the wife is a notorious liar and her husband is found innocent."}]}]}, {"word": "lethal", "poses": [{"pos": "adjective", "senses": [{"sense": "able to cause death", "level": "C2", "dict_examp": "a lethal injection/weapon", "lear_examp": "If we learn from the mistakes and there are no more wars, governments will donate money to social needs rather than assigning enormous sums on maintaining huge armies and inventing new types of lethal weapons."}]}]}, {"word": "let", "poses": [{"pos": "verb", "senses": [{"sense": "something that you say when you are making a suggestion", "level": "A2", "dict_examp": "After the film, let's go out to dinner.", "lear_examp": "Let's go shopping."}, {"sense": "to tell someone something", "level": "A2", "dict_examp": "Let me know if you can come on Friday.", "lear_examp": "Please let me know as soon as possible."}, {"sense": "to allow someone to do something, or to allow something to happen", "level": "B1", "dict_examp": "She wanted to go but her parents wouldn't let her.", "lear_examp": "I hope my parents let me go with you to New York."}, {"sense": "to allow someone or something to move to a particular place", "level": "B2", "dict_examp": "They won't let us past the gate.", "lear_examp": "But the security service at the tower refused at first to let us in."}, {"sense": "something that you say when you are offering to help someone", "level": "B2", "dict_examp": "Let me carry your suitcase.", "lear_examp": ""}, {"sense": "used to emphasize that something is more impossible than another thing", "level": "C1", "dict_examp": "You couldn't trust her to look after your dog, let alone your child.", "lear_examp": "We are surrounded by amazing pieces of technology which we do not fully understand, let alone use to their full capacity."}, {"sense": "to be relaxed and enjoy yourself", "level": "C2", "dict_examp": "Just let go and have a little fun!", "lear_examp": "When I finish my homework I listen to music, which can help me relax and let go."}, {"sense": "to stop holding someone or something", "level": "C2", "dict_examp": "Hold onto the rope and don't let go!", "lear_examp": "She let go of the mattress and sat on her bed pondering with her face resting on her hands."}, {"sense": "to stop thinking about, wanting, or being angry about something", "level": "C2", "dict_examp": "I have tried to let go of the past.", "lear_examp": "It was obvious to me that he had had a hard time letting go of the past."}, {"sense": "ssomething that you say before you say something that is unpleasant but true", "level": "C2", "dict_examp": "Let's face it, we're not getting any younger.", "lear_examp": "Let's face it, we live in an era dominated by machines."}, {"sense": "to relax when you should be careful or ready to deal with something", "level": "C2", "dict_examp": "He's worried that if he lets his guard down someone may take advantage of him.", "lear_examp": "That of course will go against anything Stevens has ever done and he never lets his guard down."}, {"sense": "to be very relaxed  and enjoy yourself a lot", "level": "C2", "dict_examp": "I'd love to see Clare let her hair down for once.", "lear_examp": "Thrace hosts every year, festivals and carnivals where all the family can let their hair down and have fun."}, {"sense": "to get rid of your anger, excitement, etc. by being noisy or using a lot of energy", "level": "C2", "dict_examp": "The children need to run around and let off steam.", "lear_examp": "I believe that listening to it on a daily basis will be an ideal way for us to relieve the day's pressure and let off steam."}, {"sense": "to disappoint someone by failing to do what you agreed to do", "level": "B2", "dict_examp": "I promised to go to a movie with Beth and I don't want to let her down.", "lear_examp": "I promise you that I am not going to let you down."}, {"sense": "to not punish someone who has done something wrong, or to not punish them severely", "level": "B2", "dict_examp": "Instead of a prison sentence they were let off with a fine.", "lear_examp": "Although the headmaster let me off with a warning when I explained the matter to him, I was very depressed because I was exhausted."}, {"sense": "to allow a person or animal to leave a place, especially by opening a locked or closed door", "level": "B2", "dict_examp": "I heard a voice from the closet shouting \"Let me out!\"", "lear_examp": "Then, hopefully, the animals can be let out into their natural environment again."}]}]}, {"word": "library", "poses": [{"pos": "noun", "senses": [{"sense": "a room or building that contains a collection of books and other written material that you can read or borrow", "level": "A2", "dict_examp": "a public/school library", "lear_examp": "It's important because I want some books from the library, and without a library card I can't take any out."}]}]}, {"word": "license", "poses": [{"pos": "noun", "senses": [{"sense": "an official document that allows you to do or have something", "level": "A2", "dict_examp": "a fishing/driver's license", "lear_examp": "I would like to sell my bicycle. I have used it for two years.  I don't need it, because I've got a driver’s license."}]}]}, {"word": "liable", "poses": [{"pos": "adjective", "senses": [{"sense": "legally responsible", "level": "C1", "dict_examp": "Corporate officials are liable for the safety of their employees.", "lear_examp": "As per our terms and conditions you are liable to pay for any damages occurred during the move and that is why we paid more money or premium to your Company than the others."}, {"sense": "to be likely to do something", "level": "C2", "dict_examp": "He's liable to make a fuss if you wake him.", "lear_examp": "I have taught them what is right and what is wrong, but also that a person is liable to make mistakes."}]}]}, {"word": "lie", "poses": [{"pos": "verb", "senses": [{"sense": "to be in or move your body into a horizontal position", "level": "A2", "dict_examp": "to lie in bed", "lear_examp": "I think Marmaris is the best place for you because you always want to lie on a beach."}, {"sense": "to be on a particular surface", "level": "B1", "dict_examp": "A pen lay on the desk.", "lear_examp": "I hurried into the airport to find my suitcase lying in one corner."}, {"sense": "to be in a particular place or position", "level": "B1", "dict_examp": "The river lies 40 miles to the south.", "lear_examp": "It lies in the south of the Czech Republic and it's a lovely place where you can spend your holiday."}, {"sense": "If responsibility, blame, a decision, a choice, etc., lies with someone, they have responsibility, must make the decision, etc.", "level": "C2", "dict_examp": "Responsibility for the disaster must ultimately lie with the government.", "lear_examp": "The greater responsibility lies with us to keep our villages and cities clean and, therefore, healthy."}, {"sense": "If an event or situation that will cause problems lies ahead, it will happen in the future.", "level": "C1", "dict_examp": "He's under no illusions about the difficulties that lie ahead for the industry.", "lear_examp": "They help prepare our children for what lies ahead of them."}, {"sense": "to move into a position in which your body is flat, usually in order to sleep or rest", "level": "A2", "dict_examp": "I'm going to lie down and take a short nap.", "lear_examp": "Sometimes I want to relax and lie down on the bed to watch TV."}]}]}, {"word": "life", "poses": [{"pos": "noun", "senses": [{"sense": "the time between a person's birth and their death", "level": "A1", "dict_examp": "Life's too short to worry about money!", "lear_examp": "Aleksandra likes to do almost everything because she likes life!"}, {"sense": "everything which is alive", "level": "B1", "dict_examp": "animal/marine/plant life", "lear_examp": "I chose to visit the London Aquarium because I had never gone to an aquarium to see sea life before."}, {"sense": "a way of living", "level": "B1", "dict_examp": "You lead an exciting life.", "lear_examp": ""}, {"sense": "one part of someone's existence", "level": "B1", "dict_examp": "I never talk about my private life.", "lear_examp": "The film is about family life."}, {"sense": "the manner in which a person lives", "level": "B1", "dict_examp": "She told us all about her way of life in Japan.", "lear_examp": "He told me about his hobbies, his way of life and especially about his love of learning languages."}, {"sense": "the existence of a person", "level": "B2", "dict_examp": "Many lives are lost to TB.", "lear_examp": "Finally if you witness an accident you should inform the police quickly, which can save lives."}, {"sense": "energy or enthusiasm", "level": "B2", "dict_examp": "She's so full of life.", "lear_examp": "Above all, I like children very much because they're full of life and always make a great impression on me when I have a chat with them."}, {"sense": "for the whole of someone's life", "level": "C1", "dict_examp": "I will have to take this medicine for life.", "lear_examp": "A wedding opens a new life when the two parties commit to each other for life."}, {"sense": "the amount of time that a machine, system, etc., exists or can be used", "level": "C2", "dict_examp": "The newer batteries have a much longer life.", "lear_examp": ""}, {"sense": "a serious situation where people could die", "level": "C2", "dict_examp": "Getting water to these people is a matter of life and death.", "lear_examp": "I told him it was a matter of life and death."}]}]}, {"word": "lick", "poses": [{"pos": "verb", "senses": [{"sense": "to move your tongue across the surface of something", "level": "B2", "dict_examp": "He licked the chocolate off his fingers.", "lear_examp": "As soon as I come home, she jumps on me and licks my face. ... Princess is my ideal dog."}]}]}, {"word": "lifelong", "poses": [{"pos": "adjective", "senses": [{"sense": "for all of your life", "level": "C2", "dict_examp": "a lifelong friend/ambition/interest", "lear_examp": "Education is a lifelong process and you never stop learning."}]}]}, {"word": "lifetime", "poses": [{"pos": "noun", "senses": [{"sense": "the period of time that someone is alive", "level": "B2", "dict_examp": "I expect to see a lot more technological change during/in my lifetime.", "lear_examp": "I'm sure you would love it, meeting so many famous musicians, who you might meet only once in a lifetime."}]}]}, {"word": "light", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment which produces light, such as a lamp or a light bulb", "level": "A2", "dict_examp": "Could you turn the light on/off, please?", "lear_examp": "Dear Nick I'm writing about the concert at school. ... I can help you on Saturday morning to set up the lights and equipment."}, {"sense": "the brightness that comes from the sun, fire, etc. and from electrical devices, and that allows things to be seen", "level": "B1", "dict_examp": "bright light", "lear_examp": "I have to buy a lamp for my desk because I don't have much light."}, {"sense": "If something is done or happens in the light of facts, it is done or happens because of those facts.", "level": "C1", "dict_examp": "In  light of                     the problems we’re having, we have no choice but to close the business.", "lear_examp": "In light of all the things mentioned above, I strongly recommend Alexandra for the job."}, {"sense": "If information about something comes to light, it is learned or discovered.", "level": "C2", "dict_examp": "She knew that the fraud would eventually come to light.", "lear_examp": "Nevertheless, during the time they are in the forest, it comes to light that Edward is the weaker character."}, {"sense": "If information is brought to light, it is learned or discovered.", "level": "C2", "dict_examp": "Her research has brought to light new information about Jefferson’s early life.", "lear_examp": "The evening investigation which was carried out by the mysterious Inspector brought all these facts to light."}, {"sense": "to provide new information about something that makes it easier to understand", "level": "C2", "dict_examp": "As an economist, he was able to shed some light on the situation.", "lear_examp": "A study of them might shed light on this unique process of adaptation, and may help improve it in the future."}]}, {"pos": "adjective", "senses": [{"sense": "Light colors are pale.", "level": "A1", "dict_examp": "light blue/green", "lear_examp": "I am going to paint it light blue."}, {"sense": "not heavy", "level": "A2", "dict_examp": "a light summer dress", "lear_examp": "I bought a coat.  I bought it because is very light."}, {"sense": "lit by the natural light of the day", "level": "B1", "dict_examp": "It gets light very early these summer mornings.", "lear_examp": "In the center of the town, streets are narrow and in many cases, they aren't light enough."}, {"sense": "small in amount", "level": "B1", "dict_examp": "A light breeze was blowing.", "lear_examp": "The weather here is very warm and sunny with a light breeze."}, {"sense": "to talk or behave as if you do not think a problem is serious", "level": "C2", "dict_examp": "I just laughed and tried to make light of it.", "lear_examp": "They project an optimistic image and make light of the troubles in life."}]}, {"pos": "verb", "senses": [{"sense": "to start to burn or to make something start to burn", "level": "B1", "dict_examp": "to light a fire", "lear_examp": "We put up the tents and lit the fire."}, {"sense": "to produce light somewhere so that you can see things", "level": "B2", "dict_examp": "Fireworks lit up the sky.", "lear_examp": "Lightning lit up my bedroom and I saw a shadow moving outside the house."}]}]}, {"word": "lighter", "poses": [{"pos": "noun", "senses": [{"sense": "a small object that produces a flame and is used to start something burning", "level": "B1", "dict_examp": "Can I borrow your lighter?", "lear_examp": "It's a silver lighter, with a little spider on, that my best friend bought me for my birthday."}]}]}, {"word": "like", "poses": [{"pos": "preposition", "senses": [{"sense": "similar to or in the same way as someone or something", "level": "A2", "dict_examp": "She's a lot like her mother.", "lear_examp": "After the game, we had a barbecue and I met Theresa, a very good-looking girl who is interested in politics, just like me."}, {"sense": "something you say when you want someone to describe someone or something", "level": "A2", "dict_examp": "I haven't met him - what's he like?", "lear_examp": "What is she like?"}, {"sense": "such as", "level": "B1", "dict_examp": "I prefer natural fabrics like cotton and wool.", "lear_examp": "We have visited beautiful places like Chile, Patagonia, Iguazu."}, {"sense": "typical or characteristic of", "level": "B2", "dict_examp": "He forgot his keys? Well, that's just like him.", "lear_examp": ""}, {"sense": "a lot", "level": "B2", "dict_examp": "Mark’s working like crazy  to get the house painted by the end of the week.", "lear_examp": "I was working like crazy but I enjoyed it  a lot."}, {"sense": "very quickly", "level": "C1", "dict_examp": "Mark’s working like crazy  to get the house painted by the end of the week.", "lear_examp": "My heart was beating like crazy and when the ski-boat started its journey along the blue waves of the sea..."}, {"sense": "used to remind someone that you said this earlier", "level": "C1", "dict_examp": "Like I said, I’m not interested in buying insurance at the moment.", "lear_examp": "I wonder if it's not too late for my own little munchkins.  Like I said, they already love to SHOP!"}, {"sense": "similar to or approximately", "level": "C2", "dict_examp": "He paid something like $18,000 for his car.", "lear_examp": "To their minds it is still something like an obligation and this may be attributed to the pressure their parents and teachers used to put on them."}]}, {"pos": "verb", "senses": [{"sense": "to enjoy something or feel that someone or something is pleasant", "level": "A1", "dict_examp": "I like your new haircut.", "lear_examp": "I like reading and writing."}, {"sense": "used to say that you want something", "level": "A1", "dict_examp": "I'd like the tomato soup, please.", "lear_examp": "I would like to study other languages, too."}, {"sense": "used to ask someone if they want something", "level": "A1", "dict_examp": "Would you like a cup of coffee?", "lear_examp": "Would you like to come?"}, {"sense": "used when you offer someone something", "level": "A2", "dict_examp": "If you like, I could drive you there.", "lear_examp": "If you like, we can go to a night club."}]}, {"pos": "conjunction", "senses": [{"sense": "as if", "level": "B1", "dict_examp": "It looks like rain.", "lear_examp": "It seems like all my new friends like me a lot, and I am very happy to stay in this school."}]}, {"pos": "noun", "senses": [{"sense": "things that you do and do not like", "level": "B1", "dict_examp": "She knows her children’s likes and dislikes.", "lear_examp": "The teacher asked about our families, friends, and likes and dislikes and then the lesson finished."}]}]}, {"word": "likelihood", "poses": [{"pos": "noun", "senses": [{"sense": "the chance that something will happen", "level": "C2", "dict_examp": "There’s little likelihood of a compromise.", "lear_examp": "There is little likelihood of having a good place to live in without the scientists' support."}, {"sense": "almost certainly", "level": "C2", "dict_examp": "The facilities are wasted on people who in all likelihood will not use them.", "lear_examp": "In all likelihood, you will have to work during the weekends, even in summer, so I firmly believe that loving your job is very important."}]}]}, {"word": "likely", "poses": [{"pos": "adjective", "senses": [{"sense": "describes something that will probably happen or is expected", "level": "B1", "dict_examp": "If I don’t write it down, I’m likely to forget.", "lear_examp": "They start thinking that the suitcase is likely to contain a bomb."}]}, {"pos": "adverb", "senses": [{"sense": "probably", "level": "C1", "dict_examp": "I’ll most likely get there at about ten o’clock.", "lear_examp": "You will most likely not get there before 2:30. Welcome!"}]}]}, {"word": "likewise", "poses": [{"pos": "adverb", "senses": [{"sense": "in the same way", "level": "C2", "dict_examp": "Water these plants twice a week and likewise the ones in the bedroom.", "lear_examp": "And likewise, common sense tells us it doesn't matter that oranges from Spain contain 0.01% more vitamin C than those from Florida, as long as we eat them every once in a while."}]}]}, {"word": "lighting", "poses": [{"pos": "noun", "senses": [{"sense": "the light created by electrical equipment, candles, etc.", "level": "B2", "dict_examp": "outdoor lighting", "lear_examp": "I fixed the lighting on the ceiling and attached several spotlights to the walls."}]}]}, {"word": "limit", "poses": [{"pos": "noun", "senses": [{"sense": "the largest amount of something that is possible or allowed", "level": "B1", "dict_examp": "Is there a limit on the number of tickets you can get?", "lear_examp": "I always watch this program, it's really interesting for anyone who enjoys cooking. ... Usually two chefs come in and prepare the food, and they have a time limit."}, {"sense": "to drive faster than you are allowed to according to the law", "level": "C1", "dict_examp": "She was exceeding the speed limit.", "lear_examp": "There are three ground rules you have to follow: stop at stop signs, don't exceed the speed limit and don't be in the way of other cars."}]}, {"pos": "verb", "senses": [{"sense": "to control something so that it is less than a particular amount or number", "level": "B2", "dict_examp": "I've been asked to limit my talk to ten minutes.", "lear_examp": "In general, kids and teenagers are, at home, allowed to do almost anything they want, which sometimes puts parents in a very difficult position when trying to establish rules in order to limit the freedom of the young."}]}]}, {"word": "life", "poses": [{"pos": "noun", "senses": [{"sense": "the time between a person's birth and their death", "level": "A1", "dict_examp": "Life's too short to worry about money!", "lear_examp": "Aleksandra likes to do almost everything because she likes life!"}, {"sense": "everything which is alive", "level": "B1", "dict_examp": "animal/marine/plant life", "lear_examp": "I chose to visit the London Aquarium because I had never gone to an aquarium to see sea life before."}, {"sense": "a way of living", "level": "B1", "dict_examp": "You lead an exciting life.", "lear_examp": ""}, {"sense": "one part of someone's existence", "level": "B1", "dict_examp": "I never talk about my private life.", "lear_examp": "The film is about family life."}, {"sense": "the manner in which a person lives", "level": "B1", "dict_examp": "She told us all about her way of life in Japan.", "lear_examp": "He told me about his hobbies, his way of life and especially about his love of learning languages."}, {"sense": "the existence of a person", "level": "B2", "dict_examp": "Many lives are lost to TB.", "lear_examp": "Finally if you witness an accident you should inform the police quickly, which can save lives."}, {"sense": "energy or enthusiasm", "level": "B2", "dict_examp": "She's so full of life.", "lear_examp": "Above all, I like children very much because they're full of life and always make a great impression on me when I have a chat with them."}, {"sense": "for the whole of someone's life", "level": "C1", "dict_examp": "I will have to take this medicine for life.", "lear_examp": "A wedding opens a new life when the two parties commit to each other for life."}, {"sense": "the amount of time that a machine, system, etc., exists or can be used", "level": "C2", "dict_examp": "The newer batteries have a much longer life.", "lear_examp": ""}, {"sense": "a serious situation where people could die", "level": "C2", "dict_examp": "Getting water to these people is a matter of life and death.", "lear_examp": "I told him it was a matter of life and death."}]}]}, {"word": "lightning", "poses": [{"pos": "noun", "senses": [{"sense": "a sudden flash of light in the sky during a storm", "level": "B1", "dict_examp": "thunder and lightning", "lear_examp": "We were sitting in the car when the lightning hit the roof."}]}]}, {"word": "lifestyle", "poses": [{"pos": "noun", "senses": [{"sense": "the way that you live", "level": "B2", "dict_examp": "He lives a healthy lifestyle.", "lear_examp": "I would like to go on an adventure like this, with a group of people with different backgrounds, cultures and lifestyles."}]}]}, {"word": "lightly", "poses": [{"pos": "adverb", "senses": [{"sense": "gently", "level": "B1", "dict_examp": "She patted him lightly on the shoulder.", "lear_examp": "The weather here is wonderful, the sun is shining, the wind is blowing lightly, and the sky is also clear, clear, blue!"}, {"sense": "not much", "level": "C1", "dict_examp": "lightly cooked vegetables", "lear_examp": ""}, {"sense": "to think carefully about something before you do it, knowing that it is serious", "level": "C2", "dict_examp": "It's not a decision that I take lightly.", "lear_examp": "I hope you give my suggestion further consideration and not treat it lightly."}]}]}, {"word": "life span", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of time that a person lives or a thing exists", "level": "C2", "dict_examp": "The average human life span has increased steadily over the last century.", "lear_examp": "Now, that the life span has increased, it is becoming more and more common to see children looking after their elderly parents."}]}]}, {"word": "lift", "poses": [{"pos": "verb", "senses": [{"sense": "to move something from a lower to a higher position", "level": "B1", "dict_examp": "Could you help me lift this table, please?", "lear_examp": "Then, we lifted weights to get stronger legs, arms, etc. I met different people and I made lots of friends."}]}, {"pos": "noun", "senses": [{"sense": "a free ride somewhere in another person's car", "level": "A2", "dict_examp": "Can you give me a lift to the airport?", "lear_examp": "My mother will drive us and give us a lift home."}]}]}, {"word": "limited", "poses": [{"pos": "adjective", "senses": [{"sense": "small in amount or number", "level": "B1", "dict_examp": "a limited choice", "lear_examp": "I like warm colors, orange and yellow, but my choices are limited for outdoor clothes."}, {"sense": "kept within a particular size, range, time, etc.", "level": "B2", "dict_examp": "The class is limited to fifty students.", "lear_examp": "Above all, would it possible to enjoy the offer in September or is it limited to July?"}]}]}, {"word": "listen", "poses": [{"pos": "verb", "senses": [{"sense": "to give attention to someone or something in order to hear them", "level": "A1", "dict_examp": "What kind of music do you listen to?", "lear_examp": "She likes to listen to oriental music and Turkish music."}, {"sense": "to pay attention to what someone tells you and accept what they say", "level": "B1", "dict_examp": "I told you she wouldn't like it but you wouldn't listen to me!", "lear_examp": "I did complain many times but he wouldn't listen to me."}, {"sense": "to secretly listen to someone else's conversation", "level": "C2", "dict_examp": "Do you think he's been listening in on our conversations?", "lear_examp": "As John kept coming back late from work and giving the same kind of excuse, Maria decided to bug his phone at work as well as his workplace and then began to listen in on him."}]}]}, {"word": "literary", "poses": [{"pos": "adjective", "senses": [{"sense": "connected with literature", "level": "B2", "dict_examp": "a literary critic", "lear_examp": "Since I am aware of your interest in literature, I have chosen a literary figure."}]}]}, {"word": "literature", "poses": [{"pos": "noun", "senses": [{"sense": "books, poems, etc. that are considered to be art", "level": "B1", "dict_examp": "American/French/world literature", "lear_examp": "He has studied English literature at Cambridge University."}]}]}, {"word": "literally", "poses": [{"pos": "adverb", "senses": [{"sense": "having the real or original meaning of a word or phrase", "level": "B2", "dict_examp": "There were literally hundreds of pages to read in the contract.", "lear_examp": "Sometimes they literally go mad; they bite their mates or even kill their own children."}]}]}, {"word": "literacy", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to read and write", "level": "C1", "dict_examp": "Adult literacy is low in this area.", "lear_examp": "School on the one hand has been a place to learn the important basics, like literacy and numeracy."}]}]}, {"word": "limitation", "poses": [{"pos": "noun", "senses": [{"sense": "control or rules that limit the size or extent of something", "level": "C1", "dict_examp": "You can't write everything you want because of space limitations.", "lear_examp": "The only thing that is crucial now is that ministries of culture and tourism should set strict limitations about building and constructing in order not to destroy the stunning views of our beautiful country."}, {"sense": "things that someone or something is not good at doing", "level": "C1", "dict_examp": "Both films show her limitations as an actress.", "lear_examp": "I would like to be a super-woman but I will have to live with my limitations."}]}]}, {"word": "lion", "poses": [{"pos": "noun", "senses": [{"sense": "a large, wild animal of the cat family, with light brown fur", "level": "A2", "dict_examp": "The lions came down to the water hole at sunset.", "lear_examp": "My favorite present is a lion."}]}]}, {"word": "link", "poses": [{"pos": "noun", "senses": [{"sense": "a connection between documents or areas on the Internet", "level": "B1", "dict_examp": "Click on this link to visit our online bookstore.", "lear_examp": "An au-pair friend of mine has given me a link to an au-pair homepage."}, {"sense": "a connection between two people, things, or ideas", "level": "B2", "dict_examp": "There's a link between diet and heart disease.", "lear_examp": "There is a direct bus link between the two locations: this is bus line number six."}]}, {"pos": "verb", "senses": [{"sense": "to make a connection between two or more people, things, or ideas", "level": "B2", "dict_examp": "The use of CFCs has been linked to the hole in the ozone layer.", "lear_examp": "The technological revolution taking place today can be directly linked to the amazing evolution of communication."}]}]}, {"word": "liter", "poses": [{"pos": "noun", "senses": [{"sense": "a unit for measuring the volume of a liquid, equal to 1.057 quarts", "level": "A2", "dict_examp": "a liter of water/soda", "lear_examp": "Also try to drink at least 2 liters of water a day."}]}]}, {"word": "literal", "poses": [{"pos": "adjective", "senses": [{"sense": "The literal meaning of a word or phrase is its real or original meaning.", "level": "C2", "dict_examp": "the literal meaning/sense", "lear_examp": "First of all, some people treasure certain possessions since they are valuable in its literal meaning, like diamonds or gold."}]}]}, {"word": "lip", "poses": [{"pos": "noun", "senses": [{"sense": "one of the two soft edges of the mouth", "level": "B1", "dict_examp": "He licked his lips.", "lear_examp": "We went to a restaurant and when I had to leave, he kissed me on my lips."}]}]}, {"word": "list", "poses": [{"pos": "noun", "senses": [{"sense": "a series of names, numbers, or items that are written one below the other", "level": "A2", "dict_examp": "a shopping list", "lear_examp": "Our class teacher will give us a list of things we must buy."}]}, {"pos": "verb", "senses": [{"sense": "to make a list, or to include something in a list", "level": "B2", "dict_examp": "I've listed some useful reading material on the handout.", "lear_examp": "I listed some reasons why we should apply for this job."}]}]}, {"word": "liquid", "poses": [{"pos": "noun", "senses": [{"sense": "a substance, such as water, that is not solid or a gas and that can be poured easily", "level": "B1", "dict_examp": "liquid fuel/nitrogen", "lear_examp": "Inside there were three samples of a nasty purple liquid."}]}]}, {"word": "listener", "poses": [{"pos": "noun", "senses": [{"sense": "someone who listens", "level": "C1", "dict_examp": "The new radio station already has twelve million listeners.", "lear_examp": "She is a good listener, as well as quite talkative."}]}]}, {"word": "linguistic", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to language or the study of language", "level": "C1", "dict_examp": "I'm particularly interested in the linguistic development of young children.", "lear_examp": "Firstly, the claim that only one hour per day was required in order to obtain linguistic fluency is an unrealistic assumption."}]}]}, {"word": "literate", "poses": [{"pos": "adjective", "senses": [{"sense": "able to read and write", "level": "C2", "dict_examp": "He was barely literate.", "lear_examp": "To sum up, in no way is education a waste of time. What we do need is to improve it and make people believe that being educated and literate is a great asset."}]}]}, {"word": "linger", "poses": [{"pos": "verb", "senses": [{"sense": "to stay somewhere for a long time", "level": "C2", "dict_examp": "The smell from the fire still lingered hours later.", "lear_examp": "Many recollections of that evening have perished, like how I worked up the nerve to ask her, but one thing that lingers in my mind is that song we danced to."}]}]}, {"word": "linen", "poses": [{"pos": "noun", "senses": [{"sense": "cloth items for the home, such as sheets and tablecloths", "level": "C1", "dict_examp": "They want to buy new curtains and linens for their new home.", "lear_examp": "I'm afraid I didn't have enough time to change the linens on the bed, so please change them by yourself, you'll find them in the second drawer from the top in the bedroom."}, {"sense": "a strong cloth that is like rough cotton", "level": "C2", "dict_examp": "a linen jacket", "lear_examp": "It has all the basic seams, and so far I have tried it with denim, cotton, linen, silk and even with leather, and it does the job perfectly."}]}]}, {"word": "line", "poses": [{"pos": "noun", "senses": [{"sense": "a long, thin mark", "level": "A2", "dict_examp": "a straight line", "lear_examp": "We have to bring with us only a pencil.  Because the first day we will draw lines."}, {"sense": "a group of people standing one behind the other who are waiting for something", "level": "B1", "dict_examp": "Are you in line?", "lear_examp": "The next day, he was in the airport waiting in line to check in his luggage."}, {"sense": "a row of words on a page", "level": "B1", "dict_examp": "The same line is repeated throughout the poem.", "lear_examp": "In no more than ten lines, my mother explained that she was moving to Brazilia, the capital of our country, and that she would take me and my brother with her."}, {"sense": "a train route or railroad track", "level": "B1", "dict_examp": "rail/commuter lines", "lear_examp": "You go up along the Yourou river on the Kominato line and you can find some beautiful places."}, {"sense": "the connection between telephones", "level": "B2", "dict_examp": "That line is busy – may I take a message?", "lear_examp": "Bedrooms were quite spacious with a lot of light as well as a TV set and a direct phone line."}, {"sense": "a type of product that a company sells", "level": "C1", "dict_examp": "Our new sportswear line will be in stores shortly.", "lear_examp": "If, on the one hand, the changing market is forcing us to remove  some product lines, on the other it is giving us new opportunities, as is the case for handhelds."}, {"sense": "a very small difference between two things that seem very different", "level": "C1", "dict_examp": "There's a fine line between courage and foolishness.", "lear_examp": "It took me 6 months to realize that there is a fine line between telling off and psychological abuse."}, {"sense": "a row of people or things", "level": "C2", "dict_examp": "a line of trees", "lear_examp": "Its facade was cut by a line of French windows and there was a large number of people in front of the front door."}, {"sense": "the border of an area within a country", "level": "C2", "dict_examp": "the city/state/county line", "lear_examp": ""}, {"sense": "a long mark on an area where a sport is played that shows an edge or measurement", "level": "C2", "dict_examp": "the foul line", "lear_examp": ""}, {"sense": "a way of dealing with or thinking about something or someone", "level": "C2", "dict_examp": "I couldn’t follow his line of reasoning.", "lear_examp": "My personal take on this line of thought is that this is a practical and beneficial albeit shallow way to view reading books, reducing reading to a simple pastime."}, {"sense": "a row of positions used to defend against enemy attack, especially the ones closest to enemy positions", "level": "C2", "dict_examp": "They were taken prisoner while on a reconnaissance mission behind enemy lines.", "lear_examp": "She was never afraid of going to the front line in battle."}, {"sense": "If someone's job, reputation, life, etc., is on the line, they may lose it.", "level": "C2", "dict_examp": "If we don't win the contract, all our jobs are on the line.", "lear_examp": "The person who hopes to achieve success shouldn't be afraid of taking risks and sometimes putting his or her career on the line for the sake of gaining much bigger benefits."}, {"sense": "the most important fact of final result in an activity, discussion, or situation", "level": "C2", "dict_examp": "The bottom line is that they lost the game.", "lear_examp": "The bottom line is that the adults of today have to stop for a second and think about what they are doing."}, {"sense": "based on and similar to something", "level": "C2", "dict_examp": "He gave a talk along the lines of the one he gave in Oxford.", "lear_examp": "Imagine one is encouraged by friends and institutions for their 'different' artistic or other activities, even if their works are not along the lines of 'acceptable' norms and tradition."}, {"sense": "to be similar to and suitable for something", "level": "C2", "dict_examp": "They were offered a pay increase in line with inflation.", "lear_examp": "The other two courses, at 5%, are still in line with the national average."}, {"sense": "in the future", "level": "C2", "dict_examp": "Lots of things will have changed a few years down the road.", "lear_examp": "For that very reason it seemed natural for Laura and John to take her in, and further down the line they would adopt her."}, {"sense": "If someone says they know where to draw the line, they are talking about knowing at what point an activity or situation becomes unacceptable because it is wrong or too extreme", "level": "C2", "dict_examp": "I’ll do what I can to help a friend, but I draw the line when someone asks me to lie for them.", "lear_examp": "For these parents, drawing the line at certain behaviors became a synonym for lack of democracy, and a source of struggle at home."}, {"sense": "If someone's actions or words are out of line, they are beyond what is considered acceptable in that situation.", "level": "C2", "dict_examp": "You can disagree with her, but calling her dishonest was way out of line.", "lear_examp": "Today I see that my mother was right in this aspect since I acted extremely out of line sometimes and a soft hand certainly wouldn't help me in the future."}, {"sense": "If you read between the lines, you understand what something really means when it hasn't been directly said or written.", "level": "C2", "dict_examp": "Reading between the lines, it was obvious that something was wrong.", "lear_examp": "All songs send positive thoughts and messages to listeners, although sometimes you really have to read between the lines to understand this profound message."}]}, {"pos": "verb", "senses": [{"sense": "to form a row along the side of something", "level": "C2", "dict_examp": "Trees and cafes lined the street.", "lear_examp": "Under the arch formed by the top branches of the trees which lined both sides of the street, she was so much absorbed in her thought that she did not hear the sound of approaching steps."}, {"sense": "to arrange people or things in a row or to stand in a row", "level": "B2", "dict_examp": "A fight broke out behind me as we lined up to receive our food rations.", "lear_examp": "A lot of customers had lined up after me."}, {"sense": "to plan for something to happen", "level": "C1", "dict_examp": "What future projects have you lined up?", "lear_examp": "Nonetheless, we are also eager to help out in other projects that you have lined up."}]}]}, {"word": "live", "poses": [{"pos": "verb", "senses": [{"sense": "to have your home somewhere", "level": "A1", "dict_examp": "Where do you live?", "lear_examp": "I live in Springfield."}, {"sense": "to spend your life in a particular way", "level": "B1", "dict_examp": "After a while you get used to living alone.", "lear_examp": "I'm so sorry but I have to go to the hospital with my grandma, she lives alone and she needs someone to go with her."}, {"sense": "to be alive", "level": "B1", "dict_examp": "He only lived a few days after the accident.", "lear_examp": "I entered and saw the chat chair? of my ancestor, who lived 500 years ago."}, {"sense": "to keep yourself alive", "level": "C2", "dict_examp": "She’s so poor – I wonder how she lives.", "lear_examp": "Later on, though, as she gets to know Douglas and his friends a little bit better, she discovers that she simply cannot identify with this group of individuals, who look down upon India's native population while parasitically living off of it."}, {"sense": "to have something or someone as the most important thing in your life", "level": "B2", "dict_examp": "She just lives for music.", "lear_examp": "They are passionate, and live for their football team."}, {"sense": "If you live on an amount of money, that is the money that you use to buy the things that you need.", "level": "B2", "dict_examp": "We lived on very little when we first got married.", "lear_examp": "They spent 2 years there and lived on their small salaries from several part-time jobs they had managed to get."}, {"sense": "to only eat a particular type of food", "level": "B2", "dict_examp": "I more or less live on pasta.", "lear_examp": "It may sound funny to live on \"carrots\", but as a matter of fact, vegetarians do survive, so why shouldn't you?"}, {"sense": "to experience a difficult situation or event", "level": "C2", "dict_examp": "My grandparents lived through two world wars.", "lear_examp": "Then you have never lived through a black out, those terrifying hours during which everything stops working including, as it seems, life itself."}, {"sense": "If two people live together, they share a home.", "level": "B2", "dict_examp": "Nowadays many young people live together.", "lear_examp": "They had lived together for about 3 years but she found out he had been cheating on her and she didn't want to stay with him any more."}, {"sense": "to be as good as someone hopes", "level": "B2", "dict_examp": "Did the trip live up to your expectations?", "lear_examp": "To my regret, the evening totally failed to live up to my expectations."}, {"sense": "to share a home with someone", "level": "B2", "dict_examp": "How do you like living with your parents?", "lear_examp": "It will be nice to live with my sister again."}]}, {"pos": "adjective", "senses": [{"sense": "A live radio or television program or performance is seen or heard as it happens.", "level": "B1", "dict_examp": "This evening there will be a live broadcast of the debate.", "lear_examp": "In January, there is a special live concert which includes the most popular music in my country."}]}]}, {"word": "liver", "poses": [{"pos": "noun", "senses": [{"sense": "a large organ in your body that cleans your blood", "level": "B2", "dict_examp": "He has something wrong with his liver.", "lear_examp": "Peter knew that her injuries would not be a problem, except her liver.  That is why the surgeon asked him if he could give his sister a part of his liver."}]}]}, {"word": "location", "poses": [{"pos": "noun", "senses": [{"sense": "a place or position", "level": "B1", "dict_examp": "The hotel is in a lovely location overlooking the lake.", "lear_examp": "The village is in a peaceful location, within minutes of a safe lake, and an hour from a pretty town."}, {"sense": "If a film or television program is made on location, it is made at a place suitable to the story.", "level": "C1", "dict_examp": "The movie was shot on location in Kenya.", "lear_examp": "We can't help mentioning the nice shots on location."}]}]}, {"word": "lock", "poses": [{"pos": "noun", "senses": [{"sense": "the thing that is used to close a door, window, etc., and that needs a key to open it", "level": "B1", "dict_examp": "I heard someone turn a key in the lock.", "lear_examp": "At the hotel, in my room I tried to open my suitcase but the lock didn't move."}]}, {"pos": "verb", "senses": [{"sense": "to fasten something with a key, or to be fastened with a key", "level": "B1", "dict_examp": "Don't forget to lock the door when you go out.", "lear_examp": "Yesterday at about 11:10 p.m. I went to lock my garage."}, {"sense": "to put something or someone in a place or container that is fastened with a key", "level": "C2", "dict_examp": "The jewelry is locked away in a safe.", "lear_examp": "With large sums of money locked away in their banks, they decided to destroy the notes in they made during the discovery, to prevent any thieves from stealing the secret."}, {"sense": "to prevent someone from leaving or prevent others from entering a room or building by locking a door", "level": "B2", "dict_examp": "She locked herself in her bedroom.", "lear_examp": "My mother was about to die from her agony while my father was trying to find a way to lock me in."}, {"sense": "to prevent someone from entering a room or building by locking a door", "level": "B2", "dict_examp": "I can't believe I've locked myself out again!", "lear_examp": "In the very early morning, my husband and I heard a lot of noise at the front door and I went to see if Kate was locked out."}]}]}, {"word": "lobby", "poses": [{"pos": "noun", "senses": [{"sense": "an area inside the main entrance of a building", "level": "B2", "dict_examp": "the hotel/building lobby", "lear_examp": "He unpacked his things, took a shower and went to the lobby to wait for Hanna."}]}, {"pos": "verb", "senses": [{"sense": "to try to persuade the government or an official group to do something", "level": "C2", "dict_examp": "Small businesses have lobbied hard for/against changes in the tax laws.", "lear_examp": "They have become so powerful through their vast sales and profits that they can effectively lobby for their points of view."}]}]}, {"word": "litter", "poses": [{"pos": "noun", "senses": [{"sense": "pieces of paper and other waste that are left in public places", "level": "B2", "dict_examp": "The streets were full of litter.", "lear_examp": "There is a lot of litter on the streets."}]}]}, {"word": "loathing", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of hating someone or something", "level": "C2", "dict_examp": "All I feel for him is loathing.", "lear_examp": "Both characters are torn between their feelings of awe and loathing for India, although Olivia's relationship with this country is one of submission and devotion."}]}]}, {"word": "loathe", "poses": [{"pos": "verb", "senses": [{"sense": "to hate someone or something", "level": "C2", "dict_examp": "I absolutely loathe swimming.", "lear_examp": "Even those obscure and never-pay-attention subjects that we totally loathe might give us food for thought regardless of what we will end up studying."}]}]}, {"word": "local", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to an area near you", "level": "B1", "dict_examp": "a local accent", "lear_examp": "You could go walking in the countryside, try water sports, enjoy the local food (especially the \"galettes\") and visit the city of Rennes."}]}, {"pos": "noun", "senses": [{"sense": "someone who lives in the area you are talking about", "level": "C2", "dict_examp": "The locals are very upset about the new law.", "lear_examp": "However, it is inadvisable to confront the locals with prejudices or exaggerated expectations they cannot live up to."}]}]}, {"word": "living room", "poses": [{"pos": "noun", "senses": [{"sense": "the room in a house where people sit to relax and, for example, watch television", "level": "A1", "dict_examp": "We had dinner in the living room and watched a movie on TV.", "lear_examp": "My favorite room is the living room because it's the biggest in my house."}]}]}, {"word": "lively", "poses": [{"pos": "adjective", "senses": [{"sense": "full of energy and interest", "level": "B1", "dict_examp": "It's hard work teaching a class of lively children.", "lear_examp": "Paris is very lively all day long and at night."}]}]}, {"word": "loan", "poses": [{"pos": "noun", "senses": [{"sense": "money that someone has borrowed", "level": "B1", "dict_examp": "She's going to take out a loan to start her own business.", "lear_examp": "From the program they learn a lot about funding or getting a loan from a bank."}, {"sense": "If something is on loan, someone is borrowing it.", "level": "C1", "dict_examp": "Both paintings are on loan from the city museum.", "lear_examp": "For example, you can always take out on loan any video you like from our center."}]}]}, {"word": "load", "poses": [{"pos": "noun", "senses": [{"sense": "a lot", "level": "B1", "dict_examp": "There were loads of people there.", "lear_examp": "We went to loads of beautiful places."}, {"sense": "something that is carried, often by a vehicle", "level": "B2", "dict_examp": "The maximum load for this elevator is eight persons.", "lear_examp": "Since it can carry a significant load, a car makes it possible for me to go shopping immediately after working."}]}, {"pos": "verb", "senses": [{"sense": "to put a lot of things into a vehicle or machine", "level": "B2", "dict_examp": "He could load more hay into the wagon.", "lear_examp": "On cloudy nights there were carriages loaded with wares which came in and afterward went out of the Jamaica Inn."}, {"sense": "to put information or a program onto a computer", "level": "B2", "dict_examp": "You need to load the new software before you can use the computer.", "lear_examp": "The shop keeper loaded 12 games onto it which I chose."}]}]}, {"word": "locate", "poses": [{"pos": "verb", "senses": [{"sense": "to be in a particular place", "level": "B1", "dict_examp": "The company decided to locate its headquarters in Denver.", "lear_examp": "It's located in the heart of Puebla and it's really wonderful."}, {"sense": "to find or discover the exact position of something", "level": "B2", "dict_examp": "Archeologists have located the remains of an ancient city.", "lear_examp": "He tried to locate the wall and took a calm step forward."}]}]}, {"word": "little", "poses": [{"pos": "adjective", "senses": [{"sense": "small in size or amount", "level": "A1", "dict_examp": "It came in a little box.", "lear_examp": "When I am swimming, I can see the little fish."}, {"sense": "young", "level": "A1", "dict_examp": "When you were little your hair was really curly.", "lear_examp": "She has a little boy."}, {"sense": "not important", "level": "B1", "dict_examp": "I had a little problem with my car, but it’s fixed now.", "lear_examp": "There is only one little problem. Unfortunately, the rooms are single."}, {"sense": "short in time or distance", "level": "B2", "dict_examp": "It’ll take me a little while longer to get ready.", "lear_examp": "I was on a phone for a little while and the lights went out... who knows why!!"}, {"sense": "used to show affection or dislike for someone or something", "level": "B2", "dict_examp": "Oh, what a nice little house!", "lear_examp": "\"Oh no Mr. Dracula...don't hurt me! Please don't hurt me!\" I said desperately. \"With such a pretty little neck? Oh no! I have to give you just a tiny little bite...\""}]}, {"pos": "determiner", "senses": [{"sense": "not much or enough", "level": "B1", "dict_examp": "There seems little hope of a ceasefire.", "lear_examp": "In his opinion, being a teacher is a very bad way to earn money because you have a lot of work to do and earn very little money."}, {"sense": "a small amount of something", "level": "B1", "dict_examp": "It just needs a little effort.", "lear_examp": "Hi Sam, I need a little help from you. I need to borrow your bicycle, because someone stole mine."}]}, {"pos": "pronoun", "senses": [{"sense": "a small amount", "level": "B1", "dict_examp": "I could only hear a little of what they were saying.", "lear_examp": "He told them how animals were treated by human beings -  they had to work a lot and were fed very little."}, {"sense": "a small amount", "level": "B1", "dict_examp": "\"Do we have any sugar left?\" \"A little.\"", "lear_examp": "One day it rained, but only a little."}, {"sense": "a small amount at  a time", "level": "B2", "dict_examp": "Little by little, the boy learned to trust us.", "lear_examp": "However, as the time went by, I couldn't but feel my dream disappearing little by little."}]}, {"pos": "adverb", "senses": [{"sense": "slightly", "level": "A2", "dict_examp": "I was a little bit worried by what she said.", "lear_examp": "It's a little bit expensive but it is so awesome!"}, {"sense": "slightly", "level": "B2", "dict_examp": "You’re walking a little too fast for me.", "lear_examp": "I'm a little surprised by my \"popularity\"."}, {"sense": "not much or not enough", "level": "C1", "dict_examp": "a little-known fact", "lear_examp": "Little did I know that I would be even more confused afterward."}, {"sense": "not much more or better", "level": "C2", "dict_examp": "Their house was little more than a hovel.", "lear_examp": "It was little better than a slum, completely unfurnished, except for a desk with a diary on it."}]}]}, {"word": "loaf", "poses": [{"pos": "noun", "senses": [{"sense": "bread that has been baked in one large piece so that it can be cut into smaller pieces", "level": "B2", "dict_examp": "a loaf of bread", "lear_examp": "I was often sent by my mother to the next shop to buy a loaf of bread, some milk and sometimes fruit and vegetables."}]}]}, {"word": "living", "poses": [{"pos": "adjective", "senses": [{"sense": "alive now", "level": "B2", "dict_examp": "living things/creatures/organisms", "lear_examp": "Environmental protection activists point out that living creatures shouldn't be deprived of their natural background and most endangered species could be saved from extinction by creating more national parks."}]}, {"pos": "noun", "senses": [{"sense": "the money that you earn from your job", "level": "B2", "dict_examp": "What do you do for a living?", "lear_examp": "You should try to earn a living from painting."}]}]}, {"word": "lonely", "poses": [{"pos": "adjective", "senses": [{"sense": "unhappy because you are not with other people", "level": "B1", "dict_examp": "She gets lonely now that all the kids have left home.", "lear_examp": "If they had not been there, I would have been very lonely."}, {"sense": "A lonely place is a long way from where people live.", "level": "B2", "dict_examp": "a lonely stretch of Arizona highway", "lear_examp": "In this lonely place strange things happened."}]}]}, {"word": "loneliness", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being lonely", "level": "C1", "dict_examp": "I wasn't prepared for the loneliness of living in a small village.", "lear_examp": "Frankenstein is a book that explores the feelings of loneliness and solitude, and the consequences that this has on human relationships."}]}]}, {"word": "logically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is logical", "level": "C2", "dict_examp": "Her ideas were clear and logically presented.", "lear_examp": "Her intuition failed her, and neither could she find the answer logically."}]}]}, {"word": "logo", "poses": [{"pos": "noun", "senses": [{"sense": "a design or symbol used by a company to advertise its products", "level": "B1", "dict_examp": "a corporate logo", "lear_examp": "I have also bought some new tee-shirts: one blue, one green with a white logo and one red."}]}]}, {"word": "longing", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of wanting something or someone very much", "level": "C2", "dict_examp": "a longing for his homeland", "lear_examp": "These elements, together with the longing for independence, can help you reach your goal."}]}]}, {"word": "long-lasting", "poses": [{"pos": "adjective", "senses": [{"sense": "continuing for a long period of time", "level": "C2", "dict_examp": "Theirs was a long-lasting friendship.", "lear_examp": "People with these qualities are most able to provide me with what I like: fun, attention, good conversations and long-lasting relationships."}]}]}, {"word": "long-time", "poses": [{"pos": "adjective", "senses": [{"sense": "describes someone who has been in a particular position for a long period", "level": "C1", "dict_examp": "A long-time friend of the chairman said she had expected the resignation.", "lear_examp": "I have now known her for 13 years both as a student and on a familiar level, since I am a long-time friend of her husband's."}]}]}, {"word": "logical", "poses": [{"pos": "adjective", "senses": [{"sense": "using reason", "level": "B2", "dict_examp": "a logical choice/conclusion", "lear_examp": "When someone is logical and smart and loves life, he is not in danger when he drives a car."}]}]}, {"word": "lock", "poses": [{"pos": "noun", "senses": [{"sense": "the thing that is used to close a door, window, etc., and that needs a key to open it", "level": "B1", "dict_examp": "I heard someone turn a key in the lock.", "lear_examp": "At the hotel, in my room I tried to open my suitcase but the lock didn't move."}]}, {"pos": "verb", "senses": [{"sense": "to fasten something with a key, or to be fastened with a key", "level": "B1", "dict_examp": "Don't forget to lock the door when you go out.", "lear_examp": "Yesterday at about 11:10 p.m. I went to lock my garage."}, {"sense": "to put something or someone in a place or container that is fastened with a key", "level": "C2", "dict_examp": "The jewelry is locked away in a safe.", "lear_examp": "With large sums of money locked away in their banks, they decided to destroy the notes in they made during the discovery, to prevent any thieves from stealing the secret."}, {"sense": "to prevent someone from leaving or prevent others from entering a room or building by locking a door", "level": "B2", "dict_examp": "She locked herself in her bedroom.", "lear_examp": "My mother was about to die from her agony while my father was trying to find a way to lock me in."}, {"sense": "to prevent someone from entering a room or building by locking a door", "level": "B2", "dict_examp": "I can't believe I've locked myself out again!", "lear_examp": "In the very early morning, my husband and I heard a lot of noise at the front door and I went to see if Kate was locked out."}]}]}, {"word": "long-running", "poses": [{"pos": "adjective", "senses": [{"sense": "having continued for a long time", "level": "C2", "dict_examp": "a long-running musical", "lear_examp": ""}]}]}, {"word": "long", "poses": [{"pos": "adjective", "senses": [{"sense": "continuing for a large amount of time", "level": "A1", "dict_examp": "a long movie/meeting", "lear_examp": "I want to eat food from Brazil because I have lived in England for a long time and I am missing food from my country."}, {"sense": "having a large distance from one end to the other", "level": "A1", "dict_examp": "long hair", "lear_examp": "I like to go for a long walk."}, {"sense": "describes a piece of writing which has a lot of pages or words", "level": "A2", "dict_examp": "a long letter/book/report", "lear_examp": "Thank you for your long letter, it was very interesting."}]}, {"pos": "adverb", "senses": [{"sense": "for a long time", "level": "A2", "dict_examp": "I'm just writing a letter but it won't take long.", "lear_examp": "It doesn't last longer than 45 minutes."}, {"sense": "for the whole day", "level": "B1", "dict_examp": "We've been walking all day long.", "lear_examp": "We talked all day long, about many things."}, {"sense": "used to say that something must happen before something else can happen", "level": "B1", "dict_examp": "I can come as long as I can leave by 4:00.", "lear_examp": "The colors I wear are not important, as long as I don't wear any pink clothes. I really dislike that color."}, {"sense": "in the past but not now", "level": "B1", "dict_examp": "The theater is no longer used.", "lear_examp": "The main reason is that my wife got pregnant and therefore a one-bedroom house is no longer suitable for us."}, {"sense": "soon", "level": "B2", "dict_examp": "They'll be home before very long.", "lear_examp": "Before long they realized that most of the animals which lived there could be big business in Europe."}, {"sense": "for a long time", "level": "C1", "dict_examp": "We didn't have to wait for long.", "lear_examp": "My parents generation, however, would not identify with this lifestyle for long."}]}, {"pos": "adverb", "senses": [{"sense": "for a long time", "level": "A2", "dict_examp": "I'm just writing a letter but it won't take long.", "lear_examp": "It doesn't last longer than 45 minutes."}, {"sense": "for the whole day", "level": "B1", "dict_examp": "We've been walking all day long.", "lear_examp": "Oh, I almost forgot to tell you about my Japanese stones where I listen to music all day long."}, {"sense": "used to say that something must happen before something else can happen", "level": "B1", "dict_examp": "I can come as long as I can leave by 4.00.", "lear_examp": "The colours I wear are not important, as long as I don't wear any pink clothes. I really dislike that colour."}, {"sense": "in the past but not now", "level": "B1", "dict_examp": "The cinema is no longer used.", "lear_examp": "The main reason is that my wife got pregnant and therefore a one-bedroom house is no longer suitable for us."}, {"sense": "soon", "level": "B2", "dict_examp": "They'll be home before very long.", "lear_examp": "Before long they realized that most of the animals which lived there could be big business in Europe."}, {"sense": "If something happened long ago, it happened a great amount of time ago.", "level": "C1", "dict_examp": "I think we met once, long ago.", "lear_examp": "Not so long ago, you could ring each Dutch doorbell of your choice at 6 pm and you'd find the whole family gathered around the kitchen table, having their supper."}, {"sense": "a long period of time before something", "level": "C2", "dict_examp": "I was a vegetarian long before I met Sally.", "lear_examp": "The cups belonged to my family long before I was born and the fact they are a part of my family tradition makes them valuable in my eyes."}]}, {"pos": "verb", "senses": [{"sense": "to want something very much", "level": "C2", "dict_examp": "She longed to see him again.", "lear_examp": "Of course I longed for my home and missed my relatives and friends, but I was so excited by everything the exchange could offer that I cannot recall any really sad day during my stay in Germany."}]}]}, {"word": "long term", "poses": [{"pos": "noun", "senses": [{"sense": "over a period of time that continues a long way into the future", "level": "B2", "dict_examp": "This decision may make financial sense now, but it will have serious consequences in the long term.", "lear_examp": "I understand this is a big investment but I can see the advantage of easier communication and a better environment. In the long term this will be more economical for us."}]}]}, {"word": "look", "poses": [{"pos": "verb", "senses": [{"sense": "to turn your eyes in the direction of something or someone so that you can see them", "level": "A1", "dict_examp": "Look! There's grandma.", "lear_examp": "I like walking around these lakes and looking at the ducks and swans."}, {"sense": "to try to find someone or something", "level": "A1", "dict_examp": "I'm looking for my keys.", "lear_examp": "I am looking for a new T-shirt."}, {"sense": "used to describe the appearance of a person or thing", "level": "A2", "dict_examp": "That food looks nice.", "lear_examp": "Well, the paint I am going to use is light pink as it will look nice."}, {"sense": "used to describe the appearance of a person or thing", "level": "B1", "dict_examp": "He looked like a nice guy.", "lear_examp": "It was dark on the street but I remember what the thief looked like."}, {"sense": "used to say that something is likely to happen", "level": "B1", "dict_examp": "It looks as if there'll only be three of us going on Sunday.", "lear_examp": "It's cold and I think I will have to buy an umbrella because it looks as if it'll rain."}, {"sense": "used to describe the appearance of a person or thing", "level": "B2", "dict_examp": "Bradley looked as if he had seen a ghost.", "lear_examp": "The dress is made of bright blue silk, it's long and looks as if it was made for a queen."}, {"sense": "to face a particular direction", "level": "B2", "dict_examp": "The garden looks south.", "lear_examp": "I would like a room which looks out onto the garden."}, {"sense": "to find good things in a bad situation", "level": "C1", "dict_examp": "Look on the bright side - no one was badly hurt.", "lear_examp": "I am quite self-confident and I usually look on the bright side, as I am not interested in pessimistic thoughts."}, {"sense": "to plan to do something", "level": "C2", "dict_examp": "I'm looking to start my own business.", "lear_examp": ""}, {"sense": "to take care of someone or something by keeping them healthy or in good condition", "level": "A2", "dict_examp": "We look after our neighbors' cat while they're away.", "lear_examp": "They didn't go with us because they had to look after their children."}, {"sense": "to think about what will happen in the future and plan for these events", "level": "C2", "dict_examp": "I'm looking ahead to next year and figuring out our staffing needs.", "lear_examp": "One must always look ahead to the future and try to progress."}, {"sense": "to visit a place and look at the things in it", "level": "B1", "dict_examp": "It's such a beautiful city, it's a shame we didn't have more time to look around.", "lear_examp": "There are lots of museums in our city and you can enjoy looking around some of them."}, {"sense": "to think about a subject carefully so that you can make a decision about it", "level": "B2", "dict_examp": "Management is looking at ways of cutting costs.", "lear_examp": "I think we should look at this problem in a wider way."}, {"sense": "to read something in order to check it or form an opinion about it", "level": "B2", "dict_examp": "Can you look at my essay sometime?", "lear_examp": "I was sitting in our coffee-room at school, looking at my homework while waiting for someone else to show up."}, {"sense": "If someone, usually an expert, looks at something, they examine it.", "level": "B2", "dict_examp": "Did you get the doctor to look at your knee?", "lear_examp": ""}, {"sense": "to think about something that happened in the past", "level": "B2", "dict_examp": "Looking back, I can see where we went wrong.", "lear_examp": "When I look back on the summer we spent together, I feel miserable and sometimes I burst into tears."}, {"sense": "to think that someone is less important than you", "level": "B2", "dict_examp": "I always felt she looked down on me because I wasn't as educated as she was.", "lear_examp": "They never humiliate or look down on you just because you are a foreigner."}, {"sense": "to feel happy and excited about something that is going to happen", "level": "B1", "dict_examp": "I'm really looking forward to my vacation.", "lear_examp": "I'm looking forward to seeing you soon."}, {"sense": "used at the end of a formal letter to say you hope to hear from or see someone soon, or that you expect something from them", "level": "B2", "dict_examp": "I look forward to hearing from you.", "lear_examp": "I look forward to hearing from you."}, {"sense": "to examine the facts about a situation", "level": "B2", "dict_examp": "We're looking into the possibility of merging the two departments.", "lear_examp": "Moreover, if we look into the matter in a conscious way, we can easily notice that we are leaving our forests and nature, in general, without any wild animals whatsoever."}, {"sense": "to consider someone or something in a particular way", "level": "C1", "dict_examp": "We looked on her as a daughter.", "lear_examp": "In some cases this can be looked upon as an asset."}, {"sense": "something you say when someone is in danger", "level": "B1", "dict_examp": "Look out - there's a car coming!", "lear_examp": "\"Look out, it's very dangerous\"."}, {"sense": "to examine something quickly", "level": "C1", "dict_examp": "I'm just looking over what you've written.", "lear_examp": "I looked over the paper I had been given."}, {"sense": "to read something", "level": "B2", "dict_examp": "I've looked through a few catalogues.", "lear_examp": "So I suggest you look through that magazine in order to find something else that interests you."}, {"sense": "to try to find a piece of information by looking in a book or on a computer", "level": "B1", "dict_examp": "If you don't know what the word means, look it up in a dictionary.", "lear_examp": "If you have unfamiliar words, you can look up these words in a dictionary."}, {"sense": "to become better", "level": "C1", "dict_examp": "Our financial situation is looking up.", "lear_examp": "The business is looking up and I have to cook many more things."}, {"sense": "to respect and admire someone", "level": "B2", "dict_examp": "She really looks up to her father.", "lear_examp": "Nowadays people in Sweden and all over the world are looking up to Zlatan, and many young boys from his area in Sweden see him as a role model."}]}, {"pos": "noun", "senses": [{"sense": "when you look at someone or something", "level": "B1", "dict_examp": "She gave him a look of real dislike.", "lear_examp": "I went to have a look and I was very surprised!"}, {"sense": "when you look for someone or something", "level": "B1", "dict_examp": "I had another look for the watch, but couldn't find it.", "lear_examp": "Should I have a look for cheap hotels?"}, {"sense": "an expression on someone's face", "level": "B2", "dict_examp": "She had a worried look about her.", "lear_examp": "China was attacking France, everyone started screaming, and the look of panic on my history teacher's face was almost funny."}, {"sense": "the appearance of someone or something", "level": "B2", "dict_examp": "They liked the look of the hotel, but it was too expensive.", "lear_examp": "We have to make it more attractive to them by improving the look of our town."}, {"sense": "a style or fashion", "level": "C1", "dict_examp": "thenew look for the summer", "lear_examp": "Shopping ... gives you a feeling of being in another world, a world where dreams can come true - dreams of becoming more beautiful by buying new clothes and accessories for the new look you have always wanted."}, {"sense": "a person's appearance, especially how attractive they are", "level": "C2", "dict_examp": "I was attracted to him because of his looks.", "lear_examp": "At last, she arrived in time for the ball held that night, and everybody was charmed by her looks and manners."}]}]}, {"word": "loft", "poses": [{"pos": "noun", "senses": [{"sense": "the space under the roof of a house, often used for storing things", "level": "C2", "dict_examp": "We keep things like suitcases and holiday decorations in the loft.", "lear_examp": "It has lots of room - two bedrooms, a spacious living room, a kitchen that's well lit and even a loft for storage."}, {"sense": "a large, open apartment, often in a former industrial building", "level": "C2", "dict_examp": "They've bought a loft downtown that has huge windows.", "lear_examp": ""}, {"sense": "a small room under a high ceiling that has only three walls and overlooks a larger room below", "level": "C2", "dict_examp": "We use the loft as a library and guest room.", "lear_examp": "What is extra (and makes it unique in this street) is the downstairs shower room, separate utility room and very large loft room."}]}]}, {"word": "longevity", "poses": [{"pos": "noun", "senses": [{"sense": "having a long life", "level": "C2", "dict_examp": "To what do you attribute your longevity?", "lear_examp": "The problem does not end there, as the unemployed present a strain on the social welfare systems, which are already overtaxed due to sinking birth numbers and rising longevity."}]}]}, {"word": "logic", "poses": [{"pos": "noun", "senses": [{"sense": "the use of reason, or the science of using reason", "level": "C1", "dict_examp": "I fail to see the logic of his argument.", "lear_examp": "It lacked any logic or interest for me."}]}]}, {"word": "long-distance", "poses": [{"pos": "adjective", "senses": [{"sense": "traveling or communicating between two places that are a long way apart", "level": "B2", "dict_examp": "a long-distance runner", "lear_examp": "I've also made some long-distance calls which I'd like to pay for."}]}]}, {"word": "long-term", "poses": [{"pos": "adjective", "senses": [{"sense": "continuing a long time into the future", "level": "B2", "dict_examp": "long-term unemployment", "lear_examp": "I was deeply impressed by the long-term cooperation between the zoo and the school."}]}]}, {"word": "log", "poses": [{"pos": "noun", "senses": [{"sense": "a thick piece of tree trunk or branch, especially one cut for burning on a fire", "level": "C1", "dict_examp": "Let's put another log on the fire.", "lear_examp": "People used to cook with fire logs but they don't do it any more."}]}, {"pos": "verb", "senses": [{"sense": "to start using a computer or to connect a computer to a system of computers by typing a password and sometimes your name", "level": "B2", "dict_examp": "I tried to log on as usual but nothing happened.", "lear_examp": "Well you need a computer and you have to log on to the Internet."}, {"sense": "to stop using a computer or program or to stop a computer being connected to a computer system", "level": "B2", "dict_examp": "We were all asked to log off while some changes were made to the system.", "lear_examp": "I know that most students just log off the computers, but they are still switched on and use energy."}]}]}, {"word": "lose", "poses": [{"pos": "verb", "senses": [{"sense": "to not be able to find someone or something", "level": "A2", "dict_examp": "I've lost my passport.", "lear_examp": "I think that I lost my ring."}, {"sense": "to stop having something that you had before", "level": "B1", "dict_examp": "Many people will lose their jobs if the comapny goes out of business.", "lear_examp": "Actually, I lost my job last week."}, {"sense": "to fail to succeed in a game, competition, etc.", "level": "B1", "dict_examp": "If we lose this game, we're out of the championship.", "lear_examp": "We were in the final, but we lost it."}, {"sense": "to have less of something than you had before", "level": "B1", "dict_examp": "I'm trying to lose weight.", "lear_examp": "I want to borrow your bicycle because I am getting fat and I need it to do some training to lose weight."}, {"sense": "to die", "level": "B2", "dict_examp": "Millions of young men lost their lives in the war.", "lear_examp": "A man who has experience after a lot of years driving is less likely to lose his life in an accident than another new driver."}, {"sense": "to stop feeling something good", "level": "B2", "dict_examp": "I'm rapidly losing interest in the whole subject.", "lear_examp": "Moreover the microphone suddenly wouldn't work anymore, and even though I desperately tried to speak up, people began to lose interest in both my speech and me and simply started to talk to each other instead."}, {"sense": "to suddenly become angry", "level": "B2", "dict_examp": "When I feel like I'm about to lose my temper, I just leave the room.", "lear_examp": "Yesterday, I must confess, I lost my temper with my son."}, {"sense": "to waste something such as time or an opportunity", "level": "B2", "dict_examp": "Four million hours at work were lost last year through stress-related illnesses.", "lear_examp": "You lose a lot of time when you have to find a place to park."}, {"sense": "to stop communicating with someone, usually because they do not live near you now", "level": "B2", "dict_examp": "We lost touch over the years.", "lear_examp": "Without a computer and a telephone, I can't contact her easily and I may lose touch with her."}, {"sense": "to not know what is happening to someone or something any more", "level": "B2", "dict_examp": "I've lost track of how much we've spent.", "lear_examp": "And, do you remember the time we went for a walk and lost track of time?"}, {"sense": "to become unable to speak, often because of an illness", "level": "B2", "dict_examp": "She had a bad cold and was losing her voice.", "lear_examp": "I immediately became agitated and at the precise moment of my speech I lost my voice completely."}, {"sense": "to make less money than you spend", "level": "C1", "dict_examp": "He lost a lot of money when he sold his house.", "lear_examp": "The reported information about the income was completely wrong; in fact, the target figure we had set has been fully reached and this obviously means that the hospital didn't lose any money."}, {"sense": "to fall because you are leaning too much to one side", "level": "C1", "dict_examp": "He lost his balance and fell down the stairs.", "lear_examp": "The most exciting part was when we accidently hit a rock and I lost my balance and fell into the cold water."}, {"sense": "to stop being calm in a difficult situation", "level": "C1", "dict_examp": "I saw the fire and I lost my head.", "lear_examp": "She has never lost her head in dangerous situations and she always knows what to do."}, {"sense": "to become less respected by others because of  something you did", "level": "C2", "dict_examp": "She had to find a way to accept defeat without losing face.", "lear_examp": "However, many popular people like Pierce Brosnan managed to keep their lives out of the press and yet be present to meet public demand without losing face."}, {"sense": "to suddenly become very angry", "level": "C2", "dict_examp": "She lost her cool and started shouting.", "lear_examp": ""}, {"sense": "to forget how many of something there is", "level": "C2", "dict_examp": "I've lost count of how many of times she's been late.", "lear_examp": "I lost count of how often I heard this sentence when I used to work for a drug company."}, {"sense": "to forget about an important idea or fact because you are thinking too much about other, less important things", "level": "C2", "dict_examp": "We mustn't lose sight of the original aims of this project.", "lear_examp": "Little do we realize that in the process we lose sight of the fundamentals, which in this case is the protection of our environment."}, {"sense": "to worry about something", "level": "C2", "dict_examp": "I know she's angry with me, but I'm not losing any sleep over it.", "lear_examp": "There was just one house, a magnificent mansion behind a high fence, that bothered me a bit. No one from there came to meet me. But in the hassle of the first few weeks I was simply too busy to lose any sleep over it."}]}]}, {"word": "look", "poses": [{"pos": "verb", "senses": [{"sense": "to turn your eyes in the direction of something or someone so that you can see them", "level": "A1", "dict_examp": "Look! There's grandma.", "lear_examp": "I like walking around these lakes and looking at the ducks and swans."}, {"sense": "to try to find someone or something", "level": "A1", "dict_examp": "I'm looking for my keys.", "lear_examp": "I am looking for a new T-shirt."}, {"sense": "used to describe the appearance of a person or thing", "level": "A2", "dict_examp": "That food looks nice.", "lear_examp": "Well, the paint I am going to use is light pink as it will look nice."}, {"sense": "used to describe the appearance of a person or thing", "level": "B1", "dict_examp": "He looked like a nice guy.", "lear_examp": "It was dark on the street but I remember what the thief looked like."}, {"sense": "used to say that something is likely to happen", "level": "B1", "dict_examp": "It looks as if there'll only be three of us going on Sunday.", "lear_examp": "It's cold and I think I will have to buy an umbrella because it looks as if it'll rain."}, {"sense": "used to describe the appearance of a person or thing", "level": "B2", "dict_examp": "Bradley looked as if he had seen a ghost.", "lear_examp": "The dress is made of bright blue silk, it's long and looks as if it was made for a queen."}, {"sense": "to face a particular direction", "level": "B2", "dict_examp": "The garden looks south.", "lear_examp": "I would like a room which looks out onto the garden."}, {"sense": "to find good things in a bad situation", "level": "C1", "dict_examp": "Look on the bright side - no one was badly hurt.", "lear_examp": "I am quite self-confident and I usually look on the bright side, as I am not interested in pessimistic thoughts."}, {"sense": "to plan to do something", "level": "C2", "dict_examp": "I'm looking to start my own business.", "lear_examp": ""}, {"sense": "to take care of someone or something by keeping them healthy or in good condition", "level": "A2", "dict_examp": "We look after our neighbors' cat while they're away.", "lear_examp": "They didn't go with us because they had to look after their children."}, {"sense": "to think about what will happen in the future and plan for these events", "level": "C2", "dict_examp": "I'm looking ahead to next year and figuring out our staffing needs.", "lear_examp": "One must always look ahead to the future and try to progress."}, {"sense": "to visit a place and look at the things in it", "level": "B1", "dict_examp": "It's such a beautiful city, it's a shame we didn't have more time to look around.", "lear_examp": "There are lots of museums in our city and you can enjoy looking around some of them."}, {"sense": "to think about a subject carefully so that you can make a decision about it", "level": "B2", "dict_examp": "Management is looking at ways of cutting costs.", "lear_examp": "I think we should look at this problem in a wider way."}, {"sense": "to read something in order to check it or form an opinion about it", "level": "B2", "dict_examp": "Can you look at my essay sometime?", "lear_examp": "I was sitting in our coffee-room at school, looking at my homework while waiting for someone else to show up."}, {"sense": "If someone, usually an expert, looks at something, they examine it.", "level": "B2", "dict_examp": "Did you get the doctor to look at your knee?", "lear_examp": ""}, {"sense": "to think about something that happened in the past", "level": "B2", "dict_examp": "Looking back, I can see where we went wrong.", "lear_examp": "When I look back on the summer we spent together, I feel miserable and sometimes I burst into tears."}, {"sense": "to think that someone is less important than you", "level": "B2", "dict_examp": "I always felt she looked down on me because I wasn't as educated as she was.", "lear_examp": "They never humiliate or look down on you just because you are a foreigner."}, {"sense": "to feel happy and excited about something that is going to happen", "level": "B1", "dict_examp": "I'm really looking forward to my vacation.", "lear_examp": "I'm looking forward to seeing you soon."}, {"sense": "used at the end of a formal letter to say you hope to hear from or see someone soon, or that you expect something from them", "level": "B2", "dict_examp": "I look forward to hearing from you.", "lear_examp": "I look forward to hearing from you."}, {"sense": "to examine the facts about a situation", "level": "B2", "dict_examp": "We're looking into the possibility of merging the two departments.", "lear_examp": "Moreover, if we look into the matter in a conscious way, we can easily notice that we are leaving our forests and nature, in general, without any wild animals whatsoever."}, {"sense": "to consider someone or something in a particular way", "level": "C1", "dict_examp": "We looked on her as a daughter.", "lear_examp": "In some cases this can be looked upon as an asset."}, {"sense": "something you say when someone is in danger", "level": "B1", "dict_examp": "Look out - there's a car coming!", "lear_examp": "\"Look out, it's very dangerous\"."}, {"sense": "to examine something quickly", "level": "C1", "dict_examp": "I'm just looking over what you've written.", "lear_examp": "I looked over the paper I had been given."}, {"sense": "to read something", "level": "B2", "dict_examp": "I've looked through a few catalogues.", "lear_examp": "So I suggest you look through that magazine in order to find something else that interests you."}, {"sense": "to try to find a piece of information by looking in a book or on a computer", "level": "B1", "dict_examp": "If you don't know what the word means, look it up in a dictionary.", "lear_examp": "If you have unfamiliar words, you can look up these words in a dictionary."}, {"sense": "to become better", "level": "C1", "dict_examp": "Our financial situation is looking up.", "lear_examp": "The business is looking up and I have to cook many more things."}, {"sense": "to respect and admire someone", "level": "B2", "dict_examp": "She really looks up to her father.", "lear_examp": "Nowadays people in Sweden and all over the world are looking up to Zlatan, and many young boys from his area in Sweden see him as a role model."}]}, {"pos": "noun", "senses": [{"sense": "when you look at someone or something", "level": "B1", "dict_examp": "She gave him a look of real dislike.", "lear_examp": "I went to have a look and I was very surprised!"}, {"sense": "when you look for someone or something", "level": "B1", "dict_examp": "I had another look for the watch, but couldn't find it.", "lear_examp": "Should I have a look for cheap hotels?"}, {"sense": "an expression on someone's face", "level": "B2", "dict_examp": "She had a worried look about her.", "lear_examp": "China was attacking France, everyone started screaming, and the look of panic on my history teacher's face was almost funny."}, {"sense": "the appearance of someone or something", "level": "B2", "dict_examp": "They liked the look of the hotel, but it was too expensive.", "lear_examp": "We have to make it more attractive to them by improving the look of our town."}, {"sense": "a style or fashion", "level": "C1", "dict_examp": "thenew look for the summer", "lear_examp": "Shopping ... gives you a feeling of being in another world, a world where dreams can come true - dreams of becoming more beautiful by buying new clothes and accessories for the new look you have always wanted."}, {"sense": "a person's appearance, especially how attractive they are", "level": "C2", "dict_examp": "I was attracted to him because of his looks.", "lear_examp": "At last, she arrived in time for the ball held that night, and everybody was charmed by her looks and manners."}]}]}, {"word": "loss", "poses": [{"pos": "noun", "senses": [{"sense": "when you no longer have something or have less of something", "level": "B2", "dict_examp": "Many parents feel a sense of loss when their children leave home.", "lear_examp": "I had been working on this manuscript for an article in a computer magazine on the topic \"How to prevent loss of data if the electric power is cut off.\""}, {"sense": "the death of a person", "level": "B2", "dict_examp": "They never got over the loss of their son.", "lear_examp": "And so John remained alone, haunted by the terrible loss."}, {"sense": "when a business spends more money than it earns", "level": "C1", "dict_examp": "The company’s losses over the last few years have been staggering.", "lear_examp": "It suffered a major loss over a period of 15 years, roughly from 1978 to 1994."}, {"sense": "a disadvantage caused by someone leaving an organization", "level": "C2", "dict_examp": "It would be a great loss to the department if you left.", "lear_examp": "It will be a great loss for Germany when he retires."}, {"sense": "not knowing what to do", "level": "C2", "dict_examp": "I'm at a loss to explain his disappearance.", "lear_examp": "And now I am completely at a loss what to write next."}, {"sense": "not knowing what to say", "level": "C2", "dict_examp": "The question was unexpected and she was temporarily at a loss for words.", "lear_examp": "If it was James I would be at a loss for words, I didn't know what to tell him."}]}]}, {"word": "loom", "poses": [{"pos": "verb", "senses": [{"sense": "to appear as a large, sometimes frightening shape", "level": "C2", "dict_examp": "Dark storm clouds loomed on the horizon.", "lear_examp": "Situated in the heart of Salford's concrete slum, the old soap factory loomed before him."}, {"sense": "If an unpleasant event looms, it is likely to happen soon.", "level": "C2", "dict_examp": "The threat of closure looms over the workforce.", "lear_examp": "Unless steps are taken soon, the future will continue to loom less assured."}, {"sense": "If something looms large, it becomes very important and often causes worry.", "level": "C2", "dict_examp": "The issue of pay will loom large at this year's conference.", "lear_examp": "It was, she dreaded to admit, a sense of regret. She shock her head as if doing so shooed the feeling away.  On the contrary, however, it was looming large while she was stamping along the busy street."}]}]}, {"word": "loose", "poses": [{"pos": "adjective", "senses": [{"sense": "large and not fitting tightly", "level": "B1", "dict_examp": "Wear comfortable, loose clothing to your exercise class.", "lear_examp": "I even like wearing loose T-shirts."}, {"sense": "not firmly attached in place", "level": "B2", "dict_examp": "I’d better sew that loose button before it comes off.", "lear_examp": "I now wear my long hair loose and I have dyed it black."}, {"sense": "not tightly controlled or not exact", "level": "C2", "dict_examp": "It's a fairly loose adaptation of the novel.", "lear_examp": ""}]}]}, {"word": "loosen", "poses": [{"pos": "verb", "senses": [{"sense": "to become loose or make something loose", "level": "C2", "dict_examp": "He loosened his tie.", "lear_examp": "Do we not want our children to be as happy as possible? By loosening their ropes, we enable them to choose the way most suitable for themselves."}, {"sense": "to become more relaxed with other people", "level": "C2", "dict_examp": "After a while he loosened up.", "lear_examp": "What is sure is that one needs to find something that will make him loosen up."}]}]}, {"word": "luckily", "poses": [{"pos": "adverb", "senses": [{"sense": "in a lucky way", "level": "B1", "dict_examp": "Luckily, I had some money with me.", "lear_examp": "Luckily, the weather was nice."}]}]}, {"word": "lost", "poses": [{"pos": "adjective", "senses": [{"sense": "not knowing where you are or where you should go", "level": "A2", "dict_examp": "I got lost driving home.", "lear_examp": "I hope you don't get lost!"}, {"sense": "If something is lost, no one knows where it is.", "level": "B1", "dict_examp": "a lost book", "lear_examp": "He went to that tree and there it was, the lost suitcase."}, {"sense": "to be unable to live or work without someone or something", "level": "C1", "dict_examp": "She's lost without her computer.", "lear_examp": "It showed us how we would be lost without this transportation system."}, {"sense": "not knowing what to do in a new situation", "level": "C1", "dict_examp": "It was his first day in the office and he seemed a bit lost.", "lear_examp": "I would recommend a visit to a restaurant or the theater the first evening. I can imagine that some of the guests felt a bit lost."}]}]}, {"word": "lover", "poses": [{"pos": "noun", "senses": [{"sense": "If two people are lovers, they have a romantic or physical relationship.", "level": "B1", "dict_examp": "They were friends before they became lovers.", "lear_examp": "I was reading \"Romeo and Juliet\" by W. Shakespeare when I suddenly decided to leave and visit Verona, the lovers' city."}, {"sense": "someone who is very interested in books, cats, dogs, etc.", "level": "B1", "dict_examp": "an  opera lover", "lear_examp": "Brazil is a very big country and perfect for nature lovers."}]}]}, {"word": "loss", "poses": [{"pos": "noun", "senses": [{"sense": "when you no longer have something or have less of something", "level": "B2", "dict_examp": "Many parents feel a sense of loss when their children leave home.", "lear_examp": "I had been working on this manuscript for an article in a computer magazine on the topic \"How to prevent loss of data if the electric power is cut off.\""}, {"sense": "the death of a person", "level": "B2", "dict_examp": "They never got over the loss of their son.", "lear_examp": "And so John remained alone, haunted by the terrible loss."}, {"sense": "when a business spends more money than it earns", "level": "C1", "dict_examp": "The company’s losses over the last few years have been staggering.", "lear_examp": "It suffered a major loss over a period of 15 years, roughly from 1978 to 1994."}, {"sense": "a disadvantage caused by someone leaving an organization", "level": "C2", "dict_examp": "It would be a great loss to the department if you left.", "lear_examp": "It will be a great loss for Germany when he retires."}, {"sense": "not knowing what to do", "level": "C2", "dict_examp": "I'm at a loss to explain his disappearance.", "lear_examp": "And now I am completely at a loss what to write next."}, {"sense": "not knowing what to say", "level": "C2", "dict_examp": "The question was unexpected and she was temporarily at a loss for words.", "lear_examp": "If it was James I would be at a loss for words, I didn't know what to tell him."}]}]}, {"word": "loyal", "poses": [{"pos": "adjective", "senses": [{"sense": "always liking and supporting someone or something, sometimes when other people do not", "level": "B2", "dict_examp": "Jack has been a loyal employee in this company for almost 50 years.", "lear_examp": "One of the most beautiful things in the world is true and loyal friendship."}]}]}, {"word": "lower", "poses": [{"pos": "verb", "senses": [{"sense": "to move something into a low position", "level": "B2", "dict_examp": "I lowered the blinds to block out the afternoon sun.", "lear_examp": "But when she asked who wanted to be a cleaner, nobody raised his hand and I felt so ashamed that I lowered my head."}, {"sense": "to reduce the amount or level of something", "level": "B2", "dict_examp": "Interest rates have been lowered again.", "lear_examp": "This should be done by lowering taxes and preparing other incentives for potential investors."}]}]}, {"word": "lucky", "poses": [{"pos": "adjective", "senses": [{"sense": "having good things happen to you by chance", "level": "A2", "dict_examp": "\"I'm going on vacation.\" \"Lucky you!\"", "lear_examp": "Maybe we will be lucky and have good weather."}, {"sense": "If an object is lucky, some people believe that it gives you luck.", "level": "B1", "dict_examp": "I chose six - it's my lucky number.", "lear_examp": "I lost my lucky pencil."}]}]}, {"word": "loudly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that makes a lot of noise", "level": "B1", "dict_examp": "They were all talking loudly.", "lear_examp": "The only thing is that he fell asleep at the end of the day and he was snoring loudly!"}]}]}, {"word": "loud", "poses": [{"pos": "adjective", "senses": [{"sense": "making a lot of noise", "level": "A2", "dict_examp": "a loud noise/voice", "lear_examp": "We were dancing then the police arrived, because of the loud music."}]}, {"pos": "adverb", "senses": [{"sense": "loudly", "level": "B1", "dict_examp": "Could you speak a little louder, please?", "lear_examp": "I cried louder."}, {"sense": "If you say or read something out loud, you say or read it so that other people can hear you.", "level": "B1", "dict_examp": "I had to read the essay out loud in front of the whole school.", "lear_examp": "She wouldn't accept it so I read it out loud for her to hear: \"Director, Jason Meyer, and producer, Sami Woods, are receiving...\"."}]}]}, {"word": "lovely", "poses": [{"pos": "adjective", "senses": [{"sense": "pleasant or enjoyable", "level": "B2", "dict_examp": "We had a lovely time in Greece.", "lear_examp": "I had a lovely time there."}, {"sense": "attractive and beautiful", "level": "B2", "dict_examp": "You look lovely in that dress.", "lear_examp": "The best time of the year would be spring because the weather will be warmer and there will be a lot of lovely flowers and the view on the mountains will be great."}]}]}, {"word": "lounge", "poses": [{"pos": "noun", "senses": [{"sense": "a room in a hotel, theater, school, etc., where people can relax or wait", "level": "C1", "dict_examp": "a faculty lounge", "lear_examp": "In the central lounge you'll find an automatic bus ticket machine."}]}]}, {"word": "lottery", "poses": [{"pos": "noun", "senses": [{"sense": "a system for selling numbered tickets to people who then have a chance of winning a prize if their number is chosen", "level": "B1", "dict_examp": "Even if she won the lottery, Paige says she’d still keep her job.", "lear_examp": "I got a phone call from a lottery company and they said I had won the lottery with a 100 million dollar prize."}]}]}, {"word": "lucrative", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is lucrative, it results in a lot of money.", "level": "C2", "dict_examp": "a lucrative contract/job/offer", "lear_examp": "It is no secret that many youngsters want a lucrative job, which would allow them to make money hand over fist."}]}]}, {"word": "low", "poses": [{"pos": "adjective", "senses": [{"sense": "small in amount, size or level", "level": "A2", "dict_examp": "low temperatures", "lear_examp": "There were beautiful clothes for low prices."}, {"sense": "not high", "level": "B1", "dict_examp": "a low fence", "lear_examp": "When I stay at home, I wear jeans, t-shirts, low shoes."}, {"sense": "of bad quality, especially when referring to something that is not as good as it should be", "level": "B2", "dict_examp": "low standards/quality", "lear_examp": "However, it is necessary to add that few people could afford much food because of poverty and the low quality of life which they had."}, {"sense": "deep or quiet", "level": "B2", "dict_examp": "a low voice", "lear_examp": "Right after I had said that, I noticed that someone was pointing at me with a gun, and a low voice said: \"If I were you I wouldn't move, follow me.\""}, {"sense": "not important or powerful", "level": "C1", "dict_examp": "low rank/status", "lear_examp": "Luminaries claim that the team spirit and the sense of competition have vanished, and it has been proven that exercise has a low priority compared to other recreational activities."}, {"sense": "unhappy and without energy", "level": "C1", "dict_examp": "She’s feeling pretty low because she failed her driver’s test.", "lear_examp": "She never feels low and I am in high spirits being with her because she has got a sense of humor."}, {"sense": "to try not to be noticed", "level": "C1", "dict_examp": "She has kept a low profile since the divorce.", "lear_examp": "Finally, I believe that the best way to handle these issues is to try to keep a low profile at all times and to remain indifferent to gossip."}]}, {"pos": "adverb", "senses": [{"sense": "at or to a small amount or level", "level": "B1", "dict_examp": "Temperatures can fall as low as -20 degrees.", "lear_examp": "The lights are down low."}]}]}, {"word": "luck", "poses": [{"pos": "noun", "senses": [{"sense": "good and bad things caused by chance and not by your own actions", "level": "A2", "dict_examp": "It was just by luck that she got the job.", "lear_examp": "Good luck to you."}, {"sense": "success", "level": "B2", "dict_examp": "I’ve got a job interview today, so wish me luck.", "lear_examp": "As you might suppose, I couldn't believe my luck when I found out that I'd won first prize in the competition."}, {"sense": "to be lucky or to be able to have or do what you want", "level": "C1", "dict_examp": "\"Do you have any tuna sandwiches?\" \"You're in luck - there's one left.\"", "lear_examp": "I was in luck, because my friend, who lived in the same area, had his private car and gave me a lift every day."}, {"sense": "something good that happens to you by chance", "level": "C2", "dict_examp": "He had exactly the part that I needed so that was a stroke of luck.", "lear_examp": "After a one-hour interview she was asked whether she could start work the very next day. A real stroke of luck."}]}]}, {"word": "love", "poses": [{"pos": "verb", "senses": [{"sense": "to like something very much", "level": "A1", "dict_examp": "She loves animals.", "lear_examp": "I love skiing."}, {"sense": "to like a friend or a person in your family very much", "level": "A1", "dict_examp": "He loves his kids.", "lear_examp": "I love my son and my girlfriend."}, {"sense": "to like someone very much and have romantic feelings for them", "level": "A1", "dict_examp": "Last night he told me he loved me.", "lear_examp": "Stan is from Poland.  He is my husband. I love him."}, {"sense": "used to say that you would very much like something", "level": "A2", "dict_examp": "I'd love some chocolate right now!", "lear_examp": "I'd love some chops and beer."}, {"sense": "used to say that you would very much like to do something that someone has suggested", "level": "A2", "dict_examp": "\"Would you like to come to the concert with us?\" \"I'd love to.\"", "lear_examp": "Yes, I'd love to come with you."}]}, {"pos": "noun", "senses": [{"sense": "something you write at the end of a letter, e-mail, etc. to a friend or someone in your family", "level": "A2", "dict_examp": "Love, Mom", "lear_examp": "Lots of love,"}, {"sense": "when you like a friend or person in your family very much", "level": "B1", "dict_examp": "Nothing is as strong as the love you have for your kids.", "lear_examp": "Give my love to your family. All the best,"}, {"sense": "when you like someone very much and have romantic feelings for them", "level": "B1", "dict_examp": "He's madly in love with her.", "lear_examp": "I fell in love with him."}, {"sense": "a person that you love and feel attracted to", "level": "B1", "dict_examp": "He was the love of my life.", "lear_examp": "It was from the love of my life."}, {"sense": "something that interests you a lot", "level": "B2", "dict_examp": "I don't share my brother's love of sports.", "lear_examp": "Both of them symbolize courage, love of justice, fight for freedom, which makes them look like heroes."}, {"sense": "an activity that is hard work but which you do because you enjoy it", "level": "C2", "dict_examp": "He prefers to paint the house himself - it's a labor of love.", "lear_examp": ""}]}]}, {"word": "loyalty", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being loyal", "level": "B2", "dict_examp": "His loyalty was never in question.", "lear_examp": "What I can say is that pets are ideal when they obey and show loyalty to you."}]}]}, {"word": "lot", "poses": [{"pos": "noun", "senses": [{"sense": "a large amount or number of people or things", "level": "A1", "dict_examp": "She eats lots of fruit.", "lear_examp": "She has a lot of flowers in her room."}, {"sense": "very much or very often", "level": "A1", "dict_examp": "Your sister looks a lot like you.", "lear_examp": "I like to study a lot."}]}]}, {"word": "lunchtime", "poses": [{"pos": "noun", "senses": [{"sense": "the time when lunch is eaten", "level": "A2", "dict_examp": "It'll be lunchtime soon.", "lear_examp": "Please telephone me at home at lunchtime."}]}]}, {"word": "lung", "poses": [{"pos": "noun", "senses": [{"sense": "one of the two organs inside your chest that are used for breathing", "level": "B2", "dict_examp": "lung cancer", "lear_examp": "People suffering from lung diseases go there to be cured."}]}]}, {"word": "luxury", "poses": [{"pos": "noun", "senses": [{"sense": "great comfort or pleasure from expensive or beautiful things", "level": "B1", "dict_examp": "a luxury cruise", "lear_examp": "I'm staying in a luxury hotel overlooking the sea."}, {"sense": "something which gives you a lot of pleasure but which you cannot often do or have", "level": "B2", "dict_examp": "A day off work is such a luxury.", "lear_examp": "I think that to have this museum is a luxury for our city and we must visit it."}, {"sense": "something expensive which is pleasant to have but is not necessary", "level": "C1", "dict_examp": "luxuries, such as champagne and chocolate", "lear_examp": "At the time, the majority of consumers had no money to spend on luxuries."}]}]}, {"word": "luggage", "poses": [{"pos": "noun", "senses": [{"sense": "suitcases and other bags that you carry with you when you are traveling", "level": "A2", "dict_examp": "Never leave your luggage unattended.", "lear_examp": "My hotel is near the airport, so it was easy for me to come here with my luggage."}]}]}, {"word": "luxurious", "poses": [{"pos": "adjective", "senses": [{"sense": "very comfortable and expensive", "level": "C1", "dict_examp": "They have a very luxurious house.", "lear_examp": "As far as the hotel is concerned, I feel that it wasn't a luxurious one."}]}]}, {"word": "lyrics", "poses": [{"pos": "noun", "senses": [{"sense": "the words of a song", "level": "B2", "dict_examp": "I've downloaded the lyrics of that song you like.", "lear_examp": "One of the greatest of these musicians is Caetano Veloso, whose lyrics and melodies touch the hearts and souls of music lovers in Brazil and all around the world."}]}]}, {"word": "lump", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of a solid substance with no particular shape", "level": "C2", "dict_examp": "a lump of coal", "lear_examp": "He bent down to pick it up and saw it was a lump of concrete."}, {"sense": "to make you feel such strong emotion that you want to cry", "level": "C2", "dict_examp": "It was a very moving speech, and it brought a lump to my throat.", "lear_examp": "This devastating image brought a lump to John's throat."}]}]}, {"word": "lure", "poses": [{"pos": "verb", "senses": [{"sense": "to persuade someone to go somewhere or do something by offering them something exciting", "level": "C2", "dict_examp": "It seems that he was lured into a trap.", "lear_examp": "Some of the children are lured to the big cities, in expectation of work."}]}, {"pos": "noun", "senses": [{"sense": "the power to attract people", "level": "C2", "dict_examp": "the lure of fame/power/money", "lear_examp": "Some have offered the lure of losing weight within a very few days, by the means of miraculously easy techniques."}]}]}, {"word": "lumber", "poses": [{"pos": "noun", "senses": [{"sense": "wood cut into sizes to be used for building", "level": "C2", "dict_examp": "We can buy most of the lumber precut to the lengths we will need.", "lear_examp": "Soon afterward, he established his own lumber company, and started to import wood items from the United States."}]}]}, {"word": "lunch", "poses": [{"pos": "noun", "senses": [{"sense": "a meal that is eaten in the middle of the day", "level": "A1", "dict_examp": "What's for lunch?", "lear_examp": "We met in Bristol, and we had beer and a light lunch."}]}]}]