[{"word": "magnetic", "poses": [{"pos": "adjective", "senses": [{"sense": "having  a thin coat of material that is able to electrically store information", "level": "C1", "dict_examp": "Your account information is on the magnetic strip on the back of your debit card.", "lear_examp": "75% of the staff suggested that the keys be changed for magnetic keys, that don't need to be left in reception when the client goes out."}, {"sense": "having a character that attracts people to you", "level": "C1", "dict_examp": "He has a magnetic personality.", "lear_examp": "Ivan has a magnetic personality, which draws people to him."}, {"sense": "able to attract and stick to iron or steel objects or cause this to happen", "level": "C2", "dict_examp": "This note pad is magnetic, so you can stick it on your refrigerator.", "lear_examp": "The glass shutter doors are broken and the door latch is also not working anymore since the magnetic stopper came unstuck during transit."}]}]}, {"word": "main course", "poses": [{"pos": "noun", "senses": [{"sense": "the largest or most important part of a meal", "level": "A2", "dict_examp": "I had salmon for my main course.", "lear_examp": "The main course could be fish or meat with vegetables."}]}]}, {"word": "magnificent", "poses": [{"pos": "adjective", "senses": [{"sense": "very good or very  beautiful", "level": "B1", "dict_examp": "a magnificent view", "lear_examp": "Next, we went to a forest. In the middle was a lake and the sight was magnificent."}]}]}, {"word": "mainly", "poses": [{"pos": "adverb", "senses": [{"sense": "mostly or to a large degree", "level": "B1", "dict_examp": "The waitresses are mainly French.", "lear_examp": "I often wear jeans, mainly blue jeans."}]}]}, {"word": "mainstream", "poses": [{"pos": "adjective", "senses": [{"sense": "considered normal, and having or using ideas, beliefs, etc. which are accepted by most people", "level": "C2", "dict_examp": "This is the director's first mainstream Hollywood film.", "lear_examp": "The media source and its credibility play a major role in determining the objectivity and realistic portrayal although there have been cases where even mainstream publications have participated in manipulative alterations."}]}]}, {"word": "magical", "poses": [{"pos": "adjective", "senses": [{"sense": "special and exciting", "level": "B2", "dict_examp": "It was a magical night.", "lear_examp": "I think you should go to Cracow - a beautiful, old city with original, historical monuments, works of art and many cafes and jazz clubs with a magical atmosphere."}, {"sense": "with special powers that make impossible things happen", "level": "B2", "dict_examp": "magical powers", "lear_examp": "We cherish the belief in a magical force outside ourselves, which sooner or later will deliver us these dreams."}]}]}, {"word": "madam", "poses": [{"pos": "noun", "senses": [{"sense": "a formal and polite way of speaking to a woman", "level": "B1", "dict_examp": "Can I help you, madam?", "lear_examp": "An old woman came in the shop and quietly put my suitcase near to me and she said \"Excuse me, Madam, it's your suitcase. I saw somebody take it."}, {"sense": "a way of beginning a formal letter to a woman whose name you do not know", "level": "B2", "dict_examp": "Dear Madam, I am writing to inform you...", "lear_examp": "Dear Sir or Madam, With reference to your newspaper report of 17th July, I am writing to correct some points in this report."}]}]}, {"word": "machinery", "poses": [{"pos": "noun", "senses": [{"sense": "machines, often large machines", "level": "C1", "dict_examp": "industrial/farm machinery", "lear_examp": "Many pieces of machinery used in the production line do not necessarily have to be functioning the entire time."}]}]}, {"word": "main", "poses": [{"pos": "adjective", "senses": [{"sense": "most important or largest", "level": "B1", "dict_examp": "The main airport is 15 miles from the capital.", "lear_examp": "However, the main reason, I must admit, was that I wanted to meet new people, make new friends and the college is the best place for meeting interesting people."}, {"sense": "the most important fact in a situation", "level": "B2", "dict_examp": "You're happy and that's the main thing.", "lear_examp": "The main thing is to be happy and to love yourself."}]}]}, {"word": "magic", "poses": [{"pos": "noun", "senses": [{"sense": "special powers that can make things happen that seem impossible", "level": "A2", "dict_examp": "Do you believe in magic?", "lear_examp": "I liked very much the book about magic."}, {"sense": "skillful  tricks that are done to entertain people, such as making things appear and disappear and pretending to cut someone in half", "level": "A2", "dict_examp": "He's a comedian who also does magic.", "lear_examp": "There is a magic show every day, I think you must go there once."}, {"sense": "a quality that makes something or someone seem special or exciting", "level": "B2", "dict_examp": "No one could fail to enjoy the magic of this wonderful city.", "lear_examp": "But everyone was thinking of the elections and couldn't feel the \"magic\" of Christmas Day..."}]}, {"pos": "adjective", "senses": [{"sense": "relating to skillful tricks done to entertain people", "level": "A2", "dict_examp": "a magic show", "lear_examp": "After that a magician showed us a lot of magic tricks."}, {"sense": "with special powers that make impossible things happen", "level": "B1", "dict_examp": "The witch put a magic spell on the prince and turned him into a frog.", "lear_examp": ""}]}]}, {"word": "machine", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment with several moving parts which uses power to do a particular type of work", "level": "A2", "dict_examp": "a washing machine", "lear_examp": "I want to sell the washing machine."}]}]}, {"word": "magazine", "poses": [{"pos": "noun", "senses": [{"sense": "a thin book published every week or month, that has shiny, colorful pages with articles and pictures", "level": "A2", "dict_examp": "She has written articles for several women's magazines.", "lear_examp": "At the party, Maria, Paula, Marissa and I read magazines, talked about boys and played games."}]}]}, {"word": "make", "poses": [{"pos": "verb", "senses": [{"sense": "to produce or create something", "level": "A1", "dict_examp": "Shall I make some coffee?", "lear_examp": "You can make a quick snack, for example a sandwich."}, {"sense": "to be produced from a substance or material", "level": "A2", "dict_examp": "Butter is made from milk.", "lear_examp": "It is made of gold."}, {"sense": "to perform an action", "level": "A2", "dict_examp": "I must make a telephone call.", "lear_examp": "I think I made a good choice."}, {"sense": "to take action so that you are certain that something happens", "level": "A2", "dict_examp": "I'll just make sure I've turned the oven off.", "lear_examp": "So please make sure that you wear old clothes."}, {"sense": "to cause something to happen or cause a particular state", "level": "B1", "dict_examp": "What made you change your mind?", "lear_examp": "It's so funny and it makes me laugh."}, {"sense": "to force someone or something to do something", "level": "B1", "dict_examp": "I made him clean his room.", "lear_examp": "I could make him wait a little."}, {"sense": "to make a decision", "level": "B1", "dict_examp": "I haven't made up my mind whether to apply for the job yet.", "lear_examp": "The place was so dirty that I made up my mind to change it by buying something useful."}, {"sense": "to manage to arrive at a place", "level": "B1", "dict_examp": "I'm afraid I can't make the meeting this afternoon.", "lear_examp": "Respected Madam, I'm sorry that I can't make it to the English class tomorrow as I have a high temperature."}, {"sense": "to show with your face that you do not like someone or something", "level": "B1", "dict_examp": "Joe made a face when he saw what was for lunch.", "lear_examp": "Making a face, I slapped my forehead."}, {"sense": "to begin to know and like someone", "level": "B1", "dict_examp": "He finds it difficult to make friends.", "lear_examp": "Although I didn't know anyone in this club, I immediately made friends with Maria and Rosaria."}, {"sense": "to earn", "level": "B2", "dict_examp": "She makes around  $80,000 a year as a doctor.", "lear_examp": "The truth is that our grandparents worked very hard to make a living."}, {"sense": "to put sheets and covers on a bed or to make the sheets and covers on a bed neat", "level": "B2", "dict_examp": "Did you make the bed?", "lear_examp": "Driving through the mountains we didn't reach the cabin until late at night.  So we just made the beds and went off to sleep."}, {"sense": "to take full advantage of something because it may not last long", "level": "B2", "dict_examp": "We should make the most of this good weather.", "lear_examp": "Remember, always try to make the most of your life."}, {"sense": "to try to be positive about a situation you do not like but cannot change", "level": "B2", "dict_examp": "Our hotel room is pretty small, but we'll just have to make the best of it.", "lear_examp": "Unfortunately I don't have very much spare time so we will have to arrange it carefully in order to make the best of your time in London."}, {"sense": "to improve a situation (a lot)", "level": "B2", "dict_examp": "Exercise can make a big difference to your health.", "lear_examp": "It wouldn't make a big difference in my life, but it would be good."}, {"sense": "to make a situation more difficult, unpleasant, etc.", "level": "B2", "dict_examp": "To make matters worse, our car broke down!", "lear_examp": "To make matters worse, the newspaper said they only played for thirty-five minutes."}, {"sense": "to make someone look stupid intentionally", "level": "B2", "dict_examp": "She was always trying to make a fool out of me in front of my friends.", "lear_examp": "He thought I had tried to make a fool of him but no, I was really desperate to get him as my boyfriend."}, {"sense": "to behave in a silly or embarrassing way", "level": "B2", "dict_examp": "I got very excited  and made a fool of myself.", "lear_examp": "I had to leave that shop in full embarrassment and I also made a fool of myself."}, {"sense": "to make a joke about someone or something in an unkind way", "level": "B2", "dict_examp": "The other children at school used to make fun of his hair.", "lear_examp": "I didn't want to tell other people because I didn't want them to make fun of me."}, {"sense": "to have a meaning or reason that you can understand", "level": "B2", "dict_examp": "He's written me this note but it doesn't make any sense.", "lear_examp": "All these words might not make sense but this is the story of how we felt."}, {"sense": "to be a good thing to do", "level": "B2", "dict_examp": "It makes sense to buy now while prices are low.", "lear_examp": "Therefore it makes sense to use the innovations."}, {"sense": "to leave enough time to do something although you are busy", "level": "C1", "dict_examp": "You have to make time to do your homework.", "lear_examp": "I'm terribly sorry for not being able to make time to pick you up when you arrive."}, {"sense": "to have the necessary qualities to become something", "level": "C1", "dict_examp": "He would make a really good dad.", "lear_examp": "That is why I think I would make a good judge."}, {"sense": "to be successful", "level": "C1", "dict_examp": "Very few actors actually make it.", "lear_examp": "People who belong to this social group are much more determined to \"make it\" in life."}, {"sense": "to have just enough money to pay for the things that you need", "level": "C1", "dict_examp": "I had to get a second job just to make ends meet.", "lear_examp": "Most students support themselves and barely make ends meet every month."}, {"sense": "to behave in a relaxed way in a place, as if it was your own home", "level": "C1", "dict_examp": "Take off your coat and make yourself at home.", "lear_examp": "Please relax and make yourself at home and help yourself."}, {"sense": "to write down information about something", "level": "C1", "dict_examp": "Let me make a note of your phone number.", "lear_examp": "After talking to other members, I have made a note of the main problems they considered the most urgent to be solved."}, {"sense": "to say something to someone in a way that they understand", "level": "C1", "dict_examp": "I had a little difficulty making myself understood.", "lear_examp": "(Find enclosed a paper slip on which I have written a destination, number of tickets, etc., in the German language - use it just in case you can't make yourselves understood.)"}, {"sense": "to mention only the final result or point of something without going into other details", "level": "C1", "dict_examp": "To make a long story short, he never played baseball again.", "lear_examp": "To make a long story short, my mother turned out to be an understanding person."}, {"sense": "to use something that is less good than you would like", "level": "C2", "dict_examp": "If we can't get a bigger room we'll have to make do with this.", "lear_examp": "Very calmly, he said \"I am not going to put up with this. You might say that I am being too emotional, overreacting, whatever. But I will not come back until my piano has been returned.  And let me make very clear that I will not make do with another instrument.\""}, {"sense": "to talk or behave as if you do not think a problem is serious", "level": "C2", "dict_examp": "I just laughed and tried to make light of it.", "lear_examp": "They project an optimistic image and make light of the troubles in life."}, {"sense": "to remember that someone has a disadvantage which is not their fault when you are judging their behavior or work", "level": "C2", "dict_examp": "They made allowances for the fact that he was ill.", "lear_examp": "I would say Mr. Stevens is a victim of his sense of duty, which makes him think of marriage as a traitor's act, but I don't know to what extent we should make allowances for his strong convictions."}, {"sense": "If something makes your blood run cold, it frightens you very much.", "level": "C2", "dict_examp": "I heard a tapping on the window which made my blood run cold.", "lear_examp": "This thought scared me and made my blood run cold."}, {"sense": "to make you extremely angry", "level": "C2", "dict_examp": "The way they have treated those people makes my blood boil.", "lear_examp": "Paul said something repulsive, with a cold light in his eyes, and it made her blood boil."}, {"sense": "to make someone very happy", "level": "C2", "dict_examp": "Seeing those little kids having so much fun just made my day.", "lear_examp": "Thank you for returning my lost diary; you have made my day!"}, {"sense": "to talk or behave as if you do not think a problem is serious", "level": "C2", "dict_examp": "I just laughed and tried to make light of it.", "lear_examp": "They project an optimistic image and make light of the troubles in life."}, {"sense": "to become famous or respected by a lot of people", "level": "C2", "dict_examp": "He's been trying to make a name for himself in the music business.", "lear_examp": "Secondly, only a few sportsmen and sportswomen manage to make a name for themselves and get to the top."}, {"sense": "to have a strong effect on other people", "level": "C2", "dict_examp": "The new police chief has really made his presence felt.", "lear_examp": "Before long a local bicycle gang was formed which would ride all over the village, through fields and gardens, making our presence felt."}, {"sense": "to suddenly run fast in order to escape from somewhere", "level": "C2", "dict_examp": "When he saw the open door, he made a run for it.", "lear_examp": "Anna and Tom decided to make a run for it."}, {"sense": "to cause problems by asking difficult questions or criticizing", "level": "C2", "dict_examp": "He has earned a reputation for making waves during political campaigns.", "lear_examp": "If we don't want to regret anything, it is time we started to make waves by scrutinizing our history."}, {"sense": "to be successful and make progress in your work", "level": "C2", "dict_examp": "He managed to make his way in the film industry.", "lear_examp": "For each one of the famous sportsmen we recognize on television or in the newspapers, there are thousands of hopeful youngsters trying to make their way to the top."}, {"sense": "to be replaced by someone or something", "level": "C2", "dict_examp": "They knocked down the old houses to make way for a new hotel.", "lear_examp": "Local markets are broken down to make way for shopping malls, which sell items for the brand conscious population of today."}, {"sense": "to understand something that is difficult to understand", "level": "C2", "dict_examp": "I'm trying to make sense of this document.", "lear_examp": "In fact, it's during his journey that Stevens begins to make sense of his life, of all the years he spent as a butler, as the \"perfect butler\" who had to be loyal, silent and discreet."}, {"sense": "to get a lot of public attention", "level": "C2", "dict_examp": "The movie made quite a splash in the US.", "lear_examp": "Moreover, it is no use splashing your money around on expensive gifts because this behavior shows that you are not happy but your purpose is to make a splash."}, {"sense": "to move toward a place", "level": "B2", "dict_examp": "He got up and made for the exit.", "lear_examp": "We might take a rest at the Frene Hotel and after having visited the Butterfly Farm, we will make for the Lakeside Inn."}, {"sense": "to change something into something else", "level": "B2", "dict_examp": "They've made the spare room into an office.", "lear_examp": "Sometimes people don't bother to read a book because it has been made into a film or a series."}, {"sense": "If you ask someone what they make of someone or something, you want to know their opinion about that person or thing.", "level": "C2", "dict_examp": "What do you make of this letter?", "lear_examp": "At first we did not know what to make of it and we were all dumbfounded; but later we realized that it was none other than the Icelandic lady out there on our lawn."}, {"sense": "to be able to see, hear or understand something or someone but with difficulty", "level": "B2", "dict_examp": "We could just make out a building through the trees.", "lear_examp": "Somebody was standing outside, but she couldn't make out who it could be."}, {"sense": "to say or write something that is not true", "level": "B2", "dict_examp": "I made up an excuse about having to look after the kids.", "lear_examp": "Donald made up the best story."}, {"sense": "to reduce the bad effect of something, or make something bad become something good", "level": "B2", "dict_examp": "No amount of money can make up for the death of a child.", "lear_examp": "I really want to make up for the broken vase, but I am not sure if you will like my choice."}]}]}, {"word": "ma'am", "poses": [{"pos": "noun", "senses": [{"sense": "a polite way of speaking to a woman", "level": "B1", "dict_examp": "Can I help you, ma’am?", "lear_examp": "Ma'am, I am sorry to say that I will not be able to attend tomorrow's English class."}]}]}, {"word": "maintenance", "poses": [{"pos": "noun", "senses": [{"sense": "the work needed to keep a road, building, machine, etc. in good condition", "level": "B2", "dict_examp": "car maintenance classes", "lear_examp": "Many people can't afford to have a car as maintenance is very expensive."}]}]}, {"word": "mail", "poses": [{"pos": "noun", "senses": [{"sense": "letters and packages that are delivered to homes, places of  work, etc.", "level": "A2", "dict_examp": "Did the mail come yet? / Was the mail delivered yet?", "lear_examp": "I check my mail every day and I hoped to have a letter from you sooner than this."}, {"sense": "the public system by which letters and packages are sent and delivered", "level": "A2", "dict_examp": "You will be sent your test results by mail.", "lear_examp": "Dear Carol, I've forgotten my palm top at your house, you can  send it to me by mail."}, {"sense": "e-mail", "level": "A2", "dict_examp": "I just want to check my mail before I turn off the computer.", "lear_examp": "When I came back home from school, I immediately checked my hotmail account to see if any mail from my friend had arrived."}]}, {"pos": "verb", "senses": [{"sense": "to send a letter or package by mail", "level": "B1", "dict_examp": "Did you remember to mail me that letter  / to mail that letter to me?", "lear_examp": "I already asked a friend of mine to pass me the notes and to mail me the homework."}]}]}, {"word": "mad", "poses": [{"pos": "adjective", "senses": [{"sense": "angry", "level": "A2", "dict_examp": "Are you still mad at me?", "lear_examp": "I'm not mad because you missed my party."}, {"sense": "to love someone or something", "level": "B1", "dict_examp": "They only met a month ago but he's mad about her.", "lear_examp": "You know, I hate pink, but my mother is really mad about pink."}, {"sense": "mentally ill", "level": "B1", "dict_examp": "I think I must be going mad.", "lear_examp": "The movie was about a guy that was mad."}, {"sense": "a lot", "level": "B2", "dict_examp": "The band practiced like mad before their first concert.", "lear_examp": "It was raining like mad, so we were wet to the skin."}]}]}, {"word": "magnificently", "poses": [{"pos": "adverb", "senses": [{"sense": "extremely well", "level": "C1", "dict_examp": "I thought she coped magnificently.", "lear_examp": "This small drawback did not affect either the dance display or the horse show, which were both performed magnificently."}]}]}, {"word": "major", "poses": [{"pos": "adjective", "senses": [{"sense": "more important, bigger or more serious than others of the same type", "level": "B2", "dict_examp": "This is a major problem for people in this region.", "lear_examp": "Some major changes are really necessary."}]}, {"pos": "noun", "senses": [{"sense": "the most important subject that a college or university student studies, or a student studying that subject", "level": "B2", "dict_examp": "What's your major?", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to study something as your main subject in college or a university", "level": "B2", "dict_examp": "She majored in earth sciences at Arizona State.", "lear_examp": "I have majored in English for four years."}]}]}, {"word": "maintain", "poses": [{"pos": "verb", "senses": [{"sense": "to make a situation or activity continue in the same way", "level": "B2", "dict_examp": "The army has been brought in to maintain order in the region.", "lear_examp": "If this not is possible he should work less hard in order to maintain his health."}, {"sense": "to keep a road, machine, building, etc. in good condition", "level": "B2", "dict_examp": "A large house costs a lot to maintain.", "lear_examp": "Due to my education and my experience in maintaining machines, I am sure that I can do a good job in your club."}, {"sense": "to say that you are certain something is true", "level": "C2", "dict_examp": "She maintains that she’s being criticized simply for telling the truth.", "lear_examp": "Moreover, sceptics maintain that the lack of facilities and jobs leads to the countryside being \"abandoned.\""}]}]}, {"word": "majority", "poses": [{"pos": "noun", "senses": [{"sense": "more than half of a group of people or things", "level": "B2", "dict_examp": "The majority of our employees have university degrees.", "lear_examp": "However the majority of the teachers found that buying movies was not a good idea."}]}]}, {"word": "management", "poses": [{"pos": "noun", "senses": [{"sense": "the control and organization of something", "level": "B2", "dict_examp": "The company has suffered from several years of bad management.", "lear_examp": "I also know the basic rules of good management."}]}]}, {"word": "mammal", "poses": [{"pos": "noun", "senses": [{"sense": "an animal that feeds its babies on milk from its body", "level": "C1", "dict_examp": "Dolphins and other sea mammals are being harmed by waste in the oceans.", "lear_examp": "To admire some of the sea mammals, like the dolphins and the whales, the best possible spot would be a small, isolated Aegean isle."}]}]}, {"word": "maker", "poses": [{"pos": "noun", "senses": [{"sense": "the person or company that makes a product", "level": "B2", "dict_examp": "They're the biggest maker of fast-food products in the country.", "lear_examp": "NISSAN is a famous Japanese car maker as you know."}]}]}, {"word": "malicious", "poses": [{"pos": "adjective", "senses": [{"sense": "intended to harm or upset someone", "level": "C2", "dict_examp": "malicious gossip", "lear_examp": "If malicious teasing is tolerated, the whole school will be affected in a negative way and nobody will feel safe and self-confident."}]}]}, {"word": "manage", "poses": [{"pos": "verb", "senses": [{"sense": "to do something or deal with something successfully", "level": "B1", "dict_examp": "Did you manage to get any bread?", "lear_examp": "I even phoned the bus company but I didn't manage to get the CDs back."}, {"sense": "to be in control of an office, store, team, etc.", "level": "B1", "dict_examp": "She used to manage the bookstore on King Street.", "lear_examp": "The English club is a student club which is managed by students aged from 13 to 20 who would like to improve their English."}, {"sense": "to use or organize your time or money", "level": "C1", "dict_examp": "He's no good at managing his money.", "lear_examp": "London is the third most expensive city in the world after Tokyo and N.Y., so you will have to manage your money quite carefully."}]}]}, {"word": "male", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging to or relating to the sex that cannot have babies", "level": "B1", "dict_examp": "a male colleague", "lear_examp": "I was there when I heard a male voice calling me."}]}, {"pos": "noun", "senses": [{"sense": "a male person or animal", "level": "B2", "dict_examp": "In 1987, 27 percent of adult males smoked.", "lear_examp": "I am a 30-year old Swedish male with a diploma in gardening."}]}]}, {"word": "make", "poses": [{"pos": "verb", "senses": [{"sense": "to produce or create something", "level": "A1", "dict_examp": "Shall I make some coffee?", "lear_examp": "You can make a quick snack, for example a sandwich."}, {"sense": "to be produced from a substance or material", "level": "A2", "dict_examp": "Butter is made from milk.", "lear_examp": "It is made of gold."}, {"sense": "to perform an action", "level": "A2", "dict_examp": "I must make a telephone call.", "lear_examp": "I think I made a good choice."}, {"sense": "to take action so that you are certain that something happens", "level": "A2", "dict_examp": "I'll just make sure I've turned the oven off.", "lear_examp": "So please make sure that you wear old clothes."}, {"sense": "to cause something to happen or cause a particular state", "level": "B1", "dict_examp": "What made you change your mind?", "lear_examp": "It's so funny and it makes me laugh."}, {"sense": "to force someone or something to do something", "level": "B1", "dict_examp": "I made him clean his room.", "lear_examp": "I could make him wait a little."}, {"sense": "to make a decision", "level": "B1", "dict_examp": "I haven't made up my mind whether to apply for the job yet.", "lear_examp": "The place was so dirty that I made up my mind to change it by buying something useful."}, {"sense": "to manage to arrive at a place", "level": "B1", "dict_examp": "I'm afraid I can't make the meeting this afternoon.", "lear_examp": "Respected Madam, I'm sorry that I can't make it to the English class tomorrow as I have a high temperature."}, {"sense": "to show with your face that you do not like someone or something", "level": "B1", "dict_examp": "Joe made a face when he saw what was for lunch.", "lear_examp": "Making a face, I slapped my forehead."}, {"sense": "to begin to know and like someone", "level": "B1", "dict_examp": "He finds it difficult to make friends.", "lear_examp": "Although I didn't know anyone in this club, I immediately made friends with Maria and Rosaria."}, {"sense": "to earn", "level": "B2", "dict_examp": "She makes around  $80,000 a year as a doctor.", "lear_examp": "The truth is that our grandparents worked very hard to make a living."}, {"sense": "to put sheets and covers on a bed or to make the sheets and covers on a bed neat", "level": "B2", "dict_examp": "Did you make the bed?", "lear_examp": "Driving through the mountains we didn't reach the cabin until late at night.  So we just made the beds and went off to sleep."}, {"sense": "to take full advantage of something because it may not last long", "level": "B2", "dict_examp": "We should make the most of this good weather.", "lear_examp": "Remember, always try to make the most of your life."}, {"sense": "to try to be positive about a situation you do not like but cannot change", "level": "B2", "dict_examp": "Our hotel room is pretty small, but we'll just have to make the best of it.", "lear_examp": "Unfortunately I don't have very much spare time so we will have to arrange it carefully in order to make the best of your time in London."}, {"sense": "to improve a situation (a lot)", "level": "B2", "dict_examp": "Exercise can make a big difference to your health.", "lear_examp": "It wouldn't make a big difference in my life, but it would be good."}, {"sense": "to make a situation more difficult, unpleasant, etc.", "level": "B2", "dict_examp": "To make matters worse, our car broke down!", "lear_examp": "To make matters worse, the newspaper said they only played for thirty-five minutes."}, {"sense": "to make someone look stupid intentionally", "level": "B2", "dict_examp": "She was always trying to make a fool out of me in front of my friends.", "lear_examp": "He thought I had tried to make a fool of him but no, I was really desperate to get him as my boyfriend."}, {"sense": "to behave in a silly or embarrassing way", "level": "B2", "dict_examp": "I got very excited  and made a fool of myself.", "lear_examp": "I had to leave that shop in full embarrassment and I also made a fool of myself."}, {"sense": "to make a joke about someone or something in an unkind way", "level": "B2", "dict_examp": "The other children at school used to make fun of his hair.", "lear_examp": "I didn't want to tell other people because I didn't want them to make fun of me."}, {"sense": "to have a meaning or reason that you can understand", "level": "B2", "dict_examp": "He's written me this note but it doesn't make any sense.", "lear_examp": "All these words might not make sense but this is the story of how we felt."}, {"sense": "to be a good thing to do", "level": "B2", "dict_examp": "It makes sense to buy now while prices are low.", "lear_examp": "Therefore it makes sense to use the innovations."}, {"sense": "to leave enough time to do something although you are busy", "level": "C1", "dict_examp": "You have to make time to do your homework.", "lear_examp": "I'm terribly sorry for not being able to make time to pick you up when you arrive."}, {"sense": "to have the necessary qualities to become something", "level": "C1", "dict_examp": "He would make a really good dad.", "lear_examp": "That is why I think I would make a good judge."}, {"sense": "to be successful", "level": "C1", "dict_examp": "Very few actors actually make it.", "lear_examp": "People who belong to this social group are much more determined to \"make it\" in life."}, {"sense": "to have just enough money to pay for the things that you need", "level": "C1", "dict_examp": "I had to get a second job just to make ends meet.", "lear_examp": "Most students support themselves and barely make ends meet every month."}, {"sense": "to behave in a relaxed way in a place, as if it was your own home", "level": "C1", "dict_examp": "Take off your coat and make yourself at home.", "lear_examp": "Please relax and make yourself at home and help yourself."}, {"sense": "to write down information about something", "level": "C1", "dict_examp": "Let me make a note of your phone number.", "lear_examp": "After talking to other members, I have made a note of the main problems they considered the most urgent to be solved."}, {"sense": "to say something to someone in a way that they understand", "level": "C1", "dict_examp": "I had a little difficulty making myself understood.", "lear_examp": "(Find enclosed a paper slip on which I have written a destination, number of tickets, etc., in the German language - use it just in case you can't make yourselves understood.)"}, {"sense": "to mention only the final result or point of something without going into other details", "level": "C1", "dict_examp": "To make a long story short, he never played baseball again.", "lear_examp": "To make a long story short, my mother turned out to be an understanding person."}, {"sense": "to use something that is less good than you would like", "level": "C2", "dict_examp": "If we can't get a bigger room we'll have to make do with this.", "lear_examp": "Very calmly, he said \"I am not going to put up with this. You might say that I am being too emotional, overreacting, whatever. But I will not come back until my piano has been returned.  And let me make very clear that I will not make do with another instrument.\""}, {"sense": "to talk or behave as if you do not think a problem is serious", "level": "C2", "dict_examp": "I just laughed and tried to make light of it.", "lear_examp": "They project an optimistic image and make light of the troubles in life."}, {"sense": "to remember that someone has a disadvantage which is not their fault when you are judging their behavior or work", "level": "C2", "dict_examp": "They made allowances for the fact that he was ill.", "lear_examp": "I would say Mr. Stevens is a victim of his sense of duty, which makes him think of marriage as a traitor's act, but I don't know to what extent we should make allowances for his strong convictions."}, {"sense": "If something makes your blood run cold, it frightens you very much.", "level": "C2", "dict_examp": "I heard a tapping on the window which made my blood run cold.", "lear_examp": "This thought scared me and made my blood run cold."}, {"sense": "to make you extremely angry", "level": "C2", "dict_examp": "The way they have treated those people makes my blood boil.", "lear_examp": "Paul said something repulsive, with a cold light in his eyes, and it made her blood boil."}, {"sense": "to make someone very happy", "level": "C2", "dict_examp": "Seeing those little kids having so much fun just made my day.", "lear_examp": "Thank you for returning my lost diary; you have made my day!"}, {"sense": "to talk or behave as if you do not think a problem is serious", "level": "C2", "dict_examp": "I just laughed and tried to make light of it.", "lear_examp": "They project an optimistic image and make light of the troubles in life."}, {"sense": "to become famous or respected by a lot of people", "level": "C2", "dict_examp": "He's been trying to make a name for himself in the music business.", "lear_examp": "Secondly, only a few sportsmen and sportswomen manage to make a name for themselves and get to the top."}, {"sense": "to have a strong effect on other people", "level": "C2", "dict_examp": "The new police chief has really made his presence felt.", "lear_examp": "Before long a local bicycle gang was formed which would ride all over the village, through fields and gardens, making our presence felt."}, {"sense": "to suddenly run fast in order to escape from somewhere", "level": "C2", "dict_examp": "When he saw the open door, he made a run for it.", "lear_examp": "Anna and Tom decided to make a run for it."}, {"sense": "to cause problems by asking difficult questions or criticizing", "level": "C2", "dict_examp": "He has earned a reputation for making waves during political campaigns.", "lear_examp": "If we don't want to regret anything, it is time we started to make waves by scrutinizing our history."}, {"sense": "to be successful and make progress in your work", "level": "C2", "dict_examp": "He managed to make his way in the film industry.", "lear_examp": "For each one of the famous sportsmen we recognize on television or in the newspapers, there are thousands of hopeful youngsters trying to make their way to the top."}, {"sense": "to be replaced by someone or something", "level": "C2", "dict_examp": "They knocked down the old houses to make way for a new hotel.", "lear_examp": "Local markets are broken down to make way for shopping malls, which sell items for the brand conscious population of today."}, {"sense": "to understand something that is difficult to understand", "level": "C2", "dict_examp": "I'm trying to make sense of this document.", "lear_examp": "In fact, it's during his journey that Stevens begins to make sense of his life, of all the years he spent as a butler, as the \"perfect butler\" who had to be loyal, silent and discreet."}, {"sense": "to get a lot of public attention", "level": "C2", "dict_examp": "The movie made quite a splash in the US.", "lear_examp": "Moreover, it is no use splashing your money around on expensive gifts because this behavior shows that you are not happy but your purpose is to make a splash."}, {"sense": "to move toward a place", "level": "B2", "dict_examp": "He got up and made for the exit.", "lear_examp": "We might take a rest at the Frene Hotel and after having visited the Butterfly Farm, we will make for the Lakeside Inn."}, {"sense": "to change something into something else", "level": "B2", "dict_examp": "They've made the spare room into an office.", "lear_examp": "Sometimes people don't bother to read a book because it has been made into a film or a series."}, {"sense": "If you ask someone what they make of someone or something, you want to know their opinion about that person or thing.", "level": "C2", "dict_examp": "What do you make of this letter?", "lear_examp": "At first we did not know what to make of it and we were all dumbfounded; but later we realized that it was none other than the Icelandic lady out there on our lawn."}, {"sense": "to be able to see, hear or understand something or someone but with difficulty", "level": "B2", "dict_examp": "We could just make out a building through the trees.", "lear_examp": "Somebody was standing outside, but she couldn't make out who it could be."}, {"sense": "to say or write something that is not true", "level": "B2", "dict_examp": "I made up an excuse about having to look after the kids.", "lear_examp": "Donald made up the best story."}, {"sense": "to reduce the bad effect of something, or make something bad become something good", "level": "B2", "dict_examp": "No amount of money can make up for the death of a child.", "lear_examp": "I really want to make up for the broken vase, but I am not sure if you will like my choice."}]}]}, {"word": "makeup", "poses": [{"pos": "noun", "senses": [{"sense": "colored substances used on your face to improve or change your appearance", "level": "A2", "dict_examp": "She wears a lot of makeup.", "lear_examp": "I like the bag because is very big.  I can put all my makeup in."}]}]}, {"word": "man", "poses": [{"pos": "noun", "senses": [{"sense": "an adult male human being", "level": "A1", "dict_examp": "a young/tall man", "lear_examp": "He's a very good man."}, {"sense": "used to refer to both men and women", "level": "B2", "dict_examp": "Man is still more intelligent than the cleverest robot.", "lear_examp": "Man must create the conditions so that animals can live, eat and procreate without strain."}]}]}, {"word": "mall", "poses": [{"pos": "noun", "senses": [{"sense": "a large, usually covered, shopping area where cars are not allowed", "level": "B1", "dict_examp": "There are plans to build a new mall in the middle of town.", "lear_examp": "You can go shopping too because there is a nice shopping mall in Punta del Este."}]}]}, {"word": "manual", "poses": [{"pos": "adjective", "senses": [{"sense": "involving physical work rather than mental work", "level": "B2", "dict_examp": "unskilled manual labor", "lear_examp": "But, on the other hand, I sometimes think that this technology is the cause of the end of certain activities such as farming, or manual work."}, {"sense": "done or operated with the hands", "level": "B2", "dict_examp": "the manual sorting of letters", "lear_examp": "It has both manual and automatic functions so it has a lot of possibilities."}]}, {"pos": "noun", "senses": [{"sense": "a book that tells you how to use something or do something", "level": "B2", "dict_examp": "You can download the manual for the computer if you need to.", "lear_examp": "Now I need to read some manuals at work."}]}]}, {"word": "manager", "poses": [{"pos": "noun", "senses": [{"sense": "someone in control of an office, shop, team, etc.", "level": "A2", "dict_examp": "a bank manager", "lear_examp": "I will be the manager of the group."}]}]}, {"word": "manufacture", "poses": [{"pos": "verb", "senses": [{"sense": "to produce goods in large numbers, usually in a factory using machines", "level": "B2", "dict_examp": "He works for a company that manufactures car parts.", "lear_examp": "In the past I have worked in a company which manufactures computer games."}]}]}, {"word": "married", "poses": [{"pos": "adjective", "senses": [{"sense": "to begin a legal relationship with someone as their husband or wife", "level": "A2", "dict_examp": "When are you getting married?", "lear_examp": "You're getting married!"}, {"sense": "having a wife or husband", "level": "A2", "dict_examp": "a married couple", "lear_examp": "So they were boyfriend and girlfriend for 8 years and now they are married."}]}]}, {"word": "martial art", "poses": [{"pos": "noun", "senses": [{"sense": "one of the traditional Japanese or Chinese skills of fighting, done as sports in many countries, for example karate or kung fu", "level": "B2", "dict_examp": "Kuk Sool Won is a martial art from Korea.", "lear_examp": "I've been doing different martial arts since I moved to Balingen in 1990."}]}]}, {"word": "marketing", "poses": [{"pos": "noun", "senses": [{"sense": "work that involves encouraging people to buy a product or service", "level": "B2", "dict_examp": "a career in marketing/sales and marketing", "lear_examp": "I am studying marketing now so I will be available at the end of April."}]}]}, {"word": "manufacturer", "poses": [{"pos": "noun", "senses": [{"sense": "a company that produces goods in large numbers", "level": "B2", "dict_examp": "a shoe manufacturer", "lear_examp": "Air pollution could be reduced if car manufacturers and companies made effective filters for car exhausts and factory chimneys."}]}]}, {"word": "manufacturing", "poses": [{"pos": "noun", "senses": [{"sense": "the business of producing goods in large numbers", "level": "B2", "dict_examp": "car/food manufacturing", "lear_examp": "I am a translator for a manufacturing company."}]}]}, {"word": "mark", "poses": [{"pos": "noun", "senses": [{"sense": "a number or letter that is written on a piece of work, saying how good the work is", "level": "A2", "dict_examp": "What mark did you get in the biology exam?", "lear_examp": "My father gave it to me because I had good marks at school last year."}, {"sense": "a small area on the surface of something which is damaged, dirty or different in some way", "level": "B2", "dict_examp": "There were dirty marks on her pants where she had wiped her hands.", "lear_examp": "But one day, when I was about ten years old, my father had hurt me on the face and I had a blue mark on my cheek."}, {"sense": "a symbol that is used for giving information", "level": "C1", "dict_examp": "I've put a mark on the map where I think we should go for a picnic.", "lear_examp": "As you walk through the valley, always following the red marks on the path, you will run into many interesting views: from climbers climbing the walls of the valley to waterfalls coming from the top of it."}, {"sense": "a sign or proof that something exists", "level": "C2", "dict_examp": "a mark of genius", "lear_examp": "To succeed in a task that one has envisioned is a mark of success."}, {"sense": "to do something that makes you successful or makes people notice you", "level": "C2", "dict_examp": "He really made his mark on the company.", "lear_examp": "It teaches you that you don't have to be an Arnold Schwarzenegger to fight for your friends and really make your mark."}]}, {"pos": "verb", "senses": [{"sense": "to check a piece of work or an exam, showing mistakes and giving a letter or number to say how good it is", "level": "B2", "dict_examp": "I was up half the night marking exam papers.", "lear_examp": "Computers even sell tickets at stations, mark exam papers, and help us to talk with people all over the world via the Internet."}, {"sense": "to put a line, symbol, letter, etc., on something as a label or to show something", "level": "B2", "dict_examp": "I've marked my street on the map for you.", "lear_examp": "On the map we have marked a black dot on the place where you will find the hotel."}, {"sense": "to put a spot, color, ink, dirt, etc., on a small area of something", "level": "C2", "dict_examp": "Sale items are marked with red on the tags.", "lear_examp": "See all paragraphs marked in green."}, {"sense": "to represent or show a characteristic of a person or thing or feeling", "level": "C2", "dict_examp": "The signing of the treaty marked a major milestone on the road to European union.", "lear_examp": "These books, most of which are very scientific, marked the beginning of a new era of enlightenment and technology."}]}]}, {"word": "mansion", "poses": [{"pos": "noun", "senses": [{"sense": "a very large expensive house", "level": "C1", "dict_examp": "The street is lined with enormous mansions where the rich and famous live.", "lear_examp": "Do you want to live in a grand mansion, an expensive flat or even a castle?"}]}]}, {"word": "masculine", "poses": [{"pos": "adjective", "senses": [{"sense": "having qualities that are typical of men", "level": "C1", "dict_examp": "a masculine appearance/voice", "lear_examp": "In Mexico, husbands traditionally avoid doing housework. They feel that it is a woman's exclusive task.  If they wash the dishes they are not masculine any more."}]}]}, {"word": "many", "poses": [{"pos": "determiner", "senses": [{"sense": "a large number of", "level": "A1", "dict_examp": "We've known them for many years.", "lear_examp": "We are doing so many interesting things at college."}, {"sense": "used in questions to ask about the number of something", "level": "A1", "dict_examp": "How many people are coming tonight?", "lear_examp": "How many friends are coming?"}, {"sense": "used before a number or amount to show that the number or amount is large", "level": "C1", "dict_examp": "As many as 6,000 people may have been infected with the disease.", "lear_examp": "The quantities of goods by pipeline in 2002 was approximately 10 times as many as that in 1974, 21 and 2 million tonnes respectively."}]}]}, {"word": "map", "poses": [{"pos": "noun", "senses": [{"sense": "a picture that shows where countries, towns, roads, rivers, etc. are", "level": "A2", "dict_examp": "a map of the world", "lear_examp": "You can get a map of the city in the train station."}]}]}, {"word": "marriage", "poses": [{"pos": "noun", "senses": [{"sense": "the legal relationship of a man and a woman being a husband and a wife, or the ceremony where people become a husband and a wife", "level": "B1", "dict_examp": "They had a long and happy marriage.", "lear_examp": "After the marriage they go to a restaurant and eat something."}]}]}, {"word": "manner", "poses": [{"pos": "noun", "senses": [{"sense": "the way something happens or something is done", "level": "B2", "dict_examp": "She stared at me in an accusing manner.", "lear_examp": "I don't know if you will follow my advice, but in whichever manner you spend the money, I hope you are glad."}, {"sense": "polite ways of behaving with other people", "level": "B2", "dict_examp": "It's bad manners to eat with your mouth open.", "lear_examp": "Professional waiters are polite, tolerant and show good manners."}, {"sense": "the way in which a person talks and behaves with other people", "level": "B2", "dict_examp": "an aggressive/friendly/rude manner", "lear_examp": "I stared at him in anger, and the poor man, afraid of my rude manner, went out of the cafe."}]}]}, {"word": "marvelous", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good", "level": "B1", "dict_examp": "I thought it was a marvelous movie.", "lear_examp": "It was a beautiful and marvelous day."}]}]}, {"word": "marginal", "poses": [{"pos": "adjective", "senses": [{"sense": "small and not important", "level": "C2", "dict_examp": "a marginal difference/effect/improvement", "lear_examp": "Over-grazing had the biggest impact in America, while deforestation caused only a marginal effect."}]}]}, {"word": "mask", "poses": [{"pos": "noun", "senses": [{"sense": "a covering for the face which protects, hides or decorates the person wearing it", "level": "B2", "dict_examp": "a gas mask", "lear_examp": "Suddenly five men with masks jumped from nowhere into the bank and started to threaten us with their guns."}]}]}, {"word": "marathon", "poses": [{"pos": "noun", "senses": [{"sense": "a running race of slightly over 26 miles (42.195 kilometres)", "level": "B2", "dict_examp": "the London/New York marathon", "lear_examp": "How many hours of training per week are necessary if I want to run the marathon next year?"}]}]}, {"word": "March", "poses": [{"pos": "noun", "senses": [{"sense": "the third month of the year, after February and before April", "level": "A1", "dict_examp": "the 26th of March/March 26th", "lear_examp": "In March my country is very beautiful because spring is coming and the cold is over."}]}]}, {"word": "margin", "poses": [{"pos": "noun", "senses": [{"sense": "the difference between two amounts of time, money, etc.", "level": "C2", "dict_examp": "He was reelected by a wide margin.", "lear_examp": "We chose the second one, and, incredible as it may seem, we managed to win by a rather comfortable margin."}, {"sense": "empty space around the edges of a page of print or writing", "level": "C2", "dict_examp": "If I have any comments to make, I'll write them in the margin.", "lear_examp": "That night, while he was going back to his native country, he analyzed the information written in the margins of the Lost Dairy."}, {"sense": "the amount by which a calculation can be wrong but still give a good result", "level": "C2", "dict_examp": "a margin of error of 5 percent", "lear_examp": "It might be true that what is considered to be healthy or unhealthy changes over time, however, as science progresses the margin of error becomes smaller, and experts are then able to have a more accurate and precise say on all matters, including health."}, {"sense": "the amount of profit that is made by a business after costs have been subtracted", "level": "C2", "dict_examp": "Higher fuel prices have reduced our margins.", "lear_examp": "The first toys, he sold with a small profit margin."}]}]}, {"word": "market", "poses": [{"pos": "noun", "senses": [{"sense": "a place where people go to buy or sell things, often outside", "level": "A2", "dict_examp": "a fish/flower market", "lear_examp": "Juan, My new house is in Balmoral Street, near the market."}, {"sense": "all the people who want to buy a particular product, or the area where they live", "level": "C1", "dict_examp": "Is there a market for                           second-hand jewelry?", "lear_examp": "We had been researching the market for a year."}, {"sense": "the number of people in a place who are available and willing to work", "level": "C1", "dict_examp": "The strong economy will create growth in the labor market.", "lear_examp": "The labor market in Russia is greatly influenced by the political situation."}, {"sense": "the business of  buying and selling a particular product or service", "level": "C2", "dict_examp": "the insurance/housing market", "lear_examp": "Usually the enumeration of problems includes facts such as the difficulties that are caused in countries which run state-administered pension schemes, distortions in the age structure of developed countries, problems with the housing market, and so on."}]}]}, {"word": "mango", "poses": [{"pos": "noun", "senses": [{"sense": "a tropical fruit that has a green skin and is orange inside", "level": "A2", "dict_examp": "We had ice cream with slices of mango.", "lear_examp": "So anyway I'm here at the beach sunbathing, having a lovely time under the mango trees."}]}]}, {"word": "marry", "poses": [{"pos": "verb", "senses": [{"sense": "to begin a legal relationship with someone as their husband or wife", "level": "B1", "dict_examp": "Will you marry me?", "lear_examp": "Before we left the airport, John whispered in my ear \"I'm going to marry her\"."}]}]}, {"word": "march", "poses": [{"pos": "noun", "senses": [{"sense": "an organized walk by a group to show that they disagree with something", "level": "C1", "dict_examp": "She's going on a  march on Saturday in protest over the closure of the hospital.", "lear_examp": "There were protest marches and doctors, nurses, and the population forced the government to find a solution to the problem."}]}, {"pos": "verb", "senses": [{"sense": "to walk with other people in a public place as part of an organized event to show that you disagree with something", "level": "C1", "dict_examp": "Around twenty thousand people marched through the city today to protest against the proposed new law.", "lear_examp": "This was a time of rupture, a scream for freedom, for love, and for peace. Young boys and girls marched against war and at the same time killed themselves with drugs."}, {"sense": "to walk with regular steps, often with other people walking the same way", "level": "C1", "dict_examp": "The band marched through the downtown streets.", "lear_examp": "Even when the Romans marched against Greece, the Greek people couldn't unite against their new and powerful enemy and that's why they were conquered."}, {"sense": "to walk somewhere fast and with purpose", "level": "C2", "dict_examp": "She marched into my office demanding to know why I hadn't written my report.", "lear_examp": "She marched into the shop, got rid of the old lady and pestered the poor man until he agreed to give her the painting for £2982."}]}]}, {"word": "mankind", "poses": [{"pos": "noun", "senses": [{"sense": "all people, considered as a group", "level": "B2", "dict_examp": "the history of mankind", "lear_examp": "Since the beginning of human civilization, mankind has never ceased to be mesmerized by folklore and stories of princes and princesses."}]}]}, {"word": "mature", "poses": [{"pos": "adjective", "senses": [{"sense": "Mature people behave like adults in a way that shows they are well developed emotionally.", "level": "B2", "dict_examp": "She seems very mature for thirteen.", "lear_examp": "Every time I thought of it before entering college, I expected to find intelligent, kind, and mature people, though of course, some rude, mean and stupid people as well."}]}]}, {"word": "mat", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of thick material that you put on the floor, often in order to protect it", "level": "C1", "dict_examp": "There's a mat by the door for you to wipe your feet on.", "lear_examp": "Last but not least, many Japanese style hotels and restaurants now have square holes in tatami (straw mat) rooms so that foreign visitors can comfortably stretch their legs under the low table without having to be seated on folded legs like Zen monks!"}]}]}, {"word": "massive", "poses": [{"pos": "adjective", "senses": [{"sense": "very large in size, amount or number", "level": "B2", "dict_examp": "They've got a massive house.", "lear_examp": "Sea pollution can be reduced if people take more care with oil tankers, to reduce massive oil spills."}]}]}, {"word": "materialism", "poses": [{"pos": "noun", "senses": [{"sense": "the belief that having money and possessions is the most important thing in life", "level": "C2", "dict_examp": "She was saddened by the materialism of our society.", "lear_examp": "We consume, not for the benefit of our social status, but to satisfy our need for material goods. This phenomenon, called materialism, characterizes our society."}]}]}, {"word": "math", "poses": [{"pos": "noun", "senses": [{"sense": "the study of numbers, shapes and space using reason and usually a special system of symbols and rules for organizing them", "level": "A2", "dict_examp": "Math is my favorite subject!", "lear_examp": "Dear Robert, I think I left my math book in your house last night."}]}]}, {"word": "master", "poses": [{"pos": "noun", "senses": [{"sense": "a man who is in charge of a servant or a dog", "level": "B2", "dict_examp": "With careful training, a dog will obey its master completely.", "lear_examp": "We must remember that we are masters of the car not the servants of the car."}, {"sense": "a higher university title of achievement", "level": "C1", "dict_examp": "to study for a Master's degree", "lear_examp": "It is the second year since I got my master's."}, {"sense": "a person who does something with a lot of skill", "level": "C2", "dict_examp": "This painting is clearly the work of a master.", "lear_examp": "Beckman is a master in telling her stories through the eyes of a child."}]}]}, {"word": "match", "poses": [{"pos": "noun", "senses": [{"sense": "a sports competition in which two people or teams compete against each other", "level": "A2", "dict_examp": "a tennis match", "lear_examp": "I would like to play a tennis match at your house, and go out tonight too."}, {"sense": "a thin, wooden stick which produces a flame when you rub one end of it against a rough surface", "level": "B2", "dict_examp": "a box of matches", "lear_examp": "I lit a match and I went to the kitchen to get a candle, but there weren't any."}, {"sense": "something which is similar to or combines well with something else", "level": "C2", "dict_examp": "The curtains look great - they're a perfect match for the sofa.", "lear_examp": "Marine science would be a perfect match for people interested in natural sciences."}, {"sense": "to not be as good as someone or something else", "level": "C2", "dict_examp": "Gibson ran well but was no match for the young Italian.", "lear_examp": "This exhibition was especially striking because almost all the prints were from the very first series of vintage prints, in addition to  being rare and also highly valued by collectors, even though their prices are no match for the Picasso."}, {"sense": "to light a match in order to produce fire", "level": "C2", "dict_examp": "I struck a match and lit the candle.", "lear_examp": "Their instant reaction was to park the car, put their raincoats on, get out and strike a few useless matches: they were their last light resource apart from the lightning in the sky and the weak headlights."}]}, {"pos": "verb", "senses": [{"sense": "If two things match, they are the same color or type.", "level": "B1", "dict_examp": "I can't find anything to match my green shirt.", "lear_examp": "They match a T-shirt that I bought last week."}, {"sense": "to choose someone or something that is suitable for a particular person, activity or purpose", "level": "B1", "dict_examp": "In the first exercise you have to match each capital city to its country.", "lear_examp": ""}, {"sense": "to be as good as someone or something else", "level": "C1", "dict_examp": "It would be difficult to match the service this airline gives to its customers.", "lear_examp": "In all these ways that your establishment failed to match the claims made for it in your publicity, we feel entitled to a full refund and I therefore urge you to improve the facilities of your museum or withdraw the advertisement to avoid further complaints."}]}]}, {"word": "mathematical", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to mathematics", "level": "B2", "dict_examp": "a mathematical formula", "lear_examp": "Furthermore, he studied the human body and invented mathematical formulas to describe his findings."}]}]}, {"word": "may", "poses": [{"pos": "modal verb", "senses": [{"sense": "used to talk about what will possibly happen", "level": "A2", "dict_examp": "We may go to France later this year.", "lear_examp": "Then we may go sightseeing."}, {"sense": "used to talk about what is possibly true", "level": "B1", "dict_examp": "There may be other problems that we don't know about.", "lear_examp": "I know it may be difficult, because it is not that easy to find a house, but please can you do your best and find something for us very soon."}, {"sense": "used to ask or give permission", "level": "B1", "dict_examp": "May I be excused, please?", "lear_examp": "Dear Friends, May I suggest that you spend your time in the city."}, {"sense": "used to talk about things that possibly happened in the past or might possibly have happened by a certain time in the future", "level": "B2", "dict_examp": "The explosion may have been caused by a faulty electrical connection.", "lear_examp": "Besides, your report is full of mistakes, so it seems to me that you may not have been well informed."}, {"sense": "used to suggest doing something when there is no reason you should not do it or there is no  better thing to do", "level": "C1", "dict_examp": "We may as well start the meeting - the others will be here soon.", "lear_examp": "We can reduce costs, taking advantage of their special offer. We may as well cut our costs, taking group discounts."}]}]}, {"word": "material", "poses": [{"pos": "noun", "senses": [{"sense": "cloth for making clothes, curtains, etc.", "level": "B1", "dict_examp": "Her dress was made of a soft, silky material.", "lear_examp": "I like buying designer clothes because they're made of  good material."}, {"sense": "documents, recorded information, etc. that are used for a particular activity", "level": "B1", "dict_examp": "publicity material", "lear_examp": "During the lesson we use a lot of useful and helpful material: tapes, video, and lots of different books."}, {"sense": "a physical substance that has a particular quality or is used for a particular purpose", "level": "B2", "dict_examp": "building materials, such as stone", "lear_examp": "They wear plastic in their hair and clothes that are made from recycled materials."}, {"sense": "the facts or ideas in a piece of writing", "level": "C1", "dict_examp": "I'm collecting material for an article that I'm writing.", "lear_examp": "They are mainly interested in gathering material and data."}]}]}, {"word": "maximize", "poses": [{"pos": "verb", "senses": [{"sense": "to increase something as much as you can", "level": "C2", "dict_examp": "to maximize profits", "lear_examp": "I can assure you that I would make every possible effort to maximize the outcome of this project."}]}]}, {"word": "materialist", "poses": [{"pos": "noun", "senses": [{"sense": "a person who thinks that having money and possessions is the most important thing in life", "level": "C2", "dict_examp": "We hope our children will not be materialists.", "lear_examp": "Firstly, I would say that I am not a materialist but some things have a great value in my eyes and pictures are one of those things."}]}, {"pos": "adjective", "senses": [{"sense": "believing that having money and possessions is the most important thing in life", "level": "C2", "dict_examp": "We live in a materialist society.", "lear_examp": "To be able to understand their labor we must separate ourselves from the materialist world we are living in."}]}]}, {"word": "materialistic", "poses": [{"pos": "adjective", "senses": [{"sense": "believing that having money and possessions is the most important thing in life", "level": "C2", "dict_examp": "a materialistic society", "lear_examp": "When parents put instead of their presence, presents, aren't we replacing love with materialism, where the children in turn become materialistic rather than loving?"}]}]}, {"word": "maximum", "poses": [{"pos": "adjective", "senses": [{"sense": "The maximum amount of something is the largest amount that is allowed or possible.", "level": "B1", "dict_examp": "maximum speed/effort/temperature", "lear_examp": "From now on, my house will have maximum security (tanks, soldiers, bombs) so no one can kidnap my family again."}]}, {"pos": "noun", "senses": [{"sense": "the largest amount allowed or possible", "level": "B1", "dict_examp": "The temperature will reach a maximum of 60°F today.", "lear_examp": "So I watch 1 hour of television a day, maximum."}]}]}, {"word": "masterpiece", "poses": [{"pos": "noun", "senses": [{"sense": "a painting, book, or movie that is generally considered to be of excellent quality", "level": "C2", "dict_examp": "\"Mona Lisa\" is widely regarded as Leonardo da Vinci's masterpiece.", "lear_examp": "My choice was Chinua Achebe's masterpiece \"Things Fall Apart.\""}]}]}, {"word": "matter", "poses": [{"pos": "noun", "senses": [{"sense": "the reason for pain, worry or a problem", "level": "A2", "dict_examp": "What's the matter? Why are you crying?", "lear_examp": "\"What's the matter?\","}, {"sense": "a subject or situation that you need to think about, discuss, or deal with", "level": "B2", "dict_examp": "Could I talk to you about a personal matter?", "lear_examp": "On another matter, I'd like to tell your parents that they don't need to get me any present, but if they insist I'd like you to pick me a novel."}, {"sense": "to make a situation more difficult, unpleasant, etc.", "level": "B2", "dict_examp": "To make matters worse, our car broke down!", "lear_examp": "To make matters worse, the newspaper said they only played for thirty-five minutes."}, {"sense": "used to emphasize that something is true, especially when it is surprising", "level": "B2", "dict_examp": "As a matter of fact, I used to live next door to him.", "lear_examp": "As a matter of fact I didn't enjoy Nice much."}, {"sense": "used to emphasize that something cannot be changed", "level": "B2", "dict_examp": "I never manage to lose any weight, no matter how hard I try.", "lear_examp": "No matter where you are or what you do, apparently you need electricity."}, {"sense": "If something happens as a matter of course, it always happens as part of the normal process or system.", "level": "C1", "dict_examp": "Babies were tested for the disease as a matter of course.", "lear_examp": "The transformation has succeeded so far and caused enormous changes in ordinary life as a matter of course, including eating habits."}, {"sense": "If you say that it is only a matter of time before something happens, you are sure it will happen but you do not know when.", "level": "C1", "dict_examp": "It's only a matter of time before someone gets into an accident on this road.", "lear_examp": "In my opinion it is only a matter of time before it is decided to put an end to this country being a kingdom."}, {"sense": "If a subject is no laughing matter, it is serious and not something that people should joke about.", "level": "C2", "dict_examp": "Being late for a job interview is no laughing matter.", "lear_examp": "Anna and Tom knew this was no laughing matter."}, {"sense": "If something is a matter of confidence/luck/waiting, etc., that is what you need for it to happen.", "level": "C2", "dict_examp": "Learning languages is just a matter of hard work.", "lear_examp": "His success wasn't a matter of luck, it was a matter of knowing his aims in life and being very persistent, too."}, {"sense": "a particular type of substance or thing", "level": "C2", "dict_examp": "vegetable matter", "lear_examp": "As compared to audio-visual aids, books have the advantage of causing less strain to the eyes and mind as printed matter is easier to read than reading from a screen."}, {"sense": "a serious situation where people could die", "level": "C2", "dict_examp": "Getting water to these people is a matter of life and death.", "lear_examp": "I told him it was a matter of life and death."}, {"sense": "a very  small amount or period of time", "level": "C2", "dict_examp": "In a matter of seconds, the building was in flames.", "lear_examp": "I decided to relax - knowing a little bit about boats myself I was sure there was a radio on board so it would be only a matter of hours before someone would come to rescue us, wouldn't it?"}]}, {"pos": "verb", "senses": [{"sense": "to be important, or to affect what happens", "level": "A2", "dict_examp": "We were late but it didn't seem to matter.", "lear_examp": "Dear Ally, It doesn't matter."}]}]}, {"word": "massacre", "poses": [{"pos": "noun", "senses": [{"sense": "the killing of a lot of people", "level": "C2", "dict_examp": "He ordered the massacre of over 2,000 women and children.", "lear_examp": "It was mostly used for military purposes, thus provoking huge disasters and massacres."}]}]}, {"word": "mass", "poses": [{"pos": "noun", "senses": [{"sense": "a large number or amount of something", "level": "B2", "dict_examp": "He always has a mass of books and papers on his desk.", "lear_examp": "But people are bewildered because of a mass of information."}]}, {"pos": "adjective", "senses": [{"sense": "the newspapers, magazines, television, and radio that reach large numbers of people", "level": "B2", "dict_examp": "We depend on mass media for current news and information.", "lear_examp": "I am thinking here particularly of the fact that every event and action is wildly discussed in the mass media."}, {"sense": "having an effect on or involving a large number of people", "level": "C1", "dict_examp": "They hope the new movie will appeal to a mass audience.", "lear_examp": "Television was a major step forward in the media world which combined the best of all the major mechanisms of mass communication."}]}]}, {"word": "meal", "poses": [{"pos": "noun", "senses": [{"sense": "an occasion when food is eaten, or the food which is eaten on such an occasion", "level": "A1", "dict_examp": "make/prepare/cook a meal", "lear_examp": "I hope we have a great meal and a lot of fun."}]}]}, {"word": "means", "poses": [{"pos": "noun", "senses": [{"sense": "a method or way of doing something", "level": "B2", "dict_examp": "They had no means of communication.", "lear_examp": "I think if the government improves the public means of transportation, more and more people will use them."}, {"sense": "not in any way", "level": "C1", "dict_examp": "I'm not an expert by any means.", "lear_examp": "For one thing, the fight against air pollution is by no means an easy mission."}, {"sense": "using, or with this method", "level": "C1", "dict_examp": "Students are selected for scholarships by means of an open, national competition.", "lear_examp": "Another plus of the Voiceover CD is the availability  of teachers, who can be easily reached by means of a telephone, but this kind of service is expensive."}, {"sense": "something that you say when you are agreeing to let someone do something", "level": "C2", "dict_examp": "I have a copy of the report on my desk. By all means have a look at it.", "lear_examp": "The kitchen utensils stay next to the sink. You can make use of them by all means."}, {"sense": "something that you do because it will help you to achieve something else", "level": "C2", "dict_examp": "I didn't particularly like the job - it was just a means to an end.", "lear_examp": "Major international sports competitions can either be understood as a means to an end or an end in their own right."}, {"sense": "money", "level": "C2", "dict_examp": "We don't have the means to buy the house.", "lear_examp": "Most of the people don't have the means to travel, too."}]}]}, {"word": "maybe", "poses": [{"pos": "adverb", "senses": [{"sense": "possibly", "level": "A2", "dict_examp": "Maybe we're too early.", "lear_examp": "Maybe I forgot it in your room."}, {"sense": "used to politely suggest something", "level": "A2", "dict_examp": "Maybe Ted would like to go.", "lear_examp": "Maybe we could visit that park you told me about or play at your house."}]}]}, {"word": "medication", "poses": [{"pos": "noun", "senses": [{"sense": "medicine that is used to treat an illness", "level": "C2", "dict_examp": "He's on medication to control his depression.", "lear_examp": "He had to put up with unbelievably painful treatments and was forced to take medication which prevented him from continuing his research."}]}]}, {"word": "me", "poses": [{"pos": "pronoun", "senses": [{"sense": "used after a verb or preposition to refer to the person who is speaking or writing", "level": "A1", "dict_examp": "Is there one for me?", "lear_examp": "It is difficult for me."}, {"sense": "accept that what I say is true, because I know or have experienced it", "level": "C1", "dict_examp": "You could be doing a much less interesting job, take it from me.", "lear_examp": "As you probably already know, Greeks love sports so, take it from me, you won't have difficulty in finding sports facilities of any kind, wherever you decide to go."}]}]}, {"word": "mechanism", "poses": [{"pos": "noun", "senses": [{"sense": "a part of a piece of equipment that does a particular job", "level": "C1", "dict_examp": "The clock's winding mechanism was broken.", "lear_examp": "Most chairs' adjusting mechanisms failed to work properly and they are not comfortable to sit on."}, {"sense": "a system for achieving something, or the way that a system works", "level": "C1", "dict_examp": "We need a mechanism for resolving this sort of dispute.", "lear_examp": "The definition of market here not only means a traditional marketplace for goods exchange and barter, but it extends further to a supply-sell mechanism which dominates the normal lives of all inhabitants."}]}]}, {"word": "mean", "poses": [{"pos": "verb", "senses": [{"sense": "to have a particular meaning", "level": "A2", "dict_examp": "What does \"gather\" mean?", "lear_examp": "Because, in my opinion, blue means freedom."}, {"sense": "something that you say in order to correct yourself", "level": "A2", "dict_examp": "We went there in May - I mean June.", "lear_examp": "If you have time - I mean if you are free."}, {"sense": "to intend to express a fact or opinion", "level": "B1", "dict_examp": "I didn't mean that as a criticism.", "lear_examp": "Now I know what you mean when you say this island is wonderful."}, {"sense": "to have an important emotional effect on someone", "level": "B1", "dict_examp": "It wasn't a valuable picture but it meant a lot to me.", "lear_examp": "It's my grandfather's birthday and he means a lot to me."}, {"sense": "to intend", "level": "B1", "dict_examp": "I think she meant 8 o’clock, although she said 7 o’clock.", "lear_examp": "But I didn't mean to scare you."}, {"sense": "to have been wanting and planning to do something", "level": "B1", "dict_examp": "I've been meaning to call you for weeks.", "lear_examp": "Dear Claude, I have been meaning to write for ages!"}, {"sense": "to have or need a particular result", "level": "B1", "dict_examp": "Lower costs mean lower prices.", "lear_examp": "This doesn't mean that you won't be able to enjoy the countryside, in fact most of these cities are surrounded by nature, so you'll have wonderful views."}, {"sense": "to be made or created for someone or something", "level": "C1", "dict_examp": "These toys are really meant for babies.", "lear_examp": "Cities are meant for human activities and not for heavy traffic."}, {"sense": "to intend to be helpful or kind but cause problems instead", "level": "C2", "dict_examp": "He means well, but he keeps trying to help with things he doesn't really understand.", "lear_examp": "Although these fans might mean well, in many cases they do not appear to realize that their \"heroes\" perhaps would like to be left alone."}]}, {"pos": "adjective", "senses": [{"sense": "unkind or unpleasant", "level": "B2", "dict_examp": "Stop being so mean to me!", "lear_examp": "On the other hand people, when driving a car, can be very mean and wicked, and they sure don't have a bit of respect for the next man."}, {"sense": "In math, a mean number is the average number you get by adding a group of numbers together and then dividing the result by how many numbers are in the group", "level": "C2", "dict_examp": "The mean temperature this  month was warmer than usual for January.", "lear_examp": "Better living conditions and significant advances in medicine have greatly contributed to an increase in the mean age of death and a decrease in deaths at birth."}, {"sense": "used when you want to emphasize that an act or achievement is very difficult", "level": "C2", "dict_examp": "Learning to ski at 60 is no mean feat!", "lear_examp": "There was an interesting discussion about whether it was harder or easier for them to enter the world of cinema, given their famous names. Both said that it was no mean feat because people were more demanding as to their abilities."}]}]}, {"word": "meaningful", "poses": [{"pos": "adjective", "senses": [{"sense": "useful, serious, or important", "level": "B2", "dict_examp": "a meaningful discussion", "lear_examp": "First of all, I think this camp could be very meaningful for children, to be close to nature and to understand Japan."}, {"sense": "having a clear meaning which people can understand", "level": "B2", "dict_examp": "The information needs to be presented in a meaningful way.", "lear_examp": "The music is really amazing and the lyrics are so meaningful."}]}]}, {"word": "meanwhile", "poses": [{"pos": "adverb", "senses": [{"sense": "in the time between two things happening, or while something else is happening", "level": "B1", "dict_examp": "Carl's starting college in September. Meanwhile, he's traveling around Europe.", "lear_examp": "Meanwhile, if you agree, I can do some English exercises to cover the class that I'm going to miss."}]}]}, {"word": "medical", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to medicine and different ways of curing illness", "level": "B2", "dict_examp": "medical advice", "lear_examp": "With the help of medical technology doctors can cure more and more patients and do many kinds of operations."}]}]}, {"word": "meat", "poses": [{"pos": "noun", "senses": [{"sense": "muscles and other soft parts of animals, used as food", "level": "A1", "dict_examp": "I don't eat meat.", "lear_examp": "I don't like meat and fish."}]}]}, {"word": "media", "poses": [{"pos": "noun", "senses": [{"sense": "newspapers, magazines, radio and television considered as a group", "level": "B2", "dict_examp": "the local/national media", "lear_examp": "All things considered, I don't want the media to reveal their private life."}]}]}, {"word": "medal", "poses": [{"pos": "noun", "senses": [{"sense": "a metal disk given as a prize in a competition or given to someone who has been very brave", "level": "B2", "dict_examp": "an Olympic medal", "lear_examp": "They can also take part in sports competitions and win a medal."}]}]}, {"word": "meantime", "poses": [{"pos": "noun", "senses": [{"sense": "in the time between two things happening, or while something else is happening", "level": "B2", "dict_examp": "Your computer won't be arriving till Thursday. In the meantime, you can use Jude's.", "lear_examp": "In the meantime, I decided to buy a new bicycle."}]}]}, {"word": "measurement", "poses": [{"pos": "noun", "senses": [{"sense": "the exact size, shape, degree or strength of something which you discover by measuring it", "level": "B2", "dict_examp": "The measurements of both rooms were identical.", "lear_examp": "We sat day and night to document the results of our measurements of polluted ground all over Sweden."}, {"sense": "the process of measuring something, or a way of measuring something", "level": "C2", "dict_examp": "The test is based on the measurement of blood sugar.", "lear_examp": "The measurement of a child by academic achievement at school is in my opinion very important as the future of a society or even more of a country depends on the high shared knowledge of the people."}]}]}, {"word": "medically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is connected to medicine or to someone's health", "level": "C2", "dict_examp": "A stay in the hospital was not medically necessary, so the doctor said he could go home.", "lear_examp": "This does seem wise, as there is no \"medically proven\" diet or nutrition program that might help everyone to achieve a state of health that they would be completely happy about."}]}]}, {"word": "mayor", "poses": [{"pos": "noun", "senses": [{"sense": "the person who is elected to govern a city or town", "level": "B2", "dict_examp": "the mayor of Boston", "lear_examp": "As I am sure you know, my name is Jane Brown, and I am the mayor's secretary."}]}]}, {"word": "mechanic", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is repairing the engines of vehicles and other machines", "level": "A2", "dict_examp": "a car/garage/motor mechanic", "lear_examp": "I worked as a mechanic in my country."}]}]}, {"word": "mechanical", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to or operated by machines", "level": "B2", "dict_examp": "a mechanical device", "lear_examp": "First of all, the car had a mechanical defect and I needed to stay almost five hours in an old and dirty garage, waiting for the car to be fixed."}, {"sense": "If you do something in a mechanical way, you do it without thinking about it.", "level": "C2", "dict_examp": "a mechanical performance", "lear_examp": "We end up doing our things in such a mechanical way that the actual spirit of doing dies in us."}]}]}, {"word": "measure", "poses": [{"pos": "verb", "senses": [{"sense": "to discover the exact size or amount of something, or to be of a particular size", "level": "B2", "dict_examp": "\"Will the table fit in here?\" \"I don't know - let's measure it.\"", "lear_examp": "I measured how long they played for, because I was one of the group's fans."}, {"sense": "to be a certain size", "level": "C1", "dict_examp": "a whale measuring around 60 feet in length.", "lear_examp": "But there is still one major problem: Bielefeld is the main big city in a region measuring about 50 km in diameter."}, {"sense": "to judge the quality, effect, importance, or value of something", "level": "C2", "dict_examp": "We will soon be able to measure the results of these policies.", "lear_examp": "The parameters for measuring success would be vastly different depending on which walk of life is being described, so in the following, the definition of success has been narrowed down to a specific domain: the international computer industry."}]}, {"pos": "noun", "senses": [{"sense": "a way of achieving something or dealing with a situation", "level": "B2", "dict_examp": "These measures were designed to improve car safety.", "lear_examp": "There are a lot of measures that we have taken in the last three years."}, {"sense": "a way of judging something", "level": "C2", "dict_examp": "Ticket sales are not necessarily a measure of the show's popularity.", "lear_examp": "So, these two experiences from my childhood taught me a lot of real truth about life and since that time they have been serving me as a measure of my affection or attachment, sorrow or disappointment."}, {"sense": "amount or degree", "level": "C2", "dict_examp": "Heavy drapes give the room some measure of warmth on cold nights.", "lear_examp": "The important thing is to have the right measure of material richness so as not to let the negative aspects of it change us and to help us to achieve spiritual richness."}]}]}, {"word": "May", "poses": [{"pos": "noun", "senses": [{"sense": "the fifth month of the year, after April and before June", "level": "A1", "dict_examp": "the 30th of May/May 30(th)", "lear_examp": "The water temperature is 18°C to 26°C all summer (May to end of Sept)."}]}]}, {"word": "meaning", "poses": [{"pos": "noun", "senses": [{"sense": "The meaning of words, signs, or actions is what they express or represent.", "level": "B1", "dict_examp": "The word \"squash\" has several meanings.", "lear_examp": "If I didn't understand the meaning of a word, she told me and gave me a dictionary to look up the words."}, {"sense": "purpose or emotional importance", "level": "B2", "dict_examp": "She felt that her life had no meaning.", "lear_examp": "We can give meaning to our lives, with everyday little things."}]}]}, {"word": "mere", "poses": [{"pos": "adjective", "senses": [{"sense": "used to emphasize that something is not large or important", "level": "B2", "dict_examp": "It cost a mere twenty dollars.", "lear_examp": "The fight was just a mere coincidence."}]}]}, {"word": "merciful", "poses": [{"pos": "adjective", "senses": [{"sense": "kind and forgiving", "level": "C2", "dict_examp": "Judges are sometimes more merciful than a jury.", "lear_examp": "He would have seven children, all of them would be merciful and good rulers of rich countries."}]}]}, {"word": "mention", "poses": [{"pos": "verb", "senses": [{"sense": "to briefly speak or write about something or someone", "level": "B1", "dict_examp": "She didn't mention her daughter.", "lear_examp": "You mentioned you are coming to visit my country."}, {"sense": "used to emphasize the importance of something that you are adding to a list", "level": "B2", "dict_examp": "The resort has great hotels and restaurants, not to mention some of the best skiing in the region.", "lear_examp": "It is crowded everywhere, the shop assistants are stressed, you get to wait for hours to pay for your goods, not to mention the time you must wait to get them wrapped."}]}, {"pos": "noun", "senses": [{"sense": "a brief remark", "level": "B2", "dict_examp": "When I ordered the catalog, there was no mention of any payment.", "lear_examp": "In the advertisement there's no mention about getting any money back but I think it was such a disappointing evening that you should give it back to me."}]}]}, {"word": "merger", "poses": [{"pos": "noun", "senses": [{"sense": "when two or more companies or organizations join together", "level": "C2", "dict_examp": "The two companies announced their merger yesterday.", "lear_examp": "For example, in Korea where conglomerates as well as small companies have announced their bankruptcy or are in the state of liquidation or merger, millions of people are on the verge of being laid off and unemployed."}]}]}, {"word": "memory", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of information that can be stored on a computer or other electronic device", "level": "A2", "dict_examp": "You need 128 megabytes of memory to run this software.", "lear_examp": "Don't forget it has 4GB of memory."}, {"sense": "your ability to remember", "level": "B1", "dict_examp": "You have a good memory.", "lear_examp": "It's about a girl that lives in London and she lost her memory so everybody has to tell her everything about the past."}, {"sense": "something that you remember from the past", "level": "B1", "dict_examp": "I have very fond memories of that period of my life.", "lear_examp": "I have so many good memories."}, {"sense": "the part of your mind that stores what you remember", "level": "C2", "dict_examp": "He recited the poem from memory.", "lear_examp": ""}, {"sense": "If you do something in memory of a dead person, you do it to show your respect or love for them.", "level": "C2", "dict_examp": "They built a statue in memory of those who died in the fire.", "lear_examp": "You see, every year our family performs a certain gathering in memory of my brother who was killed in a plane crash in 1991 known as the C130 disaster."}, {"sense": "an occasion when you remember some of the good things you did in the past", "level": "C2", "dict_examp": "We were just taking a walk down memory lane and recalling our youth.", "lear_examp": "I want to return there, without the kids, even without my husband, to have a long stroll down memory lane."}]}]}, {"word": "merit", "poses": [{"pos": "noun", "senses": [{"sense": "good qualities that deserve praise", "level": "C1", "dict_examp": "His ideas have merit.", "lear_examp": "Nevertheless, everything has its own merits."}]}, {"pos": "verb", "senses": [{"sense": "to be important enough to receive attention or punishment", "level": "C2", "dict_examp": "Her crimes were serious enough to merit a prison sentence.", "lear_examp": "One thing which merits serious consideration is the consequences of this invasion in famous private lives."}]}]}, {"word": "melon", "poses": [{"pos": "noun", "senses": [{"sense": "a large, round, sweet fruit with a thick, green or yellow skin and a lot of seeds", "level": "A2", "dict_examp": "a slice of melon", "lear_examp": "I want to buy melons, tomatoes, apples and pears."}]}]}, {"word": "mercy", "poses": [{"pos": "noun", "senses": [{"sense": "kindness that makes you forgive someone, usually someone that you have authority over", "level": "C2", "dict_examp": "The judge showed no mercy.", "lear_examp": "The doctor showed no mercy and neither would Douglas."}, {"sense": "to not be able to protect yourself from something or someone that you cannot control", "level": "C2", "dict_examp": "Farmers are often at the mercy of the weather.", "lear_examp": "I couldn't believe I'd been careless enough to let them be at the mercy of Joanna's careless, boisterous friends, and I felt very lonely now, looking for them."}]}]}, {"word": "membership", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being a member of a group or organization", "level": "B1", "dict_examp": "We applied for membership in the country club.", "lear_examp": "First, the president welcomed me and gave me my membership card."}, {"sense": "all the members of a group or organization", "level": "C1", "dict_examp": "We asked the membership to vote on the issue.", "lear_examp": "First of all, we found that our club's membership is actually falling."}]}]}, {"word": "mediocrity", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being mediocre", "level": "C2", "dict_examp": "I was shocked by the mediocrity of these students.", "lear_examp": "She is a model of mediocrity and shallowness, and in this sense, she epitomizes what authorities expect people to be: just ghosts."}]}]}, {"word": "melt", "poses": [{"pos": "verb", "senses": [{"sense": "If something melts, it changes from a solid into a liquid because of heat and if you melt something, you heat it until it becomes liquid.", "level": "B2", "dict_examp": "The snow usually melts by mid March.", "lear_examp": "Walking out of the station he saw her!  Tall, blond and with eyes that could melt ice."}]}]}, {"word": "merge", "poses": [{"pos": "verb", "senses": [{"sense": "If two or more things merge, they combine or join, and if you merge two or more things, you combine or join them.", "level": "C2", "dict_examp": "The two companies merged.", "lear_examp": "What will happen if the biggest companies go on merging and reducing the number of their employees?"}]}]}, {"word": "memorable", "poses": [{"pos": "adjective", "senses": [{"sense": "If an occasion is memorable, you will remember it for a long time because it is so good.", "level": "B2", "dict_examp": "a memorable performance", "lear_examp": "It was a memorable birthday party because they bought me a bass guitar that I couldn't buy because of its high price."}]}]}, {"word": "meeting", "poses": [{"pos": "noun", "senses": [{"sense": "an event where people come together for a reason, usually to discuss something", "level": "A2", "dict_examp": "We're having a meeting on Thursday to discuss the problem.", "lear_examp": "I'm free to come to a meeting about this tomorrow at six o'clock p.m. See you then!"}, {"sense": "to arrange for a meeting to happen", "level": "C1", "dict_examp": "The chairman has called an emergency meeting.", "lear_examp": "We hope you will call a meeting to discuss this matter in detail."}]}]}, {"word": "medicine", "poses": [{"pos": "noun", "senses": [{"sense": "a substance used to cure an illness or injury", "level": "A2", "dict_examp": "cough medicine", "lear_examp": "Dear Felix, Thank you inviting me last night. I think I have left my asthma medicine at your house."}, {"sense": "treatment for illness or injury, or the study of this", "level": "B1", "dict_examp": "Western/Chinese medicine", "lear_examp": "She is twenty three years old and she's studying medicine, here in Colombia."}]}]}, {"word": "member", "poses": [{"pos": "noun", "senses": [{"sense": "a person who belongs to a group or an organization", "level": "A2", "dict_examp": "family/staff members", "lear_examp": "The living room provides a huge place for all of my family members."}]}]}, {"word": "meet", "poses": [{"pos": "verb", "senses": [{"sense": "to see and speak to someone for the first time", "level": "A1", "dict_examp": "They met at work.", "lear_examp": "At college you can meet new people."}, {"sense": "to come to the same place as someone else by arrangement or by chance", "level": "A1", "dict_examp": "We met for coffee last Sunday.", "lear_examp": "I meet with my friends there."}, {"sense": "a polite way of greeting someone when you meet them for the first time", "level": "A2", "dict_examp": "I'm very pleased to meet you at last!", "lear_examp": "I will be pleased to meet you."}, {"sense": "to wait at a place for someone or something to arrive", "level": "B1", "dict_examp": "Will you meet me at the airport ?", "lear_examp": "Please meet me at London Heathrow at 12:00 am."}, {"sense": "If a group of people meet, they come to a place in order to do something.", "level": "B1", "dict_examp": "The children's club meets every Thursday afternoon.", "lear_examp": "The members meet at the club every weekend."}, {"sense": "to be a big enough amount or of a good enough quality for something", "level": "C1", "dict_examp": "We couldn't find a house that met our needs.", "lear_examp": "Even though its construction would mean mayhem and chaos for the length of the project, and the fact that it would hold less cars than the alternative, its exclusive location in the middle of the commercial district meets the needs of the growing number of business people working in town."}, {"sense": "to have just enough money to pay for the things that you need", "level": "C1", "dict_examp": "I had to get a second job just to make ends meet.", "lear_examp": "Most students support themselves and barely make ends meet every month."}, {"sense": "to be able to achieve something", "level": "C2", "dict_examp": "He met every goal he set for himself.", "lear_examp": "She was trying hard to meet our requirements and it really took a lot out of her."}]}]}, {"word": "mentally", "poses": [{"pos": "adverb", "senses": [{"sense": "connected with or related to the mind", "level": "B2", "dict_examp": "mentally ill", "lear_examp": "Most people believe that team sports help children to become healthier, both mentally and physically, but there are those who have objections to this statement."}]}]}, {"word": "mediocre", "poses": [{"pos": "adjective", "senses": [{"sense": "not good in quality", "level": "C2", "dict_examp": "The acting was mediocre.", "lear_examp": "In Hungary, the sports facilities provided are quite mediocre."}]}]}, {"word": "merely", "poses": [{"pos": "adverb", "senses": [{"sense": "used to emphasize that you mean exactly what you are saying and nothing more", "level": "B2", "dict_examp": "I wasn't complaining, I merely said that I was tired.", "lear_examp": "Of course this is merely a suggestion, and if you have got anything else in mind please don't hesitate to let me know."}, {"sense": "used to say something is or does only this or is not large or important when compared to something else", "level": "C2", "dict_examp": "The medicine doesn't make you better, it merely stops the pain.", "lear_examp": "For a reasonably high entrance fee a visitor can acquire the help of a skilled instructor or merely enjoy skating."}]}]}, {"word": "mentality", "poses": [{"pos": "noun", "senses": [{"sense": "a person's opinions or way of thinking", "level": "C1", "dict_examp": "They buy everything on credit – they have this play now, pay later mentality.", "lear_examp": "This is why the changing mentality of men plays an important role."}]}]}, {"word": "merciless", "poses": [{"pos": "adjective", "senses": [{"sense": "cruel, or showing no kindness", "level": "C2", "dict_examp": "a merciless attack", "lear_examp": "Sheila, being at least aware how deeply her merciless behavior changed Eve's life, was the only person in the family who was taught a lesson."}]}]}, {"word": "medieval", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the period in Europe between about AD 500 and AD 1500", "level": "B2", "dict_examp": "a medieval building/painting/town", "lear_examp": "On our way around the lake we would have the opportunity  of visiting a huge medieval castle which is said to be haunted."}]}]}, {"word": "memorial", "poses": [{"pos": "noun", "senses": [{"sense": "an object, often made of stone, that is built to help people remember an important person or event", "level": "C2", "dict_examp": "the Lincoln Memorial", "lear_examp": "Every year almost all the inhabitants of our suburb gather at the memorial and celebrate this anniversary."}]}]}, {"word": "memo", "poses": [{"pos": "noun", "senses": [{"sense": "a written message sent from one member of an organization to another", "level": "C1", "dict_examp": "Did you see the memo about expenses?", "lear_examp": "I will send Mr. Pusinshg's e-mail address in a memo if you require it."}]}]}, {"word": "medium", "poses": [{"pos": "adjective", "senses": [{"sense": "in the middle of a group of different amounts or sizes", "level": "B1", "dict_examp": "a girl of medium height", "lear_examp": "What size are you? Are you small or medium?"}]}, {"pos": "noun", "senses": [{"sense": "a way of communicating or expressing something", "level": "C2", "dict_examp": "the medium of television/radio", "lear_examp": "As with any other medium of communication or entertainment, nothing is totally good or bad provided it is done in moderation."}]}]}, {"word": "menu", "poses": [{"pos": "noun", "senses": [{"sense": "a list of food and drinks that you can order in a restaurant", "level": "A2", "dict_examp": "a lunch/dinner menu", "lear_examp": "It's for celebrations because it is a very nice menu."}, {"sense": "a list that appears on a computer screen of the choices available in a computer program", "level": "A2", "dict_examp": "a pop-up menu", "lear_examp": "I like it because it has a big screen and easy menu."}]}]}, {"word": "mental", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the mind, or involving the process of thinking", "level": "B2", "dict_examp": "mental health/illness", "lear_examp": "His theories have changed our attitude towards mental illness (and mental health) completely."}]}]}, {"word": "melody", "poses": [{"pos": "noun", "senses": [{"sense": "the main tune in a piece of music that is often played or sung more than once", "level": "C2", "dict_examp": "He played a beautiful melody.", "lear_examp": "From his harp, violin, flute, trumpet and many more instruments sprang such a wonderful, enchanting melody that the whole city flourished, thrilled and cheered under its influence."}]}]}, {"word": "working-class", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging to or relating to the working class", "level": "C1", "dict_examp": "Working-class families can't afford these prices.", "lear_examp": "And young people from working-class families in the suburbs of Paris will make a point of having the latest fashion shoes or trousers."}]}]}, {"word": "message", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of writing or spoken information that one person gives to another", "level": "A1", "dict_examp": "Did you get my message?", "lear_examp": "Thank you for your message."}, {"sense": "the most important idea in a book, movie or play", "level": "B2", "dict_examp": "The book conveys a complex message.", "lear_examp": "It has a clear message: if you desire something, you can achieve whatever you want, but only with enormous effort and the danger of losing everything you possess."}]}]}, {"word": "mighty", "poses": [{"pos": "adjective", "senses": [{"sense": "very powerful or successful", "level": "C2", "dict_examp": "In their next game they're playing the mighty Redskins.", "lear_examp": "Teotihuacan was the place that saw the rise and fall of the mighty \"Nahvatlaca Tribe.\""}]}]}, {"word": "mild", "poses": [{"pos": "adjective", "senses": [{"sense": "describes weather that is not very cold or not as cold as usual", "level": "B1", "dict_examp": "We've had a mild winter this year.", "lear_examp": "As you know, my country has got mild weather."}, {"sense": "describes food or a food flavor that is not very strong", "level": "B2", "dict_examp": "a mild chili sauce", "lear_examp": "Korean food is quite hot and usually served with rice, but Thai food is mild and sometimes a little bit sour."}, {"sense": "slight or gentle, not violent, severe or extreme", "level": "C1", "dict_examp": "She can't accept even mild criticism of her work.", "lear_examp": "Music has either a strong or a mild impact (depending on the person) on our lives."}]}]}, {"word": "meter", "poses": [{"pos": "noun", "senses": [{"sense": "a unit for measuring length, equal to 100 centimeters", "level": "A2", "dict_examp": "Our bedroom is five meters wide.", "lear_examp": "Walk 100 meters and the first street left is my street."}]}]}, {"word": "millennium", "poses": [{"pos": "noun", "senses": [{"sense": "a period of 1000 years", "level": "C2", "dict_examp": "We had a party to celebrate the new millennium.", "lear_examp": "On the cusp of a new millennium, the importance of holidays in this modernized, stressful world is undeniable."}]}]}, {"word": "migration", "poses": [{"pos": "noun", "senses": [{"sense": "when people go to another place to live or find work, or when an animal or bird moves to another place, usually when the season changes", "level": "C1", "dict_examp": "There was a mass migration of poor farmers into the cities.", "lear_examp": "There is also migration, people from little villages in the interior migrate to the coast."}]}]}, {"word": "merit", "poses": [{"pos": "noun", "senses": [{"sense": "good qualities that deserve praise", "level": "C1", "dict_examp": "His ideas have merit.", "lear_examp": "Nevertheless, everything has its own merits."}]}, {"pos": "verb", "senses": [{"sense": "to be important enough to receive attention or punishment", "level": "C2", "dict_examp": "Her crimes were serious enough to merit a prison sentence.", "lear_examp": "One thing which merits serious consideration is the consequences of this invasion in famous private lives."}]}]}, {"word": "milk", "poses": [{"pos": "noun", "senses": [{"sense": "a white liquid produced by women and other female animals, such as cows", "level": "A1", "dict_examp": "a glass/carton of milk", "lear_examp": "I like to drink coffee and tea with milk."}]}]}, {"word": "meticulous", "poses": [{"pos": "adjective", "senses": [{"sense": "very careful, and giving great attention to detail", "level": "C2", "dict_examp": "This book is the result of meticulous research.", "lear_examp": "Moreover, taking photos entails paying attention to detail and although I am not a talent, I am a meticulous person."}]}]}, {"word": "mind", "poses": [{"pos": "noun", "senses": [{"sense": "someone's memory or their ability to think, feel emotions, and be aware of things", "level": "B1", "dict_examp": "My mind was full of what had happened the night before, and I wasn't concentrating.", "lear_examp": "At my first class he asked to me sing a song in English, so I sang \"Always on my mind!\""}, {"sense": "to change a decision or opinion", "level": "B1", "dict_examp": "I've changed my mind about selling the house.", "lear_examp": "At first I wasn't so excited as Clara, but after an afternoon there I changed my mind!"}, {"sense": "to make a decision", "level": "B1", "dict_examp": "I haven't made up my mind whether to apply for the job yet.", "lear_examp": "The place was so dirty that I made up my mind to change it by buying something useful."}, {"sense": "to remember to consider someone or something that may be useful in the future", "level": "B2", "dict_examp": "I'll keep you in mind if another job comes up.", "lear_examp": "But we should keep in mind that books improve our vocabulary and, what's more, our imagination."}, {"sense": "If an idea crosses your mind, you think about it for a short time.", "level": "B2", "dict_examp": "It never crossed my mind that she might be married.", "lear_examp": "The first thought that crossed his mind was to call the police immediately and that was what he actually did."}, {"sense": "to wait until you know all the facts before you form an opinion about something or judge someone", "level": "B2", "dict_examp": "We're keeping an open mind about the causes of the fire.", "lear_examp": "To listen, to communicate, and to have an open mind are a way of life nowadays."}, {"sense": "to say something that will help someone to stop worrying", "level": "C1", "dict_examp": "I was worried about the test, but the nurse explained everything and put my mind at ease.", "lear_examp": "To drive, even though only for 30 minutes, might give you confidence for the driving test and put your mind at ease."}, {"sense": "to give your full attention to something and try very hard to do it", "level": "C1", "dict_examp": "You could win if you put your mind to it.", "lear_examp": "With all the technology available, the task is actually quite simple if you put your mind to it."}, {"sense": "to have difficulty making a decision", "level": "C1", "dict_examp": "I was of  two minds about whether to invite him to the wedding.", "lear_examp": ""}, {"sense": "If something comes to mind, you think of it.", "level": "C1", "dict_examp": "I was thinking about who might be suitable for this job, and your name came to mind.", "lear_examp": "The main problem that comes to mind concerning transportation within the city is the city road network."}, {"sense": "If something blows your mind, you are very excited or surprised by it.", "level": "C2", "dict_examp": "There was one scene in the movie that really blew my mind.", "lear_examp": "\"MOMO,\" written by Michael Ende, is a book that blew my mind as a child and as an adult, I have read it many times, but the last time has been a while now."}, {"sense": "to think or worry about something", "level": "C2", "dict_examp": "Jim has a lot on his mind at the moment.", "lear_examp": "It was just that I already had a lot on my mind and my cousin's daughters would surely distract me from studying."}, {"sense": "If something springs to mind, you suddenly think of it.", "level": "C2", "dict_examp": "Mention fashion and Kate’s name immediately springs to mind.", "lear_examp": "A musical event that clearly springs to mind is a Rolling Stones concert in Parken, Copenhagen, which I attended in June 1998."}, {"sense": "in your imagination or memory", "level": "C2", "dict_examp": "In my mind's eye, I imagined the building painted white, with a beautiful garden around it.", "lear_examp": "He sees her in his mind's eye, running around barefoot, laughing and squealing, wading in the water and running back out, screaming, trying to get away from the breaking waves."}, {"sense": "to say exactly what you think without worrying if it will upset anyone", "level": "C2", "dict_examp": "She has very strong opinions and she's not afraid to speak her mind.", "lear_examp": "His father is even more eccentric, speaks his mind, and has no manners at all."}, {"sense": "the way someone feels at a particular time", "level": "C2", "dict_examp": "She was in a much more positive frame of mind today.", "lear_examp": "Naturally, these are more difficult factors to cope with for older people, but it just happens to anyone if you're not in the right frame of mind."}, {"sense": "a feeling that you do not need to worry about anything", "level": "C2", "dict_examp": "For my peace of mind, please check that the door is locked.", "lear_examp": "After all, successfully earning your living guarantees peace of mind."}, {"sense": "the ability to deal with a difficult situation quickly and effectively", "level": "C2", "dict_examp": "She had the presence of mind to press the alarm.", "lear_examp": "Frank tried to hide a bag behind his back with great presence of mind."}, {"sense": "If something slips your mind, you forget about it.", "level": "C2", "dict_examp": "I meant to tell her you had phoned, but it completely slipped my mind.", "lear_examp": "There was something but it slipped my mind before I reached it."}, {"sense": "to try to remember", "level": "C2", "dict_examp": "If you cast your mind back, you might recall that I never promised to go.", "lear_examp": "Thus, when I pick one of these stones, I cast my mind back to the specific place where I found it, the person I was, the particular moment."}]}, {"pos": "verb", "senses": [{"sense": "something you say when politely asking if you can do something, or when asking someone else to do something", "level": "A2", "dict_examp": "Do you mind if  I turn the television on?", "lear_examp": "Do you mind if I bring a friend?"}, {"sense": "used to say the choice is not important when responding to an offer or suggestion", "level": "A2", "dict_examp": "\"Would you like tea or coffee?\" \"I don't mind - either.\"", "lear_examp": "I don't mind what we do."}, {"sense": "used to tell someone not to worry about something because it is not important", "level": "A2", "dict_examp": "\"I'm afraid I've lost that wallet you gave me.\" \"Well, never mind, I can easily buy you another one.\"", "lear_examp": "Never mind Ally, forget it, I know you've been busy."}, {"sense": "to be annoyed, unhappy or worried by something", "level": "B1", "dict_examp": "Would she mind if I came too?", "lear_examp": "I want to borrow your bicycle if you don't mind because mine doesn't work well."}, {"sense": "used to request something politely", "level": "B1", "dict_examp": "Would you mind sharing a room?", "lear_examp": "Would you mind if I called you, to know what I've missed?"}, {"sense": "used to tell someone in that you are annoyed and they should not ask about something  private", "level": "C2", "dict_examp": "I wish you'd just mind your own business.", "lear_examp": "Despite knowing that he was only doing what he thought was best for me, I couldn't stand him, and I often told him to mind his own business."}]}]}, {"word": "might", "poses": [{"pos": "modal verb", "senses": [{"sense": "used to talk about what will possibly happen", "level": "A2", "dict_examp": "We might finish the project by Thursday.", "lear_examp": "We should wear t-shirts to paint the wall because the paint might make our t-shirts dirty."}, {"sense": "used to talk about what is possibly true", "level": "B1", "dict_examp": "I think Isabel might be pregnant.", "lear_examp": "At first, I thought it might be a mistake."}, {"sense": "used to talk about things that possibly happened in the past or could possibly have happened by some time in the future", "level": "B2", "dict_examp": "It might have been Alex who called.", "lear_examp": "First of all, you might have been thinking you have to go to a sports club or somewhere and exercise very hard to keep fit."}, {"sense": "used to suggest doing something when there is no reason you should not do it or there is no better thing to do", "level": "B2", "dict_examp": "We might as well walk there.", "lear_examp": "But we have to have a starting point, and since we are not sure how to do it, I believe we might as well start by thinking that \"I am important, therefore I'm going to give time to myself, set up priorities and put aside what will harm me.\""}]}]}, {"word": "middle", "poses": [{"pos": "noun", "senses": [{"sense": "in the central part, or in a central position", "level": "A2", "dict_examp": "This is my class photo - I'm the one in the middle.", "lear_examp": "The mirror is in the middle. There are flowers on the left and right of the mirror."}, {"sense": "the central point in a period of time", "level": "B1", "dict_examp": "The letter should arrive by the middle of next week.", "lear_examp": "Once, she woke up in the middle of the night and there was the ghost of her husband's wife."}, {"sense": "to be busy or involved in something", "level": "B1", "dict_examp": "I can't talk now - I'm in the middle of cooking a meal.", "lear_examp": "But while I was in the middle of my tour, I received another e-mail."}, {"sense": "a long way from places where people live", "level": "B2", "dict_examp": "His car broke down in the middle of nowhere.", "lear_examp": "You know I really don't want to get lost in the middle of nowhere."}]}, {"pos": "adjective", "senses": [{"sense": "in a central position", "level": "B2", "dict_examp": "The knives and forks are in the middle drawer.", "lear_examp": "After some minutes and as I was going along in the middle lane, the car stopped."}, {"sense": "neither high nor low in importance, amount or size", "level": "C1", "dict_examp": "middle managers", "lear_examp": "However, women are mostly found in the low and middle income jobs and they are often working part-time."}]}]}, {"word": "method", "poses": [{"pos": "noun", "senses": [{"sense": "a way of doing something, often one that involves a system or plan", "level": "B1", "dict_examp": "What's the best method of/for solving this problem?", "lear_examp": "I think her teaching method is modern, up to date, and I hope I'll finally improve my English."}]}]}, {"word": "military", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the army, navy, or air force", "level": "B2", "dict_examp": "military action/service", "lear_examp": "During my military experience I worked in the kitchen, so kitchen work is quite normal for me as well."}]}, {"pos": "noun", "senses": [{"sense": "a country's army, navy, and air force", "level": "C1", "dict_examp": "The military has opposed any cuts in defense spending.", "lear_examp": "Until the 1970s, fencing was a sport restricted to the military."}]}]}, {"word": "metaphor", "poses": [{"pos": "noun", "senses": [{"sense": "a way of describing something by comparing it with something else which has some of the same qualities", "level": "C2", "dict_examp": "She used a computer metaphor to explain how the human brain works.", "lear_examp": "I shall use a metaphor to help me express my idea. An individual can be compared to a ship roaming the oceans."}]}]}, {"word": "millimeter", "poses": [{"pos": "noun", "senses": [{"sense": "a unit of length which is equal to 0.001 meters", "level": "B1", "dict_examp": "The ring has a width of three millimeters.", "lear_examp": ""}]}]}, {"word": "the middle class", "poses": [{"pos": "noun", "senses": [{"sense": "the social group consisting of people who are neither very rich nor very poor", "level": "C1", "dict_examp": "These tax increases will affect the middle class badly.", "lear_examp": "They also show the efforts parents make to keep the family happy, especially when the middle class in Argentina started to struggle after the economic crisis in 2001."}]}]}, {"word": "metal", "poses": [{"pos": "noun", "senses": [{"sense": "a usually hard, shiny material such as iron, gold, or silver which heat and electricity can travel through", "level": "B1", "dict_examp": "Metal, paper and glass can be recycled.", "lear_examp": "It was made of metal and wood."}]}]}, {"word": "mess", "poses": [{"pos": "noun", "senses": [{"sense": "Something or someone that is a mess or is in a mess, looks dirty and disorganized and is not neat.", "level": "B1", "dict_examp": "My hair's such a mess!", "lear_examp": "Now my room is a mess because I have so much stuff."}, {"sense": "a situation that is full of problems", "level": "B2", "dict_examp": "She said that her life was a mess.", "lear_examp": "How on earth did I get into this mess?"}]}, {"pos": "verb", "senses": [{"sense": "to waste time playing and doing things with no particular purpose", "level": "C1", "dict_examp": "I was just messing around on the computer.", "lear_examp": "To add more, on Thursday there were so many children messing around that we couldn't supervise them, as we were only two people."}, {"sense": "to interfere with or change something that doesn't need to be changed or that you don't want changed", "level": "C2", "dict_examp": "Has someone been messing around with the settings on my  computer again?", "lear_examp": "She can't help messing around with your house-keeping and your cooking."}, {"sense": "to spoil something, or to do something badly", "level": "B2", "dict_examp": "Don't try to cook lunch without me - you'll only mess it up.", "lear_examp": "I ignored the price and just paid because I didn't want to mess up the evening."}]}]}, {"word": "midnight", "poses": [{"pos": "noun", "senses": [{"sense": "12 o'clock at night", "level": "A2", "dict_examp": "We didn't get home till midnight.", "lear_examp": "We stayed until midnight dancing and singing."}, {"sense": "to work late into the night", "level": "C2", "dict_examp": "I had to burn the midnight oil to get the essay finished.", "lear_examp": "My examinations were nearing and I was always burning the midnight oil."}]}]}, {"word": "message board", "poses": [{"pos": "noun", "senses": [{"sense": "a place on a website where you can leave messages for other people to read", "level": "B1", "dict_examp": "There's a lot of discussion on the message boards about this issue.", "lear_examp": ""}]}]}, {"word": "mile", "poses": [{"pos": "noun", "senses": [{"sense": "a unit for measuring distance, equal to 1609 meters or 1760 yards", "level": "B1", "dict_examp": "a ten-mile drive", "lear_examp": "I took her for the day to Krakow, which is only 10 miles from where I live."}, {"sense": "a very long distance", "level": "C1", "dict_examp": "We drove for miles along dusty roads.", "lear_examp": "And then, when it seems as if you have walked for miles, you enter the magnificent Forum Romanum."}, {"sense": "to be much better or more advanced than someone or something else", "level": "C2", "dict_examp": "Their product designs are miles ahead of the competition.", "lear_examp": "All sciences are miles ahead comparatively to the past, thanks to technology."}]}]}, {"word": "messy", "poses": [{"pos": "adjective", "senses": [{"sense": "disorganized or dirty and not neat", "level": "B1", "dict_examp": "a messy kitchen", "lear_examp": "It's completely messy now, looks like a war in my bedroom, because my bed has broken and I need to buy a new bed quickly."}]}]}, {"word": "microphone", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment that you speak into to make your voice louder, or to record your voice or other sounds", "level": "B2", "dict_examp": "The interviewer asked her to speak into/use the microphone.", "lear_examp": "Then we had to plug in all the electric instruments, speakers, lights and microphones."}]}]}, {"word": "middle-aged", "poses": [{"pos": "adjective", "senses": [{"sense": "in the middle of your life before you are old", "level": "B1", "dict_examp": "a middle-aged couple/man/woman", "lear_examp": "Our teacher is a middle-aged lady with a kind smile and British accent."}]}]}, {"word": "million", "poses": [{"pos": "number", "senses": [{"sense": "the number 1,000,000", "level": "A2", "dict_examp": "She got eight million dollars for appearing in that film.", "lear_examp": "It costs about three million VietNam dong (VND)."}]}, {"pos": "noun", "senses": [{"sense": "very many or a lot", "level": "B2", "dict_examp": "I've seen that movie a million times.", "lear_examp": "There are millions of things you can do with a computer. (757634; First Certificate in English; Cyprus; B2 VANTAGE; 2000; Greek; Pass"}]}]}, {"word": "miniature", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely small", "level": "C2", "dict_examp": "a miniature camera", "lear_examp": "Behind him was piled the most awkward assortment of stuff I had ever seen: a miniature Eiffel Tower, a monocycle, a letter-box, three netted cages, an accordion, and a bunch of other things whose name I couldn't even guess."}]}, {"pos": "noun", "senses": [{"sense": "If something is in miniature, it is a very small copy of something else.", "level": "C2", "dict_examp": "a model of the ship in miniature", "lear_examp": "Thirdly a co-educational school is a society in miniature and it has many practical advantages."}]}]}, {"word": "minor", "poses": [{"pos": "adjective", "senses": [{"sense": "not important or serious", "level": "B2", "dict_examp": "a minor offense/operation", "lear_examp": "Happily they were found by some hunters and escaped with minor injuries."}]}]}, {"word": "mint", "poses": [{"pos": "noun", "senses": [{"sense": "a herb whose leaves have a strong fresh smell and taste and are used for giving flavor to food and drinks such as tea", "level": "B2", "dict_examp": "a bunch of mint", "lear_examp": "I'd recommend his special lamb chop with mint sauce, it's just so delicious."}]}]}, {"word": "mineral water", "poses": [{"pos": "noun", "senses": [{"sense": "water which is taken from the ground and contains natural chemical substances", "level": "A2", "dict_examp": "still/carbonated mineral water", "lear_examp": "P.S. You can bring a bottle of mineral water."}]}]}, {"word": "mining", "poses": [{"pos": "noun", "senses": [{"sense": "the industry or activity of removing substances such as coal or metal from the ground by digging", "level": "C1", "dict_examp": "coal/salt mining", "lear_examp": "My company deals mostly with the mining, processing and beneficiation of magnesite ore. Most of our final products are sold abroad."}]}]}, {"word": "ministry", "poses": [{"pos": "noun", "senses": [{"sense": "in some countries, a government department that is responsible for a particular subject", "level": "C1", "dict_examp": "the Ministry of Defense/Agriculture", "lear_examp": "According to a majority of students, it's quite economical for them to go to state schools since the Turkish Ministry of Education gives them scholarships."}]}]}, {"word": "minimal", "poses": [{"pos": "adjective", "senses": [{"sense": "as small or as little as possible", "level": "C1", "dict_examp": "Damage to the building was minimal.", "lear_examp": "Areas which are not transited regularly (such as warehouses, restrooms, etc.) are to be kept in minimal lighting conditions."}]}]}, {"word": "miner", "poses": [{"pos": "noun", "senses": [{"sense": "someone who works in a mine", "level": "C1", "dict_examp": "a coal miner", "lear_examp": "We are used to strikes in our country so when we heard that the miners had refused to work we did not despair."}]}]}, {"word": "minimum", "poses": [{"pos": "adjective", "senses": [{"sense": "The minimum amount of something is the smallest amount that is allowed, needed, or possible.", "level": "B1", "dict_examp": "There is a minimum charge of $5 for postage.", "lear_examp": "I am going to phone them to ask how much the wage is, but anyway the minimum rate in England is £3.60."}]}, {"pos": "noun", "senses": [{"sense": "the smallest amount that is allowed, needed, or possible", "level": "B1", "dict_examp": "The judge sentenced him to a minimum of five years in prison.", "lear_examp": "You should spend a minimum of 1-2 hours per day on this activity."}]}]}, {"word": "minus", "poses": [{"pos": "preposition", "senses": [{"sense": "reduced by a stated number", "level": "A2", "dict_examp": "Five minus three is two.", "lear_examp": "It's cold in winter: minus ten degrees!"}]}]}, {"word": "minute", "poses": [{"pos": "noun", "senses": [{"sense": "a period of time equal to 60 seconds", "level": "A1", "dict_examp": "a ten-minute bus ride", "lear_examp": "I had a break for 20 minutes."}, {"sense": "a very short period of time", "level": "A2", "dict_examp": "I'll be with you in a minute.", "lear_examp": "Without losing a minute I packed my things and I took a cab home."}, {"sense": "said in order to interrupt someone, or to get their attention or when you have suddenly thought of something important", "level": "B1", "dict_examp": "Wait a minute - I've just had an idea.", "lear_examp": "Oh! Wait a minute..."}, {"sense": "very soon", "level": "B2", "dict_examp": "Her train should be arriving any minute.", "lear_examp": "The evil creatures who were bound to come out of the dark would see Carla any minute now."}, {"sense": "the latest time possible", "level": "B2", "dict_examp": "The concert was canceled at the last minute.", "lear_examp": "We were very disappointed to hear that the actor was replaced by another at the last minute."}, {"sense": "as soon as", "level": "C2", "dict_examp": "I'll tell you the minute we hear any news.", "lear_examp": "Even when we are small babies, from the minute that we are able to understand what is happening around us, the first thing that we do is try to learn and touch everything that is close to us and get familiar with it."}]}, {"pos": "adjective", "senses": [{"sense": "extremely small", "level": "C2", "dict_examp": "a minute amount/quantity", "lear_examp": "I see no sense in having a supermarket, an ugly and gigantic block, next to a village where the inhabitants only require a minute amount of food, since we are all self-sustaining because of our farms."}, {"sense": "done in great detail", "level": "C2", "dict_examp": "He explained everything in minute detail.", "lear_examp": "He is also a person who can pay meticulous attention to minute details."}]}]}, {"word": "minority", "poses": [{"pos": "noun", "senses": [{"sense": "less than half of a group of people or things", "level": "B2", "dict_examp": "Only a minority of people support the proposal.", "lear_examp": "On the other hand, the minority of people who believe the opposite maybe want to see the animals and to watch their movements."}, {"sense": "a group of people who share some characteristic that is different from most of the people where they live", "level": "C1", "dict_examp": "ethnic/religious minorities", "lear_examp": "The novel reveals very clearly to the reader how minorities are exploited and scorned by society."}]}]}, {"word": "mingle", "poses": [{"pos": "verb", "senses": [{"sense": "to meet and talk to other people in a place or at an event", "level": "C1", "dict_examp": "The party will be a good opportunity to mingle with the other students.", "lear_examp": "I let them mingle with other children and surprisingly, I can see that they are very sociable and they know how to respect the rights of other people."}, {"sense": "to mix, or be mixed", "level": "C2", "dict_examp": "The smell of coffee mingled with fresh-baked bread.", "lear_examp": "The chill current of approaching winter mingled with a lingering warmth of summer so that the air became fresh and alive."}]}]}, {"word": "minimize", "poses": [{"pos": "verb", "senses": [{"sense": "to make the amount of something that is unpleasant or not wanted as small as possible", "level": "C1", "dict_examp": "Airport staff are trying to minimize the inconvenience caused to passengers.", "lear_examp": "Try to minimize your working time and spend more time with other people."}]}]}, {"word": "mine", "poses": [{"pos": "pronoun", "senses": [{"sense": "the things that belong or relate to the person who is speaking or writing", "level": "A2", "dict_examp": "\"Whose bag is this?\" \"It's mine.\"", "lear_examp": "A friend of mine gave me a present on my birthday."}]}, {"pos": "noun", "senses": [{"sense": "an underground system of holes and passages where people dig out coal or other minerals", "level": "B2", "dict_examp": "a coal/salt/gold mine", "lear_examp": "It is a more or less industrial region with many coal mines."}]}]}, {"word": "minister", "poses": [{"pos": "noun", "senses": [{"sense": "a member of the government in Britain and many other countries who is in charge of a particular department or has an important position in it", "level": "B2", "dict_examp": "the foreign/health minister", "lear_examp": "He was elected minister of sports, creating some laws to help the players to be more independent."}]}]}, {"word": "mind", "poses": [{"pos": "noun", "senses": [{"sense": "someone's memory or their ability to think, feel emotions, and be aware of things", "level": "B1", "dict_examp": "My mind was full of what had happened the night before, and I wasn't concentrating.", "lear_examp": "At my first class he asked to me sing a song in English, so I sang \"Always on my mind!\""}, {"sense": "to change a decision or opinion", "level": "B1", "dict_examp": "I've changed my mind about selling the house.", "lear_examp": "At first I wasn't so excited as Clara, but after an afternoon there I changed my mind!"}, {"sense": "to make a decision", "level": "B1", "dict_examp": "I haven't made up my mind whether to apply for the job yet.", "lear_examp": "The place was so dirty that I made up my mind to change it by buying something useful."}, {"sense": "to remember to consider someone or something that may be useful in the future", "level": "B2", "dict_examp": "I'll keep you in mind if another job comes up.", "lear_examp": "But we should keep in mind that books improve our vocabulary and, what's more, our imagination."}, {"sense": "If an idea crosses your mind, you think about it for a short time.", "level": "B2", "dict_examp": "It never crossed my mind that she might be married.", "lear_examp": "The first thought that crossed his mind was to call the police immediately and that was what he actually did."}, {"sense": "to wait until you know all the facts before you form an opinion about something or judge someone", "level": "B2", "dict_examp": "We're keeping an open mind about the causes of the fire.", "lear_examp": "To listen, to communicate, and to have an open mind are a way of life nowadays."}, {"sense": "to say something that will help someone to stop worrying", "level": "C1", "dict_examp": "I was worried about the test, but the nurse explained everything and put my mind at ease.", "lear_examp": "To drive, even though only for 30 minutes, might give you confidence for the driving test and put your mind at ease."}, {"sense": "to give your full attention to something and try very hard to do it", "level": "C1", "dict_examp": "You could win if you put your mind to it.", "lear_examp": "With all the technology available, the task is actually quite simple if you put your mind to it."}, {"sense": "to have difficulty making a decision", "level": "C1", "dict_examp": "I was of  two minds about whether to invite him to the wedding.", "lear_examp": ""}, {"sense": "If something comes to mind, you think of it.", "level": "C1", "dict_examp": "I was thinking about who might be suitable for this job, and your name came to mind.", "lear_examp": "The main problem that comes to mind concerning transportation within the city is the city road network."}, {"sense": "If something blows your mind, you are very excited or surprised by it.", "level": "C2", "dict_examp": "There was one scene in the movie that really blew my mind.", "lear_examp": "\"MOMO,\" written by Michael Ende, is a book that blew my mind as a child and as an adult, I have read it many times, but the last time has been a while now."}, {"sense": "to think or worry about something", "level": "C2", "dict_examp": "Jim has a lot on his mind at the moment.", "lear_examp": "It was just that I already had a lot on my mind and my cousin's daughters would surely distract me from studying."}, {"sense": "If something springs to mind, you suddenly think of it.", "level": "C2", "dict_examp": "Mention fashion and Kate’s name immediately springs to mind.", "lear_examp": "A musical event that clearly springs to mind is a Rolling Stones concert in Parken, Copenhagen, which I attended in June 1998."}, {"sense": "in your imagination or memory", "level": "C2", "dict_examp": "In my mind's eye, I imagined the building painted white, with a beautiful garden around it.", "lear_examp": "He sees her in his mind's eye, running around barefoot, laughing and squealing, wading in the water and running back out, screaming, trying to get away from the breaking waves."}, {"sense": "to say exactly what you think without worrying if it will upset anyone", "level": "C2", "dict_examp": "She has very strong opinions and she's not afraid to speak her mind.", "lear_examp": "His father is even more eccentric, speaks his mind, and has no manners at all."}, {"sense": "the way someone feels at a particular time", "level": "C2", "dict_examp": "She was in a much more positive frame of mind today.", "lear_examp": "Naturally, these are more difficult factors to cope with for older people, but it just happens to anyone if you're not in the right frame of mind."}, {"sense": "a feeling that you do not need to worry about anything", "level": "C2", "dict_examp": "For my peace of mind, please check that the door is locked.", "lear_examp": "After all, successfully earning your living guarantees peace of mind."}, {"sense": "the ability to deal with a difficult situation quickly and effectively", "level": "C2", "dict_examp": "She had the presence of mind to press the alarm.", "lear_examp": "Frank tried to hide a bag behind his back with great presence of mind."}, {"sense": "If something slips your mind, you forget about it.", "level": "C2", "dict_examp": "I meant to tell her you had phoned, but it completely slipped my mind.", "lear_examp": "There was something but it slipped my mind before I reached it."}, {"sense": "to try to remember", "level": "C2", "dict_examp": "If you cast your mind back, you might recall that I never promised to go.", "lear_examp": "Thus, when I pick one of these stones, I cast my mind back to the specific place where I found it, the person I was, the particular moment."}]}, {"pos": "verb", "senses": [{"sense": "something you say when politely asking if you can do something, or when asking someone else to do something", "level": "A2", "dict_examp": "Do you mind if  I turn the television on?", "lear_examp": "Do you mind if I bring a friend?"}, {"sense": "used to say the choice is not important when responding to an offer or suggestion", "level": "A2", "dict_examp": "\"Would you like tea or coffee?\" \"I don't mind - either.\"", "lear_examp": "I don't mind what we do."}, {"sense": "used to tell someone not to worry about something because it is not important", "level": "A2", "dict_examp": "\"I'm afraid I've lost that wallet you gave me.\" \"Well, never mind, I can easily buy you another one.\"", "lear_examp": "Never mind Ally, forget it, I know you've been busy."}, {"sense": "to be annoyed, unhappy or worried by something", "level": "B1", "dict_examp": "Would she mind if I came too?", "lear_examp": "I want to borrow your bicycle if you don't mind because mine doesn't work well."}, {"sense": "used to request something politely", "level": "B1", "dict_examp": "Would you mind sharing a room?", "lear_examp": "Would you mind if I called you, to know what I've missed?"}, {"sense": "used to tell someone in that you are annoyed and they should not ask about something  private", "level": "C2", "dict_examp": "I wish you'd just mind your own business.", "lear_examp": "Despite knowing that he was only doing what he thought was best for me, I couldn't stand him, and I often told him to mind his own business."}]}]}, {"word": "misunderstand", "poses": [{"pos": "verb", "senses": [{"sense": "to not understand someone or something correctly", "level": "B2", "dict_examp": "He misunderstood the question completely.", "lear_examp": "He meant that he had misunderstood the situation."}, {"sense": "If someone is misunderstood, other people do not understand that they have good qualities.", "level": "C2", "dict_examp": "He was a genius, but misunderstood by society at the time.", "lear_examp": "He was misunderstood by the adult world, he only wanted to be away from everybody, he wanted to be all by himself."}]}]}, {"word": "mission", "poses": [{"pos": "noun", "senses": [{"sense": "someone's duty or purpose in life", "level": "B2", "dict_examp": "Her mission in life was to help the poor.", "lear_examp": "You think that you are \"great,\" since you can cope with both the job and lots of other \"missions\" in life, education, sports and so on."}, {"sense": "an important job, usually traveling somewhere", "level": "C2", "dict_examp": "I'll be going on a fact-finding mission to Paris next week.", "lear_examp": "Apparently somebody had tried to sabotage the mission and given them both different code words."}]}]}, {"word": "mistaken", "poses": [{"pos": "adjective", "senses": [{"sense": "If you are mistaken, or you have a mistaken belief, you are wrong about something.", "level": "C1", "dict_examp": "If you think you can behave like that, you are mistaken.", "lear_examp": "First of all, you mentioned in the article that we promised 45 stalls for that day, but you are completely mistaken as we announced only 35."}]}]}, {"word": "mix", "poses": [{"pos": "verb", "senses": [{"sense": "If two or more substances mix, they combine to make one substance, and if you mix two or more substances, you combine them to make one substance.", "level": "A2", "dict_examp": "Oil and water don't mix.", "lear_examp": "I can work at the bar mixing drinks."}, {"sense": "to have two or more qualities, or to do two or more activities, etc. at the same time", "level": "B1", "dict_examp": "a feeling of anger mixed with sadness", "lear_examp": "That also could be a good way to mix learning and entertainment."}, {"sense": "to meet and talk to people", "level": "B2", "dict_examp": "She enjoys going to parties and mixing with people.", "lear_examp": "I like mixing with people."}, {"sense": "to confuse two people or things by thinking that one person or thing is the other person or thing", "level": "B2", "dict_examp": "People often mix up the sisters because they look so similar.", "lear_examp": "My role was to arrange all the cables for the light and sound, and now we are talking cables of about the length of 100 m each. I'd really had a lot to do not to get them mixed up."}]}, {"pos": "noun", "senses": [{"sense": "a combination of things or people, often in a group", "level": "B1", "dict_examp": "There's a good mix of nationalities in the class.", "lear_examp": "This film is a mix of fantasy and adventure."}]}]}, {"word": "mishap", "poses": [{"pos": "noun", "senses": [{"sense": "an accident or unlucky event which usually is not serious", "level": "C2", "dict_examp": "They suffered a series of mishaps during the trip.", "lear_examp": "Personally speaking, I have always received courteous attention from my parents and this has helped me overcome all mishaps that may occur."}]}]}, {"word": "mixture", "poses": [{"pos": "noun", "senses": [{"sense": "a substance made of other substances that have been combined", "level": "B2", "dict_examp": "The mixture of flour, water and yeast is then left in a warm place for four hours.", "lear_examp": ""}, {"sense": "when there is a combination of two or more ideas, qualities, styles, etc.", "level": "B2", "dict_examp": "Their house is decorated in a mixture of styles.", "lear_examp": "The result is a very strange mixture of different styles."}]}]}, {"word": "misplace", "poses": [{"pos": "verb", "senses": [{"sense": "to lose something temporarily by forgetting where you have put it", "level": "C2", "dict_examp": "I seem to have misplaced my keys.", "lear_examp": "It is only when these possessions are lost or stolen or simply misplaced that they are greatly missed."}]}]}, {"word": "misery", "poses": [{"pos": "noun", "senses": [{"sense": "great suffering or unhappiness", "level": "B2", "dict_examp": "The war brought misery to millions of people.", "lear_examp": "A few hours of amusement for us might mean a whole life of misery for the animals."}]}]}, {"word": "misleading", "poses": [{"pos": "adjective", "senses": [{"sense": "making someone believe something that is untrue", "level": "B2", "dict_examp": "misleading information/statements", "lear_examp": "I found it rather misleading and I would like to provide true information about the festival."}]}]}, {"word": "misinform", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone false information", "level": "C1", "dict_examp": "I'm afraid you've been misinformed about your test results.", "lear_examp": "From the article, I got the impression that your reporter was misinformed about certain facts which are crucial for a better understanding of the event."}]}]}, {"word": "mislead", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone believe something that is untrue by giving them information that is wrong or not complete", "level": "C1", "dict_examp": "She claims the public was misled by the government.", "lear_examp": "I would like to point out that some information in the article was wrong, which could mislead your readers."}]}]}, {"word": "misinterpret", "poses": [{"pos": "verb", "senses": [{"sense": "to understand something in the wrong way", "level": "C2", "dict_examp": "He claims his speech was deliberately misinterpreted by journalists.", "lear_examp": "A direct consequence of this is that adults misinterpret their intentions and object to youth's lack of respect."}]}]}, {"word": "mist", "poses": [{"pos": "noun", "senses": [{"sense": "small drops of water in the air which make it difficult to see objects which are not near", "level": "B2", "dict_examp": "The early-morning mist soon lifted/cleared.", "lear_examp": "The mist was getting thicker all the time and the rain was coming down harder."}]}]}, {"word": "Miss", "poses": [{"pos": "noun", "senses": [{"sense": "a title for a girl or woman who is not married, used before her family name or full name", "level": "A1", "dict_examp": "Dr. White will see you now, Miss Carter.", "lear_examp": "Dear Miss Timson, How are you?"}]}]}, {"word": "modal (verb)", "poses": [{"pos": "noun", "senses": [{"sense": "a verb, for example \"can,\" \"might\" or \"must,\" that is used before another verb to show that something is possible, necessary, etc.", "level": "B1", "dict_examp": "The first verb in the following sentence is a modal: We ought to pay the gas bill.", "lear_examp": ""}]}]}, {"word": "misinterpretation", "poses": [{"pos": "noun", "senses": [{"sense": "when something is understood in the wrong way", "level": "C2", "dict_examp": "What he said was a complete misinterpretation of my views.", "lear_examp": "As written in the letter, which I hope you have received from my friend, I worked with in this organization, we want to inform you of the true version in order to avoid misinterpretations and misunderstandings."}]}]}, {"word": "misunderstanding", "poses": [{"pos": "noun", "senses": [{"sense": "when someone does not understand something correctly", "level": "B2", "dict_examp": "There must have been a misunderstanding.", "lear_examp": "I suppose there was a misunderstanding, because he told me on the phone that he had arranged with you to come next week."}]}]}, {"word": "misuse", "poses": [{"pos": "verb", "senses": [{"sense": "to use something in the wrong way or for the wrong purpose", "level": "C1", "dict_examp": "He misused his position to obtain money dishonestly.", "lear_examp": "By doing this the money won't be misused because we won't have to build a new indoor court that will not be used at all times."}]}, {"pos": "noun", "senses": [{"sense": "the use of something in the wrong way or for the wrong purpose", "level": "C1", "dict_examp": "They accused him of misuse of power.", "lear_examp": "Can we disregard the consequences there may be of the misuse of the above innovations of technology?"}]}]}, {"word": "miss", "poses": [{"pos": "verb", "senses": [{"sense": "to not go to something", "level": "A2", "dict_examp": "You'll fall behind in your studies if you keep missing school.", "lear_examp": "You only missed the best party of the year!"}, {"sense": "to feel sad about someone that you do not see now or something that you do not have or do now", "level": "A2", "dict_examp": "I really missed her when she went away.", "lear_examp": "I miss you a lot."}, {"sense": "to arrive too late to get on a bus, train, aircraft, etc.", "level": "A2", "dict_examp": "You'll miss your train if you don't hurry up.", "lear_examp": "Even if we missed the train, I was happy and this was the most important thing."}, {"sense": "to not use an opportunity to do something", "level": "B1", "dict_examp": "You can't afford to miss a chance like this.", "lear_examp": "It's the most important tennis competition in my town, and I can't miss this opportunity."}, {"sense": "to avoid doing or experiencing something", "level": "B1", "dict_examp": "You should leave early if you want to miss the rush hour.", "lear_examp": "If you want to have a nice time, you should leave the hotel early in the morning because in this way you will miss the rush-hour traffic."}, {"sense": "to not see or hear something", "level": "B1", "dict_examp": "Sorry, I missed that, could you repeat it please?", "lear_examp": "First of all, the Festival began on time at midday with King Cup. Maybe you might have missed that part."}, {"sense": "to fail to do something at the correct time or to be too late to do something or see something or someone", "level": "B2", "dict_examp": "I wanted to see that movie but I missed it.", "lear_examp": "I missed the dinner I was going to have with my best friend in London."}, {"sense": "to not hit or catch something as you intended", "level": "B2", "dict_examp": "It should have been such an easy goal and he missed.", "lear_examp": "He aimed for the heart, and, when he was about to fire, an innocent pigeon landed on his rifle. Paul wasn't expecting this, and his shot missed the judge."}, {"sense": "to be too late to do or get something", "level": "C2", "dict_examp": "I'm afraid you've missed the boat. The concert tickets have sold out.", "lear_examp": "What if she never had another chance?  What if she missed the boat? Overcome by the anxiety and the lack of sleep, the first thing she did in the morning was to pick up two of her best poems and put them in an envelope."}, {"sense": "to not do or have something that you would enjoy or something that other people do or have", "level": "B2", "dict_examp": "I got to the party too late and missed out on all the fun.", "lear_examp": "They don't know what they are missing out on."}]}]}, {"word": "misbehave", "poses": [{"pos": "verb", "senses": [{"sense": "to behave badly", "level": "C1", "dict_examp": "If you misbehave, you will be punished - it's as simple as that.", "lear_examp": "Firstly, an apology is due to all nearby residents whose lives were disturbed by a few somewhat misbehaving students."}]}]}, {"word": "moan", "poses": [{"pos": "verb", "senses": [{"sense": "to make a low sound, especially because you are in pain", "level": "C2", "dict_examp": "She lay on the floor moaning.", "lear_examp": "He moaned and groaned but he did not have any obvious signs of injuries."}, {"sense": "to complain or speak in a way that shows you are unhappy", "level": "C2", "dict_examp": "He's always moaning about something.", "lear_examp": "She had been moaning all week about her job and her difficulties with this and that, but she couldn't remember having asked even once how Simon was getting along."}]}]}, {"word": "misfortune", "poses": [{"pos": "noun", "senses": [{"sense": "bad luck, or an unlucky event", "level": "C1", "dict_examp": "He had the misfortune to fall in love with a married woman.", "lear_examp": "But try not to wear black because they believe it brings bad luck and misfortune."}]}]}, {"word": "misty", "poses": [{"pos": "adjective", "senses": [{"sense": "If the weather is misty, there is a cloud of small drops of water in the air, which makes it difficult to see objects that are not near.", "level": "B2", "dict_examp": "a cold and misty morning", "lear_examp": "But the evenings were a bit cold and misty."}]}]}, {"word": "missing", "poses": [{"pos": "adjective", "senses": [{"sense": "If someone or something is missing, you cannot find them because they are not in their usual place.", "level": "A2", "dict_examp": "Her father has been missing since September 1992.", "lear_examp": "Yesterday, when I reached home, I found that my note book was missing."}, {"sense": "not included in something", "level": "B1", "dict_examp": "There are a couple of names missing from the list.", "lear_examp": "But even with all this furniture, I feel like there is something missing, so I have decided to buy some posters of my favorite rock bands and put them on the walls."}]}]}, {"word": "miracle", "poses": [{"pos": "noun", "senses": [{"sense": "something that is very surprising or difficult to believe", "level": "B2", "dict_examp": "an economic miracle", "lear_examp": "Every single day we hear about new products, new methods, new technological miracles which have turned our daily lives upside down."}]}]}, {"word": "mirror", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of glass with a shiny metallic material on one side which produces an image of anything that is in front of it", "level": "A2", "dict_examp": "the bathroom mirror", "lear_examp": "The mirror was given to me by Jenny."}]}]}, {"word": "mistake", "poses": [{"pos": "noun", "senses": [{"sense": "something that you do or think that is wrong", "level": "A2", "dict_examp": "He made a lot of mistakes in his written test.", "lear_examp": "You might need an eraser if you make a mistake."}, {"sense": "If you do something by mistake, you do it without intending to.", "level": "B1", "dict_examp": "I picked up someone else's book by mistake.", "lear_examp": "After 30 minutes, a man appeared telling us that he had taken our suitcases by mistake."}]}]}, {"word": "miserable", "poses": [{"pos": "adjective", "senses": [{"sense": "sad", "level": "B1", "dict_examp": "I just woke up feeling miserable.", "lear_examp": "I feel very miserable and my boyfriend is still angry with me because that ring was his gift for our first year together."}, {"sense": "very unpleasant or bad, and causing someone to feel unhappy", "level": "B2", "dict_examp": "miserable weather", "lear_examp": "Heathcliff always swears revenge because of the miserable situation the other characters have put him in."}]}]}, {"word": "missile", "poses": [{"pos": "noun", "senses": [{"sense": "an explosive weapon which can travel long distances through the air", "level": "C2", "dict_examp": "nuclear missiles", "lear_examp": "In the meantime dissident elements of the terrorist organization had tried to make contact with the United States intelligence organizations to warn them of possible bomb or missile attacks on their Kenyan and Tanzanian missions."}]}]}, {"word": "mode", "poses": [{"pos": "noun", "senses": [{"sense": "a way of doing something", "level": "C1", "dict_examp": "a mode of transport", "lear_examp": "In conclusion, I think that both modes of education play a great role in educating children to be good members of society."}]}]}, {"word": "moderately", "poses": [{"pos": "adverb", "senses": [{"sense": "to a degree that is average but not very great", "level": "C2", "dict_examp": "There's very little moderately priced housing in this area.", "lear_examp": "Very often a moderately well-off person would take his chance and try to change his life, hopefully for the better."}]}]}, {"word": "mom", "poses": [{"pos": "noun", "senses": [{"sense": "a mother", "level": "A1", "dict_examp": "I miss my mom and dad a lot.", "lear_examp": "It is very important for me because my mom gave it to me for my birthday last year."}]}]}, {"word": "monitor", "poses": [{"pos": "noun", "senses": [{"sense": "a screen that shows information or pictures, usually connected to a computer", "level": "B2", "dict_examp": "I bought a bigger monitor for my computer.", "lear_examp": "We know our world from TV screens and computer monitors."}, {"sense": "someone whose job is to watch or check something", "level": "B2", "dict_examp": "a class/school monitor", "lear_examp": "On Wednesday the 13th I'll be a monitor in a studying group (it's a task due to my scholarship)."}]}, {"pos": "verb", "senses": [{"sense": "to watch and check someone or something carefully over a period of time", "level": "C1", "dict_examp": "to monitor progress", "lear_examp": "As I said before, a close and personalized monitoring of the child (particularly when young) is very important, and the only way to do this is to reduce the number of students per class."}]}]}, {"word": "monkey", "poses": [{"pos": "noun", "senses": [{"sense": "a hairy animal with a long tail that lives in hot countries and climbs trees", "level": "A2", "dict_examp": "Of all the animals at the zoo he liked the monkeys best.", "lear_examp": "You can see animals like monkeys and birds, you can feed the fishes and also have a great meal at the restaurant."}]}]}, {"word": "modification", "poses": [{"pos": "noun", "senses": [{"sense": "a small change to something", "level": "C1", "dict_examp": "We've made a few modifications to the system.", "lear_examp": "Although I am very happy with the current design of my house I may make some modifications in the future."}]}]}, {"word": "moon", "poses": [{"pos": "noun", "senses": [{"sense": "the round object that moves in the sky around the Earth and can be seen at night", "level": "A2", "dict_examp": "We gazed at the moon.", "lear_examp": "There is a big window and from it I can see mountains, the sky, the moon and the sun."}]}]}, {"word": "modest", "poses": [{"pos": "adjective", "senses": [{"sense": "not large in size or amount, or not expensive or important", "level": "B2", "dict_examp": "a modest amount of money", "lear_examp": "It is an honour for us to receive such a well-known writer in our modest school."}, {"sense": "If you are modest, you do not talk in a proud way about your skills or successes.", "level": "C1", "dict_examp": "He's very modest about his achievements.", "lear_examp": "Earning a lot she is still very modest and does not show any signs of vanity at all."}]}]}, {"word": "Monday", "poses": [{"pos": "noun", "senses": [{"sense": "the day of the week after Sunday and before Tuesday", "level": "A1", "dict_examp": "I start my new job on Monday.", "lear_examp": "He goes to school Monday and Friday."}]}]}, {"word": "momentum", "poses": [{"pos": "noun", "senses": [{"sense": "the continuing progress, motion, development, etc., that a person or thing is experiencing", "level": "C2", "dict_examp": "A falling object gains momentum as it falls.", "lear_examp": "Mr. Emerson strongly believes in social equality, and his views can be regarded as the reflection of the democratic movements gaining momentum at the beginning of our century."}]}]}, {"word": "monthly", "poses": [{"pos": "adjective", "senses": [{"sense": "happening or produced once a month", "level": "B1", "dict_examp": "monthly payments", "lear_examp": "At the moment I pay £550 monthly plus bills."}]}]}, {"word": "monopoly", "poses": [{"pos": "noun", "senses": [{"sense": "control by a company or group over all of a type of business or activity", "level": "C2", "dict_examp": "The Postal Service is guaranteed a monopoly on all first-class letters.", "lear_examp": "In fact, it is quite obvious that the reason why a second supermarket is planned in our area is related to the current monopoly of the first supermarket."}]}]}, {"word": "monotonous", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is monotonous, it is boring because it stays the same.", "level": "C1", "dict_examp": "a monotonous voice", "lear_examp": "The voice of the speaker is monotonous and lacks any rhythm or modulation, intrinsic parts of any language without which proper acquisition of it is impossible."}]}]}, {"word": "moonlight", "poses": [{"pos": "noun", "senses": [{"sense": "light that comes from the moon", "level": "B2", "dict_examp": "In the moonlight, she looked even more beautiful.", "lear_examp": "The floor was dark, and the moonlight which came through the window gave the only light."}]}]}, {"word": "moderation", "poses": [{"pos": "noun", "senses": [{"sense": "If you do something in moderation, you do not do it too much.", "level": "C1", "dict_examp": "I only drink alcohol in moderation.", "lear_examp": "While shopping can make one feel good and even has its positive impact on the retail economy, I think it should be done in moderation."}]}]}, {"word": "moderate", "poses": [{"pos": "adjective", "senses": [{"sense": "average in size or amount and not too much", "level": "C1", "dict_examp": "a moderate income", "lear_examp": "We have to eat healthy food and in moderate quantities, and to do our daily exercises."}]}, {"pos": "verb", "senses": [{"sense": "to make something less extreme", "level": "C2", "dict_examp": "He's trying to moderate his drinking.", "lear_examp": ""}]}]}, {"word": "model", "poses": [{"pos": "noun", "senses": [{"sense": "a design of machine or car that is made by a particular company", "level": "A2", "dict_examp": "a luxury/new model", "lear_examp": "I like it very much, because it is the latest model and nobody at our school has it."}, {"sense": "a smaller copy of a real object, often used to show how something works or what it looks like", "level": "A2", "dict_examp": "a model of the railroad", "lear_examp": "I'm good at making models and telling stories."}, {"sense": "someone whose job is to wear fashionable clothes, be in photographs, etc., in order to advertise things", "level": "B1", "dict_examp": "a fashion model", "lear_examp": "In the future I hope to be a clothes designer or a top model."}, {"sense": "someone or something that is an example for others to copy", "level": "C2", "dict_examp": "Their educational system was a model for other countries.", "lear_examp": "She is a \"model\" citizen of the Fahrenheit 451 society: she doesn't ask questions, she doesn't think by herself, either."}]}]}, {"word": "mood", "poses": [{"pos": "noun", "senses": [{"sense": "the way you feel at a particular time", "level": "B1", "dict_examp": "She's in a bad mood.", "lear_examp": "I reckon I was in a bad mood, but nothing had happened to end our relationship."}, {"sense": "to not be friendly to other people because you are feeling angry", "level": "B2", "dict_examp": "Ignore him - he's in a mood.", "lear_examp": "I didn't mind the rain, actually I prefer rain when I am in a mood like that."}, {"sense": "to want to do or have something", "level": "C2", "dict_examp": "I'm not really in the mood for shopping at the moment.", "lear_examp": "Should you be in the mood for a walk around the lake then go for it."}]}]}, {"word": "moral", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to beliefs about what is right or wrong", "level": "B2", "dict_examp": "moral values", "lear_examp": "Her ideas and her moral values are pure, conveyed clearly and imparted to young children in spite of their lively jauntiness."}, {"sense": "behaving in ways considered by most people to be correct and honest", "level": "C1", "dict_examp": "He's a highly moral man.", "lear_examp": "Taking into account all these matters, we can see a moral, brave man fighting for his country and for what he believes in."}]}, {"pos": "noun", "senses": [{"sense": "a lesson that can be learned from a story or event", "level": "C1", "dict_examp": "The moral of the story is never lie.", "lear_examp": "The hidden moral she's trying to tell me is that I'll have to do everything by myself."}, {"sense": "standards for good behavior", "level": "C2", "dict_examp": "He has no morals.", "lear_examp": "Without limits, without morals, a child cannot build his own personality."}]}]}, {"word": "month", "poses": [{"pos": "noun", "senses": [{"sense": "one of the twelve periods of time that a year is divided into", "level": "A1", "dict_examp": "February is the shortest month.", "lear_examp": "I need to ask you, if I can start this course next month, in January, and finish in June."}, {"sense": "a period of approximately four weeks", "level": "A1", "dict_examp": "She'll be working here for six months.", "lear_examp": "My boy friend and I visit every winter for 3-4 months."}]}]}, {"word": "monument", "poses": [{"pos": "noun", "senses": [{"sense": "an old building or place that is important in history", "level": "B1", "dict_examp": "an ancient monument", "lear_examp": "In these cities you will be able to visit ancient monuments."}, {"sense": "a structure that is built to make people remember an event in history or a famous person", "level": "B2", "dict_examp": "In the square in front of the hotel stands a monument to all the people killed in the war.", "lear_examp": "First I went to see the Larienki Park and admired the beautiful monument to the greatest Polish composer - Chopin."}]}]}, {"word": "modestly", "poses": [{"pos": "adverb", "senses": [{"sense": "by a small size or amount", "level": "C1", "dict_examp": "At just £9, the DVD is very modestly priced.", "lear_examp": ""}, {"sense": "in a quiet way that does not show off your abilities, wealth, success, etc.", "level": "C2", "dict_examp": "She spoke modestly about her work.", "lear_examp": "Some of them extravagantly and some modestly, depending on the status, importance and financial affordability of the people getting married."}]}]}, {"word": "moment", "poses": [{"pos": "noun", "senses": [{"sense": "now", "level": "A2", "dict_examp": "I'm afraid she's not here at the moment.", "lear_examp": "Dear Sebastian, At the moment I'm in Spain."}, {"sense": "a very short period of time", "level": "A2", "dict_examp": "I'll be back in a moment.", "lear_examp": "I received your letter just a moment ago and I am happy that you are able to visit my country."}, {"sense": "a point in time", "level": "B1", "dict_examp": "Just at that moment, the phone rang.", "lear_examp": "At that moment my phone started to ring."}, {"sense": "said in order to interrupt someone, or to get their attention or when you have suddenly thought of something important", "level": "B1", "dict_examp": "Now, wait a moment - I don't agree with that.", "lear_examp": ""}, {"sense": "If you do something for the moment, you are doing it now, but might do something different in the future.", "level": "B2", "dict_examp": "Let's carry on with what we agreed for the moment.", "lear_examp": "For the moment I am unemployed so I have plenty of time to give you a hand."}, {"sense": "as soon as", "level": "C2", "dict_examp": "I'll call you the moment I hear anything.", "lear_examp": "I think these differences become relevant from the moment that they decide they are going to make a fire."}, {"sense": "If you do something on the spur of the moment, you do it suddenly, without planning it.", "level": "C2", "dict_examp": "On the spur of the moment we decided to go to London for the day.", "lear_examp": "In reality, many people buy things on the spur of the moment only to discover later that they, in fact, do not meet their expectations."}]}]}, {"word": "modern", "poses": [{"pos": "adjective", "senses": [{"sense": "using the newest ideas, design, technology, etc. and not traditional", "level": "A2", "dict_examp": "modern architecture/art/medicine", "lear_examp": "I am going to use the green paint. I think it looks very modern."}, {"sense": "relating to the present time and not to the past", "level": "B1", "dict_examp": "modern society", "lear_examp": "You'll see the modern Japan."}]}]}, {"word": "money", "poses": [{"pos": "noun", "senses": [{"sense": "the coins or bills  that are used to buy things", "level": "A1", "dict_examp": "How much money do you have?", "lear_examp": "He is from England and he is very friendly and he  works a lot because he likes money."}]}]}, {"word": "monster", "poses": [{"pos": "noun", "senses": [{"sense": "an imaginary creature that is large, ugly, and frightening", "level": "B1", "dict_examp": "a sea monster", "lear_examp": "It was a cartoon, telling a story about a monster, Stitch, who changed the life of a little girl called Lilo."}, {"sense": "a cruel and frightening person", "level": "C2", "dict_examp": "To the whole world, he was a monster.", "lear_examp": "In her opinion he was a monster without any human feelings."}]}]}, {"word": "monetary", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to money", "level": "C2", "dict_examp": "monetary policy", "lear_examp": "Indeed such a country, by accepting tourists, can exchange its probably weak currency with potentially hard currencies of strong monetary value, and help its economy."}]}]}, {"word": "modify", "poses": [{"pos": "verb", "senses": [{"sense": "to change something in order to improve it", "level": "C1", "dict_examp": "The plans will have to be modified to reduce costs.", "lear_examp": "To sum up, the Work Experience in Britain program should be modified as it was a far cry from what we had been led to expect."}]}]}, {"word": "motivation", "poses": [{"pos": "noun", "senses": [{"sense": "enthusiasm for doing something", "level": "B2", "dict_examp": "You need a lot of motivation to succeed.", "lear_examp": "I hope my motivation and my hard work capacity can help me cope with the work successfully."}, {"sense": "the need or reason for doing something", "level": "C1", "dict_examp": "One motivation for reducing the staff was the need to cut costs.", "lear_examp": "Although money is the main motivation, for many people, to work, I have come across many people who have worked voluntarily or for less money to gain relevant experience."}]}]}, {"word": "mosquito", "poses": [{"pos": "noun", "senses": [{"sense": "a small flying insect that sucks your blood, sometimes causing malaria", "level": "B1", "dict_examp": "mosquito bites", "lear_examp": "You should stay in a city because of the things that only a city can offer and an important detail about countryside is the mosquitoes, there are a lot!"}]}]}, {"word": "mount", "poses": [{"pos": "verb", "senses": [{"sense": "to arrange a series of organized activities that will achieve a particular result", "level": "C2", "dict_examp": "Students mounted a huge protest against fee increases.", "lear_examp": "In Orson Welles' story, aliens mount an offensive to take over the world, whereas in Wyndham's book, the world is quietly and slowly conquered by plants."}, {"sense": "to increase in amount or level", "level": "C2", "dict_examp": "Tension in the room was mounting.", "lear_examp": "One day, I was sitting in a dentist's waiting room, and as tension mounted and the old \"dentist fear\" was eating away at me, I availed myself of the opportunity to browse through a couple of magazines lying on the table."}, {"sense": "to fix an object onto something", "level": "C2", "dict_examp": "They've mounted a camera on the wall by the door.", "lear_examp": "He or any other guest will be happy to explain any of the items mounted on the wall and to reminisce about old times."}, {"sense": "to get on a horse or bicycle", "level": "C2", "dict_examp": "I helped him mount the horse.", "lear_examp": "After only a short walk, he had to help two of them to mount the mules."}, {"sense": "to gradually become a large amount", "level": "C2", "dict_examp": "My homework is really mounting up this week.", "lear_examp": ""}]}]}, {"word": "mostly", "poses": [{"pos": "adverb", "senses": [{"sense": "mainly or most of the time", "level": "B1", "dict_examp": "Her friends are mostly  Italian.", "lear_examp": "Normally I wear black or blue jeans and I mostly wear t-shirts and a light jacket."}]}]}, {"word": "mother", "poses": [{"pos": "noun", "senses": [{"sense": "a female parent", "level": "A1", "dict_examp": "a single mother", "lear_examp": "Eduardo is a good boy ... he helps his mother at home."}, {"sense": "the first language that you learn when you are a child", "level": "B2", "dict_examp": "Italian is my mother tongue but I started to learn English when I was six.", "lear_examp": "I can speak English and French fluently, added to my mother tongue, Japanese."}]}]}, {"word": "mosque", "poses": [{"pos": "noun", "senses": [{"sense": "a building for Islamic religious activities and worship", "level": "A2", "dict_examp": "They've just built a mosque there.", "lear_examp": "Dear Wendy, The mosque at the end of town is an interesting place."}]}]}, {"word": "motorcycle", "poses": [{"pos": "noun", "senses": [{"sense": "a vehicle with two wheels and an engine", "level": "A2", "dict_examp": "She jumped on her motorcycle and raced off down the road.", "lear_examp": "My father bought a motorcycle."}]}]}, {"word": "motivated", "poses": [{"pos": "adjective", "senses": [{"sense": "enthusiastic and determined to succeed", "level": "B2", "dict_examp": "a very motivated student", "lear_examp": "Furthermore, after a break people are often very motivated to go on with their education."}]}]}, {"word": "more", "poses": [{"pos": "determiner", "senses": [{"sense": "something in addition to what you already have", "level": "A1", "dict_examp": "Would you like some more food?", "lear_examp": "Now I have more free time, I and my family go to the swimming pool."}, {"sense": "a greater number or amount of people or things", "level": "A1", "dict_examp": "There are more people here today than yesterday.", "lear_examp": "In the disco I can meet more new people."}, {"sense": "If you do not do something or something does not happen any more, you have stopped doing it or it does not now happen.", "level": "A2", "dict_examp": "I don't do yoga any more.", "lear_examp": "I don't need it any more because I have a new one."}, {"sense": "one more time", "level": "B1", "dict_examp": "I'd like to visit the colleges once more before we leave.", "lear_examp": "On Friday I will see him once more."}, {"sense": "an increasing number", "level": "B2", "dict_examp": "More and more people are choosing not to buy a car.", "lear_examp": "More and more youngsters have problems with reading and writing."}]}, {"pos": "adverb", "senses": [{"sense": "used before an adjective or adverb to show that someone or something has a greater amount of a quality than someone or something else", "level": "A1", "dict_examp": "This exercise is more difficult than the last one.", "lear_examp": "This place is more beautiful than Stratford."}, {"sense": "used to show that something happens a greater number of times than before", "level": "B1", "dict_examp": "We eat out a lot more than we used to.", "lear_examp": "We really should do this more often."}, {"sense": "almost or approximately", "level": "B2", "dict_examp": "We've more or less finished work on the house.", "lear_examp": "I will now give you some information, so that you know more or less what you can expect."}, {"sense": "more as time passes", "level": "B2", "dict_examp": "It's becoming more and more expensive to buy property in the city.", "lear_examp": "Cycling is getting more and more popular in Poland."}]}]}, {"word": "morally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a moral way", "level": "B2", "dict_examp": "morally wrong/unacceptable", "lear_examp": "Doesn't it seems morally wrong? Animals need their space and natural surroundings to survive."}]}]}, {"word": "most", "poses": [{"pos": "adverb", "senses": [{"sense": "used before an adjective to show that someone or something has the greatest amount of a quality", "level": "A2", "dict_examp": "She's the most beautiful girl I've ever seen.", "lear_examp": "It is the most famous place in Edinburgh and it is interesting too."}, {"sense": "more than anything or anyone else", "level": "A2", "dict_examp": "Which subject do you like (the) most?", "lear_examp": "I love pink the most!"}, {"sense": "mostly or usually", "level": "C1", "dict_examp": "I enjoyed it for the most part.", "lear_examp": "First of all, for the most part, people have to use computers in their jobs."}]}, {"pos": "pronoun", "senses": [{"sense": "almost all", "level": "A2", "dict_examp": "In this school, most of the children are from the Chinese community.", "lear_examp": "I received a lot of presents. Most of them were toys."}, {"sense": "more than anyone or anything else", "level": "B2", "dict_examp": "Everyone was generous but Lizzie gave the most.", "lear_examp": ""}, {"sense": "to take full advantage of something because it may not last long", "level": "B2", "dict_examp": "We should make the most of this good weather.", "lear_examp": "Remember, always try to make the most of your life."}]}, {"pos": "determiner", "senses": [{"sense": "almost all", "level": "A2", "dict_examp": "I don't eat meat, but I like most types of fish.", "lear_examp": "Most people don't buy fast food."}, {"sense": "the largest amount", "level": "B1", "dict_examp": "Carlos earns the most money of all of us.", "lear_examp": "So, in this game, the people are there to win the most money they can."}]}]}, {"word": "morning", "poses": [{"pos": "noun", "senses": [{"sense": "the first half of the day, from the time when the sun rises or you wake up until the middle of the day", "level": "A1", "dict_examp": "Friday morning", "lear_examp": "I wake up at 8 a.m every morning."}, {"sense": "used to say hello to someone in the morning", "level": "A1", "dict_examp": "Good morning, Sarah!", "lear_examp": ""}, {"sense": "during the early part of the day", "level": "A1", "dict_examp": "I listen to the radio in the morning.", "lear_examp": "He loves to get up early in the morning."}, {"sense": "2/3/4, etc. o'clock at night", "level": "B1", "dict_examp": "My car alarm went off at 3 o'clock in the morning.", "lear_examp": "I came home at 4 o'clock in the morning."}, {"sense": "tomorrow morning", "level": "B1", "dict_examp": "I'll pack in the morning.", "lear_examp": ""}]}]}, {"word": "mother-in-law", "poses": [{"pos": "noun", "senses": [{"sense": "the mother of your husband or wife", "level": "B2", "dict_examp": "I get on well with my mother-in-law.", "lear_examp": "I was a little afraid of getting into contact with my mother-in-law."}]}]}, {"word": "motive", "poses": [{"pos": "noun", "senses": [{"sense": "a reason for doing something", "level": "B2", "dict_examp": "The police don't yet know the motive for the killing.", "lear_examp": "It was not likely that he had done the murder - because there was no motive."}]}]}, {"word": "motor", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a machine or vehicle that changes electricity or fuel into movement and makes it work", "level": "B2", "dict_examp": "The pump is powered by a small electric motor.", "lear_examp": "The boat is 26 feet long; it is a sailboat with an inboard motor."}]}]}, {"word": "motorist", "poses": [{"pos": "noun", "senses": [{"sense": "a person who drives a car", "level": "B2", "dict_examp": "Motorists will be hit hard by the rise in fuel prices.", "lear_examp": "According to motorists, cars are better than bikes, as you feel more comfortable and relaxed inside them."}]}]}, {"word": "morale", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of confidence or hope for the future that people feel", "level": "C2", "dict_examp": "The increase in pay should help to improve staff morale.", "lear_examp": "Recent events have caused the morale of the troops to disintegrate completely."}]}]}, {"word": "motivate", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone enthusiastic about doing something", "level": "C1", "dict_examp": "Teaching is all about motivating people to learn.", "lear_examp": "There are a lot of tools that can be used to motivate people and it is the Human Resources department who should take care of using them properly."}, {"sense": "to cause someone to behave in a particular way", "level": "C1", "dict_examp": "Some people are motivated by greed.", "lear_examp": "Most of us are motivated by fear."}]}]}, {"word": "moral", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to beliefs about what is right or wrong", "level": "B2", "dict_examp": "moral values", "lear_examp": "Her ideas and her moral values are pure, conveyed clearly and imparted to young children in spite of their lively jauntiness."}, {"sense": "behaving in ways considered by most people to be correct and honest", "level": "C1", "dict_examp": "He's a highly moral man.", "lear_examp": "Taking into account all these matters, we can see a moral, brave man fighting for his country and for what he believes in."}]}, {"pos": "noun", "senses": [{"sense": "a lesson that can be learned from a story or event", "level": "C1", "dict_examp": "The moral of the story is never lie.", "lear_examp": "The hidden moral she's trying to tell me is that I'll have to do everything by myself."}, {"sense": "standards for good behavior", "level": "C2", "dict_examp": "He has no morals.", "lear_examp": "Without limits, without morals, a child cannot build his own personality."}]}]}, {"word": "moreover", "poses": [{"pos": "adverb", "senses": [{"sense": "also and more importantly", "level": "B2", "dict_examp": "The whole report is badly written. Moreover, it's inaccurate.", "lear_examp": "Because it is a well-known hotel it should be easy to find it. Moreover, it is really well-located, so it will allow you to move around the city without any problem."}]}]}, {"word": "motion", "poses": [{"pos": "noun", "senses": [{"sense": "when or how something moves", "level": "C2", "dict_examp": "The motion of the boat made him feel sick.", "lear_examp": "The motion of the air caused by the jet engines makes all the windows tremble and some of them break."}, {"sense": "a suggestion that you make in a formal meeting or court of law", "level": "C2", "dict_examp": "Someone proposed a motion to increase the membership fee.", "lear_examp": "Nevertheless Mark and Paul maintained their ground and submitted motion after motion to the parliament in order to be allowed to continue their work and use their technique commercially."}, {"sense": "to do something because you are expected to do it and not because you want to", "level": "C2", "dict_examp": "Lately he seems to just go through the motions and doesn't enjoy the job at all.", "lear_examp": "She went through the motions of every-day-life without enthusiasm."}]}]}, {"word": "mortality", "poses": [{"pos": "noun", "senses": [{"sense": "the number of deaths at a particular time or in a particular place", "level": "C2", "dict_examp": "infant mortality", "lear_examp": "In addition, these countries often have a high birth-rate in combination with a high mortality rate."}]}]}, {"word": "mountain", "poses": [{"pos": "noun", "senses": [{"sense": "a raised part of the Earth's surface, much larger than a hill, the top of which might be covered in snow", "level": "A2", "dict_examp": "The Matterhorn is one of the biggest mountains in Europe.", "lear_examp": "Perhaps we can go to the mountains."}, {"sense": "a large amount of something", "level": "C2", "dict_examp": "I’ve got mountains of work to do.", "lear_examp": "But I had to get up to deal with a mountain of documents on my desk."}]}]}, {"word": "mud", "poses": [{"pos": "noun", "senses": [{"sense": "a thick liquid mixture of soil and water, or this mixture after it has dried", "level": "B2", "dict_examp": "You've got mud on your shoes.", "lear_examp": "It may sound funny, but mud, gravel and snow lying on the school's floors is not a nice sight, so we change our shoes without questioning that rule."}]}]}, {"word": "mouse", "poses": [{"pos": "noun", "senses": [{"sense": "a small piece of equipment connected to a computer that you move with your hand to control what the computer does", "level": "A2", "dict_examp": "Move your mouse over the screen.", "lear_examp": "And I had a present! An optical mouse for my computer!"}, {"sense": "a small animal with fur and a long, thin tail", "level": "A2", "dict_examp": "a field mouse", "lear_examp": "Some students and I put a mouse on the teacher's chair and he seemed to be afraid, but he accepted the joke."}]}]}, {"word": "movie theater", "poses": [{"pos": "noun", "senses": [{"sense": "a building where you go to watch movies", "level": "A1", "dict_examp": "There are three movie theaters nearby.", "lear_examp": "We will go to the movie theater near Duran's home."}]}]}, {"word": "Mrs.", "poses": [{"pos": "noun", "senses": [{"sense": "a title for a married woman, used before her family name or full name", "level": "A1", "dict_examp": "Mrs. Wood/Mrs. Jean Wood", "lear_examp": "Dear Mrs. Dunn, Could you help me?"}]}]}, {"word": "move", "poses": [{"pos": "verb", "senses": [{"sense": "to change place or position, or to make something change place or position", "level": "A2", "dict_examp": "I'm so cold I can't move my fingers.", "lear_examp": "When you move the mouse, it lights up."}, {"sense": "If a person or an organization moves, they go to a different place to live or work.", "level": "B1", "dict_examp": "We're thinking of moving - perhaps to the country.", "lear_examp": "As my office will move to the west of the town next month, it will be difficult for me to still live in this house."}, {"sense": "to change the time or order of something", "level": "B2", "dict_examp": "We need to move the meeting back a few days.", "lear_examp": "Unfortunately, we have to move the time of our departure because of technical problems."}, {"sense": "to make someone have strong feelings of sadness or sympathy", "level": "B2", "dict_examp": "I was deeply moved by his speech.", "lear_examp": "I was very moved: it was so beautiful!"}, {"sense": "to hurry", "level": "C2", "dict_examp": "We're leaving in five minutes, so get moving!", "lear_examp": "\"Oh, look at the time, we must get moving!\""}, {"sense": "to begin living in a new home", "level": "B1", "dict_examp": "She's just moved in with some friends.", "lear_examp": "Well, when I just moved in, I didn't do anything, except put a new bed in my bedroom."}, {"sense": "to change from one subject to another when you are talking or writing", "level": "C1", "dict_examp": "Let's move on to the next topic.", "lear_examp": "Let's move on to the way of teaching and the subjects."}, {"sense": "to start doing a new activity", "level": "C1", "dict_examp": "I'd done the same job for ten years and felt it was time to move on.", "lear_examp": "We have to wait for our turn to use one of the computers, and tend to have a chat with the colleagues in the meanwhile instead of moving on to another thing."}, {"sense": "to stop living in a particular home", "level": "B1", "dict_examp": "Her landlord has given her a week to move out.", "lear_examp": "I need to move out and find something near the Business Park area."}]}, {"pos": "noun", "senses": [{"sense": "an action taken to achieve something", "level": "C1", "dict_examp": "It was a good career move.", "lear_examp": "Having always been interested in environmental issues, I am happy to read among your excellent articles your \"It'll Cost The Earth\" new column.  I think that was a good move because something like that was missing from the press and generally from your readers."}, {"sense": "when you change the place where you live or when a business changes the place where it is located", "level": "C1", "dict_examp": "The office move is scheduled for March.", "lear_examp": "Finally, my opinion is that we should make the move to the suburbs."}, {"sense": "the act of changing your position", "level": "C2", "dict_examp": "One wrong move and he would have fallen off the ladder.", "lear_examp": "Some minutes later the DJ played a song I loved to dance to at the time, called \"Satisfaction\" by Benny Bennusi, so I indulged in some rather wild dance moves."}, {"sense": "to hurry", "level": "C2", "dict_examp": "Come on, get a move on!", "lear_examp": "\"All the lights will be switched off in 28 minutes, so I have to get a move on,\" I said to myself, as I started to write on a new piece of paper."}]}]}, {"word": "muddy", "poses": [{"pos": "adjective", "senses": [{"sense": "covered by or containing mud", "level": "B2", "dict_examp": "a muddy stream", "lear_examp": "I went out into the kitchen. I looked around to see if I could see him, but he was gone, only the wet, muddy footprints were left."}]}]}, {"word": "mug", "poses": [{"pos": "noun", "senses": [{"sense": "a large cup with straight sides used for hot drinks", "level": "A2", "dict_examp": "a coffee mug", "lear_examp": "I got a big mug for my birthday."}]}]}, {"word": "mouth", "poses": [{"pos": "noun", "senses": [{"sense": "the part of the face that is used for eating and speaking", "level": "A1", "dict_examp": "Open your mouth wide and say \"Ah.\"", "lear_examp": "The doll is my favorite birthday present, because it has two big eyes, a small nose and a small mouth."}, {"sense": "to say nothing", "level": "B2", "dict_examp": "He told me to keep my mouth shut.", "lear_examp": "She made every effort to keep her mouth shut but it disturbed her to be the only one to know the truth, apart from her brother."}, {"sense": "to stop talking", "level": "B2", "dict_examp": "Just shut your mouth and stop whining!", "lear_examp": "But I couldn't shut my mouth, I continued: \"You can't believe it Pat, she wears trousers like men and green flowery blouses.\""}, {"sense": "where a river goes into the sea", "level": "C1", "dict_examp": "It is a small village, by the mouth of a river.", "lear_examp": "The mouth of the river with a narrow exit to the sea, provided an extra excitement because of the pressure of the water when joining the sea."}, {"sense": "by one person telling another telling you", "level": "C2", "dict_examp": "Students learned of the center by word of mouth.", "lear_examp": "In the past news traveled mostly by word of mouth and it took days and sometimes weeks before a person would become aware of an occurrence on the other end of the world."}, {"sense": "to say something you should not say, especially something embarrassing", "level": "C2", "dict_examp": "He makes outrageous comments and is always putting his foot in his mouth.", "lear_examp": ""}]}]}, {"word": "much", "poses": [{"pos": "determiner", "senses": [{"sense": "In questions, \"much\" is used to ask about the amount of something.", "level": "A1", "dict_examp": "Was there much food there?", "lear_examp": "How much did it cost?"}, {"sense": "In negative sentences, \"much\" is used to say that there is not a large amount of something.", "level": "A2", "dict_examp": "She doesn't earn much money.", "lear_examp": "I didn't eat much."}, {"sense": "a large amount of something, often more than you want", "level": "A2", "dict_examp": "I'd love to come but I've got too much work.", "lear_examp": "I'll come by plane, because it takes too much time by car."}, {"sense": "a lot of", "level": "C1", "dict_examp": "Much of the evidence was unreliable.", "lear_examp": "Much of the influence people come under to change eating habits comes from TV, especially advertisements."}, {"sense": "used when you want to say that a person or thing is not a very good example of something", "level": "C1", "dict_examp": "I'm not much of a cook.", "lear_examp": "I'm not much of a royalist but I think she's the symbol of everything that's Danish."}]}, {"pos": "adverb", "senses": [{"sense": "a large amount or degree", "level": "A1", "dict_examp": "Thank you very much for the flowers!", "lear_examp": "I like Bradford very much."}, {"sense": "used mainly in questions or negative sentences to mean often or a lot", "level": "B1", "dict_examp": "Do you go to London much?", "lear_examp": "I wear skirts, too, but not very much."}, {"sense": "used before comparative adjectives such as \"better\" and \"more beautiful\" to mean \"a lot\"", "level": "B1", "dict_examp": "Their old house was much bigger.", "lear_examp": "This class is so much better than the old one."}]}]}, {"word": "movement", "poses": [{"pos": "noun", "senses": [{"sense": "a change of position or place", "level": "B2", "dict_examp": "He made a sudden movement and frightened the bird away.", "lear_examp": "She must sit for two hours without any movement."}, {"sense": "a group of people with the same beliefs who work together to achieve something", "level": "C1", "dict_examp": "the women's movement", "lear_examp": "Obviously what started some time ago as a feminist movement has now grown to the level of independence, economically and most important, socially."}]}]}, {"word": "MP3 player", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of electronic equipment for playing music that has been stored as MP3 files", "level": "A2", "dict_examp": "He gave me an MP3 player.", "lear_examp": "Dear Sarah, I left my MP3 player at your house last night."}]}]}, {"word": "mumble", "poses": [{"pos": "verb", "senses": [{"sense": "to speak too quietly and not clearly enough for someone to understand you", "level": "B2", "dict_examp": "He mumbled something about it being a waste of time.", "lear_examp": "I started mumbling something and I could feel I was red because my cheeks were hot."}]}]}, {"word": "muddled", "poses": [{"pos": "adjective", "senses": [{"sense": "confusing and disorganized", "level": "C2", "dict_examp": "muddled thinking", "lear_examp": "Lucy is all muddled and confused."}]}]}, {"word": "multiple", "poses": [{"pos": "adjective", "senses": [{"sense": "with several things or parts", "level": "C1", "dict_examp": "multiple injuries", "lear_examp": "The report contains multiple errors and gives the reader a totally incorrect view of the event."}]}]}, {"word": "moving", "poses": [{"pos": "adjective", "senses": [{"sense": "causing strong feelings of sadness or sympathy", "level": "B2", "dict_examp": "She read a moving speech at the funeral.", "lear_examp": "It was a really moving story."}]}]}, {"word": "mundane", "poses": [{"pos": "adjective", "senses": [{"sense": "ordinary, or not interesting", "level": "C1", "dict_examp": "a mundane task/life", "lear_examp": "Lastly, it would be a good idea to travel to an island and to escape for a while from your mundane routine."}]}]}, {"word": "muddle", "poses": [{"pos": "noun", "senses": [{"sense": "a situation of confusion or bad organization", "level": "C2", "dict_examp": "There was a big muddle over who was buying the tickets.", "lear_examp": "She couldn't make out how to get out of the muddle she was in."}]}, {"pos": "verb", "senses": [{"sense": "to get something done even though you are not organized or prepared", "level": "C2", "dict_examp": "I don’t know how to keep score – I’ll just have to muddle through.", "lear_examp": ""}]}]}, {"word": "municipal", "poses": [{"pos": "adjective", "senses": [{"sense": "relating or belonging to the government of a town or city", "level": "C1", "dict_examp": "municipal officials/employees", "lear_examp": "This is a very expensive development, so expensive, that our municipal government can't bear the costs."}]}]}, {"word": "Mr.", "poses": [{"pos": "noun", "senses": [{"sense": "a title for a man, used before his family name or full name", "level": "A1", "dict_examp": "Mr. Jones/Mr. David Jones", "lear_examp": "I spoke with Mr. Beamish last week."}]}]}, {"word": "Ms.", "poses": [{"pos": "noun", "senses": [{"sense": "a title for a woman, used before her family name or full name", "level": "A2", "dict_examp": "Ms. Hill / Ms. Pamela Hill", "lear_examp": "This morning I have met Ms. Talarico, she told me we'll need three pencils and a bag to keep all of our drawings."}]}]}, {"word": "mountain", "poses": [{"pos": "noun", "senses": [{"sense": "a raised part of the Earth's surface, much larger than a hill, the top of which might be covered in snow", "level": "A2", "dict_examp": "The Matterhorn is one of the biggest mountains in Europe.", "lear_examp": "Perhaps we can go to the mountains."}, {"sense": "a large amount of something", "level": "C2", "dict_examp": "I’ve got mountains of work to do.", "lear_examp": "But I had to get up to deal with a mountain of documents on my desk."}]}]}, {"word": "movie", "poses": [{"pos": "noun", "senses": [{"sense": "a story shown in  moving pictures, shown in a theater or on television", "level": "A1", "dict_examp": "Do you want to rent/watch a movie tonight?", "lear_examp": "We played games, had our snacks and then watched a movie."}, {"sense": "the showing of movies or the business of making movies", "level": "A1", "dict_examp": "They go to the movies almost every Friday.", "lear_examp": "Of course I want to go to the movies with you."}]}]}, {"word": "must", "poses": [{"pos": "modal verb", "senses": [{"sense": "used to say that it is necessary or important that something happens or is done", "level": "A2", "dict_examp": "Meat must be cooked thoroughly.", "lear_examp": "We must be there at 7 o'clock in the morning."}, {"sense": "used to show that you think something is very likely or certain to be true", "level": "B2", "dict_examp": "Harry's been driving all day - he must be tired.", "lear_examp": "I must have been seven years old at that time."}]}]}, {"word": "mustard", "poses": [{"pos": "noun", "senses": [{"sense": "a thick, spicy yellow or brown sauce often eaten in small amounts with meat", "level": "C1", "dict_examp": "a teaspoon of mustard", "lear_examp": "You just ask for what you want put in it - ham, eggs, salad, chicken, mustard, etc."}]}]}, {"word": "my", "poses": [{"pos": "determiner", "senses": [{"sense": "belonging to or relating to the person who is speaking or writing", "level": "A1", "dict_examp": "my parents", "lear_examp": "In my class, where there are about 15 people, I am learning very interesting things."}]}]}, {"word": "myself", "poses": [{"pos": "pronoun", "senses": [{"sense": "the reflexive form of the pronouns \"me\" or \"I\"", "level": "A2", "dict_examp": "I've bought myself a new coat.", "lear_examp": "I enjoyed myself a lot."}, {"sense": "alone or without anyone's help", "level": "A2", "dict_examp": "I couldn't carry all the luggage by myself.", "lear_examp": "I want to paint my bedroom, but it is hard for me to do this by myself."}, {"sense": "used to emphasize \"I\" as the subject of a sentence", "level": "B2", "dict_examp": "I myself don't like a heavy meal at lunchtime.", "lear_examp": "Dear editor of 'The Student Tourist Guidebook' I am writing regarding your latest student tourist guidebook, which I myself found very useful on my latest trip to Lampton."}, {"sense": "for my use only", "level": "C1", "dict_examp": "I'll have the house all to myself this weekend.", "lear_examp": "This is because if I lived in a triple-storey house, I would get a room all to myself."}]}]}, {"word": "murder", "poses": [{"pos": "noun", "senses": [{"sense": "the crime of intentionally killing a person", "level": "B1", "dict_examp": "to commit murder", "lear_examp": "It was about a murder which had taken place on the beach."}]}, {"pos": "verb", "senses": [{"sense": "to kill someone intentionally and illegally", "level": "B1", "dict_examp": "He was murdered by a former employee.", "lear_examp": "It's about the man who murdered a lot of people."}]}]}, {"word": "mushroom", "poses": [{"pos": "noun", "senses": [{"sense": "a type of fungus  with a short stem and a round top, some types of which can be eaten", "level": "A2", "dict_examp": "pasta with wild mushrooms", "lear_examp": "They usually buy wine and prepare a traditional Polish meal like cabbage with mushrooms and sausages."}]}]}, {"word": "murderer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has committed murder", "level": "B1", "dict_examp": "a mass murderer", "lear_examp": "A few weeks later the police caught the murderer of my best friend."}]}]}, {"word": "museum", "poses": [{"pos": "noun", "senses": [{"sense": "a building where you can look at important objects connected with art, history, or science", "level": "A1", "dict_examp": "a museum of modern art", "lear_examp": "We sometimes go to a museum."}]}]}, {"word": "mutual", "poses": [{"pos": "adjective", "senses": [{"sense": "When two or more people have a mutual feeling, they have the same opinion about each other.", "level": "C1", "dict_examp": "mutual admiration/respect", "lear_examp": "It will hugely contribute to better understanding between the parties as well as add to a mutual respect and trust."}, {"sense": "When two or more people have a mutual friend or interest, they have the same one.", "level": "C1", "dict_examp": "Andrew and Jean were introduced to each other by a mutual friend.", "lear_examp": "The wedding celebration attended by all who are involved is the first step for the couple to succeed in marriage and get support from their mutual friends and families."}]}]}, {"word": "mutter", "poses": [{"pos": "verb", "senses": [{"sense": "to speak quietly so that your voice is difficult to hear, often when complaining about something", "level": "B2", "dict_examp": "He was muttering (away) to himself.", "lear_examp": "\"Emile Zola is the best writer\", he muttered."}]}]}, {"word": "music", "poses": [{"pos": "noun", "senses": [{"sense": "a pattern of sounds that is made by playing instruments or singing, or a recording of this", "level": "A1", "dict_examp": "classical/pop/dance/rock music", "lear_examp": "I like to listen to music."}, {"sense": "to accept punishment or criticism for something bad that you have done", "level": "C1", "dict_examp": "If she doesn't have a good reason for being late, she'll just have to face the music.", "lear_examp": "Teenagers who live with their parents have to face the music about the long bills their parents receive monthly!"}]}]}, {"word": "mysteriously", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is mysterious", "level": "C1", "dict_examp": "\"Perhaps, and perhaps not,\" she said mysteriously.", "lear_examp": "Mysteriously, their character always dies tragically or goes abroad and is never seen again."}]}]}, {"word": "muscle", "poses": [{"pos": "noun", "senses": [{"sense": "one of many pieces of tissue in the body that are connected to bones and which produce movement by becoming longer or shorter", "level": "B2", "dict_examp": "neck/back/leg/stomach muscles", "lear_examp": "It tones the muscles in this area and provides us with stamina and good health."}, {"sense": "to injure a muscle by stretching it too much", "level": "C2", "dict_examp": "I pulled a muscle in my leg when I was skiing.", "lear_examp": ""}]}]}, {"word": "mysterious", "poses": [{"pos": "adjective", "senses": [{"sense": "strange or unknown, and not explained or understood", "level": "B2", "dict_examp": "a mysterious stranger", "lear_examp": "He went to the Hotel because he wanted to find out who was the person that had sent him a mysterious letter a few days ago."}]}]}, {"word": "musical", "poses": [{"pos": "adjective", "senses": [{"sense": "related to music", "level": "A2", "dict_examp": "musical instruments", "lear_examp": "We want to help you by bringing drums and some of the musical instruments."}, {"sense": "good at playing music", "level": "C1", "dict_examp": "She comes from a very musical family.", "lear_examp": "These people are very musical and, therefore, you will find folk songs and even unique dances."}]}, {"pos": "noun", "senses": [{"sense": "a play or movie in which singing and dancing tell part of the story", "level": "B2", "dict_examp": "a Broadway musical", "lear_examp": "My wife and I wanted to spend a nice and enjoyable evening and decided to go and see the musical."}]}]}, {"word": "mustache", "poses": [{"pos": "noun", "senses": [{"sense": "a line of hair that some men grow above their mouths", "level": "B1", "dict_examp": "Groucho Marx had a thick black mustache.", "lear_examp": "Alison thought she was dreaming, he hadn't changed, not even his mustache."}]}]}, {"word": "musically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that relates to music", "level": "C2", "dict_examp": "It's a school for musically gifted children.", "lear_examp": "Not that I was musically gifted or wanted to become a pianist, it was just the fact that I loved music that led my step there."}]}]}, {"word": "myth", "poses": [{"pos": "noun", "senses": [{"sense": "an ancient story about gods and brave people, often one that explains an event in history or the natural world", "level": "B2", "dict_examp": "ancient myths", "lear_examp": "I spent three days there thinking about myths and legends and having a lot of fun."}, {"sense": "an idea that is not true but is believed by many people", "level": "C1", "dict_examp": "Equal opportunity continues to be a myth for many.", "lear_examp": "There is this myth that when you are on vacation you should spend your whole time at the beach, practically doing nothing."}]}]}, {"word": "mystery", "poses": [{"pos": "noun", "senses": [{"sense": "something strange or unknown which has not yet been explained or understood", "level": "B1", "dict_examp": "an unsolved mystery", "lear_examp": "I have chosen this film because it has mystery in it and a lot of fun!!"}]}]}, {"word": "musician", "poses": [{"pos": "noun", "senses": [{"sense": "someone who plays a musical instrument, often as a job", "level": "B1", "dict_examp": "a talented jazz/classical musician", "lear_examp": "The movie is about two musicians that had to dress like women to escape from the gangsters of Chicago."}]}]}, {"word": "murmur", "poses": [{"pos": "verb", "senses": [{"sense": "to speak quietly so that you can only be heard by someone near you", "level": "C2", "dict_examp": "\"Go to sleep now,\" she murmured.", "lear_examp": "\"They're so unprofessional,\" he murmured to himself."}]}, {"pos": "noun", "senses": [{"sense": "the sound of something being said quietly", "level": "C2", "dict_examp": "I could hear the low murmur of voices from behind the door.", "lear_examp": "All Sandra could do was to nod every now and again to his murmurs."}]}]}]