[{"word": "narrow-minded", "poses": [{"pos": "adjective", "senses": [{"sense": "not willing to accept new ideas or opinions different from your own", "level": "C1", "dict_examp": "I found some of my classmates to be narrow-minded.", "lear_examp": "He is a bit narrow-minded and at first he'll drive you crazy but once you get to know him, he'll be good company."}]}]}, {"word": "narrator", "poses": [{"pos": "noun", "senses": [{"sense": "the person who tells the story in a book, film, play, etc.", "level": "C2", "dict_examp": "The narrator is a fisherman.", "lear_examp": "Leo Colston is the narrator and chief character through whose eyes we dive into the story."}]}]}, {"word": "naive", "poses": [{"pos": "adjective", "senses": [{"sense": "If someone is naive, they believe things too easily and do not have enough experience of the world.", "level": "C1", "dict_examp": "I was much younger then, and very naive.", "lear_examp": "It might sound a bit idealistic and naive, but I think this concept of communication will make the world a better place."}]}]}, {"word": "native", "poses": [{"pos": "adjective", "senses": [{"sense": "Your native town or country is the place where you were born.", "level": "B2", "dict_examp": "She returned to live and work in her native Japan.", "lear_examp": "You really tried to understand the far east and my native country, Japan."}, {"sense": "the first language that you learn", "level": "B2", "dict_examp": "French is his native tongue.", "lear_examp": "My native language is Russian but I speak English fluently and I have been learning Latin for two years."}, {"sense": "relating to the first people to live in an area", "level": "B2", "dict_examp": "The Aborigines are the native inhabitants of Australia.", "lear_examp": "I am very happy to tell you about my trip to the Amazon forest native inhabitants museum."}, {"sense": "Native animals or plants live or grow naturally in a place, and have not been brought from somewhere else.", "level": "C2", "dict_examp": "a large bird native to North America", "lear_examp": ""}]}]}, {"word": "napkin", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of cloth or paper used at meals to protect your clothes and to clean your lips or fingers", "level": "B2", "dict_examp": "She brought paper napkins and a cake with \"Happy Birthday\" written on it.", "lear_examp": "Dear Tom, I received your letter and I'm going to try to answer your questions: for the wedding present, I don't think you are compelled to give them anything, but if you want to, I suggest you to offer a tablecloth and napkins, it is very useful and they will be very pleased."}]}]}, {"word": "nation", "poses": [{"pos": "noun", "senses": [{"sense": "a country or the people living in a country", "level": "B2", "dict_examp": "the industrialized nations", "lear_examp": "At that time, everyone should have devoted their life to the nation."}]}]}, {"word": "namely", "poses": [{"pos": "adverb", "senses": [{"sense": "used when you are going to give more detail about something you have just said", "level": "C1", "dict_examp": "She learned an important lesson from failing that exam, namely that nothing is ever certain.", "lear_examp": "This network is used by the four most used means of transport in our city (namely, bus, car, bicycle and motorcycle) and has been plagued by problems such as potholes, poor drainage and poor use (or lack!) of traffic signs."}]}]}, {"word": "nationality", "poses": [{"pos": "noun", "senses": [{"sense": "If you have United States/British/Swiss, etc. nationality, you are legally a member of that country.", "level": "A1", "dict_examp": "She is of French nationality.", "lear_examp": "My friend was born in Norway, but his nationality is Polish."}]}]}, {"word": "national", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to or typical of a whole country and its people", "level": "A2", "dict_examp": "a national holiday", "lear_examp": "I like the music of the national anthem."}]}]}, {"word": "native speaker", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has spoken a particular language since they were a baby, rather than having learned it as a child or adult", "level": "B2", "dict_examp": "All our teachers are native speakers of English.", "lear_examp": "As I mentioned, I teach English to Japanese students, and I'd like to spend time with native speakers to improve my English."}]}]}, {"word": "narrow", "poses": [{"pos": "adjective", "senses": [{"sense": "Narrow things measure a small distance from one side to the other.", "level": "B1", "dict_examp": "narrow streets", "lear_examp": "It's a charming little town with old houses and narrow streets."}, {"sense": "limited to a small area of interest, activity or thought", "level": "C2", "dict_examp": "He has narrow interests.", "lear_examp": "People leave home with a narrow outlook and it doesn't seem to broaden."}, {"sense": "If you have a narrow escape, you only just avoid danger.", "level": "C2", "dict_examp": "He had a narrow escape when a falling tree crushed his car.", "lear_examp": "Ralph will have a narrow escape: he is saved by the arrival of a ship which has at last come to rescue them all."}]}, {"pos": "verb", "senses": [{"sense": "to become less wide or to make something less wide", "level": "C1", "dict_examp": "The road has been narrowed to one lane.", "lear_examp": "Driving as well as parking has become a difficult task in Copenhagen City as the City Council has over the last few years deliberately cut down the numbers of parking places, raised the fees and narrowed the roads and streets."}, {"sense": "to become less or to make something become less", "level": "C2", "dict_examp": "to narrow the gap between rich and poor", "lear_examp": "I tend to believe that every country should join together, as only by discussing and sorting out some measures will we be able to narrow the gap that nowadays exists among countries all over the world."}, {"sense": "to make something, for example a list or a choice, smaller and clearer by removing the things that are less important", "level": "C2", "dict_examp": "We've managed to narrow the list down to four.", "lear_examp": "My hobbies were narrowed down to reading books, listening to some music and that's all."}]}]}, {"word": "narrowly", "poses": [{"pos": "adverb", "senses": [{"sense": "only by a small amount", "level": "B2", "dict_examp": "He narrowly escaped death in the accident.", "lear_examp": "They narrowly escaped crashing with the car in theopposite lane."}]}]}, {"word": "nap", "poses": [{"pos": "noun", "senses": [{"sense": "a short sleep", "level": "C1", "dict_examp": "He likes to take a nap after lunch.", "lear_examp": "He usually takes a nap after lunch and at night goes to bed about 10:00 p.m."}]}]}, {"word": "narrative", "poses": [{"pos": "noun", "senses": [{"sense": "a story or description of a series of events", "level": "C2", "dict_examp": "It's a moving narrative of wartime adventure.", "lear_examp": "It is a happy ending, however, only because the narrative stops at this point."}]}]}, {"word": "naked", "poses": [{"pos": "adjective", "senses": [{"sense": "not wearing clothes", "level": "B2", "dict_examp": "a naked man", "lear_examp": "I cried out in anger and that was a mistake, because the girls turned around and looked at me, standing there naked."}, {"sense": "A naked feeling or quality is not hidden, although it is bad.", "level": "C1", "dict_examp": "naked power/aggression/ambition", "lear_examp": "This program presents the naked truth about Brazil, this so called \"Tropical Paradise.\""}, {"sense": "If something can be seen by the naked eye, it is big enough to be seen without special equipment.", "level": "C2", "dict_examp": "These bugs are so tiny you cannot see them with the naked eye.", "lear_examp": ""}]}]}, {"word": "naturally", "poses": [{"pos": "adverb", "senses": [{"sense": "as you would expect", "level": "B2", "dict_examp": "Naturally, he was very disappointed.", "lear_examp": "Naturally we had to take his word for it."}, {"sense": "in a normal way", "level": "B2", "dict_examp": "Relax and try to behave naturally.", "lear_examp": "As a result they can't behave naturally at all and become sick."}, {"sense": "happening or existing as part of nature and not made or done by people", "level": "C1", "dict_examp": "A healthy body will be able to fight off the illness naturally without the use of medicine.", "lear_examp": "Sometimes people say women are naturally stronger than men."}, {"sense": "having been born with a characteristic", "level": "C2", "dict_examp": "naturally aggressive/funny/slim", "lear_examp": "Clarisse McClellan is a spontaneous and naturally curious teenager who even enjoys simple things."}]}]}, {"word": "natural", "poses": [{"pos": "adjective", "senses": [{"sense": "Something that is natural exists or happens because of nature, not because it was made or done by people.", "level": "B1", "dict_examp": "natural ingredients", "lear_examp": "We have wonderful beaches full of natural beauty."}, {"sense": "normal or expected", "level": "B2", "dict_examp": "Of course you're upset - it's only natural.", "lear_examp": "Many people think that it is natural for famous people to be followed by journalists all the time because they are famous and everybody is curious about their lives."}, {"sense": "A natural characteristic is something you were born with.", "level": "C1", "dict_examp": "a natural talent", "lear_examp": "Also my natural talent for entertaining people together with my past experience should be very useful working at the new theme park."}]}]}, {"word": "nail", "poses": [{"pos": "noun", "senses": [{"sense": "a thin piece of metal with a sharp end, used to join pieces of wood together", "level": "B2", "dict_examp": "a three-inch nail", "lear_examp": "Sometimes in food given to animals by visitors you can find pieces of glass, nails or even poison."}, {"sense": "the hard surface at the end of your fingers and toes", "level": "B2", "dict_examp": "Stop biting your nails!", "lear_examp": "I do everything for my dog, such as washing him and, cutting his nails, and I have to make sure he is nice and clean."}]}]}, {"word": "nature", "poses": [{"pos": "noun", "senses": [{"sense": "all the plants, creatures, substances, and forces that exist in the universe, which are not made by people", "level": "A2", "dict_examp": "her love of nature", "lear_examp": "It's a nice place to relax and enjoy nature."}, {"sense": "someone's character", "level": "B2", "dict_examp": "As a child Juliana had a lovely nature - everyone liked her.", "lear_examp": "Jane wasn't very suspicious by nature, but there was something weird in that."}, {"sense": "type", "level": "C1", "dict_examp": "What exactly is the nature of your business?", "lear_examp": "He claims that he did not improve his English because of the nature of the job."}]}]}, {"word": "nationwide", "poses": [{"pos": "adjective", "senses": [{"sense": "existing or happening in all parts of a particular country", "level": "B2", "dict_examp": "a nationwide network/chain of stores", "lear_examp": "The nationwide blackout was the first in the past decade."}]}, {"pos": "adverb", "senses": [{"sense": "in all parts of a country", "level": "B2", "dict_examp": "Schools nationwide are experiencing a shortage of teachers.", "lear_examp": "On Thursday, Friday or Saturday you could visit the annual festival, which is well-known nationwide for the music, costumes and dance of the local people."}]}]}, {"word": "nasty", "poses": [{"pos": "adjective", "senses": [{"sense": "bad or unpleasant", "level": "B1", "dict_examp": "a nasty shock/surprise", "lear_examp": "Inside there were three samples of a nasty purple liquid."}, {"sense": "unkind", "level": "B1", "dict_examp": "Don't be so nasty to your brother - he's four years younger than you!", "lear_examp": "I though that it was a nasty joke made by a friend, but the address of the sender did not match with any that I knew."}, {"sense": "very angry or violent", "level": "B2", "dict_examp": "When I asked for the money, he turned really nasty.", "lear_examp": "Then I heard a nasty voice saying \"Bob!\""}]}]}, {"word": "name", "poses": [{"pos": "noun", "senses": [{"sense": "the word or words that a person, thing or place is known by", "level": "A1", "dict_examp": "\"Hi, what's your name?\" \"My name's Diane.\"", "lear_examp": "My friend's name is Martin."}, {"sense": "the reputation that someone or something has", "level": "B2", "dict_examp": "She went to court to clear her name.", "lear_examp": "He's the only one concerned about the good name of the family."}, {"sense": "If bad things are done in the name of something, they are done in order to help that thing succeed.", "level": "C2", "dict_examp": "Are you willing to work yourself to death in the name of competition?", "lear_examp": "There are things one cannot trifle with: friendship for example should not be sacrificed in the name of success."}, {"sense": "to become famous or respected by a lot of people", "level": "C2", "dict_examp": "He's been trying to make a name for himself in the music business.", "lear_examp": "Secondly, only a few sportsmen and sportswomen manage to make a name for themselves and get to the top."}, {"sense": "to use impolite or unpleasant words to describe someone", "level": "C2", "dict_examp": "He said the other children were calling him names.", "lear_examp": "He had never called me names or told me off."}, {"sense": "used to show that the name of something tells you something about it", "level": "C2", "dict_examp": "A \"suggested price\" is, as the name implies, the sale price suggested by the manufacturer.", "lear_examp": "Sour Sweet, as the name implies, is originally a Chinese restaurant."}]}, {"pos": "verb", "senses": [{"sense": "to give someone or something a name", "level": "B1", "dict_examp": "We named our dogs \"Max\" and \"Lady.\"", "lear_examp": "She is named Maryam."}, {"sense": "to say what something's or someone's name is", "level": "B1", "dict_examp": "In the first question you had to name three types of monkey.", "lear_examp": "Not only \"Tandoori dishes\" but all the dishes are tasty, to name some there are Chinese, North Indian, and many others."}, {"sense": "to choose someone or something", "level": "B2", "dict_examp": "Just name the time and the place and I'll be there.", "lear_examp": "He has been  named as the best Latin singer and he has won two Grammys."}, {"sense": "something that you say which means anything you say or choose", "level": "C2", "dict_examp": "I've never seen such a wide selection. You name it, they've got it.", "lear_examp": "Courses vary from languages, management, computer-related fields to fitness, yoga, karate classes and all the different hobbies you might be interested in such as painting on silk or on wood, pottery, carving and the like. You name it, they have it at ECM."}]}]}, {"word": "nearsighted", "poses": [{"pos": "adjective", "senses": [{"sense": "able to see clearly without glasses only things that are close up", "level": "B2", "dict_examp": "I've always been very nearsighted and had to get glasses in fourth grade.", "lear_examp": "I couldn't see a thing, as I'm very nearsighted. I tried to find my pair of glasses but it was so dark that I couldn't see my hand in front of me."}]}]}, {"word": "necktie", "poses": [{"pos": "noun", "senses": [{"sense": "a long, thin tie worn around the neck, under a shirt collar", "level": "C2", "dict_examp": "He wore a gray suit, with a white shirt, black and gray necktie, and silver cuff links.", "lear_examp": "Also many men frequent stores in order to buy better clothing, suits, shoes, neckties, to have a better presentation at the places were they go with frequency or for business."}]}]}, {"word": "neck", "poses": [{"pos": "noun", "senses": [{"sense": "the part of the body which joins the head to the shoulders", "level": "A2", "dict_examp": "He had the thickest neck I'd ever seen.", "lear_examp": "I was really shocked when I noticed it wasn't on my neck."}, {"sense": "to be annoying", "level": "C1", "dict_examp": "My brother can be a real pain in the neck sometimes.", "lear_examp": "He's adorable although sometimes he can really be a pain in the neck (don't tell him I wrote this.)"}, {"sense": "the part of a piece of clothing that goes around your neck", "level": "C2", "dict_examp": "a V-neck sweater", "lear_examp": "Pomona was so pretty, with her short blue and white dress, her bow on the neck and her hat."}, {"sense": "If two people who are competing are neck and neck, they are very close and either of them could win.", "level": "C2", "dict_examp": "The two runners were neck and neck coming into the last lap.", "lear_examp": "It was a really neck and neck match that took my breath away every second."}]}]}, {"word": "needless", "poses": [{"pos": "adjective", "senses": [{"sense": "as you would expect", "level": "C1", "dict_examp": "Needless to say, it rained the whole time we were there.", "lear_examp": "Needless to say, bribes are a frequent occurrence."}, {"sense": "not necessary", "level": "C2", "dict_examp": "a needless expense", "lear_examp": "They not only go out and buy totally needless things but they even forget to save up for emergencies or the proverbial \"rainy days\"."}]}]}, {"word": "necessity", "poses": [{"pos": "noun", "senses": [{"sense": "the need for something", "level": "C1", "dict_examp": "There's no financial necessity for her to work.", "lear_examp": "Therefore, the most important lesson to learn is to acknowledge the necessity of education and the struggle to make it happen."}, {"sense": "something you need", "level": "C1", "dict_examp": "Most people seem to consider a car a necessity, not a luxury.", "lear_examp": "With development came gas-guzzling cars and motorbikes.  These have become a necessity in our everyday lives."}]}]}, {"word": "needle", "poses": [{"pos": "noun", "senses": [{"sense": "a thin, pointed metal object with a small hole at one end for thread, used in sewing", "level": "B2", "dict_examp": "a needle and thread", "lear_examp": "It was impossible for me to open the door, it was like threading a needle with gloves on."}, {"sense": "the thin, sharp, metal part of a piece of medical equipment used to take blood out of the body or to put a liquid or medicine in", "level": "C2", "dict_examp": "He fainted at the sight of the needle.", "lear_examp": "Nevertheless, for all the side effects they may have, for all the unpleasantness of having a needle stuck in your arm or a spoonful of foul-tasting liquid stuck in your mouth, antibiotics and vaccines remain the greatest discovery in the history of the world."}, {"sense": "to push thread through the hole in a needle", "level": "C2", "dict_examp": "Could you thread this needle for me, please?", "lear_examp": ""}]}]}, {"word": "nature", "poses": [{"pos": "noun", "senses": [{"sense": "all the plants, creatures, substances, and forces that exist in the universe, which are not made by people", "level": "A2", "dict_examp": "her love of nature", "lear_examp": "It's a nice place to relax and enjoy nature."}, {"sense": "someone's character", "level": "B2", "dict_examp": "As a child Juliana had a lovely nature - everyone liked her.", "lear_examp": "Jane wasn't very suspicious by nature, but there was something weird in that."}, {"sense": "type", "level": "C1", "dict_examp": "What exactly is the nature of your business?", "lear_examp": "He claims that he did not improve his English because of the nature of the job."}]}]}, {"word": "neatly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a clean and organized way", "level": "C1", "dict_examp": "neatly dressed", "lear_examp": "The performers are all neatly dressed."}]}]}, {"word": "necessarily", "poses": [{"pos": "adverb", "senses": [{"sense": "used in negatives to mean \"in every case\" or \"therefore\"", "level": "B2", "dict_examp": "That's not necessarily true.", "lear_examp": "The most important point in a job interview is to give a good impression, which does not necessarily mean how you look."}]}]}, {"word": "necessary", "poses": [{"pos": "adjective", "senses": [{"sense": "needed in order to achieve something", "level": "B1", "dict_examp": "If necessary, we can change the dates of our trip.", "lear_examp": "For me, it's necessary to be modern and cool, fashionable too."}]}]}, {"word": "necklace", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of jewelry that you wear around your neck", "level": "A2", "dict_examp": "a gold/silver necklace", "lear_examp": "Dear Elaine, The party was wonderful and I got the necklace which I wanted so much."}]}]}, {"word": "negative", "poses": [{"pos": "adjective", "senses": [{"sense": "A negative sentence or phrase is one which contains a word such as \"not,\" 'no,\" \"never\" or \"nothing.\"", "level": "A2", "dict_examp": "\"I've never seen him in my life\" is a negative sentence.", "lear_examp": ""}, {"sense": "not having enthusiasm or positive opinions about something", "level": "B1", "dict_examp": "negative feelings", "lear_examp": "At the same time there were no negative opinions about the service from the visitors to \"Fine food\"."}, {"sense": "A negative effect is bad and causes damage to something.", "level": "B2", "dict_examp": "Transportation problems have had a very negative effect/impact on tourism.", "lear_examp": "Even if it provides a lot of advantages, this revolution in the world of communication also has a negative impact on our society."}, {"sense": "expressing the answer no", "level": "B2", "dict_examp": "We received a negative answer to our request.", "lear_examp": "Museums are the best example to show how life was in the past but when you ask teenagers whether they have been  in a museum you will get a negative answer."}]}]}, {"word": "need", "poses": [{"pos": "verb", "senses": [{"sense": "If you need something, you must have it.", "level": "A1", "dict_examp": "I need some new shoes.", "lear_examp": "When you need help, everyone gives you help."}, {"sense": "If you need to do something, it is necessary to do it.", "level": "A1", "dict_examp": "I need to do some shopping on my way home from work.", "lear_examp": "I need to learn English."}, {"sense": "used in order to say that someone does not have to do something or should not do something", "level": "A2", "dict_examp": "I can get there myself so you don't need to take me.", "lear_examp": "You don't need to bring anything, but if you want, you can bring some pencils."}, {"sense": "If something needs something to be done to it, that thing should be done in order to improve it.", "level": "B1", "dict_examp": "The car needs to be serviced.", "lear_examp": "It is so beautiful but it needs washing all the time."}, {"sense": "used to say that something is necessary", "level": "C2", "dict_examp": "There needs to be more funding for education in this country.", "lear_examp": "Secondly, there needs to be a proper choice of subjects taught, because what we should get in the end is a versatile person, not just some math or literature freak who is not interested in anything else."}]}, {"pos": "noun", "senses": [{"sense": "something that is necessary to have or do", "level": "B2", "dict_examp": "There's a growing need for affordable housing in the larger cities.", "lear_examp": "In conclusion, I believe that human beings will always have the need for knowledge and entertainment at the same time."}, {"sense": "If there is no need to do something or no need for something, it is not necessary or it is wrong.", "level": "B2", "dict_examp": "There's no need to go to the store - there's plenty of food in the refrigerator.", "lear_examp": "He told me that I could trust him with the ticket and that there was no need for me to take it home."}, {"sense": "to need something", "level": "B2", "dict_examp": "My car's in desperate need of repair.", "lear_examp": "He is also constantly in need of money."}, {"sense": "the things you need in order to have a good life", "level": "B2", "dict_examp": "her emotional needs", "lear_examp": "I love swimming and cycling and that is why I want to ask if there are any facilities that could suit my needs?"}, {"sense": "if it is necessary", "level": "C2", "dict_examp": "If need be, we can take two cars.", "lear_examp": "On the one hand I won't indulge my children's whims and I will lecture them or punish them if need be."}]}]}, {"word": "near", "poses": [{"pos": "preposition", "senses": [{"sense": "close in distance", "level": "A1", "dict_examp": "Is there a train station near here?", "lear_examp": "The park is near my house, about 10 minutes on foot."}, {"sense": "close in time", "level": "B2", "dict_examp": "He arrived near the end of the lesson.", "lear_examp": ""}, {"sense": "used in questions and negatives to mean \"close to being or doing something\"", "level": "C1", "dict_examp": "The house isn't anywhere near ready.", "lear_examp": "We could not have gone anywhere near 5000 miles because all our minibuses were broken down - we even stayed in one place for 8 days."}, {"sense": "not close in distance, time, amount or quality", "level": "C1", "dict_examp": "The house was nowhere near the ocean.", "lear_examp": "Although people are well aware of the current situation in Switzerland, they prefer looking at other countries and comparing us to them (we are nowhere near as fat as them)."}, {"sense": "almost in a particular state or condition", "level": "C2", "dict_examp": "The runners were near exhaustion.", "lear_examp": "It is strictly related to the fact that the old possess a vast amount of experience and are nearer to death."}]}, {"pos": "adverb", "senses": [{"sense": "close in distance", "level": "B1", "dict_examp": "I was standing just near enough to hear what they were saying.", "lear_examp": "And they are getting nearer, I must run for my life."}, {"sense": "close in time", "level": "B2", "dict_examp": "Her birthday was getting nearer and I still hadn't bought her a present.", "lear_examp": "I would appreciate very much if you could reply as soon as possible, as the school holiday is drawing near."}]}, {"pos": "adjective", "senses": [{"sense": "close in distance", "level": "B1", "dict_examp": "Where's the nearest post office?", "lear_examp": "When I arrived at the airport I went to the nearest store to buy a newspaper."}, {"sense": "at a time that is not far away", "level": "B2", "dict_examp": "Space travel may become very common in the near future.", "lear_examp": "I look forward to receiving your reply in the near future."}, {"sense": "similar in characteristics or quality", "level": "C2", "dict_examp": "The nearest library is in the next town.", "lear_examp": ""}]}]}, {"word": "navy", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a country's armed forces which is trained to operate at sea", "level": "B2", "dict_examp": "My brother is an officer in the Navy.", "lear_examp": "Best of all, not only am I familiar with the life-style on a ship but I also know a lot of things about ships because I was in the navy."}]}]}, {"word": "nearly", "poses": [{"pos": "adverb", "senses": [{"sense": "almost", "level": "A2", "dict_examp": "It's been nearly three months since my last haircut.", "lear_examp": "It will be nearly two hours."}, {"sense": "a lot less", "level": "C1", "dict_examp": "It's not nearly as expensive as I thought.", "lear_examp": "However this is not nearly enough, since we are restricted when it comes to using nuclear power and there is always a constant search for other energy sources."}]}]}, {"word": "navy blue", "poses": [{"pos": "adjective", "senses": [{"sense": "very dark blue", "level": "B1", "dict_examp": "He was wearing a navy blue sweater.", "lear_examp": "I think I will buy a navy blue carpet and black and blue furniture."}]}]}, {"word": "neat", "poses": [{"pos": "adjective", "senses": [{"sense": "organized and clean", "level": "B1", "dict_examp": "Your house is always so neat - how do you manage it with three children?", "lear_examp": "I always go to this restaurant because it's neat and clean."}, {"sense": "very good, fun, nice, or interesting", "level": "B2", "dict_examp": "That video game is really neat!", "lear_examp": "Have you seen Marian recently? Does she still going out with Robert?  What a neat couple they were."}]}]}, {"word": "naval", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the navy", "level": "C2", "dict_examp": "a naval base/officer", "lear_examp": "It is irrefutable that naval areas are in most cases abandoned by their governments."}]}]}, {"word": "nearby", "poses": [{"pos": "adverb", "senses": [{"sense": "not far away", "level": "B1", "dict_examp": "If there's a cafe nearby, we could stop for lunch.", "lear_examp": "We can go swimming, and visit some of the beautiful castles nearby."}]}, {"pos": "adjective", "senses": [{"sense": "not far away", "level": "B1", "dict_examp": "We stopped at a nearby store to buy some food.", "lear_examp": "The nearby towns are lovely, very calm."}]}]}, {"word": "net", "poses": [{"pos": "noun", "senses": [{"sense": "the Internet", "level": "A2", "dict_examp": "You can find all this information on the Net.", "lear_examp": "I like it because you can surf the Net and do a lot of other things."}, {"sense": "an object that has many holes in it and that is used in many sports and for catching fish", "level": "B1", "dict_examp": "a fishing net", "lear_examp": "I have the advantage of being quite tall and therefore I prefer to play at the net."}]}]}, {"word": "nerve", "poses": [{"pos": "noun", "senses": [{"sense": "worry or anxiety about something that is going to happen", "level": "C1", "dict_examp": "I sometimes suffer from nerves when I'm speaking in public.", "lear_examp": "You might feel you need it to calm your nerves, but for obvious reasons (the law) it is better not to."}, {"sense": "to annoy someone, especially by doing something again and again", "level": "C1", "dict_examp": "Please stop making that noise! It really gets on my nerves.", "lear_examp": "My neighbor is always quarrelling with his wife. It's getting on my nerves!"}, {"sense": "one of the stringlike parts in your body that carry messages between your brain and other parts of the body", "level": "C2", "dict_examp": "the optic nerve", "lear_examp": "At the end, give him 3 pills, one for the high blood pressure, another for the heart and the last one for nerve problems."}, {"sense": "the rudeness necessary to do something you know will upset someone", "level": "C2", "dict_examp": "You've got a nerve, coming here!", "lear_examp": "After that, how not to envy his redeeming feature of always being cool as a cucumber and how not to scorn yourself for not having the nerve to tell him what you really think!"}, {"sense": "the quality of being brave", "level": "C2", "dict_examp": "I haven't got the nerve to tell him I'm leaving.", "lear_examp": "She just never had the nerve to leave everything behind."}, {"sense": "to upset someone by talking about a particular subject", "level": "C2", "dict_examp": "By the look on her face, he really hit a nerve with that last remark.", "lear_examp": "Some of your articles strike a very sensitive nerve in my opinion."}]}]}, {"word": "nest", "poses": [{"pos": "noun", "senses": [{"sense": "a home built by birds for their eggs and by some other creatures to live in", "level": "C2", "dict_examp": "a birds'/wasps' nest", "lear_examp": "The very rare 'Cove Owl' has chosen one of the empty tree trunks by the pond to build his nest."}, {"sense": "a sum of money that has been saved or kept for a specific purpose", "level": "C2", "dict_examp": "She used her nest egg to buy a really good  piano.", "lear_examp": "She was the only heir of a rich family and her husband, who died ten years ago, left her a sizeable nest egg."}]}, {"pos": "verb", "senses": [{"sense": "to live in a nest or build a nest", "level": "C2", "dict_examp": "There are birds nesting under the roof.", "lear_examp": "If you stroll along the path on a Sunday morning, you can see robins nesting in the old honeysuckle bush."}]}]}, {"word": "new", "poses": [{"pos": "adjective", "senses": [{"sense": "recently made or having started to exist recently", "level": "A1", "dict_examp": "a new car", "lear_examp": "We spoke about new clothes and new fashion."}, {"sense": "not  known or discovered before", "level": "A1", "dict_examp": "I love learning new languages.", "lear_examp": "Every day at college I learn new words and new things in my life."}, {"sense": "different from before", "level": "A1", "dict_examp": "I met Janet's new boyfriend.", "lear_examp": "In the disco I can meet more new people."}, {"sense": "not yet familiar or experienced", "level": "B1", "dict_examp": "I'm new to the area.", "lear_examp": "I met a guy called Marc who is pretty cool. He is also new to the club."}, {"sense": "new people in an organization who will provide new ideas and energy", "level": "C1", "dict_examp": "We need some new blood in the organization.", "lear_examp": "Regardless of the age limit many companies encourage employees in high positions to retire after 55 as they want some new blood or probably a new look for the company."}, {"sense": "to start to behave in a better way", "level": "C2", "dict_examp": "I turned over a new leaf and began getting to work on time.", "lear_examp": "She promised to turn over a new leaf."}]}]}, {"word": "negligent", "poses": [{"pos": "adjective", "senses": [{"sense": "not giving enough care or attention to a job or activity, especially where your actions affect someone else", "level": "C2", "dict_examp": "The report found him negligent in his duties.", "lear_examp": "According to the research, a lot of people find it more difficult to go back to work after the holidays and tend to be more lax and negligent at work for the first few days."}]}]}, {"word": "nephew", "poses": [{"pos": "noun", "senses": [{"sense": "a son of your sister or brother, or a son of the sister or brother of your husband or wife", "level": "B1", "dict_examp": "My nephew is 21 today.", "lear_examp": "I went with my husband, my two sisters and some nieces and nephews."}]}]}, {"word": "nerves", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being nervous", "level": "B2", "dict_examp": "I always suffer from nerves before a game.", "lear_examp": "I had to calm my nerves."}, {"sense": "the ability to be calm in difficult situations", "level": "B2", "dict_examp": "You need a cool head and steady nerves for this job.", "lear_examp": "I know very well you have steady nerves but what is strong can become weak as well."}, {"sense": "to annoy someone, especially by doing something again and again", "level": "B2", "dict_examp": "If we spend too much time together, we end up getting on each other's nerves.", "lear_examp": "I would definitely avoid driving (which would soon get on my nerves) and choose to go by bicycle, singing in the sun and in the rain."}]}]}, {"word": "negligence", "poses": [{"pos": "noun", "senses": [{"sense": "when you are not careful enough in something you do, especially in a job where your actions affect other people", "level": "C2", "dict_examp": "Her parents plan to sue the surgeon for medical negligence.", "lear_examp": "Despite this situation of state negligence, bad laws and scarce funding, sports have managed to survive the harsh years of transition and most importantly people have not lost their interest in sports."}]}]}, {"word": "negatively", "poses": [{"pos": "adverb", "senses": [{"sense": "with a bad effect", "level": "B2", "dict_examp": "They were very negatively affected by the changes.", "lear_examp": "We neither walk nor do exercises and it influences our health negatively."}]}]}, {"word": "negative", "poses": [{"pos": "adjective", "senses": [{"sense": "A negative sentence or phrase is one which contains a word such as \"not,\" 'no,\" \"never\" or \"nothing.\"", "level": "A2", "dict_examp": "\"I've never seen him in my life\" is a negative sentence.", "lear_examp": ""}, {"sense": "not having enthusiasm or positive opinions about something", "level": "B1", "dict_examp": "negative feelings", "lear_examp": "At the same time there were no negative opinions about the service from the visitors to \"Fine food\"."}, {"sense": "A negative effect is bad and causes damage to something.", "level": "B2", "dict_examp": "Transportation problems have had a very negative effect/impact on tourism.", "lear_examp": "Even if it provides a lot of advantages, this revolution in the world of communication also has a negative impact on our society."}, {"sense": "expressing the answer no", "level": "B2", "dict_examp": "We received a negative answer to our request.", "lear_examp": "Museums are the best example to show how life was in the past but when you ask teenagers whether they have been  in a museum you will get a negative answer."}]}]}, {"word": "networking", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of meeting and contacting people who might be useful to know, especially for your job", "level": "C1", "dict_examp": "Students find networking essential to finding the right job.", "lear_examp": "I am sure there are many other benefits working can bring to us, apart from the enjoyment, networking, etc. that I have mentioned above, and of course the money it makes."}]}]}, {"word": "negotiation", "poses": [{"pos": "noun", "senses": [{"sense": "when people try to make or change an agreement by discussion", "level": "C1", "dict_examp": "Peace negotiations are due to start.", "lear_examp": "Therefore, I would like to propose a meeting that can be arranged in the next week so that we may continue this negotiation."}]}]}, {"word": "neighborhood", "poses": [{"pos": "noun", "senses": [{"sense": "an area of a town or city that people live in", "level": "B1", "dict_examp": "There were lots of kids in my neighborhood when I was growing up.", "lear_examp": "And then I saw Sibylle, a girl who lived in my neighborhood a few years ago."}]}]}, {"word": "neutral", "poses": [{"pos": "adjective", "senses": [{"sense": "independent and not supporting any side in an argument, fight, or competition", "level": "C1", "dict_examp": "neutral ground/territory", "lear_examp": "Thus, its main advantage is that the information you get is not provided by a company or something like that but by a neutral person."}, {"sense": "Neutral colors are not strong or bright.", "level": "C1", "dict_examp": "Try neutral creams and grays.", "lear_examp": "Throughout the house the carpets are brand new and lovely neutral colors."}]}]}, {"word": "nervous", "poses": [{"pos": "adjective", "senses": [{"sense": "worried or anxious", "level": "B1", "dict_examp": "He gets very nervous before exams.", "lear_examp": "I'm a little nervous because of that."}]}]}, {"word": "network", "poses": [{"pos": "noun", "senses": [{"sense": "a system or group of connected parts", "level": "B2", "dict_examp": "a road/rail network", "lear_examp": "Switzerland is a safe, small and beautiful country that is perfect to travel in, because of the best public transportation network in the world."}, {"sense": "a set of computers that are connected to each other", "level": "B2", "dict_examp": "All our offices are on the same network.", "lear_examp": "Moreover, with a computer network, it can be possible for people to work from home, making projects, controlling operations or having conferences."}]}]}, {"word": "nevertheless", "poses": [{"pos": "adverb", "senses": [{"sense": "despite that", "level": "B2", "dict_examp": "I knew a lot about the subject already, but her talk was interesting nevertheless.", "lear_examp": "Both the options you gave seem very interesting. Nevertheless, I get the impression that working with animals is much more fun, don't you think?"}]}]}, {"word": "never-ending", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is never-ending, it continues for ever.", "level": "C1", "dict_examp": "The housework in this place is just never-ending.", "lear_examp": "We are often forced to study till about thirty years of age, and it really appears to be a never-ending story."}]}]}, {"word": "negligible", "poses": [{"pos": "adjective", "senses": [{"sense": "small and not important", "level": "C2", "dict_examp": "a negligible effect/result", "lear_examp": "The damage that the developing world is causing to the environment is almost negligible compared to the damage caused by the industrialised world."}]}]}, {"word": "neighbor", "poses": [{"pos": "noun", "senses": [{"sense": "someone who lives very near you, especially in the next house", "level": "A2", "dict_examp": "Some of the neighbors complained about the noise from our party.", "lear_examp": "I thought that someone stole my ball. I think it was my neighbor."}, {"sense": "someone or something that is near or next to someone or something else", "level": "B2", "dict_examp": "The French make more films than some of their European neighbors.", "lear_examp": "My freedom should stop where the freedom of my neighbor begins."}]}]}, {"word": "nervousness", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being nervous", "level": "C1", "dict_examp": "Her nervousness was obvious when she spoke.", "lear_examp": "Remember, by and large, failures are sparked off by nervousness."}]}]}, {"word": "nervously", "poses": [{"pos": "adverb", "senses": [{"sense": "in a worried and anxious way", "level": "B2", "dict_examp": "to giggle/laugh nervously", "lear_examp": "As always the girls sat down in the fifth row and waited nervously for the event to begin."}]}]}, {"word": "negotiate", "poses": [{"pos": "verb", "senses": [{"sense": "to try to make or change an agreement by discussion", "level": "C1", "dict_examp": "to negotiate with employers about working conditions", "lear_examp": "You should also negotiate the best terms for our client."}]}]}, {"word": "neighboring", "poses": [{"pos": "adjective", "senses": [{"sense": "near or next to somewhere", "level": "B2", "dict_examp": "neighboring countries/states", "lear_examp": "It is incredible that my son has to commute to the neighboring town just to get a few books to read."}]}]}, {"word": "neither", "poses": [{"pos": "adverb", "senses": [{"sense": "used to say that a negative fact is also true of someone or something else", "level": "B2", "dict_examp": "Jerry doesn't like it, and neither do I.", "lear_examp": "Of course, she never thought those would be the lucky numbers and neither did her husband, so he forgot to ask her about the ticket later."}]}, {"pos": "pronoun", "senses": [{"sense": "not either of two people or things", "level": "B2", "dict_examp": "Luckily, neither child was hurt in the accident.", "lear_examp": "Three years ago, when I was in Japan, my parents were both working and neither of them were at home by the time I got back from school."}]}, {"pos": "conjunction", "senses": [{"sense": "used when a negative fact is true of two people or things or when someone or something does not have either of two qualities", "level": "B2", "dict_examp": "Neither he nor his mother would talk to the police.", "lear_examp": "I have neither climbed nor surfed before, so that would be very exciting for me."}]}]}, {"word": "neglect", "poses": [{"pos": "verb", "senses": [{"sense": "to not give enough care or attention to something or someone", "level": "C1", "dict_examp": "to neglect your appearance", "lear_examp": "So people, use what technology has to offer you but don't neglect the person next to you."}, {"sense": "to not do something, often intentionally", "level": "C2", "dict_examp": "He neglected to mention the fact that we could lose money on the deal.", "lear_examp": "Our colleagues at the museum apparently neglected to notify us."}]}, {"pos": "noun", "senses": [{"sense": "when you do not give enough care or attention to something or someone", "level": "C1", "dict_examp": "to suffer years of neglect", "lear_examp": "First of all, concerning the buses, all I can say is that they were in a complete state of neglect."}]}]}, {"word": "never", "poses": [{"pos": "adverb", "senses": [{"sense": "not ever, not one time", "level": "A1", "dict_examp": "We've never been to Australia.", "lear_examp": "I never have enough time to do it."}, {"sense": "used to tell someone not to worry about something because it is not important", "level": "A2", "dict_examp": "\"I'm afraid I've lost that wallet you gave me.\" \"Well, never mind, I can easily buy you another one.\"", "lear_examp": "Never mind Ally, forget it, I know you've been busy."}, {"sense": "used to emphasize something negative", "level": "B2", "dict_examp": "I never knew you lived around here.", "lear_examp": "I never knew what happened after I left."}]}]}, {"word": "newsletter", "poses": [{"pos": "noun", "senses": [{"sense": "a regular report with information for people who belong to an organization or who are interested in a particular subject", "level": "C1", "dict_examp": "a monthly newsletter about business and the environment", "lear_examp": "And if you decide to use our newsletter service, you'll always be up-to-date."}]}]}, {"word": "next", "poses": [{"pos": "adjective", "senses": [{"sense": "the week/year/Monday, etc. that follows the present one", "level": "A1", "dict_examp": "I'll call you next week.", "lear_examp": "See you next week."}, {"sense": "The next time, event, person, or thing is the one nearest to now or the one that follows the present one.", "level": "A2", "dict_examp": "What time's the next train?", "lear_examp": "The class is next Monday, the 13th of May."}, {"sense": "The next place is the one nearest to the present one.", "level": "A2", "dict_examp": "She only lives in the next village.", "lear_examp": "At the next stop, I left the train."}, {"sense": "the thing that is best, if you cannot have or do the thing you really want", "level": "C1", "dict_examp": "Coaching baseball is the next best thing to playing.", "lear_examp": "For many working people, there is hardly time to cook and prepare your dinner, so the next best thing is to rush into a McDonalds' or Burger King."}, {"sense": "used to talk about part of a story that happens in a sudden and surprising way", "level": "C2", "dict_examp": "A bike came speeding around the corner, and the next thing I knew I was lying on the ground.", "lear_examp": "And the next thing I knew was that I was playing cards with 3 men."}]}, {"pos": "adverb", "senses": [{"sense": "immediately after", "level": "A2", "dict_examp": "You'll never guess what happened next.", "lear_examp": "Next, turn left and you will be in front of my house."}]}, {"pos": "pronoun", "senses": [{"sense": "the person or thing that follows the present person or thing", "level": "B2", "dict_examp": "Who's next to see the nurse?", "lear_examp": "The 20th century was the computer century, what will be next?"}, {"sense": "the weekend/week/Thursday, etc. that follows the next one", "level": "B2", "dict_examp": "We're seeing Paul the Saturday after next.", "lear_examp": "If you don't mind, the weekend after next is very convenient for me."}]}]}, {"word": "nightlife", "poses": [{"pos": "noun", "senses": [{"sense": "entertainment for the night such as bars, clubs, restaurants, and theaters", "level": "B1", "dict_examp": "What's the nightlife like around here?", "lear_examp": "The nightlife in my country is wonderful!"}]}]}, {"word": "next door", "poses": [{"pos": "adverb", "senses": [{"sense": "in the next room, house, or building", "level": "B1", "dict_examp": "That's the old man who lives next door to Paul.", "lear_examp": "Maria didn't understand, but then she realized that the man she was looking for lived next door."}]}]}, {"word": "night", "poses": [{"pos": "noun", "senses": [{"sense": "the time in every 24 hours when it is dark and people usually sleep", "level": "A1", "dict_examp": "It gets cold at night.", "lear_examp": "Cracov is an interesing place and looks nice at night."}, {"sense": "the period from the evening to the time when you go to sleep", "level": "A1", "dict_examp": "We're seeing them on Saturday night.", "lear_examp": "You can go to the disco and dance all night."}, {"sense": "a night when you are not able to sleep", "level": "C1", "dict_examp": "He'd spent a sleepless night worrying about his exam.", "lear_examp": "Most of the rooms we stayed in did not have air-conditioning, which caused many sleepless nights to the majority of us due to the intense heat."}]}]}, {"word": "new", "poses": [{"pos": "adjective", "senses": [{"sense": "recently made or having started to exist recently", "level": "A1", "dict_examp": "a new car", "lear_examp": "We spoke about new clothes and new fashion."}, {"sense": "not  known or discovered before", "level": "A1", "dict_examp": "I love learning new languages.", "lear_examp": "Every day at college I learn new words and new things in my life."}, {"sense": "different from before", "level": "A1", "dict_examp": "I met Janet's new boyfriend.", "lear_examp": "In the disco I can meet more new people."}, {"sense": "not yet familiar or experienced", "level": "B1", "dict_examp": "I'm new to the area.", "lear_examp": "I met a guy called Marc who is pretty cool. He is also new to the club."}, {"sense": "new people in an organization who will provide new ideas and energy", "level": "C1", "dict_examp": "We need some new blood in the organization.", "lear_examp": "Regardless of the age limit many companies encourage employees in high positions to retire after 55 as they want some new blood or probably a new look for the company."}, {"sense": "to start to behave in a better way", "level": "C2", "dict_examp": "I turned over a new leaf and began getting to work on time.", "lear_examp": "She promised to turn over a new leaf."}]}]}, {"word": "ninety", "poses": [{"pos": "number", "senses": [{"sense": "the number 90", "level": "A2", "dict_examp": "eighty, ninety, a hundred", "lear_examp": "Friday is the art class day.  It is in ninety minutes."}, {"sense": "to be aged between 90 and 99", "level": "B2", "dict_examp": "He is in his nineties now.", "lear_examp": ""}, {"sense": "the years 1990 through 1999", "level": "B2", "dict_examp": "I spent most of the nineties traveling around the world.", "lear_examp": "Another aspect which shows us the danger that the car represents to human life in the nineties is pollution."}]}]}, {"word": "no", "poses": [{"pos": "adverb", "senses": [{"sense": "something that you say in order to disagree, give a negative answer, or say that something is not true", "level": "A1", "dict_examp": "\"You told me.\" \"No, I didn't!\"", "lear_examp": "I was in the office last week, but she said: \"No!\""}, {"sense": "something that you say to agree with something that is negative", "level": "A2", "dict_examp": "\"He's not very bright, is he?\" \"No, I'm afraid not.\"", "lear_examp": ""}, {"sense": "used to refuse an offer politely", "level": "A2", "dict_examp": "\"Would you like a drink?\" \"No thanks, I've just had one.\"", "lear_examp": ""}, {"sense": "something that you say when you are shocked and upset", "level": "A2", "dict_examp": "Oh no! It's gone all over the carpet!", "lear_examp": "Oh no!"}, {"sense": "not any", "level": "B1", "dict_examp": "The work should be done no later than Friday.", "lear_examp": "In no more than ten lines, my mother explained that she was moving to Brazilia, the capital of our country, and that she would take me and my brother with her."}]}, {"pos": "determiner", "senses": [{"sense": "not any", "level": "A1", "dict_examp": "There's no butter left.", "lear_examp": "Dear Ally, that's no problem about the party."}, {"sense": "used in signs and on notices to show that something is not allowed", "level": "A2", "dict_examp": "No smoking/fishing", "lear_examp": ""}, {"sense": "something that you say to mean you can or will do what someone has asked you to do", "level": "A2", "dict_examp": "\"Can you get me to the airport by 11.30?\" \"No problem.\"", "lear_examp": "Dear Jo, No problem. I can help you."}, {"sense": "something that you say when someone has thanked you for something", "level": "A2", "dict_examp": "\"Thanks for taking me home.\" - \"No problem.\"", "lear_examp": "It's ok, no problem."}, {"sense": "used to tell someone that something is impossible", "level": "B1", "dict_examp": "I'm sorry but there's no way we can help you.", "lear_examp": "Don't worry, there is no way I'm going to miss it!"}, {"sense": "it is not surprising", "level": "B2", "dict_examp": "No wonder the children are excited - this is the first time they've been abroad.", "lear_examp": "No wonder that people are more tired and are not interested in reading books as much as in the past."}, {"sense": "If there is no need to do something or no need for something, it is not necessary or it is wrong.", "level": "B2", "dict_examp": "There's no need to go to the store - there's plenty of food in the refridgerator.", "lear_examp": "He told me that I could trust him with the ticket and that there was no need for me to take it home."}, {"sense": "to not be useful, helpful or valuable", "level": "B2", "dict_examp": "Boots are no good if they aren't waterproof.", "lear_examp": "When it is raining, you get wet and that's no good to anyone."}, {"sense": "used to emphasize that something does not exist", "level": "B2", "dict_examp": "There's no such thing as ghosts!", "lear_examp": "But when I asked for these, I was told that no such thing existed and so the advertisement was once again proved wrong."}, {"sense": "used to emphasize that something cannot be changed", "level": "B2", "dict_examp": "I never manage to lose any weight, no matter how hard I try.", "lear_examp": "No matter where you are or what you do, apparently you need electricity."}, {"sense": "used to say that something is very likely", "level": "C1", "dict_examp": "No doubt she'll spend the money on new clothes.", "lear_examp": "No doubt I will find the skills acquired during the course, especially speaking skills, most useful in my future contacts with clients from English-speaking countries."}, {"sense": "none at all", "level": "C1", "dict_examp": "There's no evidence whatsoever that she was involved.", "lear_examp": "Moreover, the hotel we were finally dumped in was situated miles from Edinburgh city center and there was no entertainment whatsoever arranged for the evening, even though all the travelers were more or less stuck there."}]}]}, {"word": "nightmare", "poses": [{"pos": "noun", "senses": [{"sense": "a very unpleasant experience", "level": "B1", "dict_examp": "Being trapped underwater is my worst nightmare.", "lear_examp": "When I must buy something, I usually can't find it and then shopping becomes a nightmare."}, {"sense": "a frightening dream", "level": "B1", "dict_examp": "a terrifying nightmare", "lear_examp": "Every night I had a nightmare."}]}]}, {"word": "nickname", "poses": [{"pos": "noun", "senses": [{"sense": "a name used informally instead of your real name", "level": "C1", "dict_examp": "Sonny is his nickname - his real name is Joseph.", "lear_examp": "In school I had the nickname the Joker, because I had the ability to make other people laugh."}]}]}, {"word": "nickname", "poses": [{"pos": "noun", "senses": [{"sense": "a name used informally instead of your real name", "level": "B1", "dict_examp": "Do you have a nickname?", "lear_examp": "I heard about the club from a friend, so I joined it immediately (I like science fiction films a lot) and I took a strange member \"card\": in fact it is a blue sphere with my name, my nickname (\"The Sleeping Dragon\") and my favorite character's image from the film (Neo) on it."}]}]}, {"word": "news", "poses": [{"pos": "noun", "senses": [{"sense": "new information", "level": "A2", "dict_examp": "I've got some good/bad news for you.", "lear_examp": "Write soon, I'm waiting for good news from you too!"}, {"sense": "the announcement of important events on television, radio, and in newspapers", "level": "B1", "dict_examp": "It was on the 6 o'clock news.", "lear_examp": "It'll be shown next Thursday, just after the news."}, {"sense": "to affect someone badly/well", "level": "C1", "dict_examp": "This weather is bad news for farmers.", "lear_examp": "Focusing now on Kavanagh Catering Services, it could be said that for them price is the main variable - obviously this is good news for students."}, {"sense": "to be a surprise to someone", "level": "C2", "dict_examp": "He's leaving? Really? That's news to me.", "lear_examp": ""}, {"sense": "to tell someone about something new or important", "level": "C2", "dict_examp": "When they broke the news of their engagement, their parents were was delighted.", "lear_examp": "It wasn't hard to understand why she was filled with delight and happiness when her manager broke the news. The company was opening a new branch in Miami and they wanted her to become the director there."}]}]}, {"word": "nice", "poses": [{"pos": "adjective", "senses": [{"sense": "pleasant or attractive", "level": "A1", "dict_examp": "Did you have a nice holiday?", "lear_examp": "But you can make me a nice dinner."}, {"sense": "kind and friendly", "level": "A1", "dict_examp": "He's a really nice guy.", "lear_examp": "My teacher is very nice."}, {"sense": "used to emphasize a positive quality", "level": "B1", "dict_examp": "nice and clean", "lear_examp": "Anyway, I think I'm in a good class and also my home is nice and comfortable."}]}]}, {"word": "nineteen", "poses": [{"pos": "number", "senses": [{"sense": "the number 19", "level": "A1", "dict_examp": "eighteen, nineteen, twenty", "lear_examp": "I had a birthday party in my house when I became nineteen."}]}]}, {"word": "ninth", "poses": [{"pos": "ordinal number", "senses": [{"sense": "9th written as a word", "level": "A2", "dict_examp": "The ninth letter of the alphabet is I.", "lear_examp": "My free day is Tuesday the ninth of December."}]}]}, {"word": "nightclub", "poses": [{"pos": "noun", "senses": [{"sense": "a place where you can dance and drink at night", "level": "B1", "dict_examp": "We had a meal and then went to a nightclub.", "lear_examp": "We asked them if they wanted to come with us to a new nightclub, they agreed and we went to Club Pasha."}]}]}, {"word": "newspaper", "poses": [{"pos": "noun", "senses": [{"sense": "large, folded sheets of paper which are printed with the news and sold every day or every week", "level": "A1", "dict_examp": "She never reads a newspaper.", "lear_examp": "He gets up every day at 6 o'clock, has breakfast and reads the newspaper."}, {"sense": "paper from newspapers", "level": "A2", "dict_examp": "You'd better wrap that mirror up in newspaper before you put it in the car.", "lear_examp": "You should wear your old clothes and please bring some old newspaper."}]}]}, {"word": "nine", "poses": [{"pos": "number", "senses": [{"sense": "the number 9", "level": "A1", "dict_examp": "a nine-month prison sentence", "lear_examp": "I start college at half past nine."}, {"sense": "to be extremely happy and excited", "level": "C2", "dict_examp": "When I heard I got the job, I was on cloud nine!", "lear_examp": "But now, after the promise in which both said \"yes,\" she was on cloud nine."}]}]}, {"word": "nicely", "poses": [{"pos": "adverb", "senses": [{"sense": "well", "level": "B2", "dict_examp": "That table would fit nicely in the bedroom.", "lear_examp": "It is a pleasant, easy book with useful, active vocabulary and short, nicely constructed sentences."}, {"sense": "in a pleasant way", "level": "B2", "dict_examp": "She's always very nicely dressed.", "lear_examp": "All the rooms are big, clean and nicely decorated."}]}]}, {"word": "next-door", "poses": [{"pos": "adjective", "senses": [{"sense": "in the next room, house, or building", "level": "B1", "dict_examp": "What are your next-door neighbors like?", "lear_examp": "We visited the same boarding school and have been classmates since Grade 7. The last two years, she was my next door neighbor."}]}]}, {"word": "niece", "poses": [{"pos": "noun", "senses": [{"sense": "a daughter of your brother or sister, or a daughter of your husband's or wife's brother or sister", "level": "B1", "dict_examp": "We're taking my niece on vacation with us.", "lear_examp": "I bought a purple sweater and I want to knit one like mine for my niece."}]}]}, {"word": "newly", "poses": [{"pos": "adverb", "senses": [{"sense": "recently", "level": "B2", "dict_examp": "the newly formed neighborhood association", "lear_examp": "Ricardo has newly arrived here from Argentina."}]}]}, {"word": "next to", "poses": [{"pos": "preposition", "senses": [{"sense": "very close to something or someone, with nothing in between", "level": "A2", "dict_examp": "Come and sit next to me.", "lear_examp": "I left it in your bedroom, next to your desk."}]}]}, {"word": "nomination", "poses": [{"pos": "noun", "senses": [{"sense": "the act of officially suggesting a person for a job or their work for a prize", "level": "C1", "dict_examp": "to seek/win a nomination", "lear_examp": "Please allow me to support this nomination by pointing out some facts."}]}]}, {"word": "northwest", "poses": [{"pos": "noun", "senses": [{"sense": "the direction which is between north and west or the northwest part of a country", "level": "B1", "dict_examp": "The wind is coming from the northwest.", "lear_examp": ""}]}, {"pos": "adjective", "senses": [{"sense": "in the northwest, or facing toward the northwest", "level": "B1", "dict_examp": "We climbed the northwest face of the mountain.", "lear_examp": "My cousin lives in the northwest part of London and so I took the underground to central London every day."}]}]}, {"word": "nonsense", "poses": [{"pos": "noun", "senses": [{"sense": "If something someone has said or written is nonsense, it is silly and not true.", "level": "B2", "dict_examp": "She talks such nonsense sometimes.", "lear_examp": "I feel totally disappointed and I would like my money back, because everything in the advertisement was nonsense."}]}]}, {"word": "noise", "poses": [{"pos": "noun", "senses": [{"sense": "a sound, often a loud, unpleasant sound", "level": "A1", "dict_examp": "The noise out in the street was deafening.", "lear_examp": "In college I don't like too much noise."}]}]}, {"word": "norm", "poses": [{"pos": "noun", "senses": [{"sense": "the usual way that something happens", "level": "C1", "dict_examp": "Short-term job contracts are the norm nowadays.", "lear_examp": "The graph indicates the norm for children per family in three different countries."}, {"sense": "an accepted way of behaving in a particular society", "level": "C1", "dict_examp": "cultural/social norms", "lear_examp": "So, what seems to be generally important about these different kinds of clothes, are the norms and values, the status and the positions of people they show."}]}]}, {"word": "northeast", "poses": [{"pos": "noun", "senses": [{"sense": "the direction which is between north and east or the northeast part of a country", "level": "B1", "dict_examp": "They live in the northeast.", "lear_examp": "The owner is from the northeast of China."}]}, {"pos": "adjective", "senses": [{"sense": "in the northeast, or facing toward the northeast", "level": "B1", "dict_examp": "I don't really know the northeast part of the country.", "lear_examp": "You should visit the Northeast Region which is famous for its white sandy beaches which are fringed with coconut trees."}]}]}, {"word": "no", "poses": [{"pos": "adverb", "senses": [{"sense": "something that you say in order to disagree, give a negative answer, or say that something is not true", "level": "A1", "dict_examp": "\"You told me.\" \"No, I didn't!\"", "lear_examp": "I was in the office last week, but she said: \"No!\""}, {"sense": "something that you say to agree with something that is negative", "level": "A2", "dict_examp": "\"He's not very bright, is he?\" \"No, I'm afraid not.\"", "lear_examp": ""}, {"sense": "used to refuse an offer politely", "level": "A2", "dict_examp": "\"Would you like a drink?\" \"No thanks, I've just had one.\"", "lear_examp": ""}, {"sense": "something that you say when you are shocked and upset", "level": "A2", "dict_examp": "Oh no! It's gone all over the carpet!", "lear_examp": "Oh no!"}, {"sense": "not any", "level": "B1", "dict_examp": "The work should be done no later than Friday.", "lear_examp": "In no more than ten lines, my mother explained that she was moving to Brazilia, the capital of our country, and that she would take me and my brother with her."}]}, {"pos": "determiner", "senses": [{"sense": "not any", "level": "A1", "dict_examp": "There's no butter left.", "lear_examp": "Dear Ally, that's no problem about the party."}, {"sense": "used in signs and on notices to show that something is not allowed", "level": "A2", "dict_examp": "No smoking/fishing", "lear_examp": ""}, {"sense": "something that you say to mean you can or will do what someone has asked you to do", "level": "A2", "dict_examp": "\"Can you get me to the airport by 11.30?\" \"No problem.\"", "lear_examp": "Dear Jo, No problem. I can help you."}, {"sense": "something that you say when someone has thanked you for something", "level": "A2", "dict_examp": "\"Thanks for taking me home.\" - \"No problem.\"", "lear_examp": "It's ok, no problem."}, {"sense": "used to tell someone that something is impossible", "level": "B1", "dict_examp": "I'm sorry but there's no way we can help you.", "lear_examp": "Don't worry, there is no way I'm going to miss it!"}, {"sense": "it is not surprising", "level": "B2", "dict_examp": "No wonder the children are excited - this is the first time they've been abroad.", "lear_examp": "No wonder that people are more tired and are not interested in reading books as much as in the past."}, {"sense": "If there is no need to do something or no need for something, it is not necessary or it is wrong.", "level": "B2", "dict_examp": "There's no need to go to the store - there's plenty of food in the refridgerator.", "lear_examp": "He told me that I could trust him with the ticket and that there was no need for me to take it home."}, {"sense": "to not be useful, helpful or valuable", "level": "B2", "dict_examp": "Boots are no good if they aren't waterproof.", "lear_examp": "When it is raining, you get wet and that's no good to anyone."}, {"sense": "used to emphasize that something does not exist", "level": "B2", "dict_examp": "There's no such thing as ghosts!", "lear_examp": "But when I asked for these, I was told that no such thing existed and so the advertisement was once again proved wrong."}, {"sense": "used to emphasize that something cannot be changed", "level": "B2", "dict_examp": "I never manage to lose any weight, no matter how hard I try.", "lear_examp": "No matter where you are or what you do, apparently you need electricity."}, {"sense": "used to say that something is very likely", "level": "C1", "dict_examp": "No doubt she'll spend the money on new clothes.", "lear_examp": "No doubt I will find the skills acquired during the course, especially speaking skills, most useful in my future contacts with clients from English-speaking countries."}, {"sense": "none at all", "level": "C1", "dict_examp": "There's no evidence whatsoever that she was involved.", "lear_examp": "Moreover, the hotel we were finally dumped in was situated miles from Edinburgh city center and there was no entertainment whatsoever arranged for the evening, even though all the travelers were more or less stuck there."}]}]}, {"word": "nose", "poses": [{"pos": "noun", "senses": [{"sense": "the part of your face through which you breathe and smell", "level": "A1", "dict_examp": "a big nose", "lear_examp": "It has a small nose, two big eyes, and wears a dress."}, {"sense": "to show too much interest in a situation that does not involve you", "level": "C2", "dict_examp": "You shouldn't go sticking your nose into other people's business!", "lear_examp": "John started poking his nose into her life."}, {"sense": "to not accept something because you do not think it is good enough for you", "level": "C2", "dict_examp": "She turned up her nose at the job because she didn’t think it had enough status.", "lear_examp": "Moreover, she will not turn her nose up at anybody who might be considered less worthy than her."}, {"sense": "If something bad happens under your nose, it happens close to you but you do not notice it.", "level": "C2", "dict_examp": "They were stealing money from under my nose.", "lear_examp": "You will be surprised that there was something right under your nose that you could not live without."}]}]}, {"word": "normality", "poses": [{"pos": "noun", "senses": [{"sense": "a situation in which everything is happening normally", "level": "C2", "dict_examp": "a return to normality", "lear_examp": "We become self-oriented and disregard those unable to fit in our perception of normality."}]}]}, {"word": "northern", "poses": [{"pos": "adjective", "senses": [{"sense": "in or from the north part of an area", "level": "B1", "dict_examp": "northern Europe", "lear_examp": "Last Summer I went to Chiang Mai, in northern Thailand with my family."}]}]}, {"word": "nominate", "poses": [{"pos": "verb", "senses": [{"sense": "to officially suggest a person for a job or a position in an organization, or to suggest a person or their work for a prize", "level": "C1", "dict_examp": "Judges are nominated by the governor.", "lear_examp": "Being an Ambassador for Youth bears a lot of responsibility, not only because the person must be of outstanding character and well-known, but also because they must behave accordingly and be able to convey a positive message. After deep consideration, I have decided to nominate Jovanotti, alias Lorenzo Cherubini."}]}]}, {"word": "normal", "poses": [{"pos": "adjective", "senses": [{"sense": "usual, ordinary, and expected", "level": "A2", "dict_examp": "a normal working day", "lear_examp": "We will wear normal and comfortable clothes while painting."}, {"sense": "to go back to the usual condition", "level": "C1", "dict_examp": "Life has begun to return to normal now that the holidays are over.", "lear_examp": "After exactly ten minutes the electricity was switched on again and our life returned to normal - what a relief!"}]}]}, {"word": "normally", "poses": [{"pos": "adverb", "senses": [{"sense": "usually", "level": "B1", "dict_examp": "She doesn't normally arrive until ten.", "lear_examp": "I normally order fried fish."}, {"sense": "in the ordinary way that you would expect", "level": "B2", "dict_examp": "Both lungs are now functioning normally.", "lear_examp": "But the truth is that those animals are not behaving normally."}]}]}, {"word": "nobody", "poses": [{"pos": "pronoun", "senses": [{"sense": "no person", "level": "A2", "dict_examp": "Nobody called.", "lear_examp": "There was a pool but nobody went in because it was too cold."}]}]}, {"word": "no one", "poses": [{"pos": "pronoun", "senses": [{"sense": "no person", "level": "A2", "dict_examp": "No one told me she was sick.", "lear_examp": "I would like to come but my mother is sick and no one else can look after her."}]}]}, {"word": "noisy", "poses": [{"pos": "adjective", "senses": [{"sense": "making a lot of noise", "level": "A2", "dict_examp": "a noisy crowd of fans", "lear_examp": "I don't remember who was there... it was very busy and noisy!"}]}]}, {"word": "non-smoking", "poses": [{"pos": "adjective", "senses": [{"sense": "describes a place where people are not allowed to smoke", "level": "B2", "dict_examp": "Let's get a table in the non-smoking area.", "lear_examp": "You can also choose between a smoking and a non-smoking area."}]}]}, {"word": "nor", "poses": [{"pos": "conjunction", "senses": [{"sense": "used when a negative fact is true of two people or things or when someone or something does not have either of two qualities", "level": "B2", "dict_examp": "Neither Michael nor his wife was injured in the crash.", "lear_examp": "I have neither climbed nor surfed before, so that would be very exciting for me."}]}]}, {"word": "none", "poses": [{"pos": "pronoun", "senses": [{"sense": "not any", "level": "B1", "dict_examp": "None of us smoke(s).", "lear_examp": "Since none of us had been there before we hired a guide who claimed that he knew English and then we began looking at the ruins."}, {"sense": "If something is none of someone's business, they do not need to know about it, although they want to, because it does not affect them.", "level": "B2", "dict_examp": "I'm certainly not going to tell Lara how much money I've spent - it's none of her business!", "lear_examp": "You might think it's none of my business, but I simply have to say this."}, {"sense": "not at all clean/clever/pleased, etc.", "level": "C2", "dict_examp": "His clothes were none too clean.", "lear_examp": "So, without further ado I accepted, although I was none too sure of what was going to happen there."}, {"sense": "not any happier/poorer/wiser, etc., than before", "level": "C2", "dict_examp": "She must have explained the theory three times, but I'm still none the wiser.", "lear_examp": ""}]}]}, {"word": "nonetheless", "poses": [{"pos": "adverb", "senses": [{"sense": "despite what has just been said", "level": "C1", "dict_examp": "He was extremely rude in meetings. Nonetheless, his arguments found some support.", "lear_examp": "Nonetheless, all the people from whom I have received letters are satisfied, as well as their children, who enjoyed the stories and the pony rides very much."}]}]}, {"word": "noble", "poses": [{"pos": "adjective", "senses": [{"sense": "honest, brave, and kind", "level": "C1", "dict_examp": "a noble gesture", "lear_examp": "Charity is a very noble way of spending your money and it is definitely a way in which you would want to be remembered."}, {"sense": "belonging to the highest social group of a society", "level": "C1", "dict_examp": "She was born into an ancient, noble family.", "lear_examp": "Capodistrias, coming from a noble family of the Ionian islands played, as a diplomat and mainly as Russia's Foreign Minister, an important role to the new European structure after the destruction of Napoleon's Empire (1814)."}]}]}, {"word": "nod", "poses": [{"pos": "verb", "senses": [{"sense": "to move your head up and down as a way of agreeing, to give someone a sign, or to point to something", "level": "B2", "dict_examp": "Many people in the audience nodded in agreement.", "lear_examp": "She approached him calmly, showing no signs of nervousness or uncertainty. \"Do you have it?\" He nodded and shoved his hand into the left pocket of his jacket."}]}]}, {"word": "noon", "poses": [{"pos": "noun", "senses": [{"sense": "12 o'clock in the middle of the day", "level": "A2", "dict_examp": "He has until noon to act.", "lear_examp": "I'll start at 12 noon and remember to wear an apron."}]}]}, {"word": "north", "poses": [{"pos": "noun", "senses": [{"sense": "the direction that is on your left when you face toward the rising sun", "level": "A2", "dict_examp": "The points of the compass are North, South, East and West.", "lear_examp": "You can get there going on the road to the north of my town."}, {"sense": "the part of an area that is further towards the north than the rest", "level": "A2", "dict_examp": "They live in the north of the country.", "lear_examp": "I'm in Santander, in the north of Spain."}]}, {"pos": "adjective", "senses": [{"sense": "in or forming the north part of something", "level": "A2", "dict_examp": "North America/Africa", "lear_examp": "It was about a team who went to visit North America."}]}, {"pos": "adverb", "senses": [{"sense": "toward the  north", "level": "A2", "dict_examp": "The road leads north.", "lear_examp": "From that beach, we continued north and visited other small beaches."}]}]}, {"word": "nostalgia", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of happiness mixed with sadness when you think about things that happened in the past", "level": "C2", "dict_examp": "his nostalgia for his college days", "lear_examp": "He combines the strings with the brass instruments in a way that creates the feeling of nostalgia; nostalgia for the days and time I used to spend with my father."}]}]}, {"word": "nonexistent", "poses": [{"pos": "adjective", "senses": [{"sense": "not existing", "level": "C1", "dict_examp": "Crime is virtually nonexistent around here.", "lear_examp": "The country's economy is nonexistent, its main source of income being black market distribution of the foreign aid and gradual confiscation of the property of the few foreign companies left in the country."}]}]}, {"word": "note", "poses": [{"pos": "noun", "senses": [{"sense": "a short letter", "level": "A1", "dict_examp": "He left a note to say he would be home late.", "lear_examp": "Hi Rie Thank you for your note to me!"}, {"sense": "information that is written down to help you study, or to help you remember something you are going to write about", "level": "A2", "dict_examp": "The journalist took notes throughout the interview.", "lear_examp": "You have to bring with you a pencil, some chalk and a big notebook to take some notes and to draw in."}, {"sense": "a short explanation or an extra piece of information that is given at the bottom of a page or at the back of a book", "level": "B2", "dict_examp": "See note 3, page 37.", "lear_examp": ""}, {"sense": "to write down information about something", "level": "C1", "dict_examp": "Let me make a note of your phone number.", "lear_examp": "After talking to other members, I have made a note of the main problems they considered the most urgent to be solved."}, {"sense": "If two people compare notes, they tell each other what they think about something that they have both done.", "level": "C1", "dict_examp": "We compared notes about our experiences in China.", "lear_examp": "In conclusion, regular meetings between parents and school teachers ... help both parties to compare notes, acting in the best interests of the children."}, {"sense": "to notice or pay careful attention to something", "level": "C1", "dict_examp": "Please note that we will be closed on Saturday.", "lear_examp": "I thank you for taking note of my view."}, {"sense": "a particular feeling or mood", "level": "C1", "dict_examp": "a sad/serious/positive note", "lear_examp": "On a more practical note: I found the information pack I received beforehand insufficient."}, {"sense": "a single musical sound or the symbol that represents it", "level": "C2", "dict_examp": "Her soprano voice intoned the low, first notes of the song.", "lear_examp": "It was as if an external force was stopping him from playing the notes."}, {"sense": "someone or something famous or important", "level": "C2", "dict_examp": "There was nothing of note in the report.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to notice something", "level": "B1", "dict_examp": "They noted the consumers' growing demand for quicker service.", "lear_examp": "Please note that I am available for an interview."}, {"sense": "to write something so that you do not forget it", "level": "B2", "dict_examp": "I noted down their web address.", "lear_examp": "There were a couple of things I noted down during the show."}]}]}, {"word": "nothing", "poses": [{"pos": "pronoun", "senses": [{"sense": "not anything", "level": "A2", "dict_examp": "I've had nothing to eat all day.", "lear_examp": "This Sunday afternoon I have nothing to do."}, {"sense": "not something important or of value", "level": "B1", "dict_examp": "He's a dangerous person - human life means nothing to him.", "lear_examp": "Don't worry, it's nothing serious."}, {"sense": "no other thing than", "level": "B2", "dict_examp": "She did nothing but criticize.", "lear_examp": "You can read books in the open air while nothing but sea surrounds you."}, {"sense": "to have no connection or influence with someone or something", "level": "B2", "dict_examp": "He made his own decision - I had nothing to do with it.", "lear_examp": "Of course, I tried to explain to him that I had nothing to do with the vanishing of the cake but he didn't trust me."}, {"sense": "If something is or has nothing to do with you, you have no good reason to know about it or be involved with it.", "level": "B2", "dict_examp": "I wish he wouldn't offer advice on my marriage - it's nothing to do with him.", "lear_examp": "The party was horrible: the guests were all talking about things that had nothing to do with me."}, {"sense": "without a successful result", "level": "B2", "dict_examp": "I've come all this way for nothing.", "lear_examp": "Unfortunately, I waited for nothing. The TV repair man didn't come!"}, {"sense": "to be willing to do anything in order to achieve something", "level": "C1", "dict_examp": "He will stop at nothing to get what he wants.", "lear_examp": "They stopped at nothing to get the higher scores, to make themselves noticed, even if that meant telling some lies to a teacher about a schoolmate."}, {"sense": "used to emphasize that something is not true", "level": "C1", "dict_examp": "He said that he was a legitimate businessman - in fact, he was nothing of the sort.", "lear_examp": "Let me reassure you, nothing of the sort is happening at the moment."}, {"sense": "used to emphasize a quality", "level": "C2", "dict_examp": "The senator was nothing if not honest.", "lear_examp": "Well, I might be a bit biased but really, he is nothing if not extraordinary."}, {"sense": "used to emphasize other problems you have not talked about", "level": "C2", "dict_examp": "Most wild otters have disappeared from populated areas, to say nothing of wilderness areas.", "lear_examp": "Indeed would not it be an oversimplification to make one's judgement of the country's national character on the grounds of the amount and the quality of food people eat, to say nothing of the fact that this judgement is usually highly subjective?"}]}]}, {"word": "nostalgic", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling both happy and sad when you think about things that happened in the past", "level": "C2", "dict_examp": "Talking about those holidays has made me feel quite nostalgic.", "lear_examp": "While listening to what people interviewed were saying, I couldn't help feeling a bit sad in a nostalgic way."}]}]}, {"word": "notice", "poses": [{"pos": "verb", "senses": [{"sense": "to see something and be aware of it", "level": "B1", "dict_examp": "I noticed a crack in the ceiling.", "lear_examp": "Suddenly I noticed that I had lost the chain which Luke had bought me for my birthday."}]}, {"pos": "noun", "senses": [{"sense": "a sign giving information about something", "level": "A2", "dict_examp": "There was a large notice on the wall saying \"No Parking.\"", "lear_examp": "Nick - I've seen the notice about the concert."}, {"sense": "a warning that something will happen", "level": "B1", "dict_examp": "The next time you visit, can you give me more notice?", "lear_examp": "I apologize for the short notice."}, {"sense": "attention", "level": "B1", "dict_examp": "I didn't take any notice of  his advice.", "lear_examp": "I didn't take notice of it and deleted it again."}, {"sense": "only a short time before something happens", "level": "C1", "dict_examp": "I had to give a speech on very short notice.", "lear_examp": "If required, I could additionally find time on week nights, however due to my professional duties I may have to cancel on short notice."}, {"sense": "an official statement saying you are leaving your job or telling you your job has ended", "level": "C2", "dict_examp": "I'm giving my notice on Friday.", "lear_examp": ""}]}]}, {"word": "notable", "poses": [{"pos": "adjective", "senses": [{"sense": "important or interesting", "level": "C1", "dict_examp": "With one notable exception, everyone replied to my letter.", "lear_examp": "A notable exception is the advertising of so-called \"slow-food\" restaurants, which promote a healthy lifestyle."}]}]}, {"word": "nostril", "poses": [{"pos": "noun", "senses": [{"sense": "one of the two holes at the end of your nose", "level": "C2", "dict_examp": "Breathe in through one nostril.", "lear_examp": "When he finally reached the house and managed to open the door, a musty stench assaulted his nostrils."}]}]}, {"word": "nosy", "poses": [{"pos": "adjective", "senses": [{"sense": "always trying to find out private things about other people", "level": "C2", "dict_examp": "I was a nosy kid.", "lear_examp": "She was known as being a nosy and mysterious lady."}]}]}, {"word": "not", "poses": [{"pos": "adverb", "senses": [{"sense": "used to form a negative phrase after verbs like \"be,\" \"can,\" \"have,\" \"'will,\" \"must,\" etc., usually used in the short form \"n't\" in speech", "level": "A1", "dict_examp": "He's not fat!", "lear_examp": "It's not a problem for me."}, {"sense": "used to give the next word or group of words a negative meaning", "level": "A1", "dict_examp": "I told you not to do that.", "lear_examp": "You know I go to college but not every day."}, {"sense": "used after verbs like \"be afraid,\" \"hope,\" \"suspect,\" etc. in short, negative replies", "level": "A2", "dict_examp": "\"Is he coming with us?\" \"I hope not.\"", "lear_examp": ""}, {"sense": "used to express the possibility that something might not happen", "level": "A2", "dict_examp": "Are you going to reply or not?", "lear_examp": "Are you busy or not that day?"}, {"sense": "used to say what the situation will be if something does not happen", "level": "A2", "dict_examp": "I hope to see you there but, if not, I'll call you.", "lear_examp": "I'm going to paint my bedroom with the pink paint. Remember to put on your old clothes. If not, your clothes will become pinky and you can't use them anymore."}, {"sense": "used before adjectives and adverbs to mean \"not very\"", "level": "A2", "dict_examp": "\"How was your exam?\" \"Not too bad, I suppose.\"", "lear_examp": "How are you? I'm not too bad."}, {"sense": "satisfactory", "level": "A2", "dict_examp": "That's not bad for such a small company.", "lear_examp": "The presents are not bad."}, {"sense": "used to form questions when you think the answer will be \"yes,\" using the short form \"n't\"", "level": "B1", "dict_examp": "She's very pretty, isn't she?", "lear_examp": "I know that you love horror movies, don't you?"}, {"sense": "used as a polite reply after someone has thanked you", "level": "B1", "dict_examp": "\"Thanks for helping.\" \"Not at all.\"", "lear_examp": "\"Thank you.\" \"Not at all.\""}, {"sense": "used to say that something is true although it seems surprising", "level": "B1", "dict_examp": "He even remembered my birthday, believe it or not.", "lear_examp": "First I visited the \"Roman Bath'' which is more than 2000 years old and, believe it or not, it still works!"}, {"sense": "used to emphasize the fact that something does not happen or is not true", "level": "B1", "dict_examp": "\"I never cry.\" \"Not even when you hurt yourself really badly?\"", "lear_examp": "We tried to fish, but didn't catch a thing, not even a shoe!"}, {"sense": "used to say \"no\" or \"not\" strongly", "level": "B2", "dict_examp": "\"Was he a nuisance?\" \"No, not at all.\"", "lear_examp": "I sensed that invisible hand was touching my shoulder, but it didn't scare me, not at all."}, {"sense": "used to say that more than one thing is true", "level": "B2", "dict_examp": "Not only was the hotel expensive, it was dirty too.", "lear_examp": "In this show, not only can we see the latest fashions, sportswear, make-up and hairstyles, but we can also enter for free."}, {"sense": "to be much less good/bad/exciting, etc. than something else", "level": "B2", "dict_examp": "Her new book's not half as good as the last one.", "lear_examp": "Probably they wouldn't be half as famous as they are without press photographers, journalists, etc."}, {"sense": "used to emphasize the importance of something that you are adding to a list", "level": "B2", "dict_examp": "The resort has great hotels and restaurants, not to mention some of the best skiing in the region.", "lear_examp": "She got a kitten, she hated cats, not to mention the fact that she was allergic to them."}, {"sense": "almost but not completely", "level": "B2", "dict_examp": "I'm not quite sure if I understand this.", "lear_examp": "The student cafe has a welcoming atmosphere and most people said it was nice to sit and to drink coffee there. The only problem is that there are not quite enough tables and chairs for everyone at busy times."}, {"sense": "used to emphasize that there is nothing of what you are talking about", "level": "C1", "dict_examp": "Not one person came to hear him talk.", "lear_examp": "Nowadays, I can only see buildings and roads. Not one single tree to refresh yourself from the hot and tropical sun at midday."}, {"sense": "used to emphasize that something is not true or will not happen, or to say \"no\"", "level": "C1", "dict_examp": "\"She's not exactly poor, is she?\" \"Certainly not.\"", "lear_examp": "That's nice, but do you think that money is all that matters? Definitely not!"}, {"sense": "especially", "level": "C2", "dict_examp": "The whole trip was fascinating, not least because of the people I met.", "lear_examp": "We are all human beings but we are all different, not least because of a different cultural background."}, {"sense": "not at all", "level": "C2", "dict_examp": "I don't mind staying at home, not in the least.", "lear_examp": "Educating two children was not so easy a task, not in the least!"}, {"sense": "used to emphasize a quality", "level": "C2", "dict_examp": "The senator was nothing if not honest.", "lear_examp": "Well, I might be a bit biased but really, he is nothing if not extraordinary."}, {"sense": "to not have any sleep", "level": "C2", "dict_examp": "I was so excited last night - I didn't sleep a wink.", "lear_examp": "Nevertheless, due to the fact that I hadn't slept a wink the previous night, I began to fall asleep."}]}]}, {"word": "notably", "poses": [{"pos": "adverb", "senses": [{"sense": "especially or most importantly", "level": "C1", "dict_examp": "They have begun attracting investors, most notably big Japanese financial houses.", "lear_examp": "As I have already indicated, the content (what they teach you) is very good, notably the training of speaking skills and a number of special courses, for example: How to Negotiate."}]}]}, {"word": "notebook", "poses": [{"pos": "noun", "senses": [{"sense": "a book with empty pages that you can write in", "level": "A2", "dict_examp": "She was writing things down in a little notebook.", "lear_examp": "We have to bring our pencils, rulers, notebooks and books with us."}]}]}, {"word": "nut", "poses": [{"pos": "noun", "senses": [{"sense": "the dry fruit of some trees which grows in a hard shell, and can often be eaten", "level": "B2", "dict_examp": "a Brazil/cashew nut", "lear_examp": "Finally I would like to inform you that one of our students has an allergy to all sorts of nuts."}]}]}, {"word": "notice", "poses": [{"pos": "verb", "senses": [{"sense": "to see something and be aware of it", "level": "B1", "dict_examp": "I noticed a crack in the ceiling.", "lear_examp": "Suddenly I noticed that I had lost the chain which Luke had bought me for my birthday."}]}, {"pos": "noun", "senses": [{"sense": "a sign giving information about something", "level": "A2", "dict_examp": "There was a large notice on the wall saying \"No Parking.\"", "lear_examp": "Nick - I've seen the notice about the concert."}, {"sense": "a warning that something will happen", "level": "B1", "dict_examp": "The next time you visit, can you give me more notice?", "lear_examp": "I apologize for the short notice."}, {"sense": "attention", "level": "B1", "dict_examp": "I didn't take any notice of  his advice.", "lear_examp": "I didn't take notice of it and deleted it again."}, {"sense": "only a short time before something happens", "level": "C1", "dict_examp": "I had to give a speech on very short notice.", "lear_examp": "If required, I could additionally find time on week nights, however due to my professional duties I may have to cancel on short notice."}, {"sense": "an official statement saying you are leaving your job or telling you your job has ended", "level": "C2", "dict_examp": "I'm giving my notice on Friday.", "lear_examp": ""}]}]}, {"word": "nutritional", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the food that you eat and the way it affects your health", "level": "C1", "dict_examp": "These snacks have very little nutritional value.", "lear_examp": "Today, individuals have less time to prepare homemade food with high nutritional value."}]}]}, {"word": "nutritious", "poses": [{"pos": "adjective", "senses": [{"sense": "Nutritious food contains substances that your body needs to stay healthy.", "level": "C1", "dict_examp": "a nutritious meal", "lear_examp": "They seem to have discovered that salads and pasta can be as tasty and nutritious as red meat."}]}]}, {"word": "notify", "poses": [{"pos": "verb", "senses": [{"sense": "to officially tell someone about something", "level": "C1", "dict_examp": "You should notify the police if you are involved in a traffic accident.", "lear_examp": "You must notify the director if you are not going to sleep in your room."}]}]}, {"word": "nuclear", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the energy that is released when the nucleus  of an atom is divided", "level": "B2", "dict_examp": "nuclear energy/power", "lear_examp": "He said that he was a nuclear scientist and we had met before."}, {"sense": "relating to weapons that use nuclear power", "level": "B2", "dict_examp": "a nuclear war/attack", "lear_examp": "I think that the car isn't the greatest danger to human life today, because I believe the greatest danger is the nuclear bomb."}]}]}, {"word": "novelty", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being new or unusual", "level": "C2", "dict_examp": "The fashion industry relies on novelty, and photographers are always looking for new faces.", "lear_examp": "Olivia's story takes place in a romantic atmosphere, which may allow the reader to look upon the colonial period as a dream; it sounds like a legend, a fairy tale, which fulfills an important purpose of novels: the appeal of novelty."}, {"sense": "an object, event, or experience that is new or unusual", "level": "C2", "dict_examp": "Tourists are still a novelty on this remote island.", "lear_examp": "Our city needed a novelty like this and fortunately the dream came true!"}]}]}, {"word": "notion", "poses": [{"pos": "noun", "senses": [{"sense": "an idea or belief", "level": "C1", "dict_examp": "The notion of sharing is unknown to most two-year-olds.", "lear_examp": "Unfortunately, in ancient Greece, although the notion of the republic and democracy were invented and quite successfully developed there, not being a noble citizen could be cruelly disappointing and painful."}]}]}, {"word": "notwithstanding", "poses": [{"pos": "adverb", "senses": [{"sense": "despite", "level": "C1", "dict_examp": "Injuries notwithstanding, he won the semi-final match.", "lear_examp": "Notwithstanding this zealous kind of complaint, it would appear to me that they had great fun during the third day when after the English lesson they went to the swimming pool."}]}]}, {"word": "nuisance", "poses": [{"pos": "noun", "senses": [{"sense": "a person, thing, or situation that annoys you or causes problems for you", "level": "B2", "dict_examp": "I've forgotten my umbrella - what a nuisance!", "lear_examp": "There are usually so many cars in cities that it is a nuisance to use them when you have to drive a short distance."}]}]}, {"word": "nutshell", "poses": [{"pos": "noun", "senses": [{"sense": "something that you say when you are describing something using as few words as possible", "level": "C1", "dict_examp": "The answer, in a nutshell, is yes.", "lear_examp": "To put it in a nutshell, they all provide good food at reasonable prices."}]}]}, {"word": "noticeably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is noticeable", "level": "C1", "dict_examp": "He was noticeably reluctant to meet her.", "lear_examp": "The teachers' salaries are noticeably the largest part in the charts."}]}]}, {"word": "number", "poses": [{"pos": "noun", "senses": [{"sense": "a symbol or word used in a counting system or used to show the position or order of something", "level": "A1", "dict_examp": "Think of a number smaller than 100.", "lear_examp": "I chose the black one with the numbers in orange."}, {"sense": "a telephone number", "level": "A1", "dict_examp": "Do you know his phone number?", "lear_examp": "Call me before, and tell me what you like to eat? Here's my new number 07782472751."}, {"sense": "a group of numbers that represents something", "level": "A1", "dict_examp": "Please write your credit card number on this form.", "lear_examp": "You can take bus number 87, 77 or 156 and after 10 minutes get off next to the post office and library and walk 2 minutes."}, {"sense": "an amount", "level": "B1", "dict_examp": "The number of people killed in road accidents fell last month.", "lear_examp": "We are a well-mixed class with equal numbers of boys and girls, all about 20 years old."}, {"sense": "several", "level": "B2", "dict_examp": "There were a number of journalists at the meeting.", "lear_examp": "There are a number of errors in your article."}]}, {"pos": "verb", "senses": [{"sense": "to give something a number", "level": "C1", "dict_examp": "Each volume was numbered and indexed.", "lear_examp": "The bus to Finspang is numbered 410 and there is at least one bus departing for Finspang every hour."}, {"sense": "If people or things number a particular amount, there are that many of them.", "level": "C2", "dict_examp": "Our company's sales force numbered over 5,000.", "lear_examp": "They marched against Barovia with armies that numbered hundreds of thousands."}]}]}, {"word": "nowhere", "poses": [{"pos": "adverb", "senses": [{"sense": "not anywhere", "level": "B1", "dict_examp": "The room was very crowded - there was nowhere to sit.", "lear_examp": "I was looking for it nearly everywhere, but it was nowhere!"}, {"sense": "a long way from places where people live", "level": "B2", "dict_examp": "His car broke down in the middle of nowhere.", "lear_examp": "You know I really don't want to get lost in the middle of nowhere."}, {"sense": "If someone or something appears out of nowhere, it appears suddenly or unexpectedly.", "level": "B2", "dict_examp": "The car came out of nowhere and we had to swerve to miss it.", "lear_examp": "I was lying all alone on the beach, then suddenly, out of nowhere, right behind me those strange creatures appeared."}, {"sense": "If something gets you nowhere, it does not help you to succeed.", "level": "C2", "dict_examp": "Bad manners will get you nowhere.", "lear_examp": "As this is a loophole in the law system, it's creating a conflict between house-owners and squatters and getting them nowhere."}]}]}, {"word": "numerous", "poses": [{"pos": "adjective", "senses": [{"sense": "many", "level": "C1", "dict_examp": "We have discussed these plans on numerous occasions.", "lear_examp": "The fact that my country produces numerous talented skaters is also a factor that helps me enjoy skating."}]}]}, {"word": "now", "poses": [{"pos": "adverb", "senses": [{"sense": "at the present time", "level": "A1", "dict_examp": "I'm used to it now.", "lear_examp": "I am now vegetarian!"}, {"sense": "immediately", "level": "A2", "dict_examp": "We're going home now.", "lear_examp": "Please, buy it right now."}, {"sense": "a very short time ago", "level": "A2", "dict_examp": "When I came in just now, everyone was laughing.", "lear_examp": "I was watching a badminton competition just now."}, {"sense": "used to show the length of time that something has been happening, from the time it began until the present", "level": "B2", "dict_examp": "I've lived in Cambridge for two years now.", "lear_examp": ""}, {"sense": "used to say that something will happen very soon", "level": "B2", "dict_examp": "We're expecting our second child any day now.", "lear_examp": "The evil creatures who were bound to come out of the dark would see Carla any minute now."}, {"sense": "If something happens now and then, it happens sometimes but not very often.", "level": "B2", "dict_examp": "I love chocolate, but I only eat it now and then.", "lear_examp": "If you really love to have a snack now and then, try to eat fruit and vegetables, instead of sweets."}, {"sense": "sometimes, but not often", "level": "C1", "dict_examp": "We still get together for lunch every now and then.", "lear_examp": "Each day choose 10 new words and learn them by heart. In a week you will have learned 70 new words, and in a year 3640, a lot of words. Please, do not forget to repeat them every now and then."}]}, {"pos": "conjunction", "senses": [{"sense": "as a result of a new situation", "level": "B2", "dict_examp": "Now that I've got a car I can visit her more often.", "lear_examp": "Now I am in England for further studies, I would be very grateful to you if you will give me the opportunity to join your club."}]}]}, {"word": "nursery", "poses": [{"pos": "noun", "senses": [{"sense": "a place where young children and babies are taken care of while their parents are at work", "level": "B2", "dict_examp": "Does Jake go to a nursery or a baby-sitter?", "lear_examp": "I enjoy working with children because I was working  in a nursery."}]}]}, {"word": "nutrition", "poses": [{"pos": "noun", "senses": [{"sense": "the food that you eat and the way that it affects your health", "level": "C1", "dict_examp": "Good nutrition is essential for growing children.", "lear_examp": "So, good exercise combined with the right nutrition (low fat, vegetables etc.) will alter our lives and help us feel and appear more relaxed."}]}]}, {"word": "November", "poses": [{"pos": "noun", "senses": [{"sense": "the eleventh month of the year, after October and before December", "level": "A1", "dict_examp": "5(th) of November/November 5(th)", "lear_examp": "I have an exam on 22nd of November 2006."}]}]}, {"word": "nurse", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to care for sick and injured people", "level": "A2", "dict_examp": "He worked as a nurse in a psychiatric hospital.", "lear_examp": "I want to be a nurse."}]}, {"pos": "verb", "senses": [{"sense": "to care for a person or animal that is ill", "level": "C2", "dict_examp": "We nursed the injured sparrow back to health.", "lear_examp": "Second, there are more and more old people who need to be looked after or nursed."}]}]}, {"word": "novelist", "poses": [{"pos": "noun", "senses": [{"sense": "a person who writes novels", "level": "B2", "dict_examp": "His father was a novelist.", "lear_examp": "My teacher has told me that you are a British novelist who writes crime stories, and you have come to live in our area."}]}]}, {"word": "noticeable", "poses": [{"pos": "adjective", "senses": [{"sense": "easy to see or be aware of", "level": "C1", "dict_examp": "There was a noticeable difference in his behavior after the injury.", "lear_examp": "What was noticeable all over Warsaw were the overfilled garbage cans and litter in the streets that nobody cleaned up."}]}]}, {"word": "noun", "poses": [{"pos": "noun", "senses": [{"sense": "a word that refers to a person, place, thing, event, substance or quality", "level": "A2", "dict_examp": "'Doctor', 'tree', 'party', 'coal' and 'beauty' are all nouns.", "lear_examp": ""}]}]}, {"word": "notorious", "poses": [{"pos": "adjective", "senses": [{"sense": "famous for something bad", "level": "C1", "dict_examp": "a notorious criminal", "lear_examp": "Apart from this, Bristol is notorious for its poor social policy for the people who are on the poverty line."}]}]}, {"word": "novel", "poses": [{"pos": "noun", "senses": [{"sense": "a book that tells a story about imaginary people and events", "level": "B1", "dict_examp": "historical/romantic novels", "lear_examp": "Yesterday I was sat on the bench under a tree in that wonderful garden and I was reading an interesting novel by Jane Austen, when a charming young boy came near to me."}]}]}, {"word": "nowadays", "poses": [{"pos": "adverb", "senses": [{"sense": "at the present time, especially when compared to the past", "level": "B1", "dict_examp": "Everything seems more expensive nowadays.", "lear_examp": "Well, nowadays I hardly ever watch television, as time is something that I really don't have enough of."}]}]}]