[{"word": "objection", "poses": [{"pos": "noun", "senses": [{"sense": "when someone says that they do not like or approve of something or someone", "level": "B2", "dict_examp": "Our main objection to the restaurant adding outdoor tables is that it will be noisy.", "lear_examp": "In my opinion there are two main objections to the existence of zoos."}]}]}, {"word": "observation", "poses": [{"pos": "noun", "senses": [{"sense": "when someone watches someone or something carefully", "level": "B2", "dict_examp": "The doctor wants to keep him under observation for a week.", "lear_examp": "But actually it is boring when you're almost always under observation."}, {"sense": "a remark about something that you have noticed", "level": "C1", "dict_examp": "He made an interesting observation.", "lear_examp": "I'd like to make some observations regarding your CDs."}]}]}, {"word": "ocean", "poses": [{"pos": "noun", "senses": [{"sense": "a very large area of salt water", "level": "A2", "dict_examp": "the Atlantic/Pacific/Indian/Arctic/Antarctic Ocean", "lear_examp": "My favorite room is the first to the right because I like the color and because from the window, I can see the ocean."}, {"sense": "a very small amount compared to the amount needed", "level": "C2", "dict_examp": "My letter of protest was just a drop in the ocean.", "lear_examp": "I know I am a drop in the ocean, but I'm convinced it's the only way, my way, of contributing to improve education in Mexico."}]}]}, {"word": "obscene", "poses": [{"pos": "adjective", "senses": [{"sense": "much too large or much more than is needed or necessary", "level": "C2", "dict_examp": "obscene profits", "lear_examp": "Needless to say, the price was 'obscene', but I did not care."}, {"sense": "offensive, rude, or disgusting\n according to accepted moral standards, often relating to sex in a way that is unpleasant or shocking", "level": "C2", "dict_examp": "an obscene gesture", "lear_examp": "It was a woman with a deep, sexual voice, talking about my boyfriend with obscene innuendos about our relationship."}]}]}, {"word": "obtain", "poses": [{"pos": "verb", "senses": [{"sense": "to get something", "level": "B2", "dict_examp": "to obtain information", "lear_examp": "Now, he has obtained a permit from other countries to plant sugar in their countries."}]}]}, {"word": "obligatory", "poses": [{"pos": "adjective", "senses": [{"sense": "required, usually by a rule or law", "level": "C1", "dict_examp": "The street was lined with the obligatory blue bins used for recyclable trash.", "lear_examp": "I think this is a very good way of encouraging people to learn to like exercise without them having to do it because it is obligatory."}, {"sense": "expected because it is usual", "level": "C2", "dict_examp": "When we were in England, we made the obligatory trip to Stonehenge.", "lear_examp": "Everybody should try a Danish lunch with the obligatory bread with herring and lots of beer."}]}]}, {"word": "obstacle", "poses": [{"pos": "noun", "senses": [{"sense": "something that makes it difficult for you to do something or to succeed at something", "level": "C1", "dict_examp": "to overcome an obstacle", "lear_examp": "Another obstacle for those students who wish to study in the library after classes, is the totally devastating fact of early closure."}, {"sense": "a thing that blocks your way and is difficult to go around", "level": "C1", "dict_examp": "We suddenly encountered an obstacle along the trail.", "lear_examp": "They had many obstacles in their way, for example a wall of bricks and no ladder to help them get on the other side - some of them were helping each other  and could continue this rat race, and some had to finish it then."}]}]}, {"word": "obviously", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is easy to understand or see", "level": "B1", "dict_examp": "Obviously, the school cannot function without teachers.", "lear_examp": "Obviously it's a special day for all the family, so we spend a lot of time - and also lots of money - on dresses, food and flowers."}]}]}, {"word": "observant", "poses": [{"pos": "adjective", "senses": [{"sense": "good or quick at noticing things", "level": "C2", "dict_examp": "He's very observant.", "lear_examp": "What's more, Len is the most patient and observant listener I have ever come across."}]}]}, {"word": "occupation", "poses": [{"pos": "noun", "senses": [{"sense": "your job", "level": "A2", "dict_examp": "You have to give your name, age and occupation on the application form.", "lear_examp": "In the first lesson we introduced ourselves and described our occupation, interests and so on, to each other."}, {"sense": "something that you do in your free time", "level": "C1", "dict_examp": "He has a few occupations, such as gardening and woodwork.", "lear_examp": "She made literature classes an engaging activity and fun and turned reading into an absorbing and fascinating occupation."}, {"sense": "when an army moves into a place and takes control of it", "level": "C2", "dict_examp": "a military occupation", "lear_examp": "During the German occupation in Greece she was alone in Athens with her two children, because her husband had died in Albania, fighting against the Italians."}]}]}, {"word": "obese", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely fat", "level": "C1", "dict_examp": "Currently, 15% of the population are classified as obese.", "lear_examp": "Less physical activity and a poor diet can lead to being overweight or even obese."}]}]}, {"word": "occurrence", "poses": [{"pos": "noun", "senses": [{"sense": "an event or something that happens", "level": "C1", "dict_examp": "a common/rare occurrence", "lear_examp": "Many people would think this is a normal occurrence and take this capacity for granted, but my experience has been that this is not the case and that there are many people out there, especially parents, unable to show their true feelings."}, {"sense": "the existence or presence of something", "level": "C1", "dict_examp": "The tests can detect the occurrence of certain cancers.", "lear_examp": "Its line shows the occurrence of two peaks: one in the early 1980's (14%) and another one is expected to happen in the year 2010."}]}]}, {"word": "observe", "poses": [{"pos": "verb", "senses": [{"sense": "to watch someone or something carefully", "level": "B2", "dict_examp": "The role of scientists is to observe and describe the world, not to try to control it.", "lear_examp": "To support the idea of making a short video about daily life at our school I have spent some time discussing it with other students, observing and analysing an average day in our school."}, {"sense": "to notice something", "level": "C1", "dict_examp": "Jack observed a look of anxiety on his brother's face.", "lear_examp": "Two trends can be observed: one, \"sociological\", giving women a more and more important role in our country, and the other, \"cultural\", still keeping them to three \"sacred things\" - household, kids and the church."}, {"sense": "to obey a law, rule, or religious custom", "level": "C2", "dict_examp": "to observe the law", "lear_examp": ""}]}]}, {"word": "obsessed", "poses": [{"pos": "adjective", "senses": [{"sense": "to think about someone or something all the time", "level": "B2", "dict_examp": "to be obsessed with money/work", "lear_examp": "While she was walking her brain got more and more obsessed with the idea....... \"I have to tell this story!\""}]}]}, {"word": "occur", "poses": [{"pos": "verb", "senses": [{"sense": "to happen, often without being planned", "level": "B2", "dict_examp": "The accident occurred at 10:15 in the east-bound lane and traffic was tied up for three hours.", "lear_examp": "Furthermore, I think that most accidents that occur with cars are due to the irresponsibility of some drivers and I think strong measures should be taken in order to punish them."}]}]}, {"word": "obsolete", "poses": [{"pos": "adjective", "senses": [{"sense": "not used now", "level": "C1", "dict_examp": "obsolete equipment", "lear_examp": "The museum's advertisement promises an exciting experience, so students were surprised to find so many obsolete machines of no interest."}]}]}, {"word": "objective", "poses": [{"pos": "noun", "senses": [{"sense": "something that you are trying to achieve", "level": "B2", "dict_examp": "Her main/prime objective now is simply to stay in office.", "lear_examp": "Do you think I will have the right conditions to do the diving course and achieve my objectives?"}]}, {"pos": "adjective", "senses": [{"sense": "only influenced by facts and not by feelings", "level": "B2", "dict_examp": "I try to be objective when I review someone's work.", "lear_examp": "Friends can be more objective concerning your faults and can give you a different point of view."}]}]}, {"word": "occupy", "poses": [{"pos": "verb", "senses": [{"sense": "to fill or use a place or period of time", "level": "B2", "dict_examp": "His book collection occupies most of the room.", "lear_examp": "An intelligent solution to this is the bicycle, which can be parked almost everywhere and occupies little space."}, {"sense": "to keep someone busy or interested", "level": "B2", "dict_examp": "On long car trips I occupy myself with puzzles.", "lear_examp": "So in order to keep myself occupied for a while, I went to the restaurant, except it wasn't open."}, {"sense": "to move into a place and take control of it", "level": "C1", "dict_examp": "The troops eventually occupied most of the island.", "lear_examp": "It's a show called \"Taxa\" based on true stories. It takes you back to 1942, when Denmark was occupied by Germany."}]}]}, {"word": "occasion", "poses": [{"pos": "noun", "senses": [{"sense": "an important event or ceremony", "level": "B1", "dict_examp": "a special occasion", "lear_examp": "I enjoy wearing clothes for special occasions - for example a nice long dress."}, {"sense": "a time when something happens", "level": "B2", "dict_examp": "That was a different/another occasion.", "lear_examp": "On one occasion our teacher left the class."}, {"sense": "sometimes, but not often", "level": "C2", "dict_examp": "He has, on occasion, told a small lie.", "lear_examp": ""}]}]}, {"word": "obvious", "poses": [{"pos": "adjective", "senses": [{"sense": "easy to understand or see", "level": "B1", "dict_examp": "\"How do you know she's not happy?\" \"It's obvious.\"", "lear_examp": "The answers to your questions are obvious."}]}]}, {"word": "oblige", "poses": [{"pos": "verb", "senses": [{"sense": "to be forced to do something", "level": "B2", "dict_examp": "Sellers are not legally obliged to accept the highest offer.", "lear_examp": "Besides, I don't want to wear any protective head-gear, which all the riders are obliged to wear."}, {"sense": "to be helpful", "level": "C1", "dict_examp": "The manager was only too happy to oblige.", "lear_examp": "I understand that you attach a great deal of value to the views of your visitors. I am happy to oblige."}]}]}, {"word": "obey", "poses": [{"pos": "verb", "senses": [{"sense": "to do what you are told to do by a person, rule, or instruction", "level": "B2", "dict_examp": "The soldiers refused to obey (orders).", "lear_examp": "I have strict parents who tell me what to do and what not to do every day. If I don't obey them, I'll be punished for sure."}]}]}, {"word": "oak", "poses": [{"pos": "noun", "senses": [{"sense": "a large tree found in northern countries, or the wood of this tree", "level": "B2", "dict_examp": "an oak table", "lear_examp": "There is a very old oak in the middle of the garden."}]}]}, {"word": "objectively", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is only influenced by facts and not by feelings", "level": "C1", "dict_examp": "This test assesses all candidates objectively.", "lear_examp": "The articles are objectively written and what is more they are comprehensible to the majority of people."}]}]}, {"word": "obesity", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being extremely fat", "level": "C1", "dict_examp": "The government is concerned about childhood obesity.", "lear_examp": "Many researchers say that obesity and other adult diseases are getting common as we eat more western food."}]}]}, {"word": "obligation", "poses": [{"pos": "noun", "senses": [{"sense": "something that you do because it is your duty or because you feel you have to", "level": "B2", "dict_examp": "If you have not signed a contract, you are under no obligation to  pay them any money.", "lear_examp": "In spite of all these activities and obligations you don't have to worry about your rest because you will work just 5 hours a day and you will have enough free time to play your guitar."}]}]}, {"word": "obsessive", "poses": [{"pos": "adjective", "senses": [{"sense": "thinking too much about something, or doing something too much", "level": "C2", "dict_examp": "obsessive behavior", "lear_examp": "At first I followed in an extremely obsessive way the swimming competitions, which lasted almost a week."}]}]}, {"word": "object", "poses": [{"pos": "noun", "senses": [{"sense": "a thing that you can see or touch but that is usually not alive", "level": "B1", "dict_examp": "a bright, shiny object", "lear_examp": "I saw many things like dinosaur bones, mummies, various objects, etc."}, {"sense": "in grammar, the person or thing that is affected by the action of the verb or the person or thing that comes after a preposition", "level": "B1", "dict_examp": "In the sentence \"I like ice cream,\" \"ice cream\" is the object of the verb \"like.\"", "lear_examp": ""}, {"sense": "the purpose of something", "level": "C1", "dict_examp": "The object of this game is to score more points than the opposing team.", "lear_examp": "In extreme cases, famous people are the object of the rage and hate many people bury in themselves."}]}, {"pos": "verb", "senses": [{"sense": "to feel or say that you do not like or do not approve of something or someone", "level": "B2", "dict_examp": "He objects to the label \"magician,\" which he is often called.", "lear_examp": "I would like to object to what the reporter said in his conclusion."}]}]}, {"word": "observer", "poses": [{"pos": "noun", "senses": [{"sense": "a person who watches what happens but has no active part in it", "level": "C2", "dict_examp": "Political observers are expecting the election result to be close.", "lear_examp": "Not even UN observers from other African countries understood this."}]}]}, {"word": "obsession", "poses": [{"pos": "noun", "senses": [{"sense": "something or someone that you think about all the time", "level": "B2", "dict_examp": "an unhealthy obsession with death", "lear_examp": "Shopping is an obsession for all of us."}]}]}, {"word": "occasional", "poses": [{"pos": "adjective", "senses": [{"sense": "not happening or done often or regularly", "level": "C1", "dict_examp": "occasional snowstorms", "lear_examp": "It is only occasional, but you have to plan ahead about when you are going to have a bath or shower and heat the water up."}]}]}, {"word": "occasionally", "poses": [{"pos": "adverb", "senses": [{"sense": "sometimes but not often", "level": "B2", "dict_examp": "We occasionally get together for dinner.", "lear_examp": "I will need to use the computer to contact my friend on E-Mail and occasionally listen to a couple of CDs."}]}]}, {"word": "off", "poses": [{"pos": "adverb", "senses": [{"sense": "not at work", "level": "A2", "dict_examp": "I had six weeks off when my son was born.", "lear_examp": "I will take a day off on Friday."}, {"sense": "used with actions in which something is removed or removes itself from another thing", "level": "A2", "dict_examp": "Take your jacket off.", "lear_examp": "I took off my ring."}, {"sense": "not operating or being used", "level": "A2", "dict_examp": "Make sure the computers are turned off before you go home.", "lear_examp": "When we arrived home, all the lights were off and everything was peaceful."}, {"sense": "away from a place or position", "level": "B1", "dict_examp": "I'm off to the grocery store.", "lear_examp": "They got into the car and drove off."}, {"sense": "If a price has a certain amount of money off, it costs that much less than the usual price.", "level": "B1", "dict_examp": "You can get some money off if you pay cash.", "lear_examp": "He promised me 30% off the price, so I'm going to buy the TV and the CD player from him."}, {"sense": "far in distance or time", "level": "C1", "dict_examp": "You can see the city off in the distance.", "lear_examp": "Allow me to start by saying that one day, which may lie not so far off in the future, people will visit the buildings which were formerly known as \"Educational Institutions\" like we visit museums to gape at the sheer size of the Dinosaurs..."}]}, {"pos": "preposition", "senses": [{"sense": "down or away from a place or position", "level": "B1", "dict_examp": "All the leaves had dropped off the tree.", "lear_examp": "I still remember the way your brother fell off the ladder that day."}, {"sense": "used with actions in which something is removed or removes itself from another thing", "level": "B1", "dict_examp": "I can't get the lid off this jar.", "lear_examp": "Next month, I'm going to change my bedroom. I'll take the photographs off the wall."}, {"sense": "near to a building or place", "level": "B2", "dict_examp": "an island off the coast of Spain", "lear_examp": "He spent all night off the coast, (unfinished)"}, {"sense": "If someone such as a doctor or a soldier is off duty, they are not working.", "level": "B2", "dict_examp": "What time do you go off duty tomorrow?", "lear_examp": "Sometimes I come off duty at ten p.m."}, {"sense": "in a place where few people go", "level": "C2", "dict_examp": "I prefer to take my vacation somewhere off the beaten track.", "lear_examp": "Furthermore, in areas off the beaten track, there are not even police sometimes."}]}, {"pos": "adjective", "senses": [{"sense": "If food or drink is off, it is not now fresh and good to eat or drink.", "level": "B2", "dict_examp": "This milk smells off.", "lear_examp": "Who knows if the food isn't off?"}, {"sense": "stopped or given up", "level": "C2", "dict_examp": "Last night’s baseball game was called off because of rain.", "lear_examp": "On that day, she had written him a big long letter and told him that it was all off, for she didn't love him any longer."}]}]}, {"word": "offer", "poses": [{"pos": "verb", "senses": [{"sense": "to say that you are willing to do something", "level": "A2", "dict_examp": "Paul has offered to help us pack.", "lear_examp": "Dear Robbie, Thank you for offering to help me paint my bedroom."}, {"sense": "to ask someone if they would like something", "level": "B1", "dict_examp": "They've offered me a job.", "lear_examp": "He offered me a contract and asked me to go to his music studio to record a CD."}, {"sense": "to give or provide something", "level": "B1", "dict_examp": "to offer advice", "lear_examp": "Rome offers good nightlife so after visiting the museum, we'll be able to go to the disco."}, {"sense": "to say that you will pay a particular amount of money", "level": "C1", "dict_examp": "I offered him $1200 for the car.", "lear_examp": "My company will offer 20 percent more than the minimum wage that exists for the same type of work in Canada."}]}, {"pos": "noun", "senses": [{"sense": "when you ask someone if they would like something", "level": "A2", "dict_examp": "an offer  of help", "lear_examp": "Thank you very much for your offer."}, {"sense": "a cheap price or special arrangement for something you are buying", "level": "B1", "dict_examp": "This special offer ends on Friday.", "lear_examp": "We found a £12 offer to Leeds Castle including bus transfer and entrance ticket for the castle."}, {"sense": "an amount of money that you say you will pay for something", "level": "C2", "dict_examp": "The highest offer anyone has made so far is $500.", "lear_examp": ""}]}]}, {"word": "offense", "poses": [{"pos": "noun", "senses": [{"sense": "in sports such as football, the part of a team which tries to score points", "level": "B1", "dict_examp": "The offense been having trouble moving the ball down the field.", "lear_examp": ""}, {"sense": "a crime", "level": "B2", "dict_examp": "Driving without a license is an offense.", "lear_examp": "Finally, using a bike keeps you free of any parking problem or parking offense and your bike will wait for you all day long, because it won't be towed-away!"}, {"sense": "when something rude makes someone upset or angry", "level": "B2", "dict_examp": "Do you think he took offense  at what I said about his hair?", "lear_examp": "I hope you will not take offense but I think you work too much."}]}]}, {"word": "oddly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a strange or surprising way", "level": "C2", "dict_examp": "an oddly shaped house", "lear_examp": "Oddly enough, she never seems to be really angry and perhaps it is the reason why I like confiding in her."}]}]}, {"word": "ocean", "poses": [{"pos": "noun", "senses": [{"sense": "a very large area of salt water", "level": "A2", "dict_examp": "the Atlantic/Pacific/Indian/Arctic/Antarctic Ocean", "lear_examp": "My favorite room is the first to the right because I like the color and because from the window, I can see the ocean."}, {"sense": "a very small amount compared to the amount needed", "level": "C2", "dict_examp": "My letter of protest was just a drop in the ocean.", "lear_examp": "I know I am a drop in the ocean, but I'm convinced it's the only way, my way, of contributing to improve education in Mexico."}]}]}, {"word": "odds", "poses": [{"pos": "noun", "senses": [{"sense": "the probability that a particular thing will or will not happen", "level": "C1", "dict_examp": "She was sick yesterday, so the odds are she won’t be in today.", "lear_examp": "After all, on the battlefield for promotion, men still have a vital interest to set the odds against women in favor of their own opportunities."}, {"sense": "If you do or achieve something against all the odds, you succeed although you were not likely to.", "level": "C2", "dict_examp": "We won the game against all odds.", "lear_examp": "The stormy waters and heavy winds were a great challenge, and almost deemed it impossible for me to succeed, but against all odds I managed to defeat my fears."}, {"sense": "various items of different types that are not valuable or important", "level": "C2", "dict_examp": "We moved most of the furniture to the new house, but there are still a few odds and ends to bring over.", "lear_examp": "The photograph spent some time there; in the drawer under the odds and ends everybody has."}, {"sense": "to not agree with someone or something", "level": "C2", "dict_examp": "The two brothers were always at odds.", "lear_examp": "Young people are inexperienced as far as the world is concerned and thus they are frequently at odds with their family."}]}]}, {"word": "of", "poses": [{"pos": "preposition", "senses": [{"sense": "belonging or relating to someone or something", "level": "A1", "dict_examp": "a friend of mine", "lear_examp": "The name of my friend is Maria."}, {"sense": "used after words that show an amount", "level": "A1", "dict_examp": "a pound of potatoes", "lear_examp": "She has a lot of flowers in her room."}, {"sense": "containing", "level": "A1", "dict_examp": "a bag of popcorn", "lear_examp": "I like cups of tea, I like noodles, but I don't like beef."}, {"sense": "used with numbers, ages and dates", "level": "A1", "dict_examp": "an essay of 500 words", "lear_examp": "The class started on the 2nd of June at half past five."}, {"sense": "used to say \"yes\" and emphasize your answer", "level": "A1", "dict_examp": "\"Can you help me?\" \"Of course!\"", "lear_examp": "Yes of course I can come."}, {"sense": "used in expressions showing position", "level": "A2", "dict_examp": "the top of his head", "lear_examp": "First you go past a big supermarket on the corner of my street."}, {"sense": "showing someone or something", "level": "A2", "dict_examp": "a map of downtown", "lear_examp": "Tony gave me a photo of Henry."}, {"sense": "used when comparing related things", "level": "A2", "dict_examp": "Worst of all was the food!", "lear_examp": "The best of all was a necklace."}, {"sense": "used to say \"no\" and emphasize your answer", "level": "A2", "dict_examp": "\"Do you mind if I borrow your pen?\" \"Of course not.\"", "lear_examp": "\"Pardon. You said your uncle's will? Would you mind explaining that, please?\" \"Of course not!\""}, {"sense": "used to show who or what does something", "level": "B1", "dict_examp": "the works of Shakespeare", "lear_examp": "They often cover the music of \"The Beatles\" or \"The Rolling Stones\"."}, {"sense": "showing a reason or cause", "level": "B1", "dict_examp": "He died of cancer.", "lear_examp": "But, three months later, after walking in the rain he died of pneumonia."}, {"sense": "used to show that what you are saying is obvious or already known", "level": "B1", "dict_examp": "Of course, the Olympics are not just about money.", "lear_examp": "Of course, I met many new people."}, {"sense": "used after an adjective when judging someone's behavior", "level": "B2", "dict_examp": "It was very nice of you to think of us.", "lear_examp": "It was most thoughtful of you to invite us and I warmly appreciate your hospitality."}, {"sense": "about or relating to", "level": "C1", "dict_examp": "Speaking of Elizabeth, here she is.", "lear_examp": "Speaking of sightseeing, many thought that visiting other sights - like the Folk Museum - should not be compulsory."}, {"sense": "used to say \"before\" the hour when you are saying what time it is", "level": "C1", "dict_examp": "It's ten of five.", "lear_examp": ""}, {"sense": "not important", "level": "C1", "dict_examp": "The money was of little consequence to Tony.", "lear_examp": "Second, the downpour of rain which was mentioned was in fact nothing more than a small shower, of no significant consequence for the dance display and horse show."}, {"sense": "If you do something of your own accord, you choose to do it and no one else forces you.", "level": "C2", "dict_examp": "She left of her own accord.", "lear_examp": "She would go alone, but it was something that was chosen of her own accord."}]}]}, {"word": "offender", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has committed a crime", "level": "B2", "dict_examp": "first-time/repeat offenders", "lear_examp": "The ticket fare is very reasonable, and there are always police patrolling around, protecting the people from offenders."}]}]}, {"word": "odd", "poses": [{"pos": "adjective", "senses": [{"sense": "strange or unusual", "level": "B2", "dict_examp": "Her father was an odd man.", "lear_examp": "That struck me as odd, since it had never happened before."}, {"sense": "used to talk about something that happens or exists sometimes but not often", "level": "C2", "dict_examp": "She does the odd teaching job but nothing permanent.", "lear_examp": "This attitude makes it difficult for the odd foreigner who tries to get involved with the local community."}]}]}, {"word": "October", "poses": [{"pos": "noun", "senses": [{"sense": "the tenth month of the year, after September and before November", "level": "A1", "dict_examp": "the 22nd of October/October 22nd", "lear_examp": "I think the class starts the 3rd of October and finishes the 16th."}]}]}, {"word": "odor", "poses": [{"pos": "noun", "senses": [{"sense": "a particular smell, often one that is  unpleasant", "level": "C2", "dict_examp": "the musty odor of a damp cellar", "lear_examp": "Even though all the lights were on and there was an unpleasant odor of recently put-out cigarettes and also a smell of an expensive perfume, he just couldn't get a glimpse of anyone."}]}]}, {"word": "offensive", "poses": [{"pos": "adjective", "senses": [{"sense": "likely to make people angry or upset", "level": "B2", "dict_examp": "This program contains language that some viewers might find offensive.", "lear_examp": "Dear Sir/Madam, The review on the Westfield Music Festival was both offensive and incorrect."}]}]}, {"word": "o'clock", "poses": [{"pos": "adverb", "senses": [{"sense": "used after the numbers one to twelve to mean exactly that hour when you tell the time", "level": "A1", "dict_examp": "It was ten o'clock when we got home.", "lear_examp": "See you tomorrow at 7 o'clock."}]}]}, {"word": "offend", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone upset or angry", "level": "B2", "dict_examp": "I think she was a bit offended that she hadn't been invited to the party.", "lear_examp": "I know that she was not offended but I will never forget my stupid question."}]}]}, {"word": "often", "poses": [{"pos": "adverb", "senses": [{"sense": "many times or regularly", "level": "A1", "dict_examp": "I often shop there.", "lear_examp": "We often go swimming together."}, {"sense": "If something often happens or is often true, it is normal for it to happen, or it is usually true.", "level": "B2", "dict_examp": "Brothers and sisters often argue.", "lear_examp": "Very often, people link classical music to Austrian or German composers, such as Mozart or Handel, but rarely to England and geniuses such as Haydn and Purcell."}, {"sense": "sometimes, but not often", "level": "C2", "dict_examp": "He went into town every so often to buy supplies.", "lear_examp": "And likewise, common sense tells us it doesn't matter that oranges from Spain contain 0.01% more vitamin C than those from Florida, as long as we eat them every once in a while."}]}]}, {"word": "oh", "poses": [{"pos": "exclamation", "senses": [{"sense": "introduces an idea that you have just thought of, or something that you have just remembered", "level": "A1", "dict_examp": "Oh, I just realized there might be a problem.", "lear_examp": "Oh, and don't forget to show up in old clothes, ok?"}, {"sense": "used to express different emotions, such as surprise, disappointment and pleasure, often as a reaction to something someone has said", "level": "A1", "dict_examp": "\"Jack can't come after all.\" \"Oh too bad, Amy will be sorry to hear that.\"", "lear_examp": "Oh, that's ok."}, {"sense": "used to emphasize how surprised, angry, shocked, etc. you are", "level": "B1", "dict_examp": "Oh my gosh, I'm so happy to see you! When did you get here?", "lear_examp": ""}]}]}, {"word": "offer", "poses": [{"pos": "verb", "senses": [{"sense": "to say that you are willing to do something", "level": "A2", "dict_examp": "Paul has offered to help us pack.", "lear_examp": "Dear Robbie, Thank you for offering to help me paint my bedroom."}, {"sense": "to ask someone if they would like something", "level": "B1", "dict_examp": "They've offered me a job.", "lear_examp": "He offered me a contract and asked me to go to his music studio to record a CD."}, {"sense": "to give or provide something", "level": "B1", "dict_examp": "to offer advice", "lear_examp": "Rome offers good nightlife so after visiting the museum, we'll be able to go to the disco."}, {"sense": "to say that you will pay a particular amount of money", "level": "C1", "dict_examp": "I offered him $1200 for the car.", "lear_examp": "My company will offer 20 percent more than the minimum wage that exists for the same type of work in Canada."}]}, {"pos": "noun", "senses": [{"sense": "when you ask someone if they would like something", "level": "A2", "dict_examp": "an offer  of help", "lear_examp": "Thank you very much for your offer."}, {"sense": "a cheap price or special arrangement for something you are buying", "level": "B1", "dict_examp": "This special offer ends on Friday.", "lear_examp": "We found a £12 offer to Leeds Castle including bus transfer and entrance ticket for the castle."}, {"sense": "an amount of money that you say you will pay for something", "level": "C2", "dict_examp": "The highest offer anyone has made so far is $500.", "lear_examp": ""}]}]}, {"word": "on", "poses": [{"pos": "preposition", "senses": [{"sense": "on or onto a surface", "level": "A1", "dict_examp": "Ouch! You stepped on my foot.", "lear_examp": "I can read the book, listen to music, watch TV or just sit on my sofa and drink a hot cup of tea."}, {"sense": "used to show the day or date when something happens", "level": "A1", "dict_examp": "Some of the stores aren't open on Sundays.", "lear_examp": "Dinner will be on Friday at 7:00."}, {"sense": "covering, touching, attached to or hanging from something", "level": "A1", "dict_examp": "You've got blood on your shirt.", "lear_examp": "I like my bedroom, because there are a lot of windows, two armchairs, a lamp next to the bed, a table under the window, and some pictures on the wall."}, {"sense": "used to refer to a place when giving directions", "level": "A2", "dict_examp": "Our house is the first on the left after the post office.", "lear_examp": "My house is the first one on the left."}, {"sense": "used for showing some methods of traveling", "level": "A2", "dict_examp": "He called to say he's on the bus and will be here in a few minutes.", "lear_examp": "I will travel on a train and then I will take a taxi to your home."}, {"sense": "in a particular place", "level": "A2", "dict_examp": "the diagram on page 22", "lear_examp": "I live on a farm in the Emmental."}, {"sense": "used to show the way in which something is recorded or broadcast", "level": "A2", "dict_examp": "What's on television tonight?", "lear_examp": "I watched ice hockey on cable TV at night."}, {"sense": "used to show what money or time is used for", "level": "A2", "dict_examp": "She refuses to spend more than $30 on a pair of shoes.", "lear_examp": "I love it and I spend all my time on it."}, {"sense": "walking", "level": "A2", "dict_examp": "Are you going by bicycle or on foot?", "lear_examp": "It isn't far away from the main building - it's about 15 minutes on foot."}, {"sense": "available at a reduced price", "level": "A2", "dict_examp": "I love that dress but I'm waiting until it's on sale before I buy it.", "lear_examp": "I bought a nice t-shirt and a pair of shorts.  I bought them because they're comfortable and cheap: they were on sale. I spent 15€."}, {"sense": "available to buy in stores, on the Internet, etc.", "level": "B1", "dict_examp": "The video and book are now on sale.", "lear_examp": "I went window shopping with my friends yesterday and I saw this beautiful skirt on sale."}, {"sense": "about", "level": "B1", "dict_examp": "a book on plants", "lear_examp": "The other one is a book on dogs and cats."}, {"sense": "next to or along the side of a place or area", "level": "B1", "dict_examp": "New York  is on the Hudson River.", "lear_examp": "Remember our meeting is in the Golden Crown, next to the tall building on 67th street."}, {"sense": "using something", "level": "B1", "dict_examp": "I do all my bookkeeping on the computer.", "lear_examp": "I was in the pizza shop to order some food for my family and I was on the phone."}, {"sense": "on a boat, train, aircraft, etc.", "level": "B1", "dict_examp": "There were 230 people on board the plane.", "lear_examp": "I was all the more excited as it was the first time I have been on board such a big boat."}, {"sense": "If something is on fire, it is burning when it should not be.", "level": "B1", "dict_examp": "If your home was on fire and you could save only one thing, what would it be?", "lear_examp": "A lot of buildings were on fire."}, {"sense": "intentionally", "level": "B1", "dict_examp": "I didn't do it on purpose, it was an accident.", "lear_examp": "I didn't do it on purpose; it was dark and I just walked into it."}, {"sense": "not early or late", "level": "B1", "dict_examp": "I got to school on time.", "lear_examp": "So, I will not be on time for my English class tomorrow."}, {"sense": "If something is on display, it is there for people to look at.", "level": "B1", "dict_examp": "Many old airplanes are on display in the museum.", "lear_examp": "There were some new musical instruments on display."}, {"sense": "generally", "level": "B1", "dict_examp": "We've had a few problems, but on the whole we're very happy.", "lear_examp": "On the whole I don't like watching television."}, {"sense": "alone", "level": "B1", "dict_examp": "I like living on my own.", "lear_examp": "On Wednesday morning I went on my own to see the Vatican."}, {"sense": "without any help", "level": "B1", "dict_examp": "Ryan can't get into his shirt on his own - he's just a baby!", "lear_examp": "Maybe I can do the missing work on my own."}, {"sense": "used to show what happens as a result of touching or hitting against something", "level": "B2", "dict_examp": "You'll cut yourself on that knife if you're not careful.", "lear_examp": "Suddenly I hit my head on the bed as the man was talking."}, {"sense": "used to show something which is used as food or fuel", "level": "B2", "dict_examp": "What do frogs live on?", "lear_examp": "All new cars run on unleaded fuel which is a benefit to the environment."}, {"sense": "If you do something on behalf of someone, you do it for them or instead of them.", "level": "B2", "dict_examp": "On behalf of the entire company, I would like to thank you for all your work.", "lear_examp": "I am writing on behalf of our college English club members to welcome you to our city."}, {"sense": "used to give your opinion after you have considered all the facts about something", "level": "B2", "dict_examp": "On balance, I'd rather go straight home.", "lear_examp": "On balance, I think that getting to work by bike offers more advantages than going by car, most of all for traffic and the environment."}, {"sense": "only if", "level": "B2", "dict_examp": "I'll go with you on the condition that we get back before midnight.", "lear_examp": "I would like to do this on condition that you will not mention my name on the website."}, {"sense": "If someone such as a doctor or a soldier is on duty, they are working.", "level": "B2", "dict_examp": "What time are you on duty tomorrow?", "lear_examp": "I was on duty in front of the major's house with another soldier."}, {"sense": "in addition to something else", "level": "B2", "dict_examp": "He tripped and hurt his back, and on top of that, he lost his cell phone.", "lear_examp": "When I turned around, I saw that it had rained in almost every part of the room and on top of that, there were some baby wolves with their mother, sleeping on the bed."}, {"sense": "used when you are comparing two different ideas or opinions", "level": "B2", "dict_examp": "On the one hand, computer games develop many skills, but on the other, they mean kids don't get enough exercise.", "lear_examp": "On the one hand, I know from my experience that it's much easier in life if you know more about everything, but on the other hand, I'd say that if someone had given me a chance (when I was kid) to study what I enjoyed,  probably I'd have more possibility to develop my skills."}, {"sense": "to be a member of a group or organization", "level": "C1", "dict_examp": "She's on the refreshments committee.", "lear_examp": "As I am the student representative on the committee, I would like to suggest some ideas."}, {"sense": "played on television or radio", "level": "C1", "dict_examp": "His show is on the air from 11:00 to 11:30 Monday through Thursday.", "lear_examp": "As you can see, it’s probably the first chance to learn good English on T.V. Another surprising thing is that it's not on the air too late, so you can watch it without oversleeping in the morning."}, {"sense": "to be quick to understand and react to things", "level": "C1", "dict_examp": "She's over ninety, but she's still on the ball.", "lear_examp": "When you're at Sants station, you'll need to be on the ball."}, {"sense": "as the result of something", "level": "C1", "dict_examp": "Grades are awarded  on the basis of progress and performance.", "lear_examp": "On the basis of the points mentioned above, it is a foregone conclusion that young people do not face any severe problems."}, {"sense": "because of a particular reason", "level": "C1", "dict_examp": "You cannot discriminate on the grounds of religion.", "lear_examp": "I am convinced that it is better than Southside College on the grounds that a great mass of students are satisfied."}, {"sense": "If a plan or activity is on hold, it will not be done until a later time.", "level": "C1", "dict_examp": "The project is on hold until we raise more money.", "lear_examp": "What's more, it might, intentionally or not, raise awareness on issues that might have been put on hold by authorities, such as the legalization of soft drugs."}, {"sense": "waiting to speak to someone on the telephone", "level": "C1", "dict_examp": "His secretary put me on hold.", "lear_examp": "The day after, I called your office and after being put on hold, the person answering the phone was unwilling to come up with a proper reply."}, {"sense": "likely to happen soon", "level": "C1", "dict_examp": "Economic recovery is on the horizon.", "lear_examp": "Often this is justified as a result of society being collectively afraid that a shortage of fuel is on the horizon."}, {"sense": "If something is on the increase, it is happening more often.", "level": "C1", "dict_examp": "Homelessness is on the increase in many cities.", "lear_examp": "The number of motorists is on the increase everywhere in the world."}, {"sense": "at the place where you work, or while you work", "level": "C1", "dict_examp": "She's only had two years on the job and has been promoted already.", "lear_examp": "Not managing on the job wouldn't just have been your failure, but also your employer's, who had trusted you."}, {"sense": "If something is on loan, someone is borrowing it.", "level": "C1", "dict_examp": "Both paintings are on loan from the city museum.", "lear_examp": "For example, you can always take out on loan any video you like from our center."}, {"sense": "If a film or television program is made on location, it is made at a place suitable to the story.", "level": "C1", "dict_examp": "The movie was shot on location in Kenya.", "lear_examp": "We can't help mentioning the nice shots on location."}, {"sense": "driving or traveling, usually over a long distance", "level": "C1", "dict_examp": "We'd been on the road for 4 hours so we stopped to stretch and have a snack.", "lear_examp": "I have experienced sitting behind a steering wheel on the road for many years."}, {"sense": "making progress and likely to succeed", "level": "C1", "dict_examp": "A fighter from Edinburgh is on track to become world heavyweight boxing champion.", "lear_examp": "The sales teams are well on track and bringing in new customers every day."}, {"sense": "being shown to the public", "level": "C1", "dict_examp": "Her designs are currently on show at the Museum of Modern Art.", "lear_examp": "One of the facilities that really makes a difference is the Art Gallery, with its great exhibition on show, as well as the Art Library."}, {"sense": "A food served on the side is served separate from the other foods.", "level": "C1", "dict_examp": "I’ll have the salad with the dressing on the side.", "lear_examp": "A common meal in my country will include soup and rice, a main dish is usually served with beans on the side and corn tortillas, all this is full of vitamins and calcium."}, {"sense": "inside a factory, office building, etc.", "level": "C1", "dict_examp": "There are two restaurants on site.", "lear_examp": "A small period of training on site is required a few days before the beginning of the job itself and how many interesting people you will meet!"}, {"sense": "to be about to happen or be done very soon", "level": "C2", "dict_examp": "The company is on the verge of financial disaster.", "lear_examp": "I was on the verge of depression, when I decided to take the control of my own life."}, {"sense": "to have something with you", "level": "C2", "dict_examp": "I don’t have my driver’s license on me.", "lear_examp": "Make sure you have some cash in smaller bills on you, so you won't have problems paying for the ride."}, {"sense": "to be extremely happy and excited", "level": "C2", "dict_examp": "When I heard I got the job, I was on cloud nine!", "lear_examp": "But now, after the promise in which both said \"yes,\" she was on cloud nine."}, {"sense": "at that exact time", "level": "C2", "dict_examp": "We have to leave at 7:30 on the dot.", "lear_examp": "He gave him an address and told him to be there at six on the dot."}, {"sense": "to be nervous or worried", "level": "C2", "dict_examp": "Sorry for shouting - I'm a little on edge today.", "lear_examp": "I was consequently on edge all the time and was not able to have fun as much as the others did."}, {"sense": "used when you are describing how a situation seems on the surface", "level": "C2", "dict_examp": "On the face of it, this seems like a bargain, but I bet there are hidden costs.", "lear_examp": "On the face of it, both sides have valid arguments, and it's a difficult balancing act to manage."}, {"sense": "to be ready to deal with something difficult that might happen", "level": "C2", "dict_examp": "Companies were warned to be on their guard for suspicious packages.", "lear_examp": "However, we should be on guard, so as not to let the things escape our control."}, {"sense": "near to someone or something, and ready to help or be used when necessary", "level": "C2", "dict_examp": "Extra supplies will be on hand, in case they are needed.", "lear_examp": "From their point of view, they can always have you on hand whenever they need help, which is the most important part in their formative years."}, {"sense": "suddenly and without thinking first", "level": "C2", "dict_examp": "I tend to act on impulse.", "lear_examp": "I'm seeing Milly as a capricious girl who, like most teenagers, enjoys buying, although I think that she buys on impulse."}, {"sense": "If someone's job, reputation, life, etc., is on the line, they may lose it.", "level": "C2", "dict_examp": "If we don't win the contract, all our jobs are on the line.", "lear_examp": "The person who hopes to achieve success shouldn't be afraid of taking risks and sometimes putting his or her career on the line for the sake of gaining much bigger benefits."}, {"sense": "If you do something on the spur of the moment, you do it suddenly, without planning it.", "level": "C2", "dict_examp": "On the spur of the moment we decided to go to London for the day.", "lear_examp": "In reality, many people buy things on the spur of the moment only to discover later that they, in fact, do not meet their expectations."}, {"sense": "sometimes, but not often", "level": "C2", "dict_examp": "He has, on occasion, told a small lie.", "lear_examp": ""}, {"sense": "done or experienced by someone", "level": "C2", "dict_examp": "This is a major sacrifice on the part of the unions.", "lear_examp": "It seems that international sports competitions have always tended to attract a great amount of interest on the part of the media and have consistently been popular with sports fans the world over."}, {"sense": "to have a good/bad, etc. relationship with someone", "level": "C2", "dict_examp": "I'm still on friendly terms with my old colleagues.", "lear_examp": "The fact that they both live alone requires them to be on good terms with the rest of us."}, {"sense": "If two people are on the same wavelength, they have the same way of thinking and it is easy for them to understand each other.", "level": "C2", "dict_examp": "We chatted occasionally, but I never really felt we were on the same wavelength.", "lear_examp": "We were on the same wavelength and we therefore started our own research."}, {"sense": "to be in a situation where something bad is going to happen very soon", "level": "C2", "dict_examp": "The two countries are on the brink of war.", "lear_examp": "By the end of the 21st century, Earth was on the brink of destruction. The atmosphere was polluted, the seas were poisoned, the animals were just a distant memory."}, {"sense": "in addition to your main job", "level": "C2", "dict_examp": "She does some freelance work on the side.", "lear_examp": "At work, they gave her the worst jobs to do. She knew she didn't have much choice but she still tried to find something else on the side."}, {"sense": "immediately", "level": "C2", "dict_examp": "I accepted the job on the spot.", "lear_examp": "And when it was Meredith's turn to tell her about her impending wedding, she felt she was going to have a heart attack on the spot."}]}, {"pos": "adverb", "senses": [{"sense": "If you have something on, you are wearing it.", "level": "A2", "dict_examp": "She has on a black coat.", "lear_examp": "And I want you to put on some baggy clothes, so that you'll feel comfortable while working."}, {"sense": "into a bus, train, plane, etc. or onto a horse", "level": "B1", "dict_examp": "It’s time to get on the bus.", "lear_examp": ""}, {"sense": "happening or planned", "level": "B2", "dict_examp": "I'm busy this afternoon, but I don't have anything on tomorrow.", "lear_examp": ""}, {"sense": "working or being used", "level": "B2", "dict_examp": "The heating has been on all day.", "lear_examp": "For example, the staff shouldn't leave the lights on and the heating's on when they don't need to use it."}, {"sense": "in a way which results in forward movement", "level": "B2", "dict_examp": "You continue on and I'll catch up.", "lear_examp": "I had just gotten on the subway when it stopped and didn't move on."}, {"sense": "performing", "level": "C2", "dict_examp": "Hurry up with the make-up - I'm on in ten minutes.", "lear_examp": "My faith in youth started to fade but then a boy named Josh came on."}]}]}, {"word": "off-putting", "poses": [{"pos": "adjective", "senses": [{"sense": "slightly unpleasant or worrying so that you do not want to get involved in any way", "level": "C2", "dict_examp": "He's slightly aggressive, which a lot of people find a bit off-putting when they first meet him.", "lear_examp": "Therefore, it's quite off-putting to stay in Hong Kong for higher education."}]}]}, {"word": "offspring", "poses": [{"pos": "noun", "senses": [{"sense": "the child of a person or animal", "level": "C2", "dict_examp": "to produce offspring", "lear_examp": "It is vital that parents be around their offspring, especially when they are young, to establish a warm, trusting relationship."}]}]}, {"word": "old-fashioned", "poses": [{"pos": "adjective", "senses": [{"sense": "not modern", "level": "B1", "dict_examp": "old-fashioned clothes/ideas/furniture", "lear_examp": "But I don't like clothes with stripes, because I think that's a little old-fashioned."}]}]}, {"word": "omission", "poses": [{"pos": "noun", "senses": [{"sense": "when something has not been included that should have been", "level": "C2", "dict_examp": "Parents are upset by the omission of music from the school’s courses.", "lear_examp": "Finally, I think it would be an omission if I didn't mention the children that live in poverty and die from starvation and diseases every day."}]}]}, {"word": "offset", "poses": [{"pos": "verb", "senses": [{"sense": "If one thing offsets another thing, it has the opposite effect and so creates a more balanced situation.", "level": "C2", "dict_examp": "The costs have been offset by savings in other areas.", "lear_examp": "During the interview, she tried to offset the bad impression she was sure she had made."}]}]}, {"word": "OK", "poses": [{"pos": "exclamation", "senses": [{"sense": "used when agreeing to do something or when allowing someone to do something", "level": "A1", "dict_examp": "\"Could you pick me up at the train station?\" \"OK, what time?\"", "lear_examp": "OK. See you for dinner!"}, {"sense": "used to check that someone understands something or that they agree to something", "level": "A2", "dict_examp": "So I'll get the food and you can get the drink, OK?", "lear_examp": "Don't forget to wear an old shirt and jeans, okay?"}, {"sense": "used as a way of showing that you are going to take action, start speaking or start something new", "level": "A2", "dict_examp": "OK then, if you're ready we'll get started.", "lear_examp": ""}]}, {"pos": "adjective", "senses": [{"sense": "not sick, damaged, upset, etc.", "level": "A1", "dict_examp": "Are you OK? You look pale.", "lear_examp": "Hi, Ramesh, What are you doing? Are you OK?"}, {"sense": "good or good enough", "level": "A2", "dict_examp": "Is your food OK?", "lear_examp": "Well, about the music, I think salsa and rock music are OK."}, {"sense": "allowed or acceptable", "level": "A2", "dict_examp": "Is it OK if I bring a friend to the party?", "lear_examp": "Dear Ally, It's okay that you couldn't come."}]}, {"pos": "adverb", "senses": [{"sense": "in a satisfactory way", "level": "A2", "dict_examp": "Everything was going OK until the printer stopped working.", "lear_examp": "Finally the day finished OK."}]}]}, {"word": "olive", "poses": [{"pos": "noun", "senses": [{"sense": "a small green or black fruit with a bitter taste that is eaten or used to produce oil", "level": "B1", "dict_examp": "olive oil", "lear_examp": "In the countryside there are some hills, some sunflowers, olive trees and many medieval towns  on the hills to visit!"}]}]}, {"word": "omit", "poses": [{"pos": "verb", "senses": [{"sense": "to not include something", "level": "C1", "dict_examp": "I’d be upset if my name were omitted from the list of contributors.", "lear_examp": "Moreover, an important aspect of language learning is good access to books and other written materials.  For this reason, you should not omit our recently modernized library."}]}]}, {"word": "officially", "poses": [{"pos": "adverb", "senses": [{"sense": "formally and in a way agreed to or arranged by people in positions of authority", "level": "C1", "dict_examp": "The new store was officially opened yesterday.", "lear_examp": "If I could travel back to any place and time in history, I would choose the day when World War II was officially declared over."}]}]}, {"word": "omelet", "poses": [{"pos": "noun", "senses": [{"sense": "eggs that have been mixed and fried, often with other foods added", "level": "A2", "dict_examp": "a cheese/mushroom omelet", "lear_examp": ""}]}]}, {"word": "oil", "poses": [{"pos": "noun", "senses": [{"sense": "a thick liquid produced from plants  that is used in cooking", "level": "A2", "dict_examp": "olive/sunflower/vegetable oil", "lear_examp": "Hi Fatima, I think you can bring some potatoes, olive oil and lettuce."}, {"sense": "a thick liquid that comes from under the Earth's surface that is used as a fuel and for making parts of machines move easily", "level": "B1", "dict_examp": "an oil company", "lear_examp": "He is working in a big oil company called Agip."}, {"sense": "to work late into the night", "level": "C2", "dict_examp": "I had to burn the midnight oil to get the essay finished.", "lear_examp": "My examinations were nearing and I was always burning the midnight oil."}]}]}, {"word": "old", "poses": [{"pos": "adjective", "senses": [{"sense": "having lived or existed for many years", "level": "A1", "dict_examp": "an old man", "lear_examp": "Wroctaw is an old town."}, {"sense": "used to describe or ask about someone's age", "level": "A1", "dict_examp": "How old is your father?", "lear_examp": "She is 23 years old."}, {"sense": "from a period in the past", "level": "A2", "dict_examp": "I saw my old English teacher last time I went home.", "lear_examp": "My old one is a Nokia."}, {"sense": "someone who you have known and liked for a long time", "level": "A2", "dict_examp": "I saw an old friend who I went to high school with.", "lear_examp": "Do you remember my old friend Jack?"}, {"sense": "a period in the past", "level": "C1", "dict_examp": "This place isn't as good as it was in the old days.", "lear_examp": "In the old days, a scholar could spend years of his life in search of specific information, which now can be easily and inexpensively found at the click of a button!"}]}]}, {"word": "official", "poses": [{"pos": "adjective", "senses": [{"sense": "approved by the government or someone in authority", "level": "B2", "dict_examp": "the official language of Singapore", "lear_examp": "I have worked as an official translator in the British Embassy in Seoul."}, {"sense": "connected with or arranged by someone in a position of responsibility", "level": "C2", "dict_examp": "an official visit", "lear_examp": "For exactly that reason official reports are issued by doctors or psychologists in court in order to check the person's mental health and responsibility for the crime."}, {"sense": "known by the public", "level": "C2", "dict_examp": "Their engagement is now official.", "lear_examp": "It was now official, she was the most beautiful girl of the school."}, {"sense": "An official explanation or statement is one that is given, but which may not be true.", "level": "C2", "dict_examp": "The official reason for the delay is bad weather.", "lear_examp": "Well, this was the official reason to explain his stay, but the truth - which I had learned later - was that Martin was a broken man."}]}, {"pos": "noun", "senses": [{"sense": "a person who has a position of responsibility in a government or organization", "level": "C2", "dict_examp": "a UN official", "lear_examp": "As to city officials, if they manage the whole event fine, this feat is bound to boost their chances at the next elections."}]}]}, {"word": "office", "poses": [{"pos": "noun", "senses": [{"sense": "a room or building where people work", "level": "A2", "dict_examp": "I didn't leave the office until eight o'clock last night.", "lear_examp": "It's better for me to meet at central park, next to my office."}, {"sense": "the place where a doctor or other medical person sees patients", "level": "A2", "dict_examp": "the doctor's/dentist's office", "lear_examp": "I need to change the hour of our meeting next Tuesday because I have an appointment at the doctor's office at 4:00 o'clock."}, {"sense": "a room or building where you can get information, tickets, or a particular service", "level": "A2", "dict_examp": "a ticket office", "lear_examp": "I suggest we meet at 4:50 p.m, in the ticket office."}, {"sense": "an important job in a government or other organization", "level": "C1", "dict_examp": "the office of executive vice president", "lear_examp": "The former Polish prime minister was a woman - Hanna Suchocka - and she was able to remain in office for 15 months, in the time when the life expectancy of governments in Poland is about half a year."}]}]}, {"word": "officer", "poses": [{"pos": "noun", "senses": [{"sense": "a police officer", "level": "B1", "dict_examp": "a uniformed officer", "lear_examp": "They sent me an officer: Officer McDonald, from the anti-mafia department."}, {"sense": "a person who has a position of authority in an organization", "level": "B1", "dict_examp": "I had an interview with the university admissions officer.", "lear_examp": "I work as a customs officer and in this job I meet a lot of foreign people every day."}, {"sense": "someone with an important job in a military organization", "level": "B2", "dict_examp": "a military officer", "lear_examp": "He was an officer in the army."}]}]}, {"word": "on", "poses": [{"pos": "preposition", "senses": [{"sense": "on or onto a surface", "level": "A1", "dict_examp": "Ouch! You stepped on my foot.", "lear_examp": "I can read the book, listen to music, watch TV or just sit on my sofa and drink a hot cup of tea."}, {"sense": "used to show the day or date when something happens", "level": "A1", "dict_examp": "Some of the stores aren't open on Sundays.", "lear_examp": "Dinner will be on Friday at 7:00."}, {"sense": "covering, touching, attached to or hanging from something", "level": "A1", "dict_examp": "You've got blood on your shirt.", "lear_examp": "I like my bedroom, because there are a lot of windows, two armchairs, a lamp next to the bed, a table under the window, and some pictures on the wall."}, {"sense": "used to refer to a place when giving directions", "level": "A2", "dict_examp": "Our house is the first on the left after the post office.", "lear_examp": "My house is the first one on the left."}, {"sense": "used for showing some methods of traveling", "level": "A2", "dict_examp": "He called to say he's on the bus and will be here in a few minutes.", "lear_examp": "I will travel on a train and then I will take a taxi to your home."}, {"sense": "in a particular place", "level": "A2", "dict_examp": "the diagram on page 22", "lear_examp": "I live on a farm in the Emmental."}, {"sense": "used to show the way in which something is recorded or broadcast", "level": "A2", "dict_examp": "What's on television tonight?", "lear_examp": "I watched ice hockey on cable TV at night."}, {"sense": "used to show what money or time is used for", "level": "A2", "dict_examp": "She refuses to spend more than $30 on a pair of shoes.", "lear_examp": "I love it and I spend all my time on it."}, {"sense": "walking", "level": "A2", "dict_examp": "Are you going by bicycle or on foot?", "lear_examp": "It isn't far away from the main building - it's about 15 minutes on foot."}, {"sense": "available at a reduced price", "level": "A2", "dict_examp": "I love that dress but I'm waiting until it's on sale before I buy it.", "lear_examp": "I bought a nice t-shirt and a pair of shorts.  I bought them because they're comfortable and cheap: they were on sale. I spent 15€."}, {"sense": "available to buy in stores, on the Internet, etc.", "level": "B1", "dict_examp": "The video and book are now on sale.", "lear_examp": "I went window shopping with my friends yesterday and I saw this beautiful skirt on sale."}, {"sense": "about", "level": "B1", "dict_examp": "a book on plants", "lear_examp": "The other one is a book on dogs and cats."}, {"sense": "next to or along the side of a place or area", "level": "B1", "dict_examp": "New York  is on the Hudson River.", "lear_examp": "Remember our meeting is in the Golden Crown, next to the tall building on 67th street."}, {"sense": "using something", "level": "B1", "dict_examp": "I do all my bookkeeping on the computer.", "lear_examp": "I was in the pizza shop to order some food for my family and I was on the phone."}, {"sense": "on a boat, train, aircraft, etc.", "level": "B1", "dict_examp": "There were 230 people on board the plane.", "lear_examp": "I was all the more excited as it was the first time I have been on board such a big boat."}, {"sense": "If something is on fire, it is burning when it should not be.", "level": "B1", "dict_examp": "If your home was on fire and you could save only one thing, what would it be?", "lear_examp": "A lot of buildings were on fire."}, {"sense": "intentionally", "level": "B1", "dict_examp": "I didn't do it on purpose, it was an accident.", "lear_examp": "I didn't do it on purpose; it was dark and I just walked into it."}, {"sense": "not early or late", "level": "B1", "dict_examp": "I got to school on time.", "lear_examp": "So, I will not be on time for my English class tomorrow."}, {"sense": "If something is on display, it is there for people to look at.", "level": "B1", "dict_examp": "Many old airplanes are on display in the museum.", "lear_examp": "There were some new musical instruments on display."}, {"sense": "generally", "level": "B1", "dict_examp": "We've had a few problems, but on the whole we're very happy.", "lear_examp": "On the whole I don't like watching television."}, {"sense": "alone", "level": "B1", "dict_examp": "I like living on my own.", "lear_examp": "On Wednesday morning I went on my own to see the Vatican."}, {"sense": "without any help", "level": "B1", "dict_examp": "Ryan can't get into his shirt on his own - he's just a baby!", "lear_examp": "Maybe I can do the missing work on my own."}, {"sense": "used to show what happens as a result of touching or hitting against something", "level": "B2", "dict_examp": "You'll cut yourself on that knife if you're not careful.", "lear_examp": "Suddenly I hit my head on the bed as the man was talking."}, {"sense": "used to show something which is used as food or fuel", "level": "B2", "dict_examp": "What do frogs live on?", "lear_examp": "All new cars run on unleaded fuel which is a benefit to the environment."}, {"sense": "If you do something on behalf of someone, you do it for them or instead of them.", "level": "B2", "dict_examp": "On behalf of the entire company, I would like to thank you for all your work.", "lear_examp": "I am writing on behalf of our college English club members to welcome you to our city."}, {"sense": "used to give your opinion after you have considered all the facts about something", "level": "B2", "dict_examp": "On balance, I'd rather go straight home.", "lear_examp": "On balance, I think that getting to work by bike offers more advantages than going by car, most of all for traffic and the environment."}, {"sense": "only if", "level": "B2", "dict_examp": "I'll go with you on the condition that we get back before midnight.", "lear_examp": "I would like to do this on condition that you will not mention my name on the website."}, {"sense": "If someone such as a doctor or a soldier is on duty, they are working.", "level": "B2", "dict_examp": "What time are you on duty tomorrow?", "lear_examp": "I was on duty in front of the major's house with another soldier."}, {"sense": "in addition to something else", "level": "B2", "dict_examp": "He tripped and hurt his back, and on top of that, he lost his cell phone.", "lear_examp": "When I turned around, I saw that it had rained in almost every part of the room and on top of that, there were some baby wolves with their mother, sleeping on the bed."}, {"sense": "used when you are comparing two different ideas or opinions", "level": "B2", "dict_examp": "On the one hand, computer games develop many skills, but on the other, they mean kids don't get enough exercise.", "lear_examp": "On the one hand, I know from my experience that it's much easier in life if you know more about everything, but on the other hand, I'd say that if someone had given me a chance (when I was kid) to study what I enjoyed,  probably I'd have more possibility to develop my skills."}, {"sense": "to be a member of a group or organization", "level": "C1", "dict_examp": "She's on the refreshments committee.", "lear_examp": "As I am the student representative on the committee, I would like to suggest some ideas."}, {"sense": "played on television or radio", "level": "C1", "dict_examp": "His show is on the air from 11:00 to 11:30 Monday through Thursday.", "lear_examp": "As you can see, it’s probably the first chance to learn good English on T.V. Another surprising thing is that it's not on the air too late, so you can watch it without oversleeping in the morning."}, {"sense": "to be quick to understand and react to things", "level": "C1", "dict_examp": "She's over ninety, but she's still on the ball.", "lear_examp": "When you're at Sants station, you'll need to be on the ball."}, {"sense": "as the result of something", "level": "C1", "dict_examp": "Grades are awarded  on the basis of progress and performance.", "lear_examp": "On the basis of the points mentioned above, it is a foregone conclusion that young people do not face any severe problems."}, {"sense": "because of a particular reason", "level": "C1", "dict_examp": "You cannot discriminate on the grounds of religion.", "lear_examp": "I am convinced that it is better than Southside College on the grounds that a great mass of students are satisfied."}, {"sense": "If a plan or activity is on hold, it will not be done until a later time.", "level": "C1", "dict_examp": "The project is on hold until we raise more money.", "lear_examp": "What's more, it might, intentionally or not, raise awareness on issues that might have been put on hold by authorities, such as the legalization of soft drugs."}, {"sense": "waiting to speak to someone on the telephone", "level": "C1", "dict_examp": "His secretary put me on hold.", "lear_examp": "The day after, I called your office and after being put on hold, the person answering the phone was unwilling to come up with a proper reply."}, {"sense": "likely to happen soon", "level": "C1", "dict_examp": "Economic recovery is on the horizon.", "lear_examp": "Often this is justified as a result of society being collectively afraid that a shortage of fuel is on the horizon."}, {"sense": "If something is on the increase, it is happening more often.", "level": "C1", "dict_examp": "Homelessness is on the increase in many cities.", "lear_examp": "The number of motorists is on the increase everywhere in the world."}, {"sense": "at the place where you work, or while you work", "level": "C1", "dict_examp": "She's only had two years on the job and has been promoted already.", "lear_examp": "Not managing on the job wouldn't just have been your failure, but also your employer's, who had trusted you."}, {"sense": "If something is on loan, someone is borrowing it.", "level": "C1", "dict_examp": "Both paintings are on loan from the city museum.", "lear_examp": "For example, you can always take out on loan any video you like from our center."}, {"sense": "If a film or television program is made on location, it is made at a place suitable to the story.", "level": "C1", "dict_examp": "The movie was shot on location in Kenya.", "lear_examp": "We can't help mentioning the nice shots on location."}, {"sense": "driving or traveling, usually over a long distance", "level": "C1", "dict_examp": "We'd been on the road for 4 hours so we stopped to stretch and have a snack.", "lear_examp": "I have experienced sitting behind a steering wheel on the road for many years."}, {"sense": "making progress and likely to succeed", "level": "C1", "dict_examp": "A fighter from Edinburgh is on track to become world heavyweight boxing champion.", "lear_examp": "The sales teams are well on track and bringing in new customers every day."}, {"sense": "being shown to the public", "level": "C1", "dict_examp": "Her designs are currently on show at the Museum of Modern Art.", "lear_examp": "One of the facilities that really makes a difference is the Art Gallery, with its great exhibition on show, as well as the Art Library."}, {"sense": "A food served on the side is served separate from the other foods.", "level": "C1", "dict_examp": "I’ll have the salad with the dressing on the side.", "lear_examp": "A common meal in my country will include soup and rice, a main dish is usually served with beans on the side and corn tortillas, all this is full of vitamins and calcium."}, {"sense": "inside a factory, office building, etc.", "level": "C1", "dict_examp": "There are two restaurants on site.", "lear_examp": "A small period of training on site is required a few days before the beginning of the job itself and how many interesting people you will meet!"}, {"sense": "to be about to happen or be done very soon", "level": "C2", "dict_examp": "The company is on the verge of financial disaster.", "lear_examp": "I was on the verge of depression, when I decided to take the control of my own life."}, {"sense": "to have something with you", "level": "C2", "dict_examp": "I don’t have my driver’s license on me.", "lear_examp": "Make sure you have some cash in smaller bills on you, so you won't have problems paying for the ride."}, {"sense": "to be extremely happy and excited", "level": "C2", "dict_examp": "When I heard I got the job, I was on cloud nine!", "lear_examp": "But now, after the promise in which both said \"yes,\" she was on cloud nine."}, {"sense": "at that exact time", "level": "C2", "dict_examp": "We have to leave at 7:30 on the dot.", "lear_examp": "He gave him an address and told him to be there at six on the dot."}, {"sense": "to be nervous or worried", "level": "C2", "dict_examp": "Sorry for shouting - I'm a little on edge today.", "lear_examp": "I was consequently on edge all the time and was not able to have fun as much as the others did."}, {"sense": "used when you are describing how a situation seems on the surface", "level": "C2", "dict_examp": "On the face of it, this seems like a bargain, but I bet there are hidden costs.", "lear_examp": "On the face of it, both sides have valid arguments, and it's a difficult balancing act to manage."}, {"sense": "to be ready to deal with something difficult that might happen", "level": "C2", "dict_examp": "Companies were warned to be on their guard for suspicious packages.", "lear_examp": "However, we should be on guard, so as not to let the things escape our control."}, {"sense": "near to someone or something, and ready to help or be used when necessary", "level": "C2", "dict_examp": "Extra supplies will be on hand, in case they are needed.", "lear_examp": "From their point of view, they can always have you on hand whenever they need help, which is the most important part in their formative years."}, {"sense": "suddenly and without thinking first", "level": "C2", "dict_examp": "I tend to act on impulse.", "lear_examp": "I'm seeing Milly as a capricious girl who, like most teenagers, enjoys buying, although I think that she buys on impulse."}, {"sense": "If someone's job, reputation, life, etc., is on the line, they may lose it.", "level": "C2", "dict_examp": "If we don't win the contract, all our jobs are on the line.", "lear_examp": "The person who hopes to achieve success shouldn't be afraid of taking risks and sometimes putting his or her career on the line for the sake of gaining much bigger benefits."}, {"sense": "If you do something on the spur of the moment, you do it suddenly, without planning it.", "level": "C2", "dict_examp": "On the spur of the moment we decided to go to London for the day.", "lear_examp": "In reality, many people buy things on the spur of the moment only to discover later that they, in fact, do not meet their expectations."}, {"sense": "sometimes, but not often", "level": "C2", "dict_examp": "He has, on occasion, told a small lie.", "lear_examp": ""}, {"sense": "done or experienced by someone", "level": "C2", "dict_examp": "This is a major sacrifice on the part of the unions.", "lear_examp": "It seems that international sports competitions have always tended to attract a great amount of interest on the part of the media and have consistently been popular with sports fans the world over."}, {"sense": "to have a good/bad, etc. relationship with someone", "level": "C2", "dict_examp": "I'm still on friendly terms with my old colleagues.", "lear_examp": "The fact that they both live alone requires them to be on good terms with the rest of us."}, {"sense": "If two people are on the same wavelength, they have the same way of thinking and it is easy for them to understand each other.", "level": "C2", "dict_examp": "We chatted occasionally, but I never really felt we were on the same wavelength.", "lear_examp": "We were on the same wavelength and we therefore started our own research."}, {"sense": "to be in a situation where something bad is going to happen very soon", "level": "C2", "dict_examp": "The two countries are on the brink of war.", "lear_examp": "By the end of the 21st century, Earth was on the brink of destruction. The atmosphere was polluted, the seas were poisoned, the animals were just a distant memory."}, {"sense": "in addition to your main job", "level": "C2", "dict_examp": "She does some freelance work on the side.", "lear_examp": "At work, they gave her the worst jobs to do. She knew she didn't have much choice but she still tried to find something else on the side."}, {"sense": "immediately", "level": "C2", "dict_examp": "I accepted the job on the spot.", "lear_examp": "And when it was Meredith's turn to tell her about her impending wedding, she felt she was going to have a heart attack on the spot."}]}, {"pos": "adverb", "senses": [{"sense": "If you have something on, you are wearing it.", "level": "A2", "dict_examp": "She has on a black coat.", "lear_examp": "And I want you to put on some baggy clothes, so that you'll feel comfortable while working."}, {"sense": "into a bus, train, plane, etc. or onto a horse", "level": "B1", "dict_examp": "It’s time to get on the bus.", "lear_examp": ""}, {"sense": "happening or planned", "level": "B2", "dict_examp": "I'm busy this afternoon, but I don't have anything on tomorrow.", "lear_examp": ""}, {"sense": "working or being used", "level": "B2", "dict_examp": "The heating has been on all day.", "lear_examp": "For example, the staff shouldn't leave the lights on and the heating's on when they don't need to use it."}, {"sense": "in a way which results in forward movement", "level": "B2", "dict_examp": "You continue on and I'll catch up.", "lear_examp": "I had just gotten on the subway when it stopped and didn't move on."}, {"sense": "performing", "level": "C2", "dict_examp": "Hurry up with the make-up - I'm on in ten minutes.", "lear_examp": "My faith in youth started to fade but then a boy named Josh came on."}]}]}, {"word": "oneself", "poses": [{"pos": "pronoun", "senses": [{"sense": "the reflexive form of the pronoun \"one\" when it refers to the person speaking or people in general", "level": "C1", "dict_examp": "One needs to take care of oneself.", "lear_examp": "One must ask oneself: \"Why is this happening?\""}]}]}, {"word": "once", "poses": [{"pos": "adverb", "senses": [{"sense": "one single time", "level": "A2", "dict_examp": "I went sailing once, but I didn't like it.", "lear_examp": "I can write to him once a week."}, {"sense": "in the past, but not now", "level": "B1", "dict_examp": "This house once belonged to my grandfather.", "lear_examp": "I once went to England and I love the style of the clothes and how people dress there!"}, {"sense": "again", "level": "B1", "dict_examp": "Once again I'm left with all the dirty dishes!", "lear_examp": "Once again I'm sorry."}, {"sense": "one more time", "level": "B1", "dict_examp": "I'd like to visit the gardens once more before we leave.", "lear_examp": "On Friday I will see him once more."}, {"sense": "used at the beginning of a story to mean a long time ago", "level": "B1", "dict_examp": "Once upon a time there was a beautiful princess.", "lear_examp": "Once upon a time there was a very poor family."}, {"sense": "immediately", "level": "B2", "dict_examp": "I knew at once that I'd like it here.", "lear_examp": "We both were so tired that we went to bed at once."}, {"sense": "at the same time", "level": "B2", "dict_examp": "They all started talking at once.", "lear_examp": "It give me a good chance to see most of my favorite groups at once, and it was marvelous."}, {"sense": "used to mean that something is happening that does not usually happen", "level": "B2", "dict_examp": "The bus came on time for once!", "lear_examp": "We would take lots of pictures, and play our own instruments, and if we get lucky enough, we would even touch the very stones and for once be embraced by magic itself."}, {"sense": "sometimes but not often", "level": "B2", "dict_examp": "We do go to the beach once in a while.", "lear_examp": "She did not say very much except for \"oh\" and \"yes, yes\" every once in a while."}, {"sense": "suddenly", "level": "C1", "dict_examp": "All at once he stood up and walked out of the room.", "lear_examp": "All at once, everything started to work again."}, {"sense": "completely and finally", "level": "C2", "dict_examp": "We have to decide, once and for all, whether we want to ask Dad for money.", "lear_examp": "With the fall of the socialist block in the late 1980's, the ever-looming nuclear war seemed to have been avoided once and for all."}]}, {"pos": "conjunction", "senses": [{"sense": "as soon as", "level": "B2", "dict_examp": "Once I find a place to live, I'll send you my address.", "lear_examp": "I'll write back soon once I know exactly when I can visit you."}]}]}, {"word": "one", "poses": [{"pos": "number", "senses": [{"sense": "the number 1", "level": "A1", "dict_examp": "You have three bags and I only have one.", "lear_examp": "She has got three daughters and one son."}]}, {"pos": "pronoun", "senses": [{"sense": "used to refer to a particular person or thing in a group that has already been talked about", "level": "A2", "dict_examp": "I've got a few books on Chinese cooking. You can borrow one if you like.", "lear_examp": "I got a lot of presents, but the best one was a watch from my sister."}, {"sense": "each other", "level": "B1", "dict_examp": "How can they reach an agreement if they won't talk to one another?", "lear_examp": "We know one another from Poland."}, {"sense": "separately, one after the other", "level": "B2", "dict_examp": "One by one the old buildings in the city have been demolished and replaced with modern glass towers.", "lear_examp": "So, he decides to investigate his death and he meets Harry's friends, one by one, to find out how he died, but they tell him different stories."}, {"sense": "separately", "level": "B2", "dict_examp": "Eat them one at a time.", "lear_examp": "The story was a horrible one but it had a harmless ending. The mad man kills one at a time, but in the end, the producer of the film says: \"Cut, we'll take everything once again.\""}, {"sense": "many, in a series, especially with very little time between them", "level": "B2", "dict_examp": "She read all four books one after another.", "lear_examp": "Then all the good things came one after another."}, {"sense": "any person in general", "level": "C1", "dict_examp": "One ought to respect one's parents.", "lear_examp": "One can learn the beauty of the Greek language by simply reading the headings and will soon find that \"The Step\" is the best newspaper of all."}, {"sense": "combined into a single thing", "level": "C2", "dict_examp": "It's a vacation and art course all in one.", "lear_examp": "The Internet is like combining a television, a telephone and an airplane all in one."}]}, {"pos": "determiner", "senses": [{"sense": "used to refer to a particular person or thing in a group", "level": "A2", "dict_examp": "One drawback is the cost of housing in the area.", "lear_examp": "One of my presents was a dog!"}, {"sense": "used to talk about something that happened in the past", "level": "A2", "dict_examp": "One day, I came home to find my windows broken.", "lear_examp": "One day, I was reading an interesting book when someone called me."}, {"sense": "at some time in the future", "level": "B1", "dict_examp": "I'd like to go to Berlin again one day.", "lear_examp": "I hope one day I can become like that."}, {"sense": "a few", "level": "B1", "dict_examp": "I'd like to make one or two suggestions.", "lear_examp": "I need more T shirts, new skate shoes and perhaps one or two pullovers."}, {"sense": "used to refer to a time in the future that is not yet decided", "level": "B2", "dict_examp": "Why don't we meet for lunch one day next week?", "lear_examp": "I would be very glad if Enrico could stay with you one summer."}, {"sense": "used to refer to a particular occasion while avoiding stating the exact moment", "level": "B2", "dict_examp": "I met him one day in the park.", "lear_examp": "But one night, with the moon bright, they felt encouraged to continue their walk."}, {"sense": "a single thing", "level": "B2", "dict_examp": "Do you think five of us will manage to squeeze into one car?", "lear_examp": "I would recommend just the one hotel: Riverside Hotel, which offers great value."}, {"sense": "used when saying there is no other person or thing", "level": "B2", "dict_examp": "He's the one person you can rely on in an emergency.", "lear_examp": "Often it's the one and only possibility for young children to see wild animals or unknown animals from the other side of the world in real life."}, {"sense": "in some way that is not stated", "level": "B2", "dict_examp": "One way or another these bills have to be paid.", "lear_examp": "All of them made a big difference to our personal life and have affected it one way or another."}, {"sense": "in any way that is possible", "level": "B2", "dict_examp": "We have to make a decision one way or the other about what needs to be done.", "lear_examp": "Even if we choose not to use computers personally, many of our transactions with society work through computer systems one way or the other."}, {"sense": "used to describe someone or something that is completely different from other people or things", "level": "C2", "dict_examp": "My Dad was one of a kind - funny, kind and generous.", "lear_examp": "Pele is indeed one of a kind and can be considered a model for youngsters."}]}]}, {"word": "ongoing", "poses": [{"pos": "adjective", "senses": [{"sense": "still happening", "level": "C2", "dict_examp": "an ongoing investigation/process/project", "lear_examp": "To sum up, we are extremely positive about the club's future and its ongoing success."}]}]}, {"word": "onion", "poses": [{"pos": "noun", "senses": [{"sense": "a round vegetable with layers that has a strong taste and smell", "level": "A2", "dict_examp": "I always cry when I'm chopping onions.", "lear_examp": "This is cooked cabbage with beef, wild mushrooms and onion."}]}]}, {"word": "online", "poses": [{"pos": "adjective", "senses": [{"sense": "describes products, services or information that can be bought or used on the Internet", "level": "A2", "dict_examp": "online banking/shopping", "lear_examp": "I like it very much, because I can play online games now."}]}, {"pos": "adverb", "senses": [{"sense": "bought, used, etc. using the Internet", "level": "A2", "dict_examp": "I ordered them online.", "lear_examp": "When we went back home, I went online and checked my e-mails."}]}]}, {"word": "on", "poses": [{"pos": "preposition", "senses": [{"sense": "on or onto a surface", "level": "A1", "dict_examp": "Ouch! You stepped on my foot.", "lear_examp": "I can read the book, listen to music, watch TV or just sit on my sofa and drink a hot cup of tea."}, {"sense": "used to show the day or date when something happens", "level": "A1", "dict_examp": "Some of the stores aren't open on Sundays.", "lear_examp": "Dinner will be on Friday at 7:00."}, {"sense": "covering, touching, attached to or hanging from something", "level": "A1", "dict_examp": "You've got blood on your shirt.", "lear_examp": "I like my bedroom, because there are a lot of windows, two armchairs, a lamp next to the bed, a table under the window, and some pictures on the wall."}, {"sense": "used to refer to a place when giving directions", "level": "A2", "dict_examp": "Our house is the first on the left after the post office.", "lear_examp": "My house is the first one on the left."}, {"sense": "used for showing some methods of traveling", "level": "A2", "dict_examp": "He called to say he's on the bus and will be here in a few minutes.", "lear_examp": "I will travel on a train and then I will take a taxi to your home."}, {"sense": "in a particular place", "level": "A2", "dict_examp": "the diagram on page 22", "lear_examp": "I live on a farm in the Emmental."}, {"sense": "used to show the way in which something is recorded or broadcast", "level": "A2", "dict_examp": "What's on television tonight?", "lear_examp": "I watched ice hockey on cable TV at night."}, {"sense": "used to show what money or time is used for", "level": "A2", "dict_examp": "She refuses to spend more than $30 on a pair of shoes.", "lear_examp": "I love it and I spend all my time on it."}, {"sense": "walking", "level": "A2", "dict_examp": "Are you going by bicycle or on foot?", "lear_examp": "It isn't far away from the main building - it's about 15 minutes on foot."}, {"sense": "available at a reduced price", "level": "A2", "dict_examp": "I love that dress but I'm waiting until it's on sale before I buy it.", "lear_examp": "I bought a nice t-shirt and a pair of shorts.  I bought them because they're comfortable and cheap: they were on sale. I spent 15€."}, {"sense": "available to buy in stores, on the Internet, etc.", "level": "B1", "dict_examp": "The video and book are now on sale.", "lear_examp": "I went window shopping with my friends yesterday and I saw this beautiful skirt on sale."}, {"sense": "about", "level": "B1", "dict_examp": "a book on plants", "lear_examp": "The other one is a book on dogs and cats."}, {"sense": "next to or along the side of a place or area", "level": "B1", "dict_examp": "New York  is on the Hudson River.", "lear_examp": "Remember our meeting is in the Golden Crown, next to the tall building on 67th street."}, {"sense": "using something", "level": "B1", "dict_examp": "I do all my bookkeeping on the computer.", "lear_examp": "I was in the pizza shop to order some food for my family and I was on the phone."}, {"sense": "on a boat, train, aircraft, etc.", "level": "B1", "dict_examp": "There were 230 people on board the plane.", "lear_examp": "I was all the more excited as it was the first time I have been on board such a big boat."}, {"sense": "If something is on fire, it is burning when it should not be.", "level": "B1", "dict_examp": "If your home was on fire and you could save only one thing, what would it be?", "lear_examp": "A lot of buildings were on fire."}, {"sense": "intentionally", "level": "B1", "dict_examp": "I didn't do it on purpose, it was an accident.", "lear_examp": "I didn't do it on purpose; it was dark and I just walked into it."}, {"sense": "not early or late", "level": "B1", "dict_examp": "I got to school on time.", "lear_examp": "So, I will not be on time for my English class tomorrow."}, {"sense": "If something is on display, it is there for people to look at.", "level": "B1", "dict_examp": "Many old airplanes are on display in the museum.", "lear_examp": "There were some new musical instruments on display."}, {"sense": "generally", "level": "B1", "dict_examp": "We've had a few problems, but on the whole we're very happy.", "lear_examp": "On the whole I don't like watching television."}, {"sense": "alone", "level": "B1", "dict_examp": "I like living on my own.", "lear_examp": "On Wednesday morning I went on my own to see the Vatican."}, {"sense": "without any help", "level": "B1", "dict_examp": "Ryan can't get into his shirt on his own - he's just a baby!", "lear_examp": "Maybe I can do the missing work on my own."}, {"sense": "used to show what happens as a result of touching or hitting against something", "level": "B2", "dict_examp": "You'll cut yourself on that knife if you're not careful.", "lear_examp": "Suddenly I hit my head on the bed as the man was talking."}, {"sense": "used to show something which is used as food or fuel", "level": "B2", "dict_examp": "What do frogs live on?", "lear_examp": "All new cars run on unleaded fuel which is a benefit to the environment."}, {"sense": "If you do something on behalf of someone, you do it for them or instead of them.", "level": "B2", "dict_examp": "On behalf of the entire company, I would like to thank you for all your work.", "lear_examp": "I am writing on behalf of our college English club members to welcome you to our city."}, {"sense": "used to give your opinion after you have considered all the facts about something", "level": "B2", "dict_examp": "On balance, I'd rather go straight home.", "lear_examp": "On balance, I think that getting to work by bike offers more advantages than going by car, most of all for traffic and the environment."}, {"sense": "only if", "level": "B2", "dict_examp": "I'll go with you on the condition that we get back before midnight.", "lear_examp": "I would like to do this on condition that you will not mention my name on the website."}, {"sense": "If someone such as a doctor or a soldier is on duty, they are working.", "level": "B2", "dict_examp": "What time are you on duty tomorrow?", "lear_examp": "I was on duty in front of the major's house with another soldier."}, {"sense": "in addition to something else", "level": "B2", "dict_examp": "He tripped and hurt his back, and on top of that, he lost his cell phone.", "lear_examp": "When I turned around, I saw that it had rained in almost every part of the room and on top of that, there were some baby wolves with their mother, sleeping on the bed."}, {"sense": "used when you are comparing two different ideas or opinions", "level": "B2", "dict_examp": "On the one hand, computer games develop many skills, but on the other, they mean kids don't get enough exercise.", "lear_examp": "On the one hand, I know from my experience that it's much easier in life if you know more about everything, but on the other hand, I'd say that if someone had given me a chance (when I was kid) to study what I enjoyed,  probably I'd have more possibility to develop my skills."}, {"sense": "to be a member of a group or organization", "level": "C1", "dict_examp": "She's on the refreshments committee.", "lear_examp": "As I am the student representative on the committee, I would like to suggest some ideas."}, {"sense": "played on television or radio", "level": "C1", "dict_examp": "His show is on the air from 11:00 to 11:30 Monday through Thursday.", "lear_examp": "As you can see, it’s probably the first chance to learn good English on T.V. Another surprising thing is that it's not on the air too late, so you can watch it without oversleeping in the morning."}, {"sense": "to be quick to understand and react to things", "level": "C1", "dict_examp": "She's over ninety, but she's still on the ball.", "lear_examp": "When you're at Sants station, you'll need to be on the ball."}, {"sense": "as the result of something", "level": "C1", "dict_examp": "Grades are awarded  on the basis of progress and performance.", "lear_examp": "On the basis of the points mentioned above, it is a foregone conclusion that young people do not face any severe problems."}, {"sense": "because of a particular reason", "level": "C1", "dict_examp": "You cannot discriminate on the grounds of religion.", "lear_examp": "I am convinced that it is better than Southside College on the grounds that a great mass of students are satisfied."}, {"sense": "If a plan or activity is on hold, it will not be done until a later time.", "level": "C1", "dict_examp": "The project is on hold until we raise more money.", "lear_examp": "What's more, it might, intentionally or not, raise awareness on issues that might have been put on hold by authorities, such as the legalization of soft drugs."}, {"sense": "waiting to speak to someone on the telephone", "level": "C1", "dict_examp": "His secretary put me on hold.", "lear_examp": "The day after, I called your office and after being put on hold, the person answering the phone was unwilling to come up with a proper reply."}, {"sense": "likely to happen soon", "level": "C1", "dict_examp": "Economic recovery is on the horizon.", "lear_examp": "Often this is justified as a result of society being collectively afraid that a shortage of fuel is on the horizon."}, {"sense": "If something is on the increase, it is happening more often.", "level": "C1", "dict_examp": "Homelessness is on the increase in many cities.", "lear_examp": "The number of motorists is on the increase everywhere in the world."}, {"sense": "at the place where you work, or while you work", "level": "C1", "dict_examp": "She's only had two years on the job and has been promoted already.", "lear_examp": "Not managing on the job wouldn't just have been your failure, but also your employer's, who had trusted you."}, {"sense": "If something is on loan, someone is borrowing it.", "level": "C1", "dict_examp": "Both paintings are on loan from the city museum.", "lear_examp": "For example, you can always take out on loan any video you like from our center."}, {"sense": "If a film or television program is made on location, it is made at a place suitable to the story.", "level": "C1", "dict_examp": "The movie was shot on location in Kenya.", "lear_examp": "We can't help mentioning the nice shots on location."}, {"sense": "driving or traveling, usually over a long distance", "level": "C1", "dict_examp": "We'd been on the road for 4 hours so we stopped to stretch and have a snack.", "lear_examp": "I have experienced sitting behind a steering wheel on the road for many years."}, {"sense": "making progress and likely to succeed", "level": "C1", "dict_examp": "A fighter from Edinburgh is on track to become world heavyweight boxing champion.", "lear_examp": "The sales teams are well on track and bringing in new customers every day."}, {"sense": "being shown to the public", "level": "C1", "dict_examp": "Her designs are currently on show at the Museum of Modern Art.", "lear_examp": "One of the facilities that really makes a difference is the Art Gallery, with its great exhibition on show, as well as the Art Library."}, {"sense": "A food served on the side is served separate from the other foods.", "level": "C1", "dict_examp": "I’ll have the salad with the dressing on the side.", "lear_examp": "A common meal in my country will include soup and rice, a main dish is usually served with beans on the side and corn tortillas, all this is full of vitamins and calcium."}, {"sense": "inside a factory, office building, etc.", "level": "C1", "dict_examp": "There are two restaurants on site.", "lear_examp": "A small period of training on site is required a few days before the beginning of the job itself and how many interesting people you will meet!"}, {"sense": "to be about to happen or be done very soon", "level": "C2", "dict_examp": "The company is on the verge of financial disaster.", "lear_examp": "I was on the verge of depression, when I decided to take the control of my own life."}, {"sense": "to have something with you", "level": "C2", "dict_examp": "I don’t have my driver’s license on me.", "lear_examp": "Make sure you have some cash in smaller bills on you, so you won't have problems paying for the ride."}, {"sense": "to be extremely happy and excited", "level": "C2", "dict_examp": "When I heard I got the job, I was on cloud nine!", "lear_examp": "But now, after the promise in which both said \"yes,\" she was on cloud nine."}, {"sense": "at that exact time", "level": "C2", "dict_examp": "We have to leave at 7:30 on the dot.", "lear_examp": "He gave him an address and told him to be there at six on the dot."}, {"sense": "to be nervous or worried", "level": "C2", "dict_examp": "Sorry for shouting - I'm a little on edge today.", "lear_examp": "I was consequently on edge all the time and was not able to have fun as much as the others did."}, {"sense": "used when you are describing how a situation seems on the surface", "level": "C2", "dict_examp": "On the face of it, this seems like a bargain, but I bet there are hidden costs.", "lear_examp": "On the face of it, both sides have valid arguments, and it's a difficult balancing act to manage."}, {"sense": "to be ready to deal with something difficult that might happen", "level": "C2", "dict_examp": "Companies were warned to be on their guard for suspicious packages.", "lear_examp": "However, we should be on guard, so as not to let the things escape our control."}, {"sense": "near to someone or something, and ready to help or be used when necessary", "level": "C2", "dict_examp": "Extra supplies will be on hand, in case they are needed.", "lear_examp": "From their point of view, they can always have you on hand whenever they need help, which is the most important part in their formative years."}, {"sense": "suddenly and without thinking first", "level": "C2", "dict_examp": "I tend to act on impulse.", "lear_examp": "I'm seeing Milly as a capricious girl who, like most teenagers, enjoys buying, although I think that she buys on impulse."}, {"sense": "If someone's job, reputation, life, etc., is on the line, they may lose it.", "level": "C2", "dict_examp": "If we don't win the contract, all our jobs are on the line.", "lear_examp": "The person who hopes to achieve success shouldn't be afraid of taking risks and sometimes putting his or her career on the line for the sake of gaining much bigger benefits."}, {"sense": "If you do something on the spur of the moment, you do it suddenly, without planning it.", "level": "C2", "dict_examp": "On the spur of the moment we decided to go to London for the day.", "lear_examp": "In reality, many people buy things on the spur of the moment only to discover later that they, in fact, do not meet their expectations."}, {"sense": "sometimes, but not often", "level": "C2", "dict_examp": "He has, on occasion, told a small lie.", "lear_examp": ""}, {"sense": "done or experienced by someone", "level": "C2", "dict_examp": "This is a major sacrifice on the part of the unions.", "lear_examp": "It seems that international sports competitions have always tended to attract a great amount of interest on the part of the media and have consistently been popular with sports fans the world over."}, {"sense": "to have a good/bad, etc. relationship with someone", "level": "C2", "dict_examp": "I'm still on friendly terms with my old colleagues.", "lear_examp": "The fact that they both live alone requires them to be on good terms with the rest of us."}, {"sense": "If two people are on the same wavelength, they have the same way of thinking and it is easy for them to understand each other.", "level": "C2", "dict_examp": "We chatted occasionally, but I never really felt we were on the same wavelength.", "lear_examp": "We were on the same wavelength and we therefore started our own research."}, {"sense": "to be in a situation where something bad is going to happen very soon", "level": "C2", "dict_examp": "The two countries are on the brink of war.", "lear_examp": "By the end of the 21st century, Earth was on the brink of destruction. The atmosphere was polluted, the seas were poisoned, the animals were just a distant memory."}, {"sense": "in addition to your main job", "level": "C2", "dict_examp": "She does some freelance work on the side.", "lear_examp": "At work, they gave her the worst jobs to do. She knew she didn't have much choice but she still tried to find something else on the side."}, {"sense": "immediately", "level": "C2", "dict_examp": "I accepted the job on the spot.", "lear_examp": "And when it was Meredith's turn to tell her about her impending wedding, she felt she was going to have a heart attack on the spot."}]}, {"pos": "adverb", "senses": [{"sense": "If you have something on, you are wearing it.", "level": "A2", "dict_examp": "She has on a black coat.", "lear_examp": "And I want you to put on some baggy clothes, so that you'll feel comfortable while working."}, {"sense": "into a bus, train, plane, etc. or onto a horse", "level": "B1", "dict_examp": "It’s time to get on the bus.", "lear_examp": ""}, {"sense": "happening or planned", "level": "B2", "dict_examp": "I'm busy this afternoon, but I don't have anything on tomorrow.", "lear_examp": ""}, {"sense": "working or being used", "level": "B2", "dict_examp": "The heating has been on all day.", "lear_examp": "For example, the staff shouldn't leave the lights on and the heating's on when they don't need to use it."}, {"sense": "in a way which results in forward movement", "level": "B2", "dict_examp": "You continue on and I'll catch up.", "lear_examp": "I had just gotten on the subway when it stopped and didn't move on."}, {"sense": "performing", "level": "C2", "dict_examp": "Hurry up with the make-up - I'm on in ten minutes.", "lear_examp": "My faith in youth started to fade but then a boy named Josh came on."}]}]}, {"word": "open", "poses": [{"pos": "adjective", "senses": [{"sense": "available for business or serving customers", "level": "A1", "dict_examp": "The supermarket is open till 10.00 p.m.", "lear_examp": "They are open all day and all night."}, {"sense": "not closed or fastened", "level": "A2", "dict_examp": "an open door/window", "lear_examp": "The door was open!"}, {"sense": "An open area of land has no buildings on it or near it.", "level": "B1", "dict_examp": "large open spaces", "lear_examp": "I need to be outside in open spaces."}, {"sense": "to wait until you know all the facts before you form an opinion about something or judge someone", "level": "B2", "dict_examp": "We're keeping an open mind about the causes of the fire.", "lear_examp": "To listen, to communicate, and to have an open mind are a way of life nowadays."}, {"sense": "without a roof or cover", "level": "B2", "dict_examp": "an open courtyard", "lear_examp": "You took me to a sightseeing trip around the town in an open car."}, {"sense": "willing to consider a discussion/suggestions, etc.", "level": "C1", "dict_examp": "This is only a proposal. I'm open to suggestions.", "lear_examp": "He seems open to ideas like this, and I am sure he will not cancel at the last minute!"}, {"sense": "An open person is honest and not trying to hide something.", "level": "C2", "dict_examp": "He's quite open about his weaknesses.", "lear_examp": "He has also been very open about his diabetes and the problems connected with the disease."}, {"sense": "not secret", "level": "C2", "dict_examp": "There has been open hostility between them ever since they had that argument last summer.", "lear_examp": "The council has refused to have an open discussion with the residents."}, {"sense": "can easily be debated/questioned/criticized, etc.", "level": "C2", "dict_examp": "Their behavior at these negotiations is open to criticism.", "lear_examp": "Whether the wages of sportswomen and sportsmen are too high is open to question."}]}, {"pos": "verb", "senses": [{"sense": "to move something to a position that is not closed, or to make something change to a position that is not closed", "level": "A1", "dict_examp": "to open a door/window", "lear_examp": "I can't open my cupboard without my key."}, {"sense": "to remove or separate part of a container or package so that you can see or use what it contains", "level": "A2", "dict_examp": "Shall I open another bottle of water?", "lear_examp": "First I opened my presents."}, {"sense": "If a store or office opens at a particular time of day, it starts to do business at that time.", "level": "A2", "dict_examp": "The coffee shop opens at ten o'clock.", "lear_examp": "It is open every day of the week except Mondays; it opens at 9:00 am and closes at 10:00 pm."}, {"sense": "to make a computer document or program ready to be read or used", "level": "B1", "dict_examp": "First, open the file called \"statistics.\"", "lear_examp": ""}, {"sense": "If a business or activity opens, it starts officially for the first time, and if you open it, you make it start officially for the first time.", "level": "B2", "dict_examp": "That restaurant's new - it only opened last month.", "lear_examp": "I am very happy to announce to you that a new museum has been opened in our town."}, {"sense": "to tell someone your secret thoughts and feelings", "level": "C2", "dict_examp": "That night, she opened her heart to me.", "lear_examp": "It is during this excessively dramatic conversation that George opening up his heart, tells her about his interpretation of her unhappiness with Cecil."}, {"sense": "to watch carefully for someone or something", "level": "C2", "dict_examp": "Keep your eyes open for anything unusual.", "lear_examp": "While staying in Turkey, for example, people ought to keep their eyes open. Look into life there."}, {"sense": "to start a new store or business", "level": "B2", "dict_examp": "Several banks have recently opened up branches downtown.", "lear_examp": "We could set up hiking tours, mini-excursions in the mountains, survival camps. ... With these kinds of activities, the village would need to open up more shops, restaurants, coffee shops etc."}, {"sense": "to start to talk more about yourself and your feelings", "level": "C2", "dict_examp": "I've tried to get him to open up to me but without success.", "lear_examp": "Even when I tried to open up to my best friend, he laughed at me and said that I should go to a psychiatrist."}]}]}, {"word": "only", "poses": [{"pos": "adverb", "senses": [{"sense": "not more than a particular size or amount", "level": "A1", "dict_examp": "She's only 13.", "lear_examp": "This is only ten minutes by car."}, {"sense": "not anyone or anything else", "level": "A2", "dict_examp": "Only Sue and Mark came to the meeting.", "lear_examp": "Only Marco, Anna, Sue and Nick came."}, {"sense": "not in any other place", "level": "B1", "dict_examp": "These televisions are only available in Japan.", "lear_examp": "I think animals, just as human beings, can only live in their natural habitat."}, {"sense": "used to mean that something happened very recently", "level": "B1", "dict_examp": "I only arrived half an hour ago.", "lear_examp": "I am really sorry I didn't write back earlier but I have only just got back from holiday."}, {"sense": "used to say that something is not important, or that you did not mean to upset someone", "level": "B1", "dict_examp": "Don't worry - it's only a scratch.", "lear_examp": "It was only a dream!"}, {"sense": "used when you want to say how doing something simple would make it possible to avoid something unpleasant", "level": "B1", "dict_examp": "If only they'd listen to him, I'm sure they could work it out.", "lear_examp": "If only I had been more careful."}, {"sense": "used to emphasize what you are hoping or wishing for", "level": "B2", "dict_examp": "I only hope you know what you're doing.", "lear_examp": "I only hope I can have the chance to see her too."}, {"sense": "used to say that more than one thing is true", "level": "B2", "dict_examp": "Not only did he turn up late, he also forgot his books.", "lear_examp": "Not only did she introduce me to her friends but she also introduced me to her brother."}, {"sense": "used to say that there are limits to something", "level": "C2", "dict_examp": "There's only so much help you can give someone.", "lear_examp": "The effects of a longer life span have many side effects such as an increase in the world's population and, since there is only so much food, many more people are starving to death."}]}, {"pos": "adjective", "senses": [{"sense": "used to mean that there are not any others", "level": "A1", "dict_examp": "This is our only chance.", "lear_examp": "I am the only French student in my class."}, {"sense": "to not be perfect", "level": "C2", "dict_examp": "Of course Tom makes mistakes - he's only human.", "lear_examp": "In theory, it is easy to say \"We should learn from the mistakes of the past\" but is it easy to do so in practice? Many people would say \"No\" to this question, as we are only human."}]}, {"pos": "conjunction", "senses": [{"sense": "used to introduce a statement which explains why something you have just said cannot happen or is not completely true", "level": "C2", "dict_examp": "This fabric is similar to wool, only  cheaper.", "lear_examp": "He was always there for me when I needed him, only I needed him less and less."}]}]}, {"word": "opening", "poses": [{"pos": "noun", "senses": [{"sense": "a ceremony at the beginning of an event or activity", "level": "B2", "dict_examp": "The official opening of the new school will take place next month.", "lear_examp": "The festival starts with a huge opening parade."}, {"sense": "the beginning of something", "level": "B2", "dict_examp": "The opening of the novel is amazing.", "lear_examp": ""}, {"sense": "a hole or space that something or someone can pass through", "level": "C2", "dict_examp": "The children crawled through an opening in the fence.", "lear_examp": "The water in the reservoir is allowed to flow through an opening in the dam."}]}, {"pos": "adjective", "senses": [{"sense": "happening at the beginning of an event or activity", "level": "C1", "dict_examp": "her opening remarks", "lear_examp": "Also we could offer free drinks from our new products on the opening night, so we could get their first impressions."}]}]}, {"word": "onto", "poses": [{"pos": "preposition", "senses": [{"sense": "used to show movement into or on a particular place", "level": "B1", "dict_examp": "I slipped as I stepped onto the platform.", "lear_examp": "We couldn't talk so much, because the music was very loud till a group of singers came onto the dance floor and did a great show."}, {"sense": "used to show that you are starting to talk about a different subject", "level": "B2", "dict_examp": "How did we get onto this subject?", "lear_examp": "Let's move onto another topic!"}]}]}, {"word": "open-minded", "poses": [{"pos": "adjective", "senses": [{"sense": "willing to consider ideas and opinions that are new or different from your own", "level": "C1", "dict_examp": "Luckily, both my parents were very open-minded.", "lear_examp": "He is also open-minded and very reliable."}]}]}, {"word": "opera", "poses": [{"pos": "noun", "senses": [{"sense": "a musical play in which most of the words are sung", "level": "A2", "dict_examp": "\"Carmen\" is my favorite opera.", "lear_examp": "I like classical music and opera."}]}]}, {"word": "operation", "poses": [{"pos": "noun", "senses": [{"sense": "a medical procedure where a doctor cuts someone's body to remove or repair part of it", "level": "B1", "dict_examp": "a major/minor operation", "lear_examp": "I'm sorry that I can't attend the class tomorrow because my father is having an operation tomorrow."}, {"sense": "an activity that is planned in order to achieve something", "level": "C1", "dict_examp": "a military/peacekeeping operation", "lear_examp": "An attempt to follow a lecture on the U.N.O. peace-keeping operations can be a real difficulty if you are not able to listen to CNN News by now."}, {"sense": "an organization or business", "level": "C1", "dict_examp": "a large commercial operation", "lear_examp": "If I cannot receive any satisfactory reply this month, I will write to the newspaper to expose your operation."}, {"sense": "the fact of operating or being active", "level": "C1", "dict_examp": "Several printing presses are in operation at the moment.", "lear_examp": "We see computers in operation at work as well as in almost every home."}]}]}, {"word": "operate", "poses": [{"pos": "verb", "senses": [{"sense": "to treat an illness or injury by cutting someone's body and removing or repairing part of it", "level": "B1", "dict_examp": "Did they have to operate on him?", "lear_examp": "One day he decided to give part of his money to his son, whose wife was sick and had to be operated on immediately."}, {"sense": "If a machine operates, it does what it is designed to do, and if you operate it, you make it do what it is designed to do.", "level": "B2", "dict_examp": "You have to be trained to operate the machinery.", "lear_examp": "Lots of things are operated by computers now like airplanes, elevators, ticket machines, and so on."}, {"sense": "If an organization or business operates, it is working, and if you operate it, you manage it and make it work.", "level": "B2", "dict_examp": "Our company is operating under very difficult conditions.", "lear_examp": "There is a new direct transportation service from London, operated by ABC coaches."}]}]}, {"word": "onward", "poses": [{"pos": "adverb", "senses": [{"sense": "beginning at a particular time and continuing into the future", "level": "C1", "dict_examp": "The committee will meet on Monday and weekly from then onward.", "lear_examp": "14-24 year olds stays almost at the 90% attendance point before it picks up from 2008 onward."}]}]}, {"word": "openness", "poses": [{"pos": "noun", "senses": [{"sense": "willingness to talk about your thoughts and feelings", "level": "C2", "dict_examp": "I appreciated his openness.", "lear_examp": "Firstly, I have found honesty and openness significantly important."}]}]}, {"word": "openly", "poses": [{"pos": "adverb", "senses": [{"sense": "without hiding any of your thoughts or feelings", "level": "C1", "dict_examp": "They were openly dismissive of my suggestions.", "lear_examp": "I do hope that you are willing to cooperate, though I cannot say it openly."}]}]}, {"word": "operator", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to use and control a machine or vehicle", "level": "B2", "dict_examp": "an camera/elevator/crane operator", "lear_examp": "Last year I was working in a printing company as a Macintosh operator."}, {"sense": "a company that does a particular type of business", "level": "B2", "dict_examp": "a tour operator", "lear_examp": "If once more we are not satisfied, tour operators organize several types of safari holidays wherever we like."}]}]}, {"word": "opposite", "poses": [{"pos": "preposition", "senses": [{"sense": "in a position facing someone or something but on the other side", "level": "A2", "dict_examp": "We're in the building opposite the library.", "lear_examp": "It's near the park and opposite the bank, so it isn't far."}]}, {"pos": "adjective", "senses": [{"sense": "in a position facing something or someone but on the other side", "level": "B1", "dict_examp": "My brother and I live on opposite sides of town.", "lear_examp": "On the opposite side, there is a dark brown wardrobe which is made of wood."}, {"sense": "completely different", "level": "B2", "dict_examp": "All the traffic was going in the opposite direction.", "lear_examp": "The uncle had warned her so that she wouldn't interfere with what happened at the inn, but it had the opposite effect on Mary."}, {"sense": "people who are the other sex from you", "level": "C1", "dict_examp": "When you attend an all girls or all boys school, you don't study with members of the opposite sex.", "lear_examp": "This is not only about trying to impress (preferably) a person of the opposite sex, but fashion also gives you a great chance to express yourself."}]}, {"pos": "noun", "senses": [{"sense": "something or someone that is completely different from another person or thing", "level": "B1", "dict_examp": "The opposite of \"fast\" is \"slow.\"", "lear_examp": "Physically, she's the opposite of me."}]}, {"pos": "adverb", "senses": [{"sense": "in a position facing someone or something but on the other side", "level": "B1", "dict_examp": "She asked the man sitting opposite whether he'd mind if she opened the window.", "lear_examp": "I was on the pavement next to my house and I was calling to my friend, when suddenly I saw a man who was just going around to my neighbour's car, which was parked opposite."}]}]}, {"word": "oral", "poses": [{"pos": "adjective", "senses": [{"sense": "spoken, not written", "level": "B2", "dict_examp": "an oral agreement/exam", "lear_examp": "To sum it up, watching TV improves our oral skills and is a better way of taking notice of the world outside, whereas books improve our writing and reading skills."}]}]}, {"word": "or", "poses": [{"pos": "conjunction", "senses": [{"sense": "used between possibilities, or before the last in a list of possibilities", "level": "A1", "dict_examp": "Would you like tea or coffee?", "lear_examp": "I like to eat pasta or pizza, but I'm easy about food, I can eat anything."}, {"sense": "used after a negative verb to mean not one thing and also not another", "level": "A2", "dict_examp": "Tim doesn't eat meat or fish.", "lear_examp": "OH! and please don't wear jeans or white clothes."}, {"sense": "used to express the possibility that something might not happen", "level": "A2", "dict_examp": "Are you going to reply or not?", "lear_examp": "Are you busy or not that day?"}, {"sense": "used to give someone a warning or advice", "level": "B1", "dict_examp": "You should eat more, or you'll get sick.", "lear_examp": "She called \"Bill, come here or you'll be in trouble\"."}, {"sense": "approximately", "level": "B1", "dict_examp": "I think we raised five hundred dollars or so for the charity.", "lear_examp": "Well you told me about your situation and after thinking a lot I thought you should go with them for a week or so, and then just take a plane and come to Barcelona to visit me."}, {"sense": "used to indicate a very small number, often no more than two", "level": "B1", "dict_examp": "We will spend a day or two in Boston.", "lear_examp": "The thing you can do, is go out with your family first and than with your friends, or, you can ask your parents, if you can invite a friend or two to go with you."}, {"sense": "used to change or correct something you have said", "level": "B2", "dict_examp": "We told the truth, or most of it.", "lear_examp": "She is the one who goes around with all Rebecca's secrets. Or, almost all the secrets."}, {"sense": "used to say what will happen if another thing does not happen", "level": "B2", "dict_examp": "We have to be there by six, or else we'll miss the beginning.", "lear_examp": "He told me to hurry up, or else I would miss my bus."}, {"sense": "used when you cannot or do not want to be exact about the information you are giving", "level": "C1", "dict_examp": "The event was held in some park or other.", "lear_examp": "Maybe you hate the memory of boring literature classes at school, but I'm sure each of you is interested in some subject or other."}, {"sense": "used to give a reason for, explain, or correct something you have said", "level": "C2", "dict_examp": "Things were going well, or seemed to be, but the relationship had already begun to change.", "lear_examp": "I have studied music since I was twelve or, in other words, I started to learn how to read music and how to play an instrument about ten years ago."}]}]}, {"word": "opposition", "poses": [{"pos": "noun", "senses": [{"sense": "strong disagreement", "level": "C1", "dict_examp": "The proposal faces strong opposition.", "lear_examp": "The students, in an attempt to demonstrate the opposition of the Greek people to the military regime, occupied their schools for many days."}, {"sense": "the people or group not in power, especially a political party that does not have an elected majority", "level": "C1", "dict_examp": "They expect to defeat the local opposition in Tuesday's election.", "lear_examp": "He was elected MP for a record of 9 times and was the leader of EPE for many years, leading the opposition when Georgios Papandreou, Andreas' father was in power."}]}]}, {"word": "opportunity", "poses": [{"pos": "noun", "senses": [{"sense": "a situation in which it is possible for you to do something, or a possibility of doing something", "level": "B1", "dict_examp": "Everyone will have an opportunity to comment.", "lear_examp": "It's a good opportunity to spend time with your friends."}, {"sense": "the chance to get a job", "level": "B2", "dict_examp": "employment/job opportunities", "lear_examp": "And many people don't have any other job opportunities so they would be stuck with these bad jobs."}, {"sense": "to use an occasion to do or say something", "level": "B2", "dict_examp": "I'd like to take this opportunity to thank all of you.", "lear_examp": "Most of the comments are not right at all. I would like to take this opportunity to correct them."}]}]}, {"word": "oppose", "poses": [{"pos": "verb", "senses": [{"sense": "to disagree with a plan or activity and to try to change or stop it", "level": "B2", "dict_examp": "They both opposed the plan.", "lear_examp": "Some of them were defending the idea that the car is the most lethal object that anybody can have, and others who opposed that idea said that the car is and will always be the best invention made by humanity."}]}]}, {"word": "optimism", "poses": [{"pos": "noun", "senses": [{"sense": "when you believe good things will happen", "level": "C2", "dict_examp": "There was a note of optimism in his voice as he spoke about the company's future.", "lear_examp": "We had never been abroad on our own and our hearts were full with a mixture of optimism, curiosity and absurd fears."}]}]}, {"word": "opt", "poses": [{"pos": "verb", "senses": [{"sense": "to choose something or to decide to do something", "level": "C1", "dict_examp": "Mike opted for early retirement.", "lear_examp": "My recommendation today is to take into consideration people's views and opt for the Park and Ride."}]}]}, {"word": "optimistic", "poses": [{"pos": "adjective", "senses": [{"sense": "always believing that good things will happen", "level": "B2", "dict_examp": "She is optimistic about her chances of winning a gold medal.", "lear_examp": "I'm not very optimistic about them being sensitive enough to try to produce fewer cars, putting human life before their profits."}]}]}, {"word": "option", "poses": [{"pos": "noun", "senses": [{"sense": "a choice", "level": "B1", "dict_examp": "We don't have many options.", "lear_examp": "Think about it a little bit and choose the option you think is the best."}, {"sense": "to not have the possibility of doing something else", "level": "C1", "dict_examp": "We didn't want to let him go, but we had no option.", "lear_examp": "For example, on the first day, Monday, students have the day free with their host parents but there are some of them who work all day and the students have no option but to stay alone in the house."}]}]}, {"word": "opponent", "poses": [{"pos": "noun", "senses": [{"sense": "someone who you compete against in a game or competition", "level": "B2", "dict_examp": "In the second game, her opponent hurt her leg and couldn't continue to play.", "lear_examp": "Carmelita was her opponent in the volleyball final."}, {"sense": "someone who disagrees with an action or belief and tries to change it", "level": "B2", "dict_examp": "a political opponent", "lear_examp": "Lots of people think that zoos are necessary and good; their opponents demand we close all zoos because in their opinion they are cruel prisons for animals."}]}]}, {"word": "opposed", "poses": [{"pos": "adjective", "senses": [{"sense": "to disagree with a plan or activity", "level": "C1", "dict_examp": "Mom is strongly opposed to my learning to drive.", "lear_examp": "As a student at Fordham College, which is situated just opposite Greendale Park, me and my fellow student colleagues are opposed to the whole idea."}, {"sense": "rather than or instead of", "level": "C2", "dict_examp": "I’d prefer to go in May, as opposed to September.", "lear_examp": "What is more important, the majority of shoppers have changed their attitude to shopping radically.   They now take it as something engrossing and satisfying as opposed to what it used to be - tiring, exhausting and infuriating."}]}]}, {"word": "optional", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is optional, you can choose whether to do it, pay it, buy it, etc.", "level": "B2", "dict_examp": "English is required for all students, but art and music are optional.", "lear_examp": "Referring to optional lessons, it was recommended that Speaking and Listening, Computer Studies and Business English are suitable for filming."}]}]}, {"word": "orange", "poses": [{"pos": "adjective", "senses": [{"sense": "being a color that is a mixture of red and yellow", "level": "A1", "dict_examp": "The setting sun filled the sky with a deep orange glow.", "lear_examp": "I bought two orange T-shirts."}]}, {"pos": "noun", "senses": [{"sense": "a round, sweet fruit with a thick skin and a center that is divided into many equal parts", "level": "A1", "dict_examp": "Do you want to get some oranges?", "lear_examp": "I like eating a sandwich with Flora and I like drinking tea with sugar or orange juice."}, {"sense": "a color between red and yellow", "level": "A2", "dict_examp": "His car is a bright orange.", "lear_examp": "My bedroom will be orange.  I love orange, and please come with old clothes."}]}]}, {"word": "orchestral", "poses": [{"pos": "adjective", "senses": [{"sense": "played by, written for or to do with an orchestra", "level": "B2", "dict_examp": "an orchestral arrangement", "lear_examp": "The lyrics are about life, love, pain and death but the most important thing is how these lyrics match with the orchestral part of the song."}]}]}, {"word": "opinion", "poses": [{"pos": "noun", "senses": [{"sense": "a thought or belief about something or someone", "level": "B1", "dict_examp": "What's your opinion about/on this plan?", "lear_examp": "I really enjoy shopping for clothes especially when I go shopping with my brother, because I sometimes ask him for his opinion."}, {"sense": "the thoughts or beliefs that a group of people have", "level": "B2", "dict_examp": "The advertising campaign is intended to influence public opinion.", "lear_examp": "I would like to add that when it comes to public opinion there is a great variety of different points of view - that is why this article, which asserts that \"performers were second-rate'' seems to be unfair."}, {"sense": "to think that someone or something is good/bad", "level": "C1", "dict_examp": "He has a low opinion of doctors.", "lear_examp": "He had a very high opinion of this particular course."}, {"sense": "used to give your opinion about something, often when you are sure you are right", "level": "C2", "dict_examp": "In my humble opinion, that's the wrong decision.", "lear_examp": "In my humble opinion, there's no such thing as a uniform celebrity, good, bad or otherwise."}]}]}, {"word": "order", "poses": [{"pos": "noun", "senses": [{"sense": "a request to make, supply or deliver food or goods", "level": "A2", "dict_examp": "Did the waiter take our order yet?", "lear_examp": "You either have to flip burgers or take customers' orders."}, {"sense": "the way in which people or things are arranged, either in relation to one another or according to a particular characteristic", "level": "B1", "dict_examp": "The children lined up in age/height order.", "lear_examp": "This is the order of the wedding ceremony: first the man and the woman enter the church together."}, {"sense": "with the purpose of achieving something", "level": "B1", "dict_examp": "He came home early in order to see the children before they went to bed.", "lear_examp": "She will go to the United States in order to improve her English."}, {"sense": "If a machine or system is out of order, it is not working correctly.", "level": "B1", "dict_examp": "The coffee machine is out of order.", "lear_examp": "Last week my TV was out of order."}, {"sense": "an instruction that someone must obey", "level": "B2", "dict_examp": "The company received an order to stop releasing the polluting chemicals  into the river.", "lear_examp": "Today I can still remember my last order: \"Put that light out!\""}, {"sense": "a situation in which everything is in its correct place", "level": "B2", "dict_examp": "I like for everything to be in order before I go away.", "lear_examp": "Everthing was clean and in order."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "the obeying of laws in society", "level": "C2", "dict_examp": "a breakdown in law and order", "lear_examp": "The breakdown in law and order, lack of basic amenities to support life, absence of a fair and enabling environment for citizens to thrive, to mention but a few, are some among many factors that constitute the cogent reason why most Nigerians choose to travel out of their own country."}]}, {"pos": "verb", "senses": [{"sense": "to ask for food, goods, etc.", "level": "A2", "dict_examp": "I ordered the pasta and a mixed salad.", "lear_examp": "After 15 minutes I ordered a \"Party Pizza.\""}, {"sense": "to give someone an instruction that they must obey", "level": "B2", "dict_examp": "The management has ordered a cutback in spending.", "lear_examp": "Then, the men ordered him to walk back to the museum as if nothing had happened."}]}]}, {"word": "optimist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who always believes that good things will happen", "level": "C1", "dict_examp": "She's an optimist.", "lear_examp": "She is an incurable optimist with a great sense of humor."}]}]}, {"word": "orchestra", "poses": [{"pos": "noun", "senses": [{"sense": "a large group of musicians who play different instruments together", "level": "B1", "dict_examp": "a symphony orchestra", "lear_examp": "So last Thursday evening we went together to the club and there he introduced me to the choir director, a friendly man from Argentina who also plays cello in the orchestra."}]}]}, {"word": "ordeal", "poses": [{"pos": "noun", "senses": [{"sense": "a very unpleasant experience", "level": "C2", "dict_examp": "Her seven-month stay in the hospital was quite an ordeal.", "lear_examp": "Despite the unfavorable memory of this ordeal, I am of the opinion that, not only are family gatherings important in themselves, but also, I consider them to be crucial to the very existence of humanity."}]}]}, {"word": "organ", "poses": [{"pos": "noun", "senses": [{"sense": "a part of an animal or plant that has a special purpose", "level": "C1", "dict_examp": "internal/vital organs", "lear_examp": "Now you can replace or heal almost every bone or organ in a human body."}, {"sense": "a musical instrument that has one or more rows of keys like a piano that when pressed produce sound by causing air to blow through pipes or electronically", "level": "C2", "dict_examp": "a pipe organ", "lear_examp": "I played the piano for three hours every day, took organ lessons and at the age of 10 started to write programs on my home computer."}]}]}, {"word": "originally", "poses": [{"pos": "adverb", "senses": [{"sense": "at the beginning or before any changes", "level": "B2", "dict_examp": "Originally it was a bedroom, but we turned it into a study.", "lear_examp": "I've been living in England for 6 months and I have studied English for 8 years in Sweden, where I was originally born."}]}]}, {"word": "original", "poses": [{"pos": "adjective", "senses": [{"sense": "existing since the beginning, or being the earliest form of something", "level": "B1", "dict_examp": "That was my original plan.", "lear_examp": "They chose this school because it looks very similar to the original school where that old series was made."}, {"sense": "special and interesting because of not being the same as others", "level": "B1", "dict_examp": "Her essay was full of original ideas.", "lear_examp": "I like to be original."}, {"sense": "describes a piece of work produced by an artist and not a copy", "level": "B2", "dict_examp": "an original drawing/manuscript", "lear_examp": "We visited Mozart's house, where we could see not only how he lived, but also admire some of his original scores."}]}, {"pos": "noun", "senses": [{"sense": "something that is in the form in which it was first created and has not been copied or changed", "level": "B2", "dict_examp": "If the painting is an original, it will be very valuable.", "lear_examp": "She was paying him, but not as much as she would need to to buy the original."}]}]}, {"word": "organizer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who plans an event or activity", "level": "B2", "dict_examp": "conference/exhibition organizers", "lear_examp": "I have been working as a social activity organizer for 5 years at the English Language School."}]}]}, {"word": "originate", "poses": [{"pos": "verb", "senses": [{"sense": "to come from a particular place, person or cause, or to begin during a particular period", "level": "C2", "dict_examp": "Citrus fruits originated in China and Southeast Asia.", "lear_examp": "They originated in Polynesia but had come to New Zealand about one thousand years ago."}]}]}, {"word": "other", "poses": [{"pos": "determiner", "senses": [{"sense": "as well as the person or thing already mentioned", "level": "A1", "dict_examp": "There is only one other person who could help us.", "lear_examp": "She likes meeting other people because she wants to improve her English."}, {"sense": "used to talk about the remaining members of a group or items in a set", "level": "A2", "dict_examp": "Mario and Anna sat down to watch the other dancers.", "lear_examp": "One part is green and the other part is blue."}, {"sense": "different from the thing or person already mentioned", "level": "B1", "dict_examp": "I don't have any cash - is there no other way of paying?", "lear_examp": "The two kids had waited long enough so they decided to walk. The girl asked: \"Is there any other way the Man can hurt us?\""}, {"sense": "the opposite side or end of something", "level": "B1", "dict_examp": "Put the chair at the other end of the table.", "lear_examp": "I'll move my bed to the other side of my room."}, {"sense": "referring to a day, week, etc. in the recent past without saying exactly when it was", "level": "B1", "dict_examp": "I saw him just the other day/night.", "lear_examp": "Dear John, Thanks for the letter you wrote me the other day."}, {"sense": "used to introduce an explanation that is simpler than the one given earlier", "level": "B2", "dict_examp": "He was economical with the truth - in other words, he was lying.", "lear_examp": "We are able to use zoos as a place where we can spend our free time with our children. In other words, it is a good place for the family."}, {"sense": "happening in the opposite way", "level": "B2", "dict_examp": "I thought the older people would be more offended than the young people, but it was the other way around.", "lear_examp": "They are controlling us and not the other way around."}, {"sense": "used when you cannot or do not want to be exact about the information you are giving", "level": "C1", "dict_examp": "The event was held in some park or other.", "lear_examp": "Maybe you hate the memory of boring literature classes at school, but I'm sure each of you is interested in some subject or other."}, {"sense": "different from or except", "level": "C1", "dict_examp": "The form cannot be signed by anyone other than you.", "lear_examp": "There are no vegetarian alternatives other than cheese sandwiches, which our members find very depressing."}, {"sense": "except for the thing you have just said", "level": "C1", "dict_examp": "My arm was a bit sore - other than that I was fine.", "lear_examp": "Currently, I only have a small corner in the room whereas my sisters get a bigger portion. This means I have to keep all my things under the bed. Other than that, I would like a big beautiful garden because I love nature."}, {"sense": "happening every two days/weeks, etc., not each day/week, etc.", "level": "C2", "dict_examp": "Alice goes to the gym every other day.", "lear_examp": "First, I would run 2 miles every other day, but soon it became a need to do it on a daily basis."}]}, {"pos": "pronoun", "senses": [{"sense": "used to refer to a person or thing which belongs to a group or set that you have already talked about", "level": "A2", "dict_examp": "Hold the racket in one hand and the ball in the other.", "lear_examp": "I really wanted you to come with me and the others."}, {"sense": "used to show that each person in a group of two or more people does something to the others", "level": "A2", "dict_examp": "They kept looking at each other and smiling.", "lear_examp": "We can write to each other once a month."}, {"sense": "people in general, not including yourself", "level": "B1", "dict_examp": "You shouldn't expect others to do your work for you.", "lear_examp": "I think that I would be very useful there, because I know that they need people who enjoy helping others and I am one of those people."}, {"sense": "more similar ones", "level": "B2", "dict_examp": "This one is broken - do you have any others?", "lear_examp": "In fact, we might manage to do some interesting activities such as mountain biking in Sintra, canoeing in Teja, etc. You would be glad to see how many interesting people we might meet while doing those activities and any others that you would like to do."}]}]}, {"word": "orphan", "poses": [{"pos": "noun", "senses": [{"sense": "a child whose parents have died", "level": "C2", "dict_examp": "They adopted an orphan.", "lear_examp": "\"Vanyka\" is a story about a nine-year-old orphan sent to Moscow to work as a servant in a rich person's house."}]}]}, {"word": "otherwise", "poses": [{"pos": "adverb", "senses": [{"sense": "used to say what the result would be if something else did not happen", "level": "B1", "dict_examp": "I'd better write it down, otherwise I'll forget it.", "lear_examp": "Oh! I'll have to buy a table for the computer. Otherwise, I'll have to use my computer on my bed."}, {"sense": "except for what has just been referred to", "level": "B2", "dict_examp": "The bike needs a new saddle, but otherwise it's in good condition.", "lear_examp": "This seemed the high point of an otherwise dull and disorganized event."}, {"sense": "differently than what has been stated", "level": "C1", "dict_examp": "I'll meet you there at 6 o'clock, unless I hear otherwise.", "lear_examp": "An important event in the history of Greece was the Civil War between the cities of Athens and Sparta around 400 B.C., otherwise known as the Peloponnesian War."}]}]}, {"word": "origin", "poses": [{"pos": "noun", "senses": [{"sense": "the cause of something, or where something begins or comes from", "level": "B2", "dict_examp": "What's the origin of that saying?", "lear_examp": "The cooking is based on traditional recipes of Westfalian origin and it is tasty but often very rich!"}, {"sense": "the country, race, or social class of a person's family", "level": "C1", "dict_examp": "He is of North African origin.", "lear_examp": "The rules are very simple, they can be understood by everyone, regardless of age, origin or social status."}]}]}, {"word": "organized", "poses": [{"pos": "adjective", "senses": [{"sense": "able to plan things carefully and keep things neat", "level": "B2", "dict_examp": "She's not a very organized person and she always arrives late for meetings.", "lear_examp": "I know you're a very organized person so tell me which CDs I can use."}, {"sense": "planned or arranged", "level": "B2", "dict_examp": "We didn't go on an organized tour.", "lear_examp": "It's a well-kept and organized place for animals to live."}]}]}, {"word": "ordinary", "poses": [{"pos": "adjective", "senses": [{"sense": "not special, different, or unusual in any way", "level": "B1", "dict_examp": "These are ordinary people living ordinary lives.", "lear_examp": "In the afternoon I prefer jean shorts or skirts with an ordinary t-shirt and sandals."}, {"sense": "unusual or different", "level": "C2", "dict_examp": "The investigation revealed nothing out of the ordinary.", "lear_examp": "This event is something out of the ordinary for local life and it gives our town prestige and originality."}]}]}, {"word": "ornament", "poses": [{"pos": "noun", "senses": [{"sense": "an attractive object that is used as a decoration in a home or garden", "level": "C2", "dict_examp": "There were glass ornaments on the shelf.", "lear_examp": "Expensive products such as necklaces and decorative ornaments are highly represented, much to the joy of the more wealthy people in the town."}]}]}, {"word": "orientation", "poses": [{"pos": "noun", "senses": [{"sense": "the position of something in relation to its surroundings", "level": "C1", "dict_examp": "The building has an east-west orientation.", "lear_examp": "The information pack was really good but it would be helpful if you could include a map for orientation."}, {"sense": "training or preparation for a new job or activity", "level": "C2", "dict_examp": "Orientation for new students begins Wednesday afternoon.", "lear_examp": "I may require some training or orientation should you be using specialized cleaning tools or equipment."}, {"sense": "the interests, activities, or beliefs that a person has", "level": "C2", "dict_examp": "He  has never tried to hide his political orientation.", "lear_examp": "Choices about friends, hobbies, professional orientation, have to start in the children, and it is the task of the parents not to restrict the power to choose, but advise them using their own experience, and to provide a safe environment where the final choice of the child, how ever free, won't entail any danger to him or her."}]}]}, {"word": "organize", "poses": [{"pos": "verb", "senses": [{"sense": "to plan or arrange something", "level": "B1", "dict_examp": "He organized the whole event.", "lear_examp": "Why don't you organize a dinner with your parents and your friends?"}, {"sense": "to do or arrange something according to a particular system", "level": "B2", "dict_examp": "The books are organized by author, not by title.", "lear_examp": "Now Museums are big, have lots of light and you can find the latest technology in them. They are organized in such a different way."}]}]}, {"word": "orthodox", "poses": [{"pos": "adjective", "senses": [{"sense": "If ideas or methods are orthodox, most people think they are correct, usually because they have existed for a long time.", "level": "C2", "dict_examp": "orthodox methods of teaching", "lear_examp": "To tell the truth, I was brought up in a rather orthodox way."}, {"sense": "keeping a particular traditional set of religious beliefs and customs", "level": "C2", "dict_examp": "an orthodox Jewish family", "lear_examp": "It is a celebration, a hymn to love, and honors the memory of St Hyacinth, an orthodox martyr who died for his faith."}]}]}, {"word": "organization", "poses": [{"pos": "noun", "senses": [{"sense": "an official group of people who work together for the same purpose", "level": "B1", "dict_examp": "the World Health Organization", "lear_examp": "She decided on studying abroad 2 years ago, applied to several organizations, got invitations to a few interviews with these organizations and finally got the 'OK' to go to the USA for one year."}, {"sense": "the planning of an activity or event", "level": "B1", "dict_examp": "He didn't want to be involved in the organization of/for the conference, although he agreed to attend.", "lear_examp": "I need to change the time of our meeting because my boss tells me that I have to work two more hours on the organization for the party of the year."}, {"sense": "the way that parts of something are arranged", "level": "C1", "dict_examp": "I'm trying to improve the organization of my computer files.", "lear_examp": "The organization of books, magazines and references is fantastic."}]}]}, {"word": "order", "poses": [{"pos": "noun", "senses": [{"sense": "a request to make, supply or deliver food or goods", "level": "A2", "dict_examp": "Did the waiter take our order yet?", "lear_examp": "You either have to flip burgers or take customers' orders."}, {"sense": "the way in which people or things are arranged, either in relation to one another or according to a particular characteristic", "level": "B1", "dict_examp": "The children lined up in age/height order.", "lear_examp": "This is the order of the wedding ceremony: first the man and the woman enter the church together."}, {"sense": "with the purpose of achieving something", "level": "B1", "dict_examp": "He came home early in order to see the children before they went to bed.", "lear_examp": "She will go to the United States in order to improve her English."}, {"sense": "If a machine or system is out of order, it is not working correctly.", "level": "B1", "dict_examp": "The coffee machine is out of order.", "lear_examp": "Last week my TV was out of order."}, {"sense": "an instruction that someone must obey", "level": "B2", "dict_examp": "The company received an order to stop releasing the polluting chemicals  into the river.", "lear_examp": "Today I can still remember my last order: \"Put that light out!\""}, {"sense": "a situation in which everything is in its correct place", "level": "B2", "dict_examp": "I like for everything to be in order before I go away.", "lear_examp": "Everthing was clean and in order."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "a situation in which people obey laws and there is no trouble", "level": "C2", "dict_examp": "The teacher found it hard to keep her class in order.", "lear_examp": "Some young people began to be aggressive, putting everything in a mess; some policemen trying to restore order even got wounded."}, {"sense": "the way that the economy, politics, or society is organized", "level": "C2", "dict_examp": "a threat to the established social order", "lear_examp": "The failure of the social order Ralph tries to establish and the success of beautifully painted hunters led by Jack, hunting pigs up in the mountains, slowly makes the number of Ralph's supporters diminish."}, {"sense": "the obeying of laws in society", "level": "C2", "dict_examp": "a breakdown in law and order", "lear_examp": "The breakdown in law and order, lack of basic amenities to support life, absence of a fair and enabling environment for citizens to thrive, to mention but a few, are some among many factors that constitute the cogent reason why most Nigerians choose to travel out of their own country."}]}, {"pos": "verb", "senses": [{"sense": "to ask for food, goods, etc.", "level": "A2", "dict_examp": "I ordered the pasta and a mixed salad.", "lear_examp": "After 15 minutes I ordered a \"Party Pizza.\""}, {"sense": "to give someone an instruction that they must obey", "level": "B2", "dict_examp": "The management has ordered a cutback in spending.", "lear_examp": "Then, the men ordered him to walk back to the museum as if nothing had happened."}]}]}, {"word": "organic", "poses": [{"pos": "adjective", "senses": [{"sense": "not using artificial chemicals when keeping animals or growing plants for food", "level": "B2", "dict_examp": "organic food/vegetables/meat", "lear_examp": "Also, people care more about what really is in the food they eat and so interest in organic food is increasing."}]}]}, {"word": "outer", "poses": [{"pos": "adjective", "senses": [{"sense": "on the edge or surface of something", "level": "B2", "dict_examp": "Remove the outer layers of the onion.", "lear_examp": "Perhaps you could give some consideration to the outer building, like renovation work."}]}]}, {"word": "ourselves", "poses": [{"pos": "pronoun", "senses": [{"sense": "the reflexive form of the pronoun \"we\"", "level": "A2", "dict_examp": "We really enjoyed ourselves.", "lear_examp": "We all enjoyed ourselves very much at the party."}, {"sense": "alone or without anyone else's help", "level": "A2", "dict_examp": "We finished the work by ourselves.", "lear_examp": "Anyway, we had to try to fix the stupid car by ourselves."}]}]}, {"word": "outdoors", "poses": [{"pos": "adverb", "senses": [{"sense": "outside", "level": "B1", "dict_examp": "If the weather's good, we'll eat outdoors.", "lear_examp": "My parents always tell me that I should spend more time outdoors."}]}]}, {"word": "outnumber", "poses": [{"pos": "verb", "senses": [{"sense": "to be larger in number than another group", "level": "C1", "dict_examp": "Women outnumber men in our language classes.", "lear_examp": "An annual average rate of 10% GDP growth for the past ten years has created more than 7 million new jobs, which outnumbered the number of new male entrants."}]}]}, {"word": "outgoing", "poses": [{"pos": "adjective", "senses": [{"sense": "Someone who is outgoing is friendly, talks a lot, and enjoys meeting people.", "level": "C1", "dict_examp": "Anne is very outgoing, but her sister's quite shy.", "lear_examp": "He is very outgoing, friendly and communicative."}, {"sense": "going to another place, or leaving a job", "level": "C2", "dict_examp": "outgoing mail/calls/flights", "lear_examp": "We therefore propose you scrap your plans for Terminal 5 and instead try to reduce the number of incoming and outgoing flights, by diverting some planes to Luton or Stansted or Gatwick Airport."}]}]}, {"word": "out", "poses": [{"pos": "adverb", "senses": [{"sense": "used to refer to a period of time when someone goes away from home for a social activity", "level": "A2", "dict_examp": "He's out nearly every night.", "lear_examp": "After the film, we can have dinner out."}, {"sense": "not in the place where you usually live or work, especially for a short time", "level": "A2", "dict_examp": "I came by to see you this morning, but you were out.", "lear_examp": "Will you give it back to my father because I am out for a while."}, {"sense": "used to show movement away from the inside of a place or container", "level": "B1", "dict_examp": "Get out!", "lear_examp": "When I was on the plane, I decided to open my suitcase to take out my CD player because I was bored."}, {"sense": "able to be seen", "level": "B1", "dict_examp": "The stars are out tonight.", "lear_examp": "In the beginning it was raining a little bit, but then the sun came out."}, {"sense": "available to buy or see", "level": "B1", "dict_examp": "Is the new Harry Potter book out yet?", "lear_examp": "It came out just yesterday."}, {"sense": "to the point where something is removed or disappears", "level": "B1", "dict_examp": "The stain won't come out.", "lear_examp": "A friend of mine told me, when he was in Lampton, that you couldn't have special rates for students at Hotel Royal, so you should cross that information out of the guide."}, {"sense": "If you say or read something out loud, you say or read it so that other people can hear you.", "level": "B1", "dict_examp": "I had to read the essay out loud in front of the whole school.", "lear_examp": "She wouldn't accept it so I read it out loud for her to hear: \"Director, Jason Meyer, and producer, Sami Woods, are receiving...\"."}, {"sense": "If a light or fire is out, it is no longer shining or burning.", "level": "B2", "dict_examp": "When we got home, all the lights were out.", "lear_examp": "I looked out through the window to check if the lights were out in the windows of the block of flats next to ours."}, {"sense": "a long distance away from land, a town or your own country", "level": "C2", "dict_examp": "The fishing boats were out at sea for three days.", "lear_examp": "Today I live out in the country."}, {"sense": "having no money, no luck and no opportunities", "level": "C2", "dict_examp": "Nobody loves you when you're down and out.", "lear_examp": "The neglect of social security as a vital point in state policies leaves homeless people down and out, with little chance for improving their bleak prospects."}, {"sense": "the details of a particular subject", "level": "C2", "dict_examp": "the ins and outs of the legal system", "lear_examp": "I knew all the ins and outs of every story but I couldn't stay one single day in bed without reading it."}, {"sense": "If the jury is (still) out on a subject, people do not yet know the answer or have a definite opinion about it.", "level": "C2", "dict_examp": "The jury's still out on whether these vitamins protect against cancer.", "lear_examp": "I think that the jury is still out on the effects of television and other media."}, {"sense": "to try very hard to do something pleasant for someone", "level": "C2", "dict_examp": "He went out of his way to make us feel welcome.", "lear_examp": ""}, {"sense": "to finish a task or to get rid of something unpleasant", "level": "C2", "dict_examp": "I'll go shopping when I've got this essay out of the way.", "lear_examp": "It was a joyful reunion and everybody was grateful to have all misunderstandings out of the way and to be one big family once more."}]}]}, {"word": "outlet", "poses": [{"pos": "noun", "senses": [{"sense": "a store at which a company sells its products at lower prices than usual", "level": "C1", "dict_examp": "a factory outlet", "lear_examp": "Some people can only afford the local two dollar shop or factory outlets."}, {"sense": "a place a plug fits in to connect a piece of electrical equipment to the electricity supply", "level": "C1", "dict_examp": "an electrical outlet", "lear_examp": ""}, {"sense": "a store or restaurant that sells products  of a particular company or a particular type", "level": "C2", "dict_examp": "The company has more than 1200 retail outlets nationwide.", "lear_examp": "In addition, the atmosphere is cheered up by the presence of the most well-known fast-food outlets of our country, where the client can find some rest and food at a good price."}, {"sense": "a way for someone to express an emotion, idea, or ability", "level": "C2", "dict_examp": "She needs a job that will provide an outlet for her creative talent.", "lear_examp": "I am a very busy person but I try to find time to go to concerts, which, I think, are an excellent outlet for our feelings."}]}]}, {"word": "outline", "poses": [{"pos": "noun", "senses": [{"sense": "a short description of the most important ideas or facts about something", "level": "B2", "dict_examp": "If you read the minutes of the meeting, they'll give you a brief/broad outline of what was discussed.", "lear_examp": "Perhaps a brief outline of the party will help you to make your decision."}, {"sense": "the shape made by the outside edge of something", "level": "C2", "dict_examp": "She drew the outline of the boat and then colored it in.", "lear_examp": "The roof tiles were of a beautiful shade of pink, each of them carved in an outline of a heart."}]}, {"pos": "verb", "senses": [{"sense": "to describe only the most important ideas or facts about something", "level": "B2", "dict_examp": "At the interview she outlined what I would be doing.", "lear_examp": "First of all, I will briefly outline some personal details."}]}]}, {"word": "outbreak", "poses": [{"pos": "noun", "senses": [{"sense": "when something unpleasant and difficult to control starts, such as a war or disease", "level": "C2", "dict_examp": "an outbreak of flu/disease", "lear_examp": "Being a GP during the time of another outbreak of the flu, meant long hours of hard work."}]}]}, {"word": "ounce", "poses": [{"pos": "noun", "senses": [{"sense": "a unit for measuring weight, equal to 1/16 pound or 28.35 grams", "level": "C1", "dict_examp": "Add four ounces of butter.", "lear_examp": ""}, {"sense": "a very small amount of something such as a quality or emotion", "level": "C2", "dict_examp": "If he’s got an ounce of common sense, he’ll realize that this project is bound to fail.", "lear_examp": "I trained a lot, putting my last ounce of energy into the process, determined to win."}]}]}, {"word": "outdoor", "poses": [{"pos": "adjective", "senses": [{"sense": "happening, used, or in a place that is outside and not inside a building", "level": "B1", "dict_examp": "an outdoor pool/concert", "lear_examp": "The water temperature of the outdoor pool is relatively cold because it's filled with natural mountain-spring-water."}]}]}, {"word": "out of", "poses": [{"pos": "preposition", "senses": [{"sense": "no longer in a particular place or area", "level": "A2", "dict_examp": "He has been out of the country for a long time.", "lear_examp": "When you arrive please come to my home and then we can go there because it's out of the city."}, {"sense": "used to show movement away from the inside of a place or container", "level": "B1", "dict_examp": "A peach rolled out of the bag.", "lear_examp": "Once he told me that he and his other friend saw a cat falling out of a window."}, {"sense": "used to show what something is made from", "level": "B1", "dict_examp": "The dress is made out of silk.", "lear_examp": "I like wearing skirts made out of denim because they fit me perfectly."}, {"sense": "from among an amount or number", "level": "B1", "dict_examp": "Nine out of ten people said they liked the product.", "lear_examp": "He got 99.4 out of 100, \"Oh my God\"."}, {"sense": "old and no longer useful, correct or fashionable", "level": "B1", "dict_examp": "These unemployment figures are out of date.", "lear_examp": "However, the information in the book seems out of date and misleading."}, {"sense": "If a machine or system is out of order, it is not working as it should.", "level": "B1", "dict_examp": "The elevator is out of order.", "lear_examp": "Last week my TV was out of order."}, {"sense": "not in a job", "level": "B1", "dict_examp": "I've been out of work for the last six months.", "lear_examp": "Right now I am out of work and would like to try something different for a while."}, {"sense": "no longer in a particular condition or situation", "level": "B2", "dict_examp": "The patient is now out of danger.", "lear_examp": "She told me that D was out of danger and that she will have other information tomorrow."}, {"sense": "used to show the reason why someone does something", "level": "B2", "dict_examp": "I took the job out of necessity because we had no money left.", "lear_examp": "When the warrior had left, the explorer explored the cave out of curiosity and to his big surprise found the treasure."}, {"sense": "to have no more of something left", "level": "B2", "dict_examp": "We're almost out of gas.", "lear_examp": "By then I was out of money so I started walking."}, {"sense": "to be breathing quickly because you have been running, walking fast, etc.", "level": "B2", "dict_examp": "He ran into the room, red-faced and out of breath.", "lear_examp": "Although I was out of breath I started to run faster and faster."}, {"sense": "If something or someone is out of control, you cannot influence, limit or direct it.", "level": "B2", "dict_examp": "The weeds in my garden are out of control.", "lear_examp": "I had just driven through Piazza Duomo, when another car came round a corner much too fast, skidded, and went out of control."}, {"sense": "If someone or something appears out of nowhere, it appears suddenly or unexpectedly.", "level": "B2", "dict_examp": "The car came out of nowhere and we had to swerve to miss it.", "lear_examp": "I was lying all alone on the beach, then suddenly, out of nowhere, right behind me those strange creatures appeared."}, {"sense": "to not do something well because you have not done it recently", "level": "B2", "dict_examp": "I didn't play very well today - I'm out of practice.", "lear_examp": "I think playing in the club will be a great opportunity for me so as not to be out of practice."}, {"sense": "not available in a store", "level": "B2", "dict_examp": "The book is out of stock at the moment.", "lear_examp": "And sometimes the item you are looking for is out of stock."}, {"sense": "If vegetables or fruit are out of season, they are not usually available at that time.", "level": "C1", "dict_examp": "Strawberries are out of season now.", "lear_examp": "As our place was famous for fresh sea food, I bought crabs and salmon although they were out of season and expensive."}, {"sense": "singing or playing the wrong notes", "level": "C1", "dict_examp": "The piano is out of tune.", "lear_examp": "Even if you sing out of tune please call us."}, {"sense": "If something happens out of the blue, it is completely unexpected.", "level": "C1", "dict_examp": "An old fried of mine from college called me out of the blue yesterday.", "lear_examp": "Dear Kim, I was extremely happy when I received your letter out of the blue."}, {"sense": "not having the knowledge, experience, or skills to deal with a particular subject or situation", "level": "C2", "dict_examp": "When they start talking about philosophy, I'm completely out of my depth.", "lear_examp": "It was my first day of school. What I can remember is that I really felt out of my depth: my parents were so happy that I couldn't succeed in telling them that I was terribly frightened and that the only thing that I wanted was my doll."}, {"sense": "unusual or different", "level": "C2", "dict_examp": "The investigation revealed nothing out of the ordinary.", "lear_examp": "This event is something out of the ordinary for local life and it gives our town prestige and originality."}, {"sense": "to be of extremely good quality", "level": "C2", "dict_examp": "Their chocolate cake is just out of this world!", "lear_examp": "The dessert trays are out of this world."}, {"sense": "If someone's actions or words are out of line, they are beyond what is considered acceptable in that situation.", "level": "C2", "dict_examp": "You can disagree with her, but calling her dishonest was way out of line.", "lear_examp": "Today I see that my mother was right in this aspect since I acted extremely out of line sometimes and a soft hand certainly wouldn't help me in the future."}, {"sense": "to become difficult to control", "level": "C2", "dict_examp": "It was the end of week and the children were getting a little out of hand.", "lear_examp": "A few solutions can prevent this problem from getting out of hand."}, {"sense": "not in the correct position", "level": "C2", "dict_examp": "Why are my files all out of place?", "lear_examp": "It was awful getting back from school and seeing all my things out of place."}, {"sense": "not right or suitable for a particular situation", "level": "C2", "dict_examp": "Everyone else was wearing jeans and I felt completely out of place in my office clothes.", "lear_examp": "This does not mean everybody is wearing tuxedos and dresses but you might be out of place just wearing shorts and a shirt."}, {"sense": "If something is out of proportion, it is much bigger or smaller than it should be, when compared to other things.", "level": "C2", "dict_examp": "The punishment is completely out of proportion to the crime.", "lear_examp": "If you were doing it to make a profit, I could understand, but for a library it is just out of proportion and I even believe more people could be attracted if the prices decrease."}, {"sense": "If something is out of the question, it is not possible or not allowed.", "level": "C2", "dict_examp": "Providing more money is out of the question.", "lear_examp": "Walking home was out of the question since that would have taken even longer."}, {"sense": "If you go somewhere out of season, you go during a period of the year when few people are there.", "level": "C2", "dict_examp": "I prefer to travel out of season.", "lear_examp": "Some towns that are completely dependent on tourism \"die\" out of season, while others are destroyed because of the excessive emigration of their people."}, {"sense": "not healthy or physically strong", "level": "C2", "dict_examp": "Since I stopped riding my bike, I've gotten out of shape.", "lear_examp": "I no longer run and it has been more than a year since the last time I raced, so I am out of shape."}, {"sense": "to be unaware of things that have been happening or what other people think", "level": "C2", "dict_examp": "Tell me what's been going on - I've been away for a month and out of touch.", "lear_examp": "In much worse cases, some individuals may even be trapped in the virtual world and get out of touch with the real one."}]}]}, {"word": "outcome", "poses": [{"pos": "noun", "senses": [{"sense": "the final result of an activity or process", "level": "C1", "dict_examp": "It's too early to predict the outcome of the meeting.", "lear_examp": "In order to ensure a pleasant end-of-term activity and to avoid yet another negative outcome, it is necessary for us to dispose of a great sum of money."}]}]}, {"word": "our", "poses": [{"pos": "determiner", "senses": [{"sense": "belonging to or relating to us", "level": "A1", "dict_examp": "We bought our house several years ago.", "lear_examp": "Every day, we have to give our teacher our homework."}]}]}, {"word": "otherwise", "poses": [{"pos": "adverb", "senses": [{"sense": "used to say what the result would be if something else did not happen", "level": "B1", "dict_examp": "I'd better write it down, otherwise I'll forget it.", "lear_examp": "Oh! I'll have to buy a table for the computer. Otherwise, I'll have to use my computer on my bed."}, {"sense": "except for what has just been referred to", "level": "B2", "dict_examp": "The bike needs a new saddle, but otherwise it's in good condition.", "lear_examp": "This seemed the high point of an otherwise dull and disorganized event."}, {"sense": "differently than what has been stated", "level": "C1", "dict_examp": "I'll meet you there at 6 o'clock, unless I hear otherwise.", "lear_examp": "An important event in the history of Greece was the Civil War between the cities of Athens and Sparta around 400 B.C., otherwise known as the Peloponnesian War."}]}]}, {"word": "ours", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to show that something belongs to or is connected with the person who is speaking and one or more other people", "level": "A2", "dict_examp": "Which table is ours?", "lear_examp": "We met a lot of friends of ours."}]}]}, {"word": "ought to", "poses": [{"pos": "modal verb", "senses": [{"sense": "used to say or ask what is the correct or best thing to do", "level": "B1", "dict_examp": "We ought to clean  up before we go home.", "lear_examp": "I ought to go to the doctor tomorrow."}, {"sense": "used to say that you expect something to be true or that you expect something to happen", "level": "B2", "dict_examp": "She ought to be home by now.", "lear_examp": "All the students ought to know how famous you are. You are a very well-known writer who was born in Rhodes."}]}]}, {"word": "outlook", "poses": [{"pos": "noun", "senses": [{"sense": "the likely future situation", "level": "C1", "dict_examp": "The economic outlook is good.", "lear_examp": "The outlook for all three companies is bright over the next 5 years."}, {"sense": "the way a person thinks about something", "level": "C2", "dict_examp": "a positive/negative/optimistic outlook", "lear_examp": "He was a kind and friendly man, with an optimistic outlook on life."}]}]}, {"word": "output", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of something produced by a person, machine, factory, country, etc.", "level": "C2", "dict_examp": "Last year British manufacturing output fell by 14%.", "lear_examp": "The right-wing thinkers claim that unemployment is one of the indicators in the economy, displaying a lack of balance between industrial output and citizens' demands."}]}]}, {"word": "outstanding", "poses": [{"pos": "adjective", "senses": [{"sense": "excellent and much better than most", "level": "B2", "dict_examp": "an outstanding achievement", "lear_examp": "Although it was an outstanding festival, I would like to point out some problems that happened there."}]}]}, {"word": "out-of-date", "poses": [{"pos": "adjective", "senses": [{"sense": "old and no longer useful, correct or fashionable", "level": "B1", "dict_examp": "I had a very out-of-date map.", "lear_examp": "I don't want to be an out-of-date person."}]}]}, {"word": "outrageous", "poses": [{"pos": "adjective", "senses": [{"sense": "shocking or extreme", "level": "B2", "dict_examp": "outrageous behavior/clothes", "lear_examp": "The only negative thing to be said about this restaurant is that the prices are outrageous, but it is worth every penny."}]}]}, {"word": "outskirts", "poses": [{"pos": "noun", "senses": [{"sense": "the outer area of a city or town", "level": "B2", "dict_examp": "The new assembly plant is being built on the outskirts of town.", "lear_examp": "There I booked a room in a small lovely boarding house in the outskirts of the town."}]}]}, {"word": "outset", "poses": [{"pos": "noun", "senses": [{"sense": "at or from the beginning of something", "level": "C2", "dict_examp": "I made my views clear at the outset.", "lear_examp": "From the outset I hadn't liked that hotel."}]}]}, {"word": "oven", "poses": [{"pos": "noun", "senses": [{"sense": "a boxlike part of a stove or separate device with a door, which is used to cook food", "level": "B1", "dict_examp": "a toaster/microwave oven", "lear_examp": "They eat the traditional food - souvlaki and potatoes cooked in the oven."}]}]}, {"word": "outweigh", "poses": [{"pos": "verb", "senses": [{"sense": "to be greater or more important than something else", "level": "C1", "dict_examp": "The benefits of this treatment far outweigh the risks.", "lear_examp": "However, in my opinion the advantages far outweigh the disadvantages and competition is a natural phenomenon that we should accept."}]}]}, {"word": "outrage", "poses": [{"pos": "noun", "senses": [{"sense": "a strong feeling of anger or shock", "level": "C2", "dict_examp": "Many politicians and members of the public expressed outrage at the verdict.", "lear_examp": ""}, {"sense": "something that causes great anger or shock", "level": "C2", "dict_examp": "The terrible living conditions of migrant workers, he said, were an outrage.", "lear_examp": "It shows one child's reaction to the outrage, to the fear and it as been held out as an example of the unthinkable and cruel effects that a racist mentality may have."}]}, {"pos": "verb", "senses": [{"sense": "to cause someone to feel very angry, shocked, or upset", "level": "C1", "dict_examp": "The proposed pay cut outraged the staff.", "lear_examp": "I was outraged when I was given a copy of an article published in your magazine."}]}]}, {"word": "outside", "poses": [{"pos": "adverb", "senses": [{"sense": "not inside a building", "level": "A1", "dict_examp": "It's cold outside!", "lear_examp": "You can sit on the chair outside and look at the bridge."}, {"sense": "not in a particular room or building but near it", "level": "A2", "dict_examp": "I'll wait outside while you get changed.", "lear_examp": "We are going to go to Top Totty and will wait for you outside."}]}, {"pos": "preposition", "senses": [{"sense": "not in a particular room, building, or place, but near it", "level": "A2", "dict_examp": "She waited outside his room for nearly two hours.", "lear_examp": "I'll meet you outside the art class."}]}, {"pos": "adjective", "senses": [{"sense": "not in a building", "level": "B2", "dict_examp": "an outside light", "lear_examp": "I was going to say to him to turn on the outside light, but seeing his face, I changed my mind."}, {"sense": "coming from another place or organization", "level": "C1", "dict_examp": "The company has called in outside experts.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the outer part or side of something", "level": "B2", "dict_examp": "The outside of the house needs to be painted.", "lear_examp": "It had been dark in the room since the door was locked from the outside."}]}]}, {"word": "oval", "poses": [{"pos": "adjective", "senses": [{"sense": "in the shape of an egg or a slightly flat circle", "level": "B2", "dict_examp": "an oval mirror", "lear_examp": "It was green, oval and opaque."}]}]}, {"word": "out of", "poses": [{"pos": "preposition", "senses": [{"sense": "no longer in a particular place or area", "level": "A2", "dict_examp": "He has been out of the country for a long time.", "lear_examp": "When you arrive please come to my home and then we can go there because it's out of the city."}, {"sense": "used to show movement away from the inside of a place or container", "level": "B1", "dict_examp": "A peach rolled out of the bag.", "lear_examp": "Once he told me that he and his other friend saw a cat falling out of a window."}, {"sense": "used to show what something is made from", "level": "B1", "dict_examp": "The dress is made out of silk.", "lear_examp": "I like wearing skirts made out of denim because they fit me perfectly."}, {"sense": "from among an amount or number", "level": "B1", "dict_examp": "Nine out of ten people said they liked the product.", "lear_examp": "He got 99.4 out of 100, \"Oh my God\"."}, {"sense": "old and no longer useful, correct or fashionable", "level": "B1", "dict_examp": "These unemployment figures are out of date.", "lear_examp": "However, the information in the book seems out of date and misleading."}, {"sense": "If a machine or system is out of order, it is not working as it should.", "level": "B1", "dict_examp": "The elevator is out of order.", "lear_examp": "Last week my TV was out of order."}, {"sense": "not in a job", "level": "B1", "dict_examp": "I've been out of work for the last six months.", "lear_examp": "Right now I am out of work and would like to try something different for a while."}, {"sense": "no longer in a particular condition or situation", "level": "B2", "dict_examp": "The patient is now out of danger.", "lear_examp": "She told me that D was out of danger and that she will have other information tomorrow."}, {"sense": "used to show the reason why someone does something", "level": "B2", "dict_examp": "I took the job out of necessity because we had no money left.", "lear_examp": "When the warrior had left, the explorer explored the cave out of curiosity and to his big surprise found the treasure."}, {"sense": "to have no more of something left", "level": "B2", "dict_examp": "We're almost out of gas.", "lear_examp": "By then I was out of money so I started walking."}, {"sense": "to be breathing quickly because you have been running, walking fast, etc.", "level": "B2", "dict_examp": "He ran into the room, red-faced and out of breath.", "lear_examp": "Although I was out of breath I started to run faster and faster."}, {"sense": "If something or someone is out of control, you cannot influence, limit or direct it.", "level": "B2", "dict_examp": "The weeds in my garden are out of control.", "lear_examp": "I had just driven through Piazza Duomo, when another car came round a corner much too fast, skidded, and went out of control."}, {"sense": "If someone or something appears out of nowhere, it appears suddenly or unexpectedly.", "level": "B2", "dict_examp": "The car came out of nowhere and we had to swerve to miss it.", "lear_examp": "I was lying all alone on the beach, then suddenly, out of nowhere, right behind me those strange creatures appeared."}, {"sense": "to not do something well because you have not done it recently", "level": "B2", "dict_examp": "I didn't play very well today - I'm out of practice.", "lear_examp": "I think playing in the club will be a great opportunity for me so as not to be out of practice."}, {"sense": "not available in a store", "level": "B2", "dict_examp": "The book is out of stock at the moment.", "lear_examp": "And sometimes the item you are looking for is out of stock."}, {"sense": "If vegetables or fruit are out of season, they are not usually available at that time.", "level": "C1", "dict_examp": "Strawberries are out of season now.", "lear_examp": "As our place was famous for fresh sea food, I bought crabs and salmon although they were out of season and expensive."}, {"sense": "singing or playing the wrong notes", "level": "C1", "dict_examp": "The piano is out of tune.", "lear_examp": "Even if you sing out of tune please call us."}, {"sense": "If something happens out of the blue, it is completely unexpected.", "level": "C1", "dict_examp": "An old fried of mine from college called me out of the blue yesterday.", "lear_examp": "Dear Kim, I was extremely happy when I received your letter out of the blue."}, {"sense": "not having the knowledge, experience, or skills to deal with a particular subject or situation", "level": "C2", "dict_examp": "When they start talking about philosophy, I'm completely out of my depth.", "lear_examp": "It was my first day of school. What I can remember is that I really felt out of my depth: my parents were so happy that I couldn't succeed in telling them that I was terribly frightened and that the only thing that I wanted was my doll."}, {"sense": "unusual or different", "level": "C2", "dict_examp": "The investigation revealed nothing out of the ordinary.", "lear_examp": "This event is something out of the ordinary for local life and it gives our town prestige and originality."}, {"sense": "to be of extremely good quality", "level": "C2", "dict_examp": "Their chocolate cake is just out of this world!", "lear_examp": "The dessert trays are out of this world."}, {"sense": "If someone's actions or words are out of line, they are beyond what is considered acceptable in that situation.", "level": "C2", "dict_examp": "You can disagree with her, but calling her dishonest was way out of line.", "lear_examp": "Today I see that my mother was right in this aspect since I acted extremely out of line sometimes and a soft hand certainly wouldn't help me in the future."}, {"sense": "to become difficult to control", "level": "C2", "dict_examp": "It was the end of week and the children were getting a little out of hand.", "lear_examp": "A few solutions can prevent this problem from getting out of hand."}, {"sense": "not in the correct position", "level": "C2", "dict_examp": "Why are my files all out of place?", "lear_examp": "It was awful getting back from school and seeing all my things out of place."}, {"sense": "not right or suitable for a particular situation", "level": "C2", "dict_examp": "Everyone else was wearing jeans and I felt completely out of place in my office clothes.", "lear_examp": "This does not mean everybody is wearing tuxedos and dresses but you might be out of place just wearing shorts and a shirt."}, {"sense": "If something is out of proportion, it is much bigger or smaller than it should be, when compared to other things.", "level": "C2", "dict_examp": "The punishment is completely out of proportion to the crime.", "lear_examp": "If you were doing it to make a profit, I could understand, but for a library it is just out of proportion and I even believe more people could be attracted if the prices decrease."}, {"sense": "If something is out of the question, it is not possible or not allowed.", "level": "C2", "dict_examp": "Providing more money is out of the question.", "lear_examp": "Walking home was out of the question since that would have taken even longer."}, {"sense": "If you go somewhere out of season, you go during a period of the year when few people are there.", "level": "C2", "dict_examp": "I prefer to travel out of season.", "lear_examp": "Some towns that are completely dependent on tourism \"die\" out of season, while others are destroyed because of the excessive emigration of their people."}, {"sense": "not healthy or physically strong", "level": "C2", "dict_examp": "Since I stopped riding my bike, I've gotten out of shape.", "lear_examp": "I no longer run and it has been more than a year since the last time I raced, so I am out of shape."}, {"sense": "to be unaware of things that have been happening or what other people think", "level": "C2", "dict_examp": "Tell me what's been going on - I've been away for a month and out of touch.", "lear_examp": "In much worse cases, some individuals may even be trapped in the virtual world and get out of touch with the real one."}]}]}, {"word": "over", "poses": [{"pos": "preposition", "senses": [{"sense": "more than a particular amount, number, or age", "level": "A2", "dict_examp": "Most of the bikes cost/are over $500.", "lear_examp": "We have to dance in a school and over two hundred people will watch us."}, {"sense": "covering something or someone", "level": "A2", "dict_examp": "Put a blanket over you to keep warm.", "lear_examp": "Wear an apron over your clothes."}, {"sense": "above or higher than something", "level": "B1", "dict_examp": "The sign over the door said \"Exit.\"", "lear_examp": "Besides that, you have voted for the construction of a new bridge over the main street."}, {"sense": "across from one side of something to the other, especially by going up and then down", "level": "B1", "dict_examp": "She jumped over the gate.", "lear_examp": "I most enjoyed it when we were cycling over the hills, because there weren't any people and it was peaceful and quiet."}, {"sense": "everywhere in a particular place", "level": "B1", "dict_examp": "Soon the news was all over town.", "lear_examp": "The people in the class are from all over the world."}, {"sense": "during a particular period of time", "level": "B1", "dict_examp": "I was in Seattle over the summer.", "lear_examp": "I could make up for the work I missed over the weekend, if that's alright with you."}, {"sense": "on the other side of", "level": "B1", "dict_examp": "Their house is just over the river.", "lear_examp": ""}, {"sense": "in this/that place", "level": "B1", "dict_examp": "Put your bags down over there.", "lear_examp": "How is everything over there?"}, {"sense": "using", "level": "B2", "dict_examp": "They spoke over the phone.", "lear_examp": "She laughed over the phone, and said \"It's really like you\"."}, {"sense": "in control of or teaching someone or something", "level": "C2", "dict_examp": "Parents want to have control over their children.", "lear_examp": "Fortunately, my parents do not wield authority over me and my siblings like dictators."}, {"sense": "connected with or about", "level": "C2", "dict_examp": "It's stupid arguing over something so trivial.", "lear_examp": "The teams themselves suffered from these money problems: recently strikes broke out in basketball teams in the U.S. when players began to argue over money."}]}, {"pos": "adverb", "senses": [{"sense": "more than a particular amount or level", "level": "A2", "dict_examp": "People who are 65 years old and over can get half-price tickets.", "lear_examp": ""}, {"sense": "from one side or place to another", "level": "B1", "dict_examp": "She leaned over and kissed me.", "lear_examp": "He came over to me and we talked a while."}, {"sense": "finished", "level": "B1", "dict_examp": "I'll be glad when the semester is over.", "lear_examp": "David smiled triumphantly and said, \"It is all over!\""}, {"sense": "describes the way an object moves or is moved so that a different part of it is facing up", "level": "B2", "dict_examp": "She turned another page over.", "lear_examp": "A big truck had turned over and blocked the road and there was no other way for us to go, so we had to wait."}, {"sense": "happening or done many times", "level": "B2", "dict_examp": "I read the article over and over.", "lear_examp": "I've been searching in newspapers over and over again and finally after a couple of days I found something."}, {"sense": "repeated from the beginning", "level": "B2", "dict_examp": "We had to start all over again.", "lear_examp": "After that I went back to my home in Ribeirao Preto to begin my routine all over again."}, {"sense": "to do something difficult or unpleasant  as soon as you can so that you do not have to worry about it any more", "level": "C2", "dict_examp": "I got all my apologies over and done with at the beginning of the meeting.", "lear_examp": "Not to mention that he knew that he had to get his degree over and done with before he started making serious decisions."}]}]}, {"word": "overseas", "poses": [{"pos": "adjective", "senses": [{"sense": "in, from or to other countries", "level": "B2", "dict_examp": "We need to open up the overseas markets.", "lear_examp": "It is suggested that one of our English as a Foreign Language lessons should be filmed, as there are some 100 overseas students who are from over 30 countries in our school."}]}]}, {"word": "owner", "poses": [{"pos": "noun", "senses": [{"sense": "someone who owns something", "level": "B1", "dict_examp": "Are you the owner of this car?", "lear_examp": "The owner was an old woman who lives alone in a big house with her pet animals."}]}]}, {"word": "overcome", "poses": [{"pos": "verb", "senses": [{"sense": "to deal with and control a problem or feeling", "level": "B2", "dict_examp": "I admire the way she has overcome her difficulties/problems and made a success of her life.", "lear_examp": "Trying to overcome my fear, I was slowly going toward the dangerous stranger."}, {"sense": "to suddenly have too much of  a feeling", "level": "C2", "dict_examp": "She was overcome by emotion.", "lear_examp": "When she got in her house she was overcome by a sense of wrath and started screaming and crying."}]}]}, {"word": "overnight", "poses": [{"pos": "adjective", "senses": [{"sense": "for or during the night", "level": "B1", "dict_examp": "an overnight stop in Paris", "lear_examp": "We will stay in our tents overnight and get up early in the morning to reach the next camping site."}, {"sense": "very quickly or suddenly", "level": "C2", "dict_examp": "Change does not happen overnight.", "lear_examp": "I am aware of the fact that it is not at all an easy path nor  is it something that can happen overnight."}]}]}, {"word": "overdo", "poses": [{"pos": "verb", "senses": [{"sense": "to do or use too much of something", "level": "C1", "dict_examp": "I went to the gym yesterday, but I think I overdid it a bit.", "lear_examp": "On the other hand, people usually overdo it and prefer making use of the modern technology to meeting a friend."}]}]}, {"word": "overestimate", "poses": [{"pos": "verb", "senses": [{"sense": "to guess or think that something is or will be bigger or better than it really is", "level": "C1", "dict_examp": "They overestimated her ability to do the job.", "lear_examp": "In spite of the progress achieved in promoting the social status of women, one should not overestimate the significance of these achievements to ordinary women's careers."}]}]}, {"word": "overflow", "poses": [{"pos": "verb", "senses": [{"sense": "If a container overflows, the things inside it start to come out because it is too full, and if the contents of a container overflow, they come out because it is too full.", "level": "C2", "dict_examp": "The sink overflowed, and there's water all over the floor!", "lear_examp": "As a result of relentless rain the river had broken its banks and overflowed violently."}, {"sense": "If a place is overflowing, there are too many people in it.", "level": "C2", "dict_examp": "The square was overflowing with people trying to see the queen.", "lear_examp": "The prisons are overflowing, society is losing out in many ways."}, {"sense": "to have a lot of a quality or emotion", "level": "C2", "dict_examp": "Her father was overflowing with pride as he watched her receive her award.", "lear_examp": "She felt overflowing with indignation as if he had been rude to her."}]}]}, {"word": "overcrowded", "poses": [{"pos": "adjective", "senses": [{"sense": "containing too many people or things", "level": "C1", "dict_examp": "an overcrowded classroom/prison", "lear_examp": "As you arrive about midday, the trams are likely to be overcrowded."}]}]}, {"word": "overload", "poses": [{"pos": "verb", "senses": [{"sense": "to fill something with too much or more then it should contain", "level": "C1", "dict_examp": "Don’t overload the washer or it won’t work properly.", "lear_examp": "Secondly the buses and trains are mostly overloaded."}, {"sense": "to give someone too much to do", "level": "C2", "dict_examp": "All the staff are completely overloaded.", "lear_examp": "I was also overloaded with work and had many doubts about joining the group at all."}]}, {"pos": "noun", "senses": [{"sense": "when someone has more of something than they can deal with", "level": "C2", "dict_examp": "We are suffering from data overload here.", "lear_examp": "Will we get to the point of \"information overload\"?"}]}]}, {"word": "owing to", "poses": [{"pos": "preposition", "senses": [{"sense": "because of", "level": "B2", "dict_examp": "The concert has been cancelled owing to low ticket sales.", "lear_examp": "To start with, it is a great idea to change rooms because they are too crowded, owing to the fact that there a lot of people."}]}]}, {"word": "ozone", "poses": [{"pos": "noun", "senses": [{"sense": "a form of oxygen that exists high in the atmosphere", "level": "C1", "dict_examp": "the ozone layer", "lear_examp": "There is probably no child who hasn't heard about the holes in the ozone layer or the greenhouse effect."}]}]}, {"word": "overdrawn", "poses": [{"pos": "adjective", "senses": [{"sense": "If you are overdrawn, you have taken more money out of your bank account than you had in it.", "level": "C1", "dict_examp": "Your account is overdrawn.", "lear_examp": "In other words their expenditure is much more than their income. They get into debt and are mostly overdrawn."}]}]}, {"word": "oxygen", "poses": [{"pos": "noun", "senses": [{"sense": "a gas that is in the air and that animals need to live", "level": "B2", "dict_examp": "an oxygen tank", "lear_examp": "Everybody needs oxygen and trees produce oxygen."}]}]}, {"word": "overworked", "poses": [{"pos": "adjective", "senses": [{"sense": "Someone who is overworked has to work too much.", "level": "C1", "dict_examp": "We're overworked and underpaid.", "lear_examp": "People are overworked and often choose fast food for dinner."}]}]}, {"word": "ownership", "poses": [{"pos": "noun", "senses": [{"sense": "when you own something", "level": "C1", "dict_examp": "Do you have any proof of ownership for this car?", "lear_examp": "Converting all of this into private ownership is a long term process."}]}]}, {"word": "overweight", "poses": [{"pos": "adjective", "senses": [{"sense": "too heavy or too fat", "level": "B2", "dict_examp": "He's still a few pounds overweight.", "lear_examp": "In England the majority of people are either overweight or underweight."}]}]}, {"word": "owl", "poses": [{"pos": "noun", "senses": [{"sense": "a bird with a flat face, large eyes, and strong curved nails, which hunts small mammals at night", "level": "B2", "dict_examp": "We heard an owl hooting in the night.", "lear_examp": "I could hear an owl hooting in the tree nearby."}]}]}, {"word": "overtake", "poses": [{"pos": "verb", "senses": [{"sense": "to go past a vehicle or person that is going in the same direction", "level": "B2", "dict_examp": "We were overtaken by a red sports car.", "lear_examp": "Of course it is easier for a bike to overtake the cars in traffic jams."}, {"sense": "to go past something by being a greater amount or degree", "level": "C1", "dict_examp": "US sales have been overtaken by sales in Europe.", "lear_examp": "This however was projected to be overtaken by people coming from the 35-49 year old bracket by 2006."}]}]}, {"word": "overall", "poses": [{"pos": "adverb", "senses": [{"sense": "in general rather than in particular, or including all the people or things in a particular group or situation", "level": "B2", "dict_examp": "The overall situation is good, despite a few minor problems.", "lear_examp": "Overall these two restaurants are worth going to for nice meals."}]}]}, {"word": "overtime", "poses": [{"pos": "noun", "senses": [{"sense": "extra time that you work after your usual working hours", "level": "B2", "dict_examp": "He's been working a lot of overtime lately.", "lear_examp": "You can't go on living like this, chasing around and always being pressured by your work and all this overtime."}]}]}, {"word": "overview", "poses": [{"pos": "noun", "senses": [{"sense": "a short description giving the most important facts about something", "level": "C1", "dict_examp": "I'll just give you an overview of the job.", "lear_examp": "Moreover, I would recommend a student and a teacher to be interviewed, so that we can provide a better overview of the institution itself, with both the opinions of those who teach and those who learn here."}, {"sense": "knowledge of the general features of something", "level": "C1", "dict_examp": "Having spent some time there, she had a good overview of the market.", "lear_examp": "As my main interest was to get an overview of the current market situation, I was simply impressed by the variety of companies that you've presented."}]}]}, {"word": "over", "poses": [{"pos": "preposition", "senses": [{"sense": "more than a particular amount, number, or age", "level": "A2", "dict_examp": "Most of the bikes cost/are over $500.", "lear_examp": "We have to dance in a school and over two hundred people will watch us."}, {"sense": "covering something or someone", "level": "A2", "dict_examp": "Put a blanket over you to keep warm.", "lear_examp": "Wear an apron over your clothes."}, {"sense": "above or higher than something", "level": "B1", "dict_examp": "The sign over the door said \"Exit.\"", "lear_examp": "Besides that, you have voted for the construction of a new bridge over the main street."}, {"sense": "across from one side of something to the other, especially by going up and then down", "level": "B1", "dict_examp": "She jumped over the gate.", "lear_examp": "I most enjoyed it when we were cycling over the hills, because there weren't any people and it was peaceful and quiet."}, {"sense": "everywhere in a particular place", "level": "B1", "dict_examp": "Soon the news was all over town.", "lear_examp": "The people in the class are from all over the world."}, {"sense": "during a particular period of time", "level": "B1", "dict_examp": "I was in Seattle over the summer.", "lear_examp": "I could make up for the work I missed over the weekend, if that's alright with you."}, {"sense": "on the other side of", "level": "B1", "dict_examp": "Their house is just over the river.", "lear_examp": ""}, {"sense": "in this/that place", "level": "B1", "dict_examp": "Put your bags down over there.", "lear_examp": "How is everything over there?"}, {"sense": "using", "level": "B2", "dict_examp": "They spoke over the phone.", "lear_examp": "She laughed over the phone, and said \"It's really like you\"."}, {"sense": "in control of or teaching someone or something", "level": "C2", "dict_examp": "Parents want to have control over their children.", "lear_examp": "Fortunately, my parents do not wield authority over me and my siblings like dictators."}, {"sense": "connected with or about", "level": "C2", "dict_examp": "It's stupid arguing over something so trivial.", "lear_examp": "The teams themselves suffered from these money problems: recently strikes broke out in basketball teams in the U.S. when players began to argue over money."}]}, {"pos": "adverb", "senses": [{"sense": "more than a particular amount or level", "level": "A2", "dict_examp": "People who are 65 years old and over can get half-price tickets.", "lear_examp": ""}, {"sense": "from one side or place to another", "level": "B1", "dict_examp": "She leaned over and kissed me.", "lear_examp": "He came over to me and we talked a while."}, {"sense": "finished", "level": "B1", "dict_examp": "I'll be glad when the semester is over.", "lear_examp": "David smiled triumphantly and said, \"It is all over!\""}, {"sense": "describes the way an object moves or is moved so that a different part of it is facing up", "level": "B2", "dict_examp": "She turned another page over.", "lear_examp": "A big truck had turned over and blocked the road and there was no other way for us to go, so we had to wait."}, {"sense": "happening or done many times", "level": "B2", "dict_examp": "I read the article over and over.", "lear_examp": "I've been searching in newspapers over and over again and finally after a couple of days I found something."}, {"sense": "repeated from the beginning", "level": "B2", "dict_examp": "We had to start all over again.", "lear_examp": "After that I went back to my home in Ribeirao Preto to begin my routine all over again."}, {"sense": "to do something difficult or unpleasant  as soon as you can so that you do not have to worry about it any more", "level": "C2", "dict_examp": "I got all my apologies over and done with at the beginning of the meeting.", "lear_examp": "Not to mention that he knew that he had to get his degree over and done with before he started making serious decisions."}]}]}, {"word": "overwhelm", "poses": [{"pos": "verb", "senses": [{"sense": "If a feeling or situation overwhelms someone, it has an effect that is too strong or extreme.", "level": "C1", "dict_examp": "She was overwhelmed by the excitement of it all.", "lear_examp": "I am sure the students from the acting classes will be overwhelmed by the grandeur of the 200-seat theater."}]}]}, {"word": "overwhelming", "poses": [{"pos": "adjective", "senses": [{"sense": "very strong in effect or large in amount", "level": "C1", "dict_examp": "She felt an overwhelming urge/desire/need to tell someone about what had happened.", "lear_examp": "Second, the overwhelming majority of your staff members speaks English only, which poses a big problem for those passengers who can not speak English."}]}]}, {"word": "overlap", "poses": [{"pos": "verb", "senses": [{"sense": "If two subjects or activities overlap, they are the same in some way.", "level": "C2", "dict_examp": "Although our job titles are different, our responsibilities overlap quite a lot.", "lear_examp": "Of course, these two motivations can be overlapping and ideally they do overlap."}]}]}, {"word": "overlook", "poses": [{"pos": "verb", "senses": [{"sense": "to have a view of something from above", "level": "B2", "dict_examp": "Our hotel room overlooked the harbor.", "lear_examp": "I had a delicious lunch in a cozy restaurant overlooking the Cote d'Azur."}, {"sense": "to not notice or consider something", "level": "C2", "dict_examp": "His film was nominated for an Oscar, but Reiner himself was overlooked as best director.", "lear_examp": "Of course, man's basic needs cannot be overlooked and a certain amount of wealth can be put to very good use, wisely to provide for oneself and one's family and home."}]}]}, {"word": "own", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging to or done by a particular person or thing", "level": "A2", "dict_examp": "All of the students have their own dictionaries.", "lear_examp": "We have to bring our own paints."}, {"sense": "belonging to someone or something", "level": "B1", "dict_examp": "I'll have a home of my own someday.", "lear_examp": "I also bought a cupboard of my own, so that I need not share with my sister."}, {"sense": "alone", "level": "B1", "dict_examp": "I like living on my own.", "lear_examp": "On Wednesday morning I went on my own to see the Vatican."}, {"sense": "without any help", "level": "B1", "dict_examp": "Ryan can't get into his shirt on his own - he's just a baby!", "lear_examp": "Maybe I can do the missing work on my own."}, {"sense": "to be as successful as other people or things", "level": "C2", "dict_examp": "Alison could always hold her own in political debates.", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to have something that legally belongs to you", "level": "B1", "dict_examp": "We own our house.", "lear_examp": "It is owned by a Japanese owner."}]}]}, {"word": "overhear", "poses": [{"pos": "verb", "senses": [{"sense": "to hear what someone is saying when they are not talking to you", "level": "C2", "dict_examp": "I overheard him telling her he was leaving.", "lear_examp": "I once overheard a remark from a person who had just been in Italy."}]}]}, {"word": "owe", "poses": [{"pos": "verb", "senses": [{"sense": "to have to pay money back to someone", "level": "B1", "dict_examp": "I owe Janet ten dollars.", "lear_examp": "Please tell me how much I owe you for that."}, {"sense": "to have to give something to someone because they deserve it", "level": "B2", "dict_examp": "I think you owe  me an explanation/apology.", "lear_examp": "I owe you a favor."}, {"sense": "to have something or achieve something because of someone or something else", "level": "C2", "dict_examp": "The museum owes much of its success to the present generation of young artists.", "lear_examp": "Many restaurants, bars and gift shops owe their existence to the fact that visitors to our country enjoy the view of the river and its surroundings."}]}]}, {"word": "overboard", "poses": [{"pos": "adverb", "senses": [{"sense": "over the side of a boat and into the water", "level": "C2", "dict_examp": "Wait! Something fell overboard.", "lear_examp": "My diary is lost - it fell overboard on my way home."}, {"sense": "to do something too much, or to be too excited about something", "level": "C2", "dict_examp": "I think I went overboard cooking this dinner – there is enough to feed a dozen people.", "lear_examp": "While no one should restrict their eating habits to the point eating is no longer a pleasure, but rather a chore, it is important not to go overboard, completely disregarding the advice of nutrition experts."}]}]}]