[{"word": "quality", "poses": [{"pos": "noun", "senses": [{"sense": "how good or bad something is", "level": "B1", "dict_examp": "good/high quality", "lear_examp": "A large school can offer more equipment to use and high quality education."}, {"sense": "when something is very good or well made", "level": "B1", "dict_examp": "I was impressed by the quality of their clothes.", "lear_examp": "They're more expensive than I expected but I prefer quality to quantity."}, {"sense": "a part of someone's character", "level": "B2", "dict_examp": "leadership qualities", "lear_examp": "Moreover, I have other qualities such as politeness, and I feel pleased when helping people, thus I am capable of looking after members of the public."}]}, {"pos": "adjective", "senses": [{"sense": "very good", "level": "B1", "dict_examp": "We only sell quality products in this store.", "lear_examp": "On the one hand, you usually have a lot of fun with your friends but on the other hand, it would be better to spend some quality time with your parents!"}]}]}, {"word": "qualify", "poses": [{"pos": "verb", "senses": [{"sense": "to achieve or have the standard of knowledge, experience, education, or ability you need for a particular job", "level": "B2", "dict_examp": "She was qualified to teach high school mathematics and physics.", "lear_examp": "I could give the band members \"Shiatsu massage\" just before the concert to make them relax!! Can you imagine how much I appreciated that I am qualified in massage?"}, {"sense": "If you qualify for something, you are allowed to do it or have it.", "level": "B2", "dict_examp": "I hope I'll qualify for financial aid to help pay for school.", "lear_examp": ""}, {"sense": "to succeed in getting into a competition or in reaching a particular stage in a competition", "level": "B2", "dict_examp": "Derrick won his tennis match and qualified for the semifinals.", "lear_examp": "I left the stadium disappointed, fearing that Portugal would not qualify for the World Championships once more."}]}]}, {"word": "question", "poses": [{"pos": "noun", "senses": [{"sense": "a sentence or phrase used to find out information", "level": "A1", "dict_examp": "May I ask you a question?", "lear_examp": "Our teacher talks to us and gives us some questions."}, {"sense": "in a test or exam, a problem that tests a person's knowledge or ability", "level": "A2", "dict_examp": "Answer as many questions as you can.", "lear_examp": "In the e-mail were the exam questions, and I felt very happy because I'll pass the test!"}, {"sense": "a situation or problem that needs to be dealt with or considered", "level": "B2", "dict_examp": "This raises the question of teacher pay.", "lear_examp": "Then it raises an important question: \"Do museums provide enough to interest young people?\""}, {"sense": "doubt or uncertainty", "level": "B2", "dict_examp": "There's no question that this was an accidental fire.", "lear_examp": "There's no question that it was absolutely great!"}, {"sense": "used for saying what the most important issue is in a situation", "level": "C1", "dict_examp": "Someone needs to be here - it's a question of who would be the best person.", "lear_examp": "The choice is a question of price."}, {"sense": "If something is out of the question, it is not possible or not allowed.", "level": "C2", "dict_examp": "Providing more money is out of the question.", "lear_examp": "Walking home was out of the question since that would have taken even longer."}, {"sense": "the person or thing that is being discussed", "level": "C2", "dict_examp": "He sais that he was at a restaurant with his friends on the night in question.", "lear_examp": "While this is not necessarily false, it should be borne in mind that the events in question are by no means boring or uninteresting."}, {"sense": "to ask a question", "level": "C2", "dict_examp": "It was left to Grazia to pose the question of how the project was to be funded.", "lear_examp": "For instance, you can pose a question concerning music to your listeners and the person who is going to call first to answer - correctly of course - will gain a small sum of money."}]}, {"pos": "verb", "senses": [{"sense": "to ask a person about something, especially officially", "level": "B2", "dict_examp": "\"What was she questioning you about?\" \"Oh, just about the schedule changes.\"", "lear_examp": "A total of 60 per cent of those questioned suggested that we should find sponsorship for all activities. 30 per cent of those questioned said that there are not enough seats in the reception area."}, {"sense": "to feel or express doubt about something", "level": "B2", "dict_examp": "I'm not for a moment questioning your decision.", "lear_examp": "It may sound funny, but mud, gravel and snow lying on the school's floors is not a nice sight, so we change our shoes without questioning that rule."}]}]}, {"word": "quiet", "poses": [{"pos": "adjective", "senses": [{"sense": "making little or no noise", "level": "A2", "dict_examp": "Can you be quiet, please?", "lear_examp": "But now everything must change - after 10 pm we must be quiet."}, {"sense": "without much activity or excitement", "level": "A2", "dict_examp": "a quiet town/neighborhood", "lear_examp": "My house is near the hospital and it is in a very quiet area."}, {"sense": "If someone is quiet, they talk very little.", "level": "B1", "dict_examp": "He was a shy, quiet man.", "lear_examp": "He's a quiet person but I'm that too."}, {"sense": "to not talk about something", "level": "C2", "dict_examp": "It might be wise to keep this quiet for a while.", "lear_examp": "They tried to keep it quiet but, somehow, half the village knew about the news in a few days."}]}, {"pos": "noun", "senses": [{"sense": "when there is little or no noise", "level": "B2", "dict_examp": "She needs a some peace and quiet.", "lear_examp": "At least if you were working in a museum, you would probably have some peace and quiet."}]}]}, {"word": "qualification", "poses": [{"pos": "noun", "senses": [{"sense": "skills, experience, education, etc., that provide you with the ability do something, especially a job", "level": "B2", "dict_examp": "My qualifications for this position include a degree in biochemistry and three years research experience.", "lear_examp": "I hope my qualifications will meet your requirements. Please do not hesitate to contact me if you want further information."}, {"sense": "a level of skill or education that you have achieved", "level": "B2", "dict_examp": "Passing the advanced Red Cross life-saving course is a qualification for all our lifeguards.", "lear_examp": "I like being at the beach and swimming and recently got a qualification for an assistant life-guard on the beach."}, {"sense": "success in getting into a competition", "level": "C1", "dict_examp": "Mexico's qualification for the World Cup.", "lear_examp": "The video tells how particular national teams got through their qualification for finals and then presents the most interesting games that took place in Italy '92."}]}]}, {"word": "questionable", "poses": [{"pos": "adjective", "senses": [{"sense": "possibly not true or correct", "level": "C2", "dict_examp": "It is questionable whether that investment will pay off.", "lear_examp": "However, it is questionable whether this is possible."}, {"sense": "not honest or not legal", "level": "C2", "dict_examp": "He's being investigated for questionable business practices.", "lear_examp": "I am a policeman, or in fact, I used to be one until I was ejected from the department because of questionable procedures to enforce the law."}]}]}, {"word": "quietly", "poses": [{"pos": "adverb", "senses": [{"sense": "making little or no noise", "level": "B1", "dict_examp": "\"Don't worry,\" she said quietly.", "lear_examp": "They were talking quietly and just before getting into the car, they kissed."}, {"sense": "doing something without much noise or activity", "level": "B1", "dict_examp": "He sat quietly on the sofa, reading a book.", "lear_examp": "It was about eight o'clock in the evening, I was watching TV quietly in my living-room when the phone rang."}]}]}, {"word": "qualified", "poses": [{"pos": "adjective", "senses": [{"sense": "having the standard of knowledge, experience, education, or ability you need to do or be something", "level": "B2", "dict_examp": "She was highly qualified to run the State Department.", "lear_examp": "I don't think that anyone else in my country is qualified to take over his seat."}]}]}, {"word": "quit", "poses": [{"pos": "verb", "senses": [{"sense": "to leave a job", "level": "B1", "dict_examp": "I hated the work so much that I quit.", "lear_examp": "Winning let me quit my job and I could afford to study more English than I used to do."}, {"sense": "to stop doing something", "level": "B1", "dict_examp": "I'm going to quit smoking.", "lear_examp": "And, last but not least, quit smoking!"}]}]}, {"word": "queen", "poses": [{"pos": "noun", "senses": [{"sense": "a woman who rules a country because she was born into a royal family, or a woman who is married to a king", "level": "A2", "dict_examp": "Queen Victoria", "lear_examp": "You can visit the castle of Isabel II, a Spanish queen."}]}]}, {"word": "quest", "poses": [{"pos": "noun", "senses": [{"sense": "an attempt to get something or do something difficult", "level": "C2", "dict_examp": "the quest for truth", "lear_examp": "This stimulation is essential in our quest for spiritual and emotional well-being and exerts a profound effect on our psyche."}]}]}, {"word": "quarter", "poses": [{"pos": "noun", "senses": [{"sense": "a period of 15 minutes before or after the hour", "level": "A1", "dict_examp": "It's (a) quarter to three.", "lear_examp": "You can meet me at my house at a quarter to nine."}, {"sense": "one of four equal or almost equal parts of something; ¼", "level": "A2", "dict_examp": "He cut the orange into quarters.", "lear_examp": "I really enjoy shopping for clothes and spend a quarter of my monthly salary for a year in shopping for jeans alone."}, {"sense": "a coin in the US and Canada worth 25 cents, or one fourth of a dollar", "level": "B2", "dict_examp": "I need some quarters for the washing machine.", "lear_examp": "And the last thing but not the least, I was thinking if everybody put a quarter of a dollar in our box every week to help the poor people who live here, behind us, it will help them a lot."}, {"sense": "an area of a city or place that has a special history or character", "level": "C2", "dict_examp": "We stayed in the French Quarter in New Orleans.", "lear_examp": "It will surely add to the development of the Podgoize quarter but also will sustain the development of all the little shops in this area."}]}]}, {"word": "questionnaire", "poses": [{"pos": "noun", "senses": [{"sense": "a set of questions asked of a large number of people to discover information about a subject", "level": "B1", "dict_examp": "Residents have been sent questionnaires about their homes and energy use.", "lear_examp": "I had to fill in a questionnaire about myself."}]}]}, {"word": "quarrel", "poses": [{"pos": "noun", "senses": [{"sense": "an argument", "level": "B2", "dict_examp": "She had a quarrel with her neighbor.", "lear_examp": "Sometimes, we can have quarrels with our parents who refuse to support our ideas."}]}, {"pos": "verb", "senses": [{"sense": "to argue", "level": "B2", "dict_examp": "I was always quarreling with my brother.", "lear_examp": "John was 13 years old and his brother Michael was 7. They were very nice and funny but they were always quarreling."}]}]}, {"word": "quantity", "poses": [{"pos": "noun", "senses": [{"sense": "the amount or number of something", "level": "B1", "dict_examp": "a large/small quantity", "lear_examp": "I think you should go to the school in the center of the town; as you wrote, it's bigger, so you'll have the opportunity of making a huge quantity of friends!"}, {"sense": "a lot of something", "level": "B2", "dict_examp": "I'm just amazed at the quantity of food that gets eaten.", "lear_examp": "What surprised me was the quantity of incorrect figures reported in your article."}]}]}, {"word": "quick", "poses": [{"pos": "adjective", "senses": [{"sense": "doing something fast", "level": "A1", "dict_examp": "I tried to catch him but he was too quick for me.", "lear_examp": "Call me right now at my home: 555-9684. Be quick!!!"}, {"sense": "lasting a short time", "level": "A2", "dict_examp": "Can I ask you a quick question?", "lear_examp": "Dear Teacher, This is just a quick note to apologize for missing tomorrow's class."}]}]}, {"word": "quickly", "poses": [{"pos": "adverb", "senses": [{"sense": "at a fast speed", "level": "A2", "dict_examp": "I quickly shut the door.", "lear_examp": "It was fantastic match, because the  football players run very quickly and they scored four goals."}, {"sense": "after only a very short time", "level": "A2", "dict_examp": "These people need to be treated as quickly as possible.", "lear_examp": "Give it to me as quickly as you can."}]}]}, {"word": "quaint", "poses": [{"pos": "adjective", "senses": [{"sense": "attractive or unusual in an old-fashioned way", "level": "C2", "dict_examp": "a quaint little village", "lear_examp": "The quaint cafes would be replaced by McDonald's and the charm of the place would be lost."}]}]}, {"word": "question mark", "poses": [{"pos": "noun", "senses": [{"sense": "the ? punctuation mark that is put at the end of a phrase or sentence to show that it is a question", "level": "B1", "dict_examp": "", "lear_examp": ""}]}]}, {"word": "quite", "poses": [{"pos": "adverb", "senses": [{"sense": "to a large degree", "level": "A2", "dict_examp": "Casey is quite tall.", "lear_examp": "She bought me a dress for my aunt's wedding.  It was quite expensive, approximately 300 euros."}, {"sense": "a large amount or number", "level": "A2", "dict_examp": "They earn quite a lot of money.", "lear_examp": "There were quite a lot of people."}, {"sense": "completely", "level": "B1", "dict_examp": "Quite frankly, the thought of performing terrifies me.", "lear_examp": "I'm quite sure you will love my country, especially the Amazon basins and the biggest rain-forest in the world!"}, {"sense": "a long time", "level": "B1", "dict_examp": "I hadn’t seen Rebecca in quite a while.", "lear_examp": "But although I have what you could call \"simple\" tastes, it takes me quite a while to decide what to buy."}, {"sense": "a lot", "level": "B1", "dict_examp": "He does quite a bit of traveling.", "lear_examp": "We spent quite a bit of time going along the beach."}, {"sense": "almost but not completely", "level": "B2", "dict_examp": "I'm not quite sure that I understand this.", "lear_examp": "The student café has a welcoming atmosphere and most people said it was nice to sit and to drink coffee there. The only problem is that there are not quite enough tables and chairs for everyone at busy times."}, {"sense": "truly, really, or sincerely", "level": "B2", "dict_examp": "It was quite a remarkable speech.", "lear_examp": "Moreover, the city is quite an interesting historical place, so you could visit some buildings such as the old castle or the local museum."}]}]}, {"word": "quotation marks", "poses": [{"pos": "noun", "senses": [{"sense": "the \" \" punctuation marks that are put around a word or phrase to show that someone else has written or said it", "level": "B2", "dict_examp": "Direct speech should be shown in quotation marks.", "lear_examp": ""}]}]}, {"word": "quotation", "poses": [{"pos": "noun", "senses": [{"sense": "a sentence or phrase that is taken from a book, poem, speech, etc.", "level": "C2", "dict_examp": "a quotation from Shakespeare", "lear_examp": "Women also played an important role in his life, so it might also be a good idea to show pictures of his \"muses\" framed by quotations from his novels."}, {"sense": "the amount that a piece of work will probably cost", "level": "C2", "dict_examp": "Make sure you get a quotation for all the work before they start.", "lear_examp": "I have attached a current quotation from the retailer who supplies that dining table."}]}]}, {"word": "quiz", "poses": [{"pos": "noun", "senses": [{"sense": "a game or competition in which you answer questions", "level": "A2", "dict_examp": "a television quiz show", "lear_examp": "My team won the quiz."}, {"sense": "a short informal test", "level": "B1", "dict_examp": "We had a history quiz today.", "lear_examp": "Well, I have to go right now because I have to study for the quiz."}]}]}, {"word": "quote", "poses": [{"pos": "verb", "senses": [{"sense": "to repeat the words that someone else has said or written", "level": "C1", "dict_examp": "He illustrated by quoting from Winston Churchill's speech.", "lear_examp": "Let me quote another sentence: \"...carefully selected host families.\""}, {"sense": "to give a fact or example to support what you are saying", "level": "C1", "dict_examp": "The judge quoted several cases to support his opinion.", "lear_examp": "We would like to quote some facts to support our points of view."}, {"sense": "to say how much a piece of work will cost", "level": "C2", "dict_examp": "The roofer quoted $3000 to fix the roof.", "lear_examp": "I have spoken to the service department at IKEA and they have quoted me £400 to fix the whole thing back to its original shape."}]}, {"pos": "noun", "senses": [{"sense": "the repeat of words that someone else has said or written", "level": "C2", "dict_examp": "Use plenty of quotes from her poems in your essay.", "lear_examp": "My beloved diary included hundreds of quotes and drawings, illustrating my most intimate thoughts."}, {"sense": "a document or statement saying how much a piece of work will cost", "level": "C2", "dict_examp": "I got three quotes for the work.", "lear_examp": "I have already obtained a quote to have the damage repaired."}]}]}, {"word": "quite", "poses": [{"pos": "adverb", "senses": [{"sense": "to a large degree", "level": "A2", "dict_examp": "Casey is quite tall.", "lear_examp": "She bought me a dress for my aunt's wedding.  It was quite expensive, approximately 300 euros."}, {"sense": "a large amount or number", "level": "A2", "dict_examp": "They earn quite a lot of money.", "lear_examp": "There were quite a lot of people."}, {"sense": "completely", "level": "B1", "dict_examp": "Quite frankly, the thought of performing terrifies me.", "lear_examp": "I'm quite sure you will love my country, especially the Amazon basins and the biggest rain-forest in the world!"}, {"sense": "a long time", "level": "B1", "dict_examp": "I hadn’t seen Rebecca in quite a while.", "lear_examp": "But although I have what you could call \"simple\" tastes, it takes me quite a while to decide what to buy."}, {"sense": "a lot", "level": "B1", "dict_examp": "He does quite a bit of traveling.", "lear_examp": "We spent quite a bit of time going along the beach."}, {"sense": "almost but not completely", "level": "B2", "dict_examp": "I'm not quite sure that I understand this.", "lear_examp": "The student café has a welcoming atmosphere and most people said it was nice to sit and to drink coffee there. The only problem is that there are not quite enough tables and chairs for everyone at busy times."}, {"sense": "truly, really, or sincerely", "level": "B2", "dict_examp": "It was quite a remarkable speech.", "lear_examp": "Moreover, the city is quite an interesting historical place, so you could visit some buildings such as the old castle or the local museum."}]}]}]