[{"word": "raise", "poses": [{"pos": "verb", "senses": [{"sense": "to lift something to a higher position", "level": "B1", "dict_examp": "Would all those in favor please raise their hands?", "lear_examp": "Many students raised their hands."}, {"sense": "to increase an amount or level", "level": "B1", "dict_examp": "The city council plans to raise taxes.", "lear_examp": "Another disadvantage could be to raise costs, which includes high taxes, etc."}, {"sense": "to start talking about a subject that you want other people to consider", "level": "B2", "dict_examp": "You've raised an interesting question.", "lear_examp": "Then it raises an important question: \"Do museums provide enough to interest young people?\""}, {"sense": "to collect money from different people in order to do a particular thing", "level": "B2", "dict_examp": "They were raising  money for charity.", "lear_examp": "What I liked the most about it is not the fact that we raised a lot of money, but that we enjoyed an amazing show in which I took an active part."}, {"sense": "to take care of a child until he or she is completely grown", "level": "B2", "dict_examp": "Her parents died when she was a baby so she was raised by her grandparents.", "lear_examp": "I was born and raised on a Greek island called Evia."}, {"sense": "to speak loudly and angrily to someone", "level": "C1", "dict_examp": "Even when he was angry with his children, he never raised his voice.", "lear_examp": "Not every au-pair family is pleasant. And believe me, mine was giving me hell on earth. ... After I returned home I took some time to learn not to freak out when someone raised his voice and eventually I started to see my time in Germany as a great lesson in life."}, {"sense": "to cause emotions or thoughts", "level": "C2", "dict_examp": "Her answers raised doubts in my mind.", "lear_examp": "Indeed due to the advancements in many technological fields, the educational program of our schools has been modified or adapted up to a point that raises doubts about its purpose and value."}]}, {"pos": "noun", "senses": [{"sense": "an increase in the amount money you earn", "level": "C1", "dict_examp": "a pay raise", "lear_examp": "It is also worth mentioning that, owing to my knowledge of English I received, last month, a promotion in my job and a raise in my salary, as well."}]}]}, {"word": "randomly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a random way", "level": "C1", "dict_examp": "The books were randomly arranged on the shelves.", "lear_examp": "It is based on the survey of the Language Institute's students, who were randomly selected."}]}]}, {"word": "radical", "poses": [{"pos": "adjective", "senses": [{"sense": "A radical change is very big and important.", "level": "C1", "dict_examp": "During bad economic times, radical steps may be necessary to restore the confidence of the consumer.", "lear_examp": "Have you ever wondered if tourism can bring radical changes in an area?"}, {"sense": "believing that there should be big social and political changes", "level": "C2", "dict_examp": "a radical group/movement", "lear_examp": "As a result, they tend to sympathize with more radical groups and parties in order to support a change in the current system."}]}, {"pos": "noun", "senses": [{"sense": "someone who supports the idea that there should be big social and political changes", "level": "C2", "dict_examp": "There are several radicals in the government.", "lear_examp": "While in College, Josephine got involved with a group of radicals who became in a way her second family."}]}]}, {"word": "raid", "poses": [{"pos": "noun", "senses": [{"sense": "a planned, sudden attack on a place by a military group", "level": "C2", "dict_examp": "an air raid", "lear_examp": "Back in England, he provided valuable information to the SAS to make the air raids more effective."}, {"sense": "a planned, sudden visit to a place by police in order to find someone or something or stop an illegal activity", "level": "C2", "dict_examp": "Thousands of dollars worth of counterfeit goods were seized during the raid.", "lear_examp": "Biko showed Donald the reality, of the black people in their country, the raids, the townships, the dark side of Government movements."}]}, {"pos": "verb", "senses": [{"sense": "If soldiers raid a place, they suddenly attack it.", "level": "C2", "dict_examp": "Armed soldiers raided the village.", "lear_examp": "She had started doing this 15 years ago, when mounted warriors, clad in black armor, had raided the farm she, along with her parents and three older brothers, had lived on."}, {"sense": "If the police raid a place, they suddenly visit it in order to find someone or something or to stop an illegal activity.", "level": "C2", "dict_examp": "The FBI said it had no plans to raid the suspect’s farm.", "lear_examp": ""}]}]}, {"word": "rail", "poses": [{"pos": "noun", "senses": [{"sense": "trains as a method of transportation", "level": "B1", "dict_examp": "Thousands of commuters travel to work by rail.", "lear_examp": "By rail: get off at York station and you can walk from the station. Turn left and the hotel is on your left-hand side."}, {"sense": "a bar around or along something that you can hold for support to stop you from falling", "level": "C2", "dict_examp": "a hand rail", "lear_examp": "However it could be much more comfortable if there were hand rails in the bathroom and a lower bed."}]}]}, {"word": "random", "poses": [{"pos": "adjective", "senses": [{"sense": "happening, done or chosen by chance rather than according to a plan", "level": "C1", "dict_examp": "random checks/tests/attacks", "lear_examp": "I will put my remarks in random order."}, {"sense": "chosen by chance", "level": "C1", "dict_examp": "Winners will be chosen at random.", "lear_examp": "The rooms suggested to be filmed have not been chosen at random."}]}]}, {"word": "race", "poses": [{"pos": "noun", "senses": [{"sense": "a competition in which people run, ride, drive, etc., against each other in order to see who is the fastest", "level": "A2", "dict_examp": "a horse/bike/boat race", "lear_examp": "That's really important because I only have one swimsuit and today I have a swimming race."}, {"sense": "one of the groups that people are divided into according to physical characteristics", "level": "C1", "dict_examp": "people of many different races", "lear_examp": "A student was taught how to lead negotiations with a business partner regardless of their age, nationality, race and culture."}, {"sense": "an effort to get something such as power, control or success", "level": "C1", "dict_examp": "It was a race against time to get the project finished by Friday’s deadline.", "lear_examp": "In a world where Capitalism has reached almost every little part of the world, where the race for power and money is the most important priority; little time and interest is left for old traditions."}, {"sense": "a competition to be elected to a political position", "level": "C2", "dict_examp": "the race for governor", "lear_examp": ""}]}, {"pos": "verb", "senses": [{"sense": "to compete in a race", "level": "B1", "dict_examp": "He has been racing for over ten years.", "lear_examp": "Cycling has also given me the opportunity to race as well as train in Europe and the U.S."}]}]}, {"word": "racial", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to people's race", "level": "B2", "dict_examp": "a racial minority", "lear_examp": "It also prevents us from pre-judging foreign people, which is very important in a community where racial discrimination is common."}]}]}, {"word": "rally", "poses": [{"pos": "noun", "senses": [{"sense": "a large public meeting in support of something", "level": "C2", "dict_examp": "an election/campaign rally", "lear_examp": "I am prepared to take part in a rally against this decision and join other concerned readers of your newspaper on the steps of the Town Hall to show full support for retaining the local hospital to serve our community."}, {"sense": "a car or motorcycle race", "level": "C2", "dict_examp": "a rally driver", "lear_examp": "Indeed, it didn't look at all like the vehicles that we see on TV during the Paris-Dakkar rally."}]}]}, {"word": "railroad", "poses": [{"pos": "noun", "senses": [{"sense": "the system of transportation that uses trains, or a company that runs trains", "level": "A2", "dict_examp": "railroad tracks", "lear_examp": ""}]}]}, {"word": "rainbow", "poses": [{"pos": "noun", "senses": [{"sense": "a half circle of seven colors that you see in the sky when rain is falling and the sun is shining", "level": "B2", "dict_examp": "We could see a rainbow.", "lear_examp": "We all were really wet, but then the sun shone again and we saw a wonderful rainbow."}]}]}, {"word": "racism", "poses": [{"pos": "noun", "senses": [{"sense": "the belief that other races of people are not as good as your own, or the unfair treatment of people because they belong to a particular race", "level": "B2", "dict_examp": "It's important  to speak out about racism and injustice.", "lear_examp": "If we were all tolerant, racial segregation wouldn't exist. Hopefully racism is tending to disappear now."}]}]}, {"word": "raincoat", "poses": [{"pos": "noun", "senses": [{"sense": "a coat that you wear when it is raining", "level": "A2", "dict_examp": "Make sure you take a raincoat.", "lear_examp": "Tony, I have left my raincoat in your house."}]}]}, {"word": "racist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who believes that other races of people are not as good as their own", "level": "C2", "dict_examp": "Their boss was a racist.", "lear_examp": "That's something we should keep in mind, the next time you meet a racist."}]}, {"pos": "adjective", "senses": [{"sense": "believing that other races are not as good as your own and therefore treating them unfairly", "level": "C2", "dict_examp": "a racist attack", "lear_examp": "It's even getting worse because of immigration and serious incidents like racist attacks in Germany against Turks or Asian people."}]}]}, {"word": "radiation", "poses": [{"pos": "noun", "senses": [{"sense": "a form of energy that comes from a nuclear reaction and that in large amounts can be very dangerous", "level": "C1", "dict_examp": "dangerously high levels of radiation", "lear_examp": "It's true that in the last few years we have actually polluted much of our air with smoke or radiation from power plants, but we're working on that."}]}]}, {"word": "radically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that shows radical change or beliefs", "level": "C1", "dict_examp": "The company has changed radically in recent years.", "lear_examp": "During the last decades our eating habits have changed radically in Sweden."}]}]}, {"word": "rain forest", "poses": [{"pos": "noun", "senses": [{"sense": "a forest in a tropical area which receives a lot of rain", "level": "B1", "dict_examp": "a tropical rain forest", "lear_examp": "In the countryside we can hear birds singing, and we enjoy ourselves in the rain forest."}]}]}, {"word": "rainy", "poses": [{"pos": "adjective", "senses": [{"sense": "raining a lot", "level": "B1", "dict_examp": "a rainy afternoon", "lear_examp": "On a rainy night, I was walking down the street with an umbrella."}]}]}, {"word": "racially", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is connected to someone's race", "level": "C1", "dict_examp": "racially motivated attacks", "lear_examp": "He respects people's values and rights and can easily integrate and assert himself in a multi-cultural or racially diversified environment."}]}]}, {"word": "rain", "poses": [{"pos": "noun", "senses": [{"sense": "water that falls from the sky in small drops", "level": "A1", "dict_examp": "heavy/light rain", "lear_examp": "I think tomorrow we will have rain."}]}, {"pos": "verb", "senses": [{"sense": "If it rains, water falls from the sky in small drops.", "level": "A1", "dict_examp": "It's starting to rain.", "lear_examp": "It was raining when I arrived."}]}]}, {"word": "racket", "poses": [{"pos": "noun", "senses": [{"sense": "a net fixed tightly to an oval frame with a long handle, used in various sports for hitting a ball", "level": "A2", "dict_examp": "a tennis/squash/badminton racket", "lear_examp": "I got many presents such as a puppy, a badminton racket and many more things."}, {"sense": "a loud noise", "level": "C2", "dict_examp": "Go see why the kids are making such a racket.", "lear_examp": "However, my blissful thoughts were suddenly and rudely interrupted by the racket going on next door."}]}]}, {"word": "rage", "poses": [{"pos": "noun", "senses": [{"sense": "very strong anger that you cannot control", "level": "B2", "dict_examp": "My main feeling was one of rage.", "lear_examp": "However, they flew into a rage when one of Paul's friends was poisoned by the food, after having dinner in the hotel restaurant."}]}, {"pos": "verb", "senses": [{"sense": "to speak or behave in a very angry way", "level": "C2", "dict_examp": "He raged at us for forgetting to order a replacement.", "lear_examp": "Sobbing and raging she stomped into the bedroom, briskly opened the drawer and flung the framed picture showing them both at sunset on the coast of Fiji into it."}, {"sense": "to continue with great force or violence", "level": "C2", "dict_examp": "The battle raged well into the night.", "lear_examp": "It narrates the story of a group of children evacuated on an island somewhere in the Pacific Ocean while a war is raging elsewhere in Europe."}]}]}, {"word": "rabbit", "poses": [{"pos": "noun", "senses": [{"sense": "a small animal with fur and long ears that lives in a hole in the ground", "level": "A2", "dict_examp": "She has a pet rabbit.", "lear_examp": "I like rabbits very much because their fur is very soft, and white rabbits have pretty red eyes."}]}]}, {"word": "radio", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment used for listening to sound broadcasts", "level": "A1", "dict_examp": "a car radio", "lear_examp": "I want to sell my radio."}, {"sense": "the programs that you hear when you listen to the radio", "level": "A1", "dict_examp": "We heard him talking on the radio this morning.", "lear_examp": "He likes watching television and listening to the radio."}, {"sense": "a system of sending and receiving sound through the air", "level": "B1", "dict_examp": "local radio", "lear_examp": "I'm thinking of calling the radio station to inform them about my situation."}]}]}, {"word": "razor", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment with a sharp blade used for removing hair from the face, legs, etc.", "level": "B2", "dict_examp": "Did you pack a razor?", "lear_examp": "Oh yes, she could vividly remember the last time he hurt her, only then it was with a razor."}]}]}, {"word": "rape", "poses": [{"pos": "verb", "senses": [{"sense": "to force someone to have sex when they do not want to", "level": "B2", "dict_examp": "She was pulled from the car and raped.", "lear_examp": "I thought that they wanted to rape me."}]}, {"pos": "noun", "senses": [{"sense": "the crime of forcing someone to have sex when they do not want to", "level": "B2", "dict_examp": "He had committed several rapes.", "lear_examp": "Last month the police caught a man for rape and he confessed to several other crimes."}]}]}, {"word": "range", "poses": [{"pos": "noun", "senses": [{"sense": "a group of different things of the same general type", "level": "B1", "dict_examp": "a range of colors/patterns", "lear_examp": "It's a beautiful place with a wide range of activities."}, {"sense": "a group of mountains or hills", "level": "B1", "dict_examp": "A range of mountains runs through the middle of Puerto Rico.", "lear_examp": "My friend's farm is near to the lovely mountain range, and there are beautiful countryside views as well."}, {"sense": "the amounts or numbers between a particular set of limits", "level": "B2", "dict_examp": "That's too expensive - it's out of our price range.", "lear_examp": "The age range of the club is from eighteen to thirty years old and our club has different nationalities."}]}, {"pos": "verb", "senses": [{"sense": "to have an upper and a lower limit in amount, number, etc.", "level": "B2", "dict_examp": "Dress sizes range from petite to extra large.", "lear_examp": "It offers lots of fabulous things ranging from drinks to modern music."}]}]}, {"word": "rare", "poses": [{"pos": "adjective", "senses": [{"sense": "very unusual", "level": "B1", "dict_examp": "a rare disease/species", "lear_examp": "There are palms, rare birds, very good food and a wonderful beach."}, {"sense": "If meat is rare, it is still red because it has only been cooked for a short time.", "level": "C1", "dict_examp": "a rare steak", "lear_examp": ""}]}]}, {"word": "ray", "poses": [{"pos": "noun", "senses": [{"sense": "a narrow beam of light, heat, or energy traveling in a straight line from its place of origin", "level": "B2", "dict_examp": "A ray of sunshine shone through a gap in the clouds.", "lear_examp": "She just couldn't see any way of finding her camping equipment in the basement, where there was not even a single ray of light to guide her."}]}]}, {"word": "ratio", "poses": [{"pos": "noun", "senses": [{"sense": "the relationship between two groups or amounts, which expresses how much bigger one is than the other", "level": "C1", "dict_examp": "The ratio of men to women at the conference was ten to one/10:1.", "lear_examp": "First, the ratio between cost and the perceived value has become better since 2004, i.e., the guests are more satisfied now and believe that your service is worth the money."}]}]}, {"word": "raw", "poses": [{"pos": "adjective", "senses": [{"sense": "not cooked", "level": "B1", "dict_examp": "raw fish/meat/vegetables", "lear_examp": "My grandparents often tell me that they've never eaten anything while walking and they love healthy food, especially raw fish and sushi."}, {"sense": "in the natural state", "level": "B2", "dict_examp": "raw sugar", "lear_examp": "Finally, I think the designers will make use of the raw materials and create an innovative look for all of us."}]}]}, {"word": "rapidly", "poses": [{"pos": "adverb", "senses": [{"sense": "quickly or suddenly", "level": "B2", "dict_examp": "Prices have increased rapidly in the last few months.", "lear_examp": ""}]}]}, {"word": "reach", "poses": [{"pos": "verb", "senses": [{"sense": "to arrive at a place, especially after spending a long time traveling", "level": "B1", "dict_examp": "We won't reach home till five or six o'clock.", "lear_examp": "In the evening, it got colder than it had been, so we reached home shivering."}, {"sense": "to make a decision/agreement/conclusion, etc. about something", "level": "B2", "dict_examp": "She reached the conclusion that there was no more she could do.", "lear_examp": "After having thought about this video, I reached the following conclusions: we must film the lessons which are the most important and the activities which take a great part of the day at school."}, {"sense": "to get to a particular level, situation, etc.", "level": "B2", "dict_examp": "The temperature is expected to reach 30 degrees today.", "lear_examp": "My dad  has already reached the age of 60."}, {"sense": "to stretch out your arm in order to get or touch something", "level": "B2", "dict_examp": "Our little girl isn’t tall enough to reach the light switches.", "lear_examp": "So when I reached out my hand, I suddenly felt another hand."}, {"sense": "to be able to touch or take something with your hand", "level": "B2", "dict_examp": "Could you get that book down for me - I can't reach.", "lear_examp": "Then I looked around my car and saw my handbag. I could hardly reach it but after some effort I got it."}, {"sense": "to speak to someone on the telephone", "level": "B2", "dict_examp": "You can reach him at home.", "lear_examp": "I have been trying to reach him the whole day but I didn't get any answer."}]}, {"pos": "noun", "senses": [{"sense": "the distance that can be traveled, especially easily", "level": "B2", "dict_examp": "We live within(easy) reach of the station.", "lear_examp": "Our city, Sardab, is located just two kilometers from the Caspian Sea, and it is within easy reach of the capital of our province."}, {"sense": "Someone's reach is the distance within which they can stretch out their arm and touch something.", "level": "B2", "dict_examp": "I like to keep a notebook and pencil within reach.", "lear_examp": ""}]}]}, {"word": "rational", "poses": [{"pos": "adjective", "senses": [{"sense": "showing clear thought and reason", "level": "C1", "dict_examp": "He was too upset to be rational.", "lear_examp": "Be as rational as you can and you will pass your driving test the first time."}]}]}, {"word": "rate", "poses": [{"pos": "noun", "senses": [{"sense": "how often something happens, or how many people something happens to", "level": "B2", "dict_examp": "the rate of unemployment", "lear_examp": "The topics we have in mind are - why people commit a crime, why the crime rate has risen in Britain, and of course some discussion about your latest novel."}, {"sense": "a fixed amount of money given for something", "level": "B2", "dict_examp": "the interest rate", "lear_examp": "I think it would be a good thing to help the restaurant by either giving them a subsidy or lending them money at a low rate."}, {"sense": "the speed at which something happens", "level": "C1", "dict_examp": "the patient's heart rate", "lear_examp": "The actual rate of our company's growth demands increasing quality and productivity."}, {"sense": "very good, bad, or very bad", "level": "C1", "dict_examp": "a first-rate hotel", "lear_examp": "For example, our town is famous for its first-rate tennis team, so he could continue his training in tennis here and also do other sports like volleyball and baseketball."}, {"sense": "used before saying what will happen if a situation continues in the same way", "level": "C2", "dict_examp": "At this rate we're not going to be there till midnight.", "lear_examp": ""}, {"sense": "used before saying one fact that is certain in a situation that you are generally not certain about", "level": "C2", "dict_examp": "Well, at any rate we need her to be there.", "lear_examp": "Nevertheless, at any rate, we would like to see a society with a full and strong workforce working towards stronger economic power."}]}, {"pos": "verb", "senses": [{"sense": "to judge the quality or ability of someone or something", "level": "C1", "dict_examp": "How do you rate her as a singer?", "lear_examp": "We did a survey among our members that rated value for money, cost, staff, and the like."}]}]}, {"word": "rank", "poses": [{"pos": "noun", "senses": [{"sense": "a position in an organization, such as the army, showing someone's importance", "level": "C1", "dict_examp": "senior/high/junior/low rank", "lear_examp": "Women were denied a higher rank and their job was limited to mundane tasks."}]}, {"pos": "verb", "senses": [{"sense": "to have a position in a list which shows things or people in order of importance, or to give someone or something a position on such a list", "level": "C1", "dict_examp": "He ranked number one in the world at the start of the competition.", "lear_examp": "From being in an amateur league to ranked top 3 in the world is a considerable achievement."}]}]}, {"word": "reaction", "poses": [{"pos": "noun", "senses": [{"sense": "something you say, feel, or do because of something that has happened", "level": "B2", "dict_examp": "What was his reaction to the news?", "lear_examp": "Her reaction made it all worthwhile. She burst into tears and thanked us. That was an experience that I'll never forget."}, {"sense": "an unpleasant effect resulting from eating particular things or taking particular drugs", "level": "B2", "dict_examp": "A number of people have had a bad reaction to this medication.", "lear_examp": "There is one more thing that you have to note: two girls have an allergic reaction to nuts, so please make sure that our lunch is nut-free!"}]}]}, {"word": "rapid", "poses": [{"pos": "adjective", "senses": [{"sense": "fast or sudden", "level": "B2", "dict_examp": "The 1990s were a period of rapid change/growth.", "lear_examp": "With the rapid development of technology, shopping on the Internet is becoming very popular."}]}]}, {"word": "rat", "poses": [{"pos": "noun", "senses": [{"sense": "an animal that looks like a large mouse and has a long tail", "level": "A2", "dict_examp": "Rats carry disease.", "lear_examp": "Last night a rat tasted my feet, so now I'm looking for a poison for rats."}]}]}, {"word": "rarely", "poses": [{"pos": "adverb", "senses": [{"sense": "not often", "level": "B1", "dict_examp": "We rarely see each other now.", "lear_examp": "I rarely go shopping for clothes."}]}]}, {"word": "rap", "poses": [{"pos": "noun", "senses": [{"sense": "a type of music in which the words are spoken and there is a strong beat", "level": "A2", "dict_examp": "a rap artist", "lear_examp": "I like hip-hop, rap, reggae and punk-rock."}]}]}, {"word": "rating", "poses": [{"pos": "noun", "senses": [{"sense": "a measurement of how good or popular something or someone is", "level": "C1", "dict_examp": "A high percentage of Americans gave the President a positive rating.", "lear_examp": "Overall your rating was excellent!"}, {"sense": "a list of television and radio programmes showing how popular they are", "level": "C2", "dict_examp": "His show did well in the ratings.", "lear_examp": "Sports would not appear on TV if it was not for a majority of the population wanting to watch it, in fact some sports programmes have the highest ratings of all TV shows."}]}]}, {"word": "react", "poses": [{"pos": "verb", "senses": [{"sense": "to say, do, or feel something because of something else that has been said or done", "level": "B2", "dict_examp": "He reacted angrily to her comments.", "lear_examp": "I reacted quickly and without panic."}]}]}, {"word": "read", "poses": [{"pos": "verb", "senses": [{"sense": "to look at words and understand what they mean", "level": "A1", "dict_examp": "I've read three books this month.", "lear_examp": "We read books and we use computers."}, {"sense": "to look at words that are written and say them aloud for other people to listen to", "level": "A2", "dict_examp": "Do you want me to read the directions to you?", "lear_examp": "Can you imagine anything more beautiful than a mother reading a bedtime story to her little baby?"}, {"sense": "If you read between the lines, you understand what something really means when it hasn't been directly said or written.", "level": "C2", "dict_examp": "Reading between the lines, it was obvious that something was wrong.", "lear_examp": "All songs send positive thoughts and messages to listeners, although sometimes you really have to read between the lines to understand this profound message."}, {"sense": "to read something and say the words aloud so that other people can hear", "level": "B2", "dict_examp": "He read out the names of all the winners.", "lear_examp": "Michael sat in his favorite chair while his wife read out what had happened."}, {"sense": "to read something from the beginning to the end, especially to find mistakes", "level": "B2", "dict_examp": "I read over my essay to check for errors.", "lear_examp": "I thought my eyes were deceiving me so I read the letter over again."}]}]}, {"word": "rash", "poses": [{"pos": "noun", "senses": [{"sense": "a group of small, red spots on the skin", "level": "C2", "dict_examp": "an itchy rash", "lear_examp": "Indeed, everything had worked out very well since I had woken up, not only for the little things such as having your breakfast without spilling your tea on your new suit but also for more serious matters like getting up with a dreadful face or a rash of spots!"}]}, {"pos": "adjective", "senses": [{"sense": "done suddenly and without thinking carefully", "level": "C2", "dict_examp": "a rash decision/promise", "lear_examp": "They had reconciled only some days ago and had made a rash decision to go on holiday with us."}]}]}, {"word": "rather", "poses": [{"pos": "adverb", "senses": [{"sense": "slightly or to a  small degree", "level": "B1", "dict_examp": "That's rather a difficult question to answer.", "lear_examp": "I can't come because I feel rather sick."}, {"sense": "instead of", "level": "B1", "dict_examp": "I think I'd like coffee rather than tea, if that's okay?", "lear_examp": "When the weather is too hot to wear jeans, I usually wear a swimsuit rather than shorts."}, {"sense": "used to show that you prefer to have or do one thing more than another", "level": "B1", "dict_examp": "I'd much rather go out to dinner than stay in and watch TV.", "lear_examp": "I'd rather watch something funny, like a sitcom."}, {"sense": "used to change something you have just said and make it more correct", "level": "B2", "dict_examp": "She'll go shopping on Thursday, or rather, she will if she has to.", "lear_examp": "The food - or rather, leftovers - that she gave him was barely enough to feed a baby."}]}]}, {"word": "rarity", "poses": [{"pos": "noun", "senses": [{"sense": "to be unusual", "level": "C1", "dict_examp": "Genuine enthusiasm is a rarity.", "lear_examp": "Hot meals were a rarity."}, {"sense": "the fact that something is not common", "level": "C1", "dict_examp": "Precious stones are valued for their rarity.", "lear_examp": "Another group of objects would be those that are valuable - or even priceless - because of their rarity."}]}]}, {"word": "realize", "poses": [{"pos": "verb", "senses": [{"sense": "to notice or understand something that you did not notice or understand before", "level": "B1", "dict_examp": "I didn't realize how unhappy she was.", "lear_examp": "I was on my way to the airport when I realized I wasn't carrying my suitcase."}]}]}, {"word": "realistic", "poses": [{"pos": "adjective", "senses": [{"sense": "showing things and people as they really are, or making them seem to be real", "level": "B1", "dict_examp": "The creatures were all computer-generated but so realistic.", "lear_examp": "I chose this film because I think it is very realistic."}, {"sense": "accepting the true facts of a situation and not basing decisions on things that will not happen", "level": "B2", "dict_examp": "Let's be realistic - we're not going to finish this by Friday.", "lear_examp": "Dear friends, I think that your ideas are very nice, but we have to be realistic."}]}]}, {"word": "realistically", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that shows things and people as they really are, or that makes them seem real", "level": "C1", "dict_examp": "The characters are portrayed very realistically.", "lear_examp": "It was realistically captured in the TV reports you have seen."}, {"sense": "in a way that shows that you accept the true facts of a situation", "level": "C2", "dict_examp": "Realistically, we cannot expect to have finished by the weekend.", "lear_examp": "Realistically, separate schools will probably be with us for a long time to come, but it will remain the least used form of the two."}]}]}, {"word": "readjust", "poses": [{"pos": "verb", "senses": [{"sense": "to move something slightly or make a small change to something", "level": "C1", "dict_examp": "He readjusted his tie.", "lear_examp": "Because the air conditioning was not working properly or because your unfriendly coach driver refused to readjust it, I got acold from that day."}, {"sense": "to change in order to deal with a new situation, such as a new job or home", "level": "C2", "dict_examp": "The children will have to readjust to a new school.", "lear_examp": "For the last couple of days she had gradually readjusted to her normal mode of life, no longer suddenly finding herself attuned to Morgan's odd modality of perceptions and unable to interface properly with her surroundings."}]}]}, {"word": "real", "poses": [{"pos": "adjective", "senses": [{"sense": "existing in fact and not imagined", "level": "A2", "dict_examp": "He's not real you know, he's just a character in a book.", "lear_examp": "I have recently seen a program called \"Real life\". The program is very good because you can see what the real world is like."}, {"sense": "not artificial or false", "level": "A2", "dict_examp": "real leather", "lear_examp": "They brought a car for me but not a real one."}, {"sense": "true and not pretended", "level": "B1", "dict_examp": "What's the real reason she didn't come?", "lear_examp": "That is the real reason why I'm going to stay in England longer."}, {"sense": "being the most important or the main thing", "level": "B2", "dict_examp": "The real problem, of course, is money.", "lear_examp": "Nowadays people work most of the time with their computers, and the internet gives them the opportunity to download whatever they want, even books, but the real problem is that they do not have the time to read them."}, {"sense": "used to emphasize a noun", "level": "B2", "dict_examp": "She was a real help.", "lear_examp": "In the advertisement it says \"your perfect evening out\", but it was a real disappointment."}, {"sense": "taken seriously, not pretended", "level": "B2", "dict_examp": "I thought it was just a practice, but apparently it was for real.", "lear_examp": "I thought it was a joke but when I saw the signature I knew it was for real."}]}]}, {"word": "reality", "poses": [{"pos": "noun", "senses": [{"sense": "the way things or situations really are and not the way you would like them to be", "level": "B2", "dict_examp": "Listening to music is my escape from reality.", "lear_examp": "Finally, your report talks about an audience of less than 2,000 although we were in reality more than 5,000."}, {"sense": "the truth about an unpleasant situation", "level": "B2", "dict_examp": "the harsh realities of life", "lear_examp": "Besides we all know the realities of the modern world."}, {"sense": "to start to happen or exist", "level": "B2", "dict_examp": "New jobs could become a reality by next month.", "lear_examp": "You have made my dream become a reality."}]}]}, {"word": "reasonable", "poses": [{"pos": "adjective", "senses": [{"sense": "somewhat cheap", "level": "B1", "dict_examp": "reasonable prices", "lear_examp": "If you are nature lovers, you should visit some small villages where you can find a peaceful atmosphere, delicious, fresh food and everything at a reasonable price."}, {"sense": "big enough or large enough in number or amount, although not big or not many", "level": "B1", "dict_examp": "There were a reasonable number of people there.", "lear_examp": "Some of them have good places for sightseeing and a reasonable amount of nightlife."}, {"sense": "good enough but not the best", "level": "B1", "dict_examp": "The service at the hotel is reasonable but don't expect 5-star treatment.", "lear_examp": "From my Certificates you can see that I speak English very well and that I have a reasonable knowledge of Italian and Spanish."}, {"sense": "fair and showing good judgment", "level": "B2", "dict_examp": "It's not reasonable to expect people to work such long hours.", "lear_examp": "In my opinion, reasonable rules are important for us but being too strict will bring stress, which causes kids to be afraid of many things."}, {"sense": "based on facts that can be explained", "level": "B2", "dict_examp": "There will be a reasonable explanation for all of this.", "lear_examp": "I hope you will be able to offer me a reasonable explanation for these mistakes and report correct information in your newspaper."}]}]}, {"word": "realm", "poses": [{"pos": "noun", "senses": [{"sense": "an area of knowledge, interest, experience or activity", "level": "C2", "dict_examp": "successes in the realm of  foreign policy", "lear_examp": "Reading literature, in particular, as a pastime is the path which leads you to the magic realm of other worlds shaped by a magnificent combination of words, phrases and sentences composing anew and in a totally different way what you experience in your everyday life."}]}]}, {"word": "reason", "poses": [{"pos": "noun", "senses": [{"sense": "the facts about why something happens or why someone does something", "level": "A2", "dict_examp": "The reason I'm calling is to ask you a favor.", "lear_examp": "I think the reason why I like mirrors is I like to look at myself."}, {"sense": "something that makes it right for you to think or do something", "level": "B2", "dict_examp": "I think we have reason to be concerned.", "lear_examp": "Animals in zoos are in captivity and not in their natural habitat. They live captured there for no reason, as we could learn about them from books or documentaries instead."}, {"sense": "If it stands to reason that something happens or is true, it is what you would expect.", "level": "C2", "dict_examp": "It stands to reason that a child who is constantly criticized will have little self-confidence.", "lear_examp": "So it stands to reason that there is no place for Piggy in Jack's world."}]}]}, {"word": "reap", "poses": [{"pos": "verb", "senses": [{"sense": "to get something good by working hard for it", "level": "C2", "dict_examp": "Sometimes, this approach can reap tremendous rewards.", "lear_examp": "Again this is going to cost the library but it will be able to reap the benefits in the end."}]}]}, {"word": "realization", "poses": [{"pos": "noun", "senses": [{"sense": "when you notice or understand something that you did not notice or understand before", "level": "C1", "dict_examp": "There is a growing realization that education has benefits at many levels.", "lear_examp": "I suppose it is only when one starts to think about it that the realization comes about the fact that fashion is part of our everyday life."}, {"sense": "when you achieve something that you wanted", "level": "C2", "dict_examp": "the realization of an ambition", "lear_examp": "I am certain that the realization of such a project would not only be of benefit to me, but also contribute to an enhanced cultural understanding of both the host country and Switzerland."}]}]}, {"word": "rear", "poses": [{"pos": "adjective", "senses": [{"sense": "at the back of something", "level": "B2", "dict_examp": "There's a sticker on the rear door/window.", "lear_examp": "In his rear mirror he saw that all the lights on the airfield were on again."}]}, {"pos": "noun", "senses": [{"sense": "the back part of something", "level": "C1", "dict_examp": "First class accommodation is towards the rear of the train.", "lear_examp": "The damage seems to be at the rear of the fridge where the motor is situated."}]}, {"pos": "verb", "senses": [{"sense": "If you rear children or young animals, you care for them until they are adults.", "level": "C1", "dict_examp": "In these waters they breed and rear their young.", "lear_examp": "But still the main role of the woman is to rear her children and be a good assistant to her husband and take care of her home."}]}]}, {"word": "really", "poses": [{"pos": "adverb", "senses": [{"sense": "very or very much", "level": "A1", "dict_examp": "She's really friendly/nice.", "lear_examp": "I really like my lessons, the teacher and my new friends."}, {"sense": "used to give particular importance to a verb, especially a modal verb", "level": "A2", "dict_examp": "I really have to call Ursula this week.", "lear_examp": "I really need to study."}, {"sense": "used when you are saying what is the truth of a situation", "level": "B1", "dict_examp": "He isn't really angry - he's just pretending.", "lear_examp": "The first lesson was about the present tense and wasn't really difficult for us."}, {"sense": "used for replying that something is not true in a way that is less strong than saying \"no\"", "level": "B1", "dict_examp": "\"So was the food good?\" \"Not really.\"", "lear_examp": ""}]}, {"pos": "exclamation", "senses": [{"sense": "used to express interest or  surprise", "level": "A2", "dict_examp": "\"Apparently she's leaving.\" \"Really? When?\"", "lear_examp": ""}]}]}, {"word": "read", "poses": [{"pos": "verb", "senses": [{"sense": "to look at words and understand what they mean", "level": "A1", "dict_examp": "I've read three books this month.", "lear_examp": "We read books and we use computers."}, {"sense": "to look at words that are written and say them aloud for other people to listen to", "level": "A2", "dict_examp": "Do you want me to read the directions to you?", "lear_examp": "Can you imagine anything more beautiful than a mother reading a bedtime story to her little baby?"}, {"sense": "If you read between the lines, you understand what something really means when it hasn't been directly said or written.", "level": "C2", "dict_examp": "Reading between the lines, it was obvious that something was wrong.", "lear_examp": "All songs send positive thoughts and messages to listeners, although sometimes you really have to read between the lines to understand this profound message."}, {"sense": "to read something and say the words aloud so that other people can hear", "level": "B2", "dict_examp": "He read out the names of all the winners.", "lear_examp": "Michael sat in his favorite chair while his wife read out what had happened."}, {"sense": "to read something from the beginning to the end, especially to find mistakes", "level": "B2", "dict_examp": "I read over my essay to check for errors.", "lear_examp": "I thought my eyes were deceiving me so I read the letter over again."}]}]}, {"word": "reading", "poses": [{"pos": "noun", "senses": [{"sense": "the activity or skill of getting information from books, newspapers, etc.", "level": "A1", "dict_examp": "I did a lot of reading while I was on vacation.", "lear_examp": "Also we do some practice tasks on writing, reading, speaking and spelling."}]}]}, {"word": "reader", "poses": [{"pos": "noun", "senses": [{"sense": "someone who reads", "level": "B1", "dict_examp": "He's a great reader.", "lear_examp": "It is a club of readers. Our motto is \"READ AND YOU WILL FEEL FINE!\""}, {"sense": "a book containing a simple story for people who are learning to read or learning a language", "level": "B1", "dict_examp": "There are readers at five different levels, from beginner to upper intermediate.", "lear_examp": ""}]}]}, {"word": "readership", "poses": [{"pos": "noun", "senses": [{"sense": "the number and type of people who read a particular newspaper, magazine, etc", "level": "C1", "dict_examp": "These magazines have a very young readership.", "lear_examp": "The first one is an issue that has become one of the main subjects of the last ten years and affects the whole world, so it will interest your readership."}]}]}, {"word": "rearrange", "poses": [{"pos": "verb", "senses": [{"sense": "to change the order or position of things", "level": "B2", "dict_examp": "I've rearranged the furniture in my office.", "lear_examp": "Maybe you could rearrange the café to be more classical."}]}]}, {"word": "readily", "poses": [{"pos": "adverb", "senses": [{"sense": "quickly and easily", "level": "B2", "dict_examp": "Information is readily available on the Internet.", "lear_examp": ""}, {"sense": "willingly and without stopping to think", "level": "B2", "dict_examp": "He readily admits to having problems himself.", "lear_examp": "Drinking alcohol won't do you any good. There are a lot of friends who would readily help you if you decided to give it up."}]}]}, {"word": "ready", "poses": [{"pos": "adjective", "senses": [{"sense": "prepared for doing something", "level": "A1", "dict_examp": "Give me a call when you're ready.", "lear_examp": "Are you ready for some painting?"}, {"sense": "prepared and available to be eaten, drunk, used, etc.", "level": "A2", "dict_examp": "Is dinner ready?", "lear_examp": "The meal will be ready at 6 o'clock."}]}]}, {"word": "readiness", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is willing to do something", "level": "C1", "dict_examp": "They expressed a readiness to accept our demands.", "lear_examp": "Usually, the clients appreciate his readiness to use their language and this has often been a significant factor in closing a deal."}, {"sense": "when someone is prepared for something", "level": "C2", "dict_examp": "It was time to repair their shelters in readiness for the winter.", "lear_examp": ""}]}]}, {"word": "recollection", "poses": [{"pos": "noun", "senses": [{"sense": "when you remember something", "level": "C2", "dict_examp": "He had no recollection of the incident.", "lear_examp": "I have a very vague recollection of my childhood but, of course, there are some things that have stayed in my memory."}]}]}, {"word": "reception", "poses": [{"pos": "noun", "senses": [{"sense": "a formal party that is given to celebrate a special event or to welcome someone", "level": "B2", "dict_examp": "a wedding reception", "lear_examp": "Next month, I have to fly to London to attend a friend's wedding reception."}]}]}, {"word": "recognize", "poses": [{"pos": "verb", "senses": [{"sense": "to know someone or something because you have seen, heard or experienced them before", "level": "B1", "dict_examp": "I hadn't seen her for 20 years, but I recognized her immediately.", "lear_examp": "I had recognized Andy's handwriting as soon as I had seen it."}, {"sense": "to accept that something is legal, true or important", "level": "B2", "dict_examp": "She recognized that she had been partly to blame.", "lear_examp": "I recognize that, when the weather is bad, you sometimes get wet."}]}]}, {"word": "rebuild", "poses": [{"pos": "verb", "senses": [{"sense": "to build something again that has been damaged or destroyed", "level": "B1", "dict_examp": "The villa was completely rebuilt in 1425 after it had been destroyed by fire.", "lear_examp": "It's a XIX century construction, but they rebuilt it."}, {"sense": "to make a situation succeed again after something caused it to fail", "level": "B2", "dict_examp": "The country was still struggling to rebuild its economy.", "lear_examp": "Since more and more people in our modern society have been living in a highly urbanized environment and they are isolated from the rest of nature, I think it is vital to make every effort to rebuild healthy relationships with nature."}]}]}, {"word": "reconsider", "poses": [{"pos": "verb", "senses": [{"sense": "to think again about a decision or opinion and decide if you want to change it", "level": "C1", "dict_examp": "We've been asked to reconsider the proposal.", "lear_examp": "We invite your newspaper to reconsider its position, hoping that the council will think about our proposals."}]}]}, {"word": "reassuring", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel less worried", "level": "C1", "dict_examp": "a reassuring smile/voice", "lear_examp": "It was a reassuring feeling."}]}]}, {"word": "reasoning", "poses": [{"pos": "noun", "senses": [{"sense": "the process of thinking about something in order to make a decision", "level": "C2", "dict_examp": "I don't understand the reasoning behind this decision.", "lear_examp": "According to this line of reasoning, its supporters believe that although sports people sacrifice a lot of their time, the huge amounts of money that they earn are illogical in comparison with the job they are doing."}]}]}, {"word": "recommendation", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of advice about what to do in a particular situation", "level": "B2", "dict_examp": "The report doesn't make/offer any new recommendations.", "lear_examp": "I hope my recommendations are helpful, and I hope you  have a great time!"}]}]}, {"word": "recession", "poses": [{"pos": "noun", "senses": [{"sense": "a period when the economy of a country is not successful and conditions for business are bad", "level": "B2", "dict_examp": "The latest report confirms that the economy is in recession.", "lear_examp": "Now in Japan the recession is getting worse and unemployment is increasing."}]}]}, {"word": "reasonably", "poses": [{"pos": "adverb", "senses": [{"sense": "available at a good price", "level": "B1", "dict_examp": "reasonably priced meals", "lear_examp": "Then in the evenings there are many reasonably priced restaurants, where you can get a nice tasty meal with friends."}, {"sense": "good/successful/well, etc. enough but not very good or very well", "level": "B2", "dict_examp": "I did reasonably well in school but not as well as my sister.", "lear_examp": "I noticed the sound system wasn't perfect, but it was reasonably good."}, {"sense": "in a fair way, showing good judgment", "level": "B2", "dict_examp": "Let's discuss this reasonably.", "lear_examp": ""}]}]}, {"word": "rebellion", "poses": [{"pos": "noun", "senses": [{"sense": "when people fight against the government in their country", "level": "C1", "dict_examp": "Government troops defeated an armed rebellion in the south.", "lear_examp": "The rebellion of the students not only led to the freedom of Greece but it also inspired the local people and the people worldwide to fight for their freedom."}]}]}, {"word": "reconstruction", "poses": [{"pos": "noun", "senses": [{"sense": "when you build something again after it has been damaged or destroyed", "level": "C1", "dict_examp": "The reconstruction of the city took decades.", "lear_examp": "The classrooms are in need of immediate reconstruction."}, {"sense": "when you create a description of a past event using all the information that you have", "level": "C2", "dict_examp": "A reconstruction of the crime was shown on TV.", "lear_examp": ""}]}]}, {"word": "reasonable", "poses": [{"pos": "adjective", "senses": [{"sense": "somewhat cheap", "level": "B1", "dict_examp": "reasonable prices", "lear_examp": "If you are nature lovers, you should visit some small villages where you can find a peaceful atmosphere, delicious, fresh food and everything at a reasonable price."}, {"sense": "big enough or large enough in number or amount, although not big or not many", "level": "B1", "dict_examp": "There were a reasonable number of people there.", "lear_examp": "Some of them have good places for sightseeing and a reasonable amount of nightlife."}, {"sense": "good enough but not the best", "level": "B1", "dict_examp": "The service at the hotel is reasonable but don't expect 5-star treatment.", "lear_examp": "From my Certificates you can see that I speak English very well and that I have a reasonable knowledge of Italian and Spanish."}, {"sense": "fair and showing good judgment", "level": "B2", "dict_examp": "It's not reasonable to expect people to work such long hours.", "lear_examp": "In my opinion, reasonable rules are important for us but being too strict will bring stress, which causes kids to be afraid of many things."}, {"sense": "based on facts that can be explained", "level": "B2", "dict_examp": "There will be a reasonable explanation for all of this.", "lear_examp": "I hope you will be able to offer me a reasonable explanation for these mistakes and report correct information in your newspaper."}]}]}, {"word": "receptive", "poses": [{"pos": "adjective", "senses": [{"sense": "willing to think about and accept new ideas", "level": "C2", "dict_examp": "She's generally very receptive to ideas and suggestions.", "lear_examp": "As we are very receptive to new ideas, this interaction will help us improve our city and take a step forward in making it a nicer place to live or visit."}]}]}, {"word": "record", "poses": [{"pos": "verb", "senses": [{"sense": "to store sounds or pictures using electronic equipment, a camera, etc., so that you can listen to them or see them again", "level": "A2", "dict_examp": "They've just recorded a new album.", "lear_examp": "The best thing about the phone is it has a camera and it can record anything."}, {"sense": "to write down information or store it on a computer so that it can be used in the future", "level": "B2", "dict_examp": "He recorded details of their conversation in his diary.", "lear_examp": "Another way to highlight the importance of books is to consider them as the \"depots\" of wisdom and knowledge that exist and have been recorded since the beginning of History."}]}, {"pos": "noun", "senses": [{"sense": "a song or music which has been recorded and which is available for the public to buy", "level": "B1", "dict_examp": "I like their new record.", "lear_examp": "My room is comfortable but a bit untidy around my stereo because in spite of having a lot of records and CDs, I don't have any shelf for them so this is why I'm going to buy a new shelf."}, {"sense": "the best, biggest, longest, tallest, etc.", "level": "B1", "dict_examp": "He ran the 100 meters in 9.79 seconds and broke the world record.", "lear_examp": "For instance, at the moment we hear a lot about Laure Manaudou - she has won many gold medals in swimming, and any time she takes part in a competition, she tends to go faster than her previous personal time record or even faster than the world record!!"}, {"sense": "information that is written on paper or stored on computer so that it can be used in the future", "level": "B2", "dict_examp": "medical/dental records", "lear_examp": "Finally, I have to mention that according to the records from the box office, they sold over 5,000 tickets for this music festival."}]}]}, {"word": "reconstruct", "poses": [{"pos": "verb", "senses": [{"sense": "to build something again after it has been damaged or destroyed", "level": "C1", "dict_examp": "They reconstructed the palace exactly as it had been.", "lear_examp": "Dear Sir, The student committee greatly appreciate your efforts to resolve our current problems, in particular improving and reconstructing our sports centre."}, {"sense": "to create a description of a past event using all the information that you have", "level": "C2", "dict_examp": "The police tried to reconstruct the crime using evidence found at the scene.", "lear_examp": "Through some letters written by Olivia to her sister Marcia, who lived in Paris in 1923, Anne reconstructs the different episodes, letting the reader imagine all the different scenes."}]}]}, {"word": "reassurance", "poses": [{"pos": "noun", "senses": [{"sense": "something that you say to make someone stop worrying", "level": "C2", "dict_examp": "Despite my reassurances that she was welcome, she wouldn't come.", "lear_examp": "I very much like being around people and need the reassurance of being well liked."}]}]}, {"word": "receptionist", "poses": [{"pos": "noun", "senses": [{"sense": "someone who works in a hotel or office building, answering the telephone and dealing with guests", "level": "A2", "dict_examp": "a hotel receptionist", "lear_examp": "If you can't find the information, you must ask the receptionist."}]}]}, {"word": "reconcile", "poses": [{"pos": "verb", "senses": [{"sense": "to make two different ideas, beliefs, or situations agree or able to exist together", "level": "C2", "dict_examp": "It is sometimes difficult to reconcile science and religion.", "lear_examp": "When this is the case, the families caring for them are faced with an uphill struggle, as it is difficult to reconcile the need for earning a living with the care of their relatives."}, {"sense": "to accept a situation although you do not like it", "level": "C2", "dict_examp": "Eventually he reconciled himself to living without her.", "lear_examp": "I couldn't reconcile myself to the thought that my sister had proved to be smarter than me once again."}]}]}, {"word": "receive", "poses": [{"pos": "verb", "senses": [{"sense": "to get something that someone has given or sent to you", "level": "A2", "dict_examp": "Occasionally, he still receives letters from fans.", "lear_examp": "I also received many other presents."}, {"sense": "to react to a suggestion or piece of work in a particular way", "level": "C1", "dict_examp": "His first book was not well received.", "lear_examp": "The English lessons in the mornings were well received but I wonder if it is possible to get more variety?"}]}]}, {"word": "recent", "poses": [{"pos": "adjective", "senses": [{"sense": "happening or starting from a short time ago", "level": "B1", "dict_examp": "Is that a recent photo?", "lear_examp": "Dear John, Thank you for your recent letter."}]}]}, {"word": "recognition", "poses": [{"pos": "noun", "senses": [{"sense": "when you accept that something is true or real", "level": "C2", "dict_examp": "There is a growing recognition of the scale of the problem.", "lear_examp": "We easily become seduced by the false image of a perfect world of ads that makes us a part of it as long as we purchase more things with no sense of recognition between a real and a false need."}, {"sense": "when someone gets praise, respect or thanks for  something good they have done", "level": "C2", "dict_examp": "Ellen gained recognition for her outstanding work.", "lear_examp": "What they are after, is recognition in their work but not so much for the work itself, but for what comes after recognition, which is a rise in the salary!"}, {"sense": "when you know something or someone because you have seen or experienced them before", "level": "C2", "dict_examp": "I waved at her, but she showed no sign of recognition.", "lear_examp": "Everything had changed out of all recognition and bore no resemblance to the house he had entered a few minutes ago."}]}]}, {"word": "reassure", "poses": [{"pos": "verb", "senses": [{"sense": "to say something to stop someone from worrying", "level": "C1", "dict_examp": "He reassured me that I would be paid soon.", "lear_examp": "Making my own decisions gives me much stress because I am always so scared of the results and I need to be reassured that I am doing the right thing all the time."}]}]}, {"word": "recharge", "poses": [{"pos": "verb", "senses": [{"sense": "to fill a battery with electricity so that it can work again", "level": "C1", "dict_examp": "You can recharge these batteries.", "lear_examp": "After buying your mobile phone, it is important to know that it can't be used for an unlimited time. It will have to be recharged and, in the end, it will let you down when most needed."}, {"sense": "to have a period of rest and relaxation so that you feel energetic again", "level": "C2", "dict_examp": "She took a trip to the south of France to recharge her batteries.", "lear_examp": "It is a very effective way in which we could rejuvenate ourselves and recharge our batteries in order to face the difficulties of the daily routine."}]}]}, {"word": "recently", "poses": [{"pos": "adverb", "senses": [{"sense": "not long ago, or at a time that started not long ago", "level": "B1", "dict_examp": "Have you seen any good films recently?", "lear_examp": "My grandparents, who recently moved to Spain, were sending me a plane ticket so that I could go there for a visit."}]}]}, {"word": "receipt", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of paper that proves that you have received goods or money", "level": "A2", "dict_examp": "Could I have a receipt?", "lear_examp": "Fortunately I had kept the receipts and could show them to him."}, {"sense": "the act of receiving something", "level": "B2", "dict_examp": "Items must be returned within fourteen days of receipt.", "lear_examp": ""}]}]}, {"word": "recollect", "poses": [{"pos": "verb", "senses": [{"sense": "to remember something", "level": "C2", "dict_examp": "I didn't recollect having seen him.", "lear_examp": "I am able to recollect only one single family gathering I did not especially take to."}]}]}, {"word": "recommend", "poses": [{"pos": "verb", "senses": [{"sense": "to say that someone or something is good or suitable for a particular purpose", "level": "B1", "dict_examp": "Can you recommend a good hotel?", "lear_examp": "I recommend the city of Porto Alegre."}, {"sense": "to advise someone that something should be done", "level": "B2", "dict_examp": "The committee recommended that we increase our fund-raising efforts.", "lear_examp": "I recommend that you apply to work at the festival and you will have a great time!"}]}]}, {"word": "rebel", "poses": [{"pos": "noun", "senses": [{"sense": "someone who fights against the government in their country, especially a soldier", "level": "B2", "dict_examp": "The rebels took over the capital and set up a new government.", "lear_examp": "Suddenly, the police came onto the train, and killed all the rebels."}]}, {"pos": "verb", "senses": [{"sense": "to refuse to obey rules that you disagree with or do not like", "level": "B2", "dict_examp": "Children often  rebel against eating certain foods - Rory won't eat vegetables.", "lear_examp": "His brother was never kind with her and she always wanted to rebel."}]}]}, {"word": "rebellious", "poses": [{"pos": "adjective", "senses": [{"sense": "refusing to obey rules because you do not like authority", "level": "C1", "dict_examp": "a rebellious teenager", "lear_examp": "\"It was impossible for me to become submissive - I must have been rebellious from my very birth\", she recalls."}]}]}, {"word": "recall", "poses": [{"pos": "verb", "senses": [{"sense": "to remember something", "level": "B2", "dict_examp": "I couldn't recall our instructor's name.", "lear_examp": "Right now, I can't recall much of that phone call."}]}]}, {"word": "reckless", "poses": [{"pos": "adjective", "senses": [{"sense": "doing something dangerous and not caring about what might happen", "level": "C2", "dict_examp": "reckless driving", "lear_examp": "And, not to mention all the litter they leave behind, they also damage valuable rock formations or cliff faces through reckless climbing attempts."}]}]}, {"word": "recipe", "poses": [{"pos": "noun", "senses": [{"sense": "a list of foods and a set of instructions telling you how to cook something", "level": "B1", "dict_examp": "Do you know a good recipe for a multigrain bread?", "lear_examp": "Actually I am going to bring with me some delicious recipes that you are going to be surprised by."}]}]}, {"word": "recreational", "poses": [{"pos": "adjective", "senses": [{"sense": "used for recreation", "level": "C2", "dict_examp": "recreational activities/facilities", "lear_examp": "There are few schools in the countryside and only basic recreational facilities, whereas the cities possess many schools, fully staffed, universities and many opportunities for recreation of every kind."}]}]}, {"word": "referee", "poses": [{"pos": "noun", "senses": [{"sense": "a person who is in charge of a sports game and who makes certain that the rules are followed", "level": "B2", "dict_examp": "I think the referee made the wrong decision.", "lear_examp": "Due to my back injury, I could not train and play with my team, so it would be a good idea to be a referee."}]}]}, {"word": "refer", "poses": [{"pos": "verb", "senses": [{"sense": "to talk or write about someone or something, especially briefly", "level": "B2", "dict_examp": "I don’t know which of his sisters he was referring to.", "lear_examp": "In your book you refer to the Hotel Astrid but they  decided to close it last year."}]}]}, {"word": "rectangular", "poses": [{"pos": "adjective", "senses": [{"sense": "shaped like a rectangle, with four sides and four 90° angles", "level": "B2", "dict_examp": "a rectangular area of grass", "lear_examp": "The room is rectangular, 4 times 6 metres."}]}]}, {"word": "reflect", "poses": [{"pos": "verb", "senses": [{"sense": "If a surface such as a mirror or water reflects something, you can see the image of that thing in the mirror, water, etc.", "level": "B2", "dict_examp": "He saw himself reflected in the window.", "lear_examp": "We could see a little from the light coming from the moon that was reflected in a mirror."}, {"sense": "to show or be a sign of something", "level": "B2", "dict_examp": "The statistics reflect a change in people's spending habits.", "lear_examp": "Your description of the people, their everyday life, their characters and their friendliness reflects that you really had an excellent time here."}, {"sense": "to think in a serious and careful way", "level": "B2", "dict_examp": "When she retired, she felt she needed time to reflect on what she would do next.", "lear_examp": "Then I reflected on his words: he had just said that he loved me."}]}]}, {"word": "red", "poses": [{"pos": "adjective", "senses": [{"sense": "being the same color as blood", "level": "A1", "dict_examp": "red lipstick", "lear_examp": "Opposite the second bus stop is my house with a red door."}, {"sense": "Red wine is made from black grapes.", "level": "A2", "dict_examp": "We ordered a bottle of red wine.", "lear_examp": "You can bring red wine, if you want, because we will be eating beef."}, {"sense": "describes hair which is an orange-brown color", "level": "A2", "dict_examp": "Both children have red hair.", "lear_examp": "Cassie, that beautiful girl with red hair, will come to it."}, {"sense": "If someone goes red, their face becomes red because they are embarrassed or angry.", "level": "B2", "dict_examp": "He kissed her on the cheek and she went bright red.", "lear_examp": "When Paul saw the girl who had blond hair and bluish eyes, his face suddenly went red."}]}, {"pos": "noun", "senses": [{"sense": "the color of blood", "level": "A2", "dict_examp": "She uses a lot of reds and pinks in her paintings.", "lear_examp": "Hey, Robbie... about that painting we're going to do in my bedroom: I've decided to use red!"}]}]}, {"word": "recycle", "poses": [{"pos": "verb", "senses": [{"sense": "to collect used paper, glass, plastic, etc., and put if through a process so that it can be used again", "level": "B1", "dict_examp": "We recycle all our newspapers and bottles.", "lear_examp": "The project is about collecting cans to recycle."}]}]}, {"word": "recycling", "poses": [{"pos": "noun", "senses": [{"sense": "when paper, glass, plastic, etc., is put through a process so that it can be used again", "level": "B1", "dict_examp": "ways to encourage recycling", "lear_examp": "To respect the environment they have to understand that recycling is the best and cheapest way to get a better environment without pollution."}, {"sense": "materials such as paper, glass, and plastic that you collect to be recycled", "level": "B2", "dict_examp": "We put out our recycling for pickup on Tuesdays.", "lear_examp": "Do you ever try to save water and electricity? And do you put the rubbish and recycling things separately?"}]}]}, {"word": "redistribute", "poses": [{"pos": "verb", "senses": [{"sense": "to share money, land, power, etc. between people in a different way from before", "level": "C2", "dict_examp": "to redistribute wealth", "lear_examp": "The challenge our governments face now is how to redistribute wealth and how to provide the opportunity for all to exercise their right to work."}]}]}, {"word": "reduction", "poses": [{"pos": "noun", "senses": [{"sense": "when something is reduced", "level": "B2", "dict_examp": "a reduction in traffic", "lear_examp": "As for the prices, they are reasonable and you can have a reduction if your group is over 16 people."}]}]}, {"word": "recruitment", "poses": [{"pos": "noun", "senses": [{"sense": "the process of finding people to work for a company or become a new member of an organization", "level": "C1", "dict_examp": "The recession has forced a lot of companies to cut down on staff recruitment.", "lear_examp": "This is mainly due to the recent recruitment of office personnel in our department."}]}]}, {"word": "rectangle", "poses": [{"pos": "noun", "senses": [{"sense": "a shape with four 90° angles and four sides, with opposite sides of equal length and two sides longer than the other two", "level": "C1", "dict_examp": "The garden is in the shape of a rectangle.", "lear_examp": ""}]}]}, {"word": "recover", "poses": [{"pos": "verb", "senses": [{"sense": "to become healthy or happy again after an illness, injury, or period of sadness", "level": "B1", "dict_examp": "It took a long time to recover after my knee surgery.", "lear_examp": "Dear Teacher, I'm sorry but I can't be at your next class because I'm recovering from an illness and my doctor said that I should stay home."}, {"sense": "If a system or situation recovers, it returns to the way it was before something bad happened.", "level": "B2", "dict_examp": "The economy recovered quickly after the election.", "lear_examp": "Lots of effort has been put in and finally our economy is recovering."}]}]}, {"word": "recording", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of music or a speech which has been recorded onto a disc, tape, etc.", "level": "B1", "dict_examp": "I bought a recording of Maria Callas singing Verdi.", "lear_examp": "I've made some recordings for you to listen to."}, {"sense": "the process or business of putting sounds, especially music, onto a disc, magnetic tape, etc., using electronic equipment", "level": "B2", "dict_examp": "a recording studio", "lear_examp": "I loved to sing and I decided to visit all the recording companies."}]}]}, {"word": "redevelopment", "poses": [{"pos": "noun", "senses": [{"sense": "when a place is made more modern by improving old buildings or building new ones", "level": "C1", "dict_examp": "There has been a lot of redevelopment in this area.", "lear_examp": "I would like to invite other people to support this proposal and to try to explain to the opposition how nice our city centre would be after the proposed redevelopment."}]}]}, {"word": "reflection", "poses": [{"pos": "noun", "senses": [{"sense": "the image of something in a mirror, on a shiny surface, etc.", "level": "B2", "dict_examp": "I saw my reflection in the window.", "lear_examp": "Have you seen your reflection in a mirror?"}, {"sense": "something that is a sign or result of a particular situation", "level": "C1", "dict_examp": "The fact that soldiers are on the streets is a reflection of how terrified the government is.", "lear_examp": "Is it really a reflection of the way we live?"}, {"sense": "when you think in a serious and careful way", "level": "C2", "dict_examp": "He paused for reflection before answering my question.", "lear_examp": "Only now, on reflection, do I realize what care, love and thoughtfulness my parents lavished on me."}]}]}, {"word": "recur", "poses": [{"pos": "verb", "senses": [{"sense": "to happen again or many times", "level": "C2", "dict_examp": "The same ideas recur throughout her books.", "lear_examp": "This feeling of feeling trapped recurs often throughout the novel as a way to emphasize the feeling of isolation."}]}]}, {"word": "redevelop", "poses": [{"pos": "verb", "senses": [{"sense": "to make a place more modern by improving old buildings or building new ones", "level": "C1", "dict_examp": "There are plans to redevelop the city's waterfront area.", "lear_examp": "Most of the coastal villages lose their traditional element - their value  - and they become redeveloped in order to be in accord with the growing need to attract people."}]}]}, {"word": "recovery", "poses": [{"pos": "noun", "senses": [{"sense": "when you feel better or happier again after an illness, injury, or period of sadness", "level": "B2", "dict_examp": "She only had the operation last month but she's made a full recovery.", "lear_examp": "I was sorry to hear that you were ill, and my family and I send you our best wishes for a speedy recovery."}, {"sense": "when a system or situation returns to the way it was before something bad happened", "level": "C1", "dict_examp": "economic recovery", "lear_examp": "We are still waiting for the recovery in our economy but the political transformation and economic reforms are very painful for our society."}, {"sense": "when you get back something that was lost or stolen", "level": "C2", "dict_examp": "the recovery of stolen jewels", "lear_examp": "The diary had been lost for a long time but was now found in the attic of the house several years after the woman's death. It was dedicated to John. When John finished reading Lucy's secret diary he let willing tears flow. ... The recovery of the lost diary had broken his heart."}]}]}, {"word": "recruit", "poses": [{"pos": "verb", "senses": [{"sense": "to try to persuade someone to work for a company or to join an organization", "level": "C1", "dict_examp": "", "lear_examp": "Secondly, the coach driver was quite a rude person and, as far as I am concerned, it would be a good idea to pay more attention when recruiting your staff."}]}, {"pos": "noun", "senses": [{"sense": "someone who has recently joined an organization", "level": "C2", "dict_examp": "a new   recruit", "lear_examp": "The CD-Rom will enable a self-training for new recruits with help of Compact Disks with usefull info."}]}]}, {"word": "reduce", "poses": [{"pos": "verb", "senses": [{"sense": "to make something less", "level": "B1", "dict_examp": "to reduce air pollution", "lear_examp": "It is a bit small, but the price was reduced."}, {"sense": "to make someone unhappy or cause them to be in a bad situation", "level": "C2", "dict_examp": "She was reduced to tears by his comments.", "lear_examp": "She was also very hard with stubborn witnesses, reducing them to tears, or pumping them dry of information where necessary."}, {"sense": "to destroy something, especially something that has been built", "level": "C2", "dict_examp": "The earthquake reduced the city to rubble.", "lear_examp": ""}]}]}, {"word": "record", "poses": [{"pos": "verb", "senses": [{"sense": "to store sounds or pictures using electronic equipment, a camera, etc., so that you can listen to them or see them again", "level": "A2", "dict_examp": "They've just recorded a new album.", "lear_examp": "The best thing about the phone is it has a camera and it can record anything."}, {"sense": "to write down information or store it on a computer so that it can be used in the future", "level": "B2", "dict_examp": "He recorded details of their conversation in his diary.", "lear_examp": "Another way to highlight the importance of books is to consider them as the \"depots\" of wisdom and knowledge that exist and have been recorded since the beginning of History."}]}, {"pos": "noun", "senses": [{"sense": "a song or music which has been recorded and which is available for the public to buy", "level": "B1", "dict_examp": "I like their new record.", "lear_examp": "My room is comfortable but a bit untidy around my stereo because in spite of having a lot of records and CDs, I don't have any shelf for them so this is why I'm going to buy a new shelf."}, {"sense": "the best, biggest, longest, tallest, etc.", "level": "B1", "dict_examp": "He ran the 100 meters in 9.79 seconds and broke the world record.", "lear_examp": "For instance, at the moment we hear a lot about Laure Manaudou - she has won many gold medals in swimming, and any time she takes part in a competition, she tends to go faster than her previous personal time record or even faster than the world record!!"}, {"sense": "information that is written on paper or stored on computer so that it can be used in the future", "level": "B2", "dict_examp": "medical/dental records", "lear_examp": "Finally, I have to mention that according to the records from the box office, they sold over 5,000 tickets for this music festival."}]}]}, {"word": "recreate", "poses": [{"pos": "verb", "senses": [{"sense": "to make something exist or happen again", "level": "C1", "dict_examp": "They plan to recreate a typical English village in Japan.", "lear_examp": "We want people whose skills with a laser high-accuracy enamel paint brush could only be surpassed by the skill of those men in our past who wielded the original weapons we are now recreating."}]}]}, {"word": "rectify", "poses": [{"pos": "verb", "senses": [{"sense": "to correct something or change it so that it is acceptable", "level": "C1", "dict_examp": "The government has promised to rectify the situation.", "lear_examp": "I also hope as far as the article is concerned that you will kindly rectify the defamatory information revealed in the statement."}]}]}, {"word": "reference", "poses": [{"pos": "noun", "senses": [{"sense": "relating to something", "level": "B2", "dict_examp": "His comments were in reference to a question someone asked.", "lear_examp": "Secondly, in reference to the café, I think that more items could be included on the menu, such as sandwiches, salads and some sort of appetizers."}, {"sense": "something such as a name or a book title given in a piece of writing that tells you where the writer's information came from", "level": "B2", "dict_examp": "There's the usual list of references at the back of the book.", "lear_examp": "I have information, and historical references in my collection, and I will be glad to share it with other members."}, {"sense": "a letter that is written by someone who knows you, to say why you are a good person  for a particular job, school, honor, etc.", "level": "B2", "dict_examp": "My economics professor said he would write/give me a   reference.", "lear_examp": "I am enclosing references from my ex-managers."}]}]}, {"word": "reform", "poses": [{"pos": "noun", "senses": [{"sense": "when changes are made to improve a system, organization, or law, or a change that is made", "level": "C2", "dict_examp": "economic/political reform", "lear_examp": "To sum up, it is obvious that a reform in the educational system is necessary and that the beliefs of what is or is not useful to learn must be reconsidered."}]}, {"pos": "verb", "senses": [{"sense": "to change a system, organization, or law in order to improve it", "level": "C2", "dict_examp": "efforts to reform the education system", "lear_examp": "Dag Hammarskjold made the work of the U N more efficient by reforming its structure."}]}]}, {"word": "refined", "poses": [{"pos": "adjective", "senses": [{"sense": "very polite and showing knowledge of social rules", "level": "C2", "dict_examp": "She's very refined.", "lear_examp": "Not only is Lord Trimingham a noble and refined representative of Edwardian aristocracy, but also he is kind towards Leo."}, {"sense": "improved by many small changes", "level": "C2", "dict_examp": "a refined method", "lear_examp": "Ever more refined technological devices like robots for example have led to the bizarre situation that you can walk through a production hall while work is in progress without seeing any human workers at all."}]}]}, {"word": "recreation", "poses": [{"pos": "noun", "senses": [{"sense": "activities that you do for enjoyment when you are not working", "level": "B2", "dict_examp": "Emma's only form of recreation seems to be shopping.", "lear_examp": "Is there any gym or other recreation facilities available in the Magnet Hotel?"}]}]}, {"word": "referendum", "poses": [{"pos": "noun", "senses": [{"sense": "an occasion when all the people in a country can vote in order to show their opinion about a political question", "level": "C2", "dict_examp": "The government has promised a referendum on voting reform.", "lear_examp": "Everybody was speaking about the referendum."}]}]}, {"word": "refine", "poses": [{"pos": "verb", "senses": [{"sense": "to improve an idea, method, system, etc. by making small changes", "level": "C2", "dict_examp": "The engineers spent months refining the software.", "lear_examp": "Zucchero Fornaciari was discovered ten years ago in a national show and during this period of time has sharpened and refined his music."}]}]}, {"word": "recycled", "poses": [{"pos": "adjective", "senses": [{"sense": "Recycled paper, glass, plastic, etc. has been used before and put through a process so that it can be used again.", "level": "B1", "dict_examp": "recycled paper/plastic", "lear_examp": "Using recycled glass and paper not only saves resources, but also a lot of energy."}]}]}, {"word": "regularly", "poses": [{"pos": "adverb", "senses": [{"sense": "often", "level": "B1", "dict_examp": "Accidents regularly occur on this curve in the road.", "lear_examp": "But I regularly watch the news."}, {"sense": "at the same time each day, week, month, etc.", "level": "B1", "dict_examp": "They meet regularly - usually once a week.", "lear_examp": "I usually go out with my friends to buy a lot of clothes, regularly on weekends."}]}]}, {"word": "refreshing", "poses": [{"pos": "adjective", "senses": [{"sense": "different and interesting", "level": "C1", "dict_examp": "a refreshing change", "lear_examp": "Once you master the language quite well, listening to a news broadcast is a refreshing challenge that may require some serious concentration on your behalf."}, {"sense": "making you feel less hot or tired", "level": "C1", "dict_examp": "a refreshing shower/swim", "lear_examp": "Last summer, I got a chance to visit there, and my breath was taken away by its soft sand, refreshing breeze, flocks of seagulls and poetic sunsets."}]}]}, {"word": "region", "poses": [{"pos": "noun", "senses": [{"sense": "a particular area in a country or the world", "level": "B1", "dict_examp": "the semi-desert regions of Australia", "lear_examp": "The Northeast region is famous for its white sandy beaches which are fringed with coconut trees."}, {"sense": "approximately", "level": "C1", "dict_examp": "It probably cost somewhere in the region of £900.", "lear_examp": "I am willing to pay rent in the region of £1000 to £1200 monthly."}]}]}, {"word": "regret", "poses": [{"pos": "verb", "senses": [{"sense": "to feel sorry about a situation, especially something that you wish you had not done", "level": "B1", "dict_examp": "He regretted his decision to leave school.", "lear_examp": "I'm glad to receive your letter and know about your intention to come to Brazil.  I think you've made a nice choice and you won't regret it."}, {"sense": "used to say that you are sorry that you have to tell someone about a situation", "level": "B2", "dict_examp": "We regret to inform you that the application has been refused.", "lear_examp": "Dear editor, I regret to inform you about some untrue information which was given in the last issue of your magazine."}]}, {"pos": "noun", "senses": [{"sense": "a feeling of sadness about a situation, often something that you wish you had not done", "level": "B2", "dict_examp": "I quit school at 18, but I've had a great life and I have no regrets.", "lear_examp": "Anyway, it was too late for regrets."}]}]}, {"word": "rehearsal", "poses": [{"pos": "noun", "senses": [{"sense": "a time when all the people involved in a play, dance, etc. practise in order to prepare for a performance", "level": "B2", "dict_examp": "We only had one rehearsal before the show.", "lear_examp": "I helped to organise the rehearsals of the different groups who were going to play in the concert."}]}]}, {"word": "regain", "poses": [{"pos": "verb", "senses": [{"sense": "to get something back again", "level": "B2", "dict_examp": "The party has regained control of Congress.", "lear_examp": "He regained his health in a month, and helped police to capture the loan gang."}]}]}, {"word": "regulate", "poses": [{"pos": "verb", "senses": [{"sense": "to control an activity or process, especially by using rules", "level": "C1", "dict_examp": "laws regulating advertising", "lear_examp": "I think in the near future we will find a way to regulate and control the internet and prevent criminals from using it."}, {"sense": "to control the speed, temperature, etc. of something", "level": "C1", "dict_examp": "Babies find it difficult to regulate their body temperature.", "lear_examp": "I expressed a wish to the driver to regulate the temperature, but he was extremely rude to me as well as to other passengers."}]}]}, {"word": "refrain", "poses": [{"pos": "verb", "senses": [{"sense": "to stop yourself from doing something", "level": "C2", "dict_examp": "Please refrain from talking during the performance.", "lear_examp": "I believe that people who have civil and graceful manners and who refrain from being too assertive end up being more successful and powerful than those who try to exert authority at any given moment."}]}]}, {"word": "regional", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to a particular area in a country or the world", "level": "B2", "dict_examp": "a regional accent/dialect", "lear_examp": "Among these events, you'll be able to visit the annual regional food festival, in which you'll enjoy some delicious meals and stupendous cakes."}]}]}, {"word": "registration", "poses": [{"pos": "noun", "senses": [{"sense": "when a name or information is recorded on an official list", "level": "B1", "dict_examp": "voter registration", "lear_examp": "We had to pay some money for the registration in the first lesson."}]}]}, {"word": "rehearse", "poses": [{"pos": "verb", "senses": [{"sense": "to practise a play, dance, etc. in order to prepare for a performance", "level": "C1", "dict_examp": "We usually rehearse on Wednesdays.", "lear_examp": "I can't count how many nights I spent studying and studying for difficult exams, rehearsing for presentations and so on."}]}]}, {"word": "refund", "poses": [{"pos": "noun", "senses": [{"sense": "an amount of money that is given back to you, especially because you are not happy with something you have bought", "level": "B1", "dict_examp": "The airline was responsible for the cancellation and we expect to get/receive a full refund.", "lear_examp": "I am expecting a full refund and compensation for the discomfort I have suffered."}]}]}, {"word": "register", "poses": [{"pos": "verb", "senses": [{"sense": "to put information about someone or something, especially a name, on an official list", "level": "B1", "dict_examp": "Please register with the conference organizers when you arrive.", "lear_examp": "I registered for a \"green card\" six months ago."}]}]}, {"word": "reign", "poses": [{"pos": "noun", "senses": [{"sense": "a period of time when a king or queen rules a country", "level": "C1", "dict_examp": "the reign of Henry VIII", "lear_examp": "If I had the incredible opportunity to travel back in time and place, I would probably choose to go to Egypt during the reign of the Pharaohs to gain an insight into how this magical place really was so long ago."}]}, {"pos": "verb", "senses": [{"sense": "to be the king or queen of a country", "level": "C2", "dict_examp": "Queen Victoria reigned for 64 years.", "lear_examp": "I would be most of my free time playing with them, making them feel I am their friend not the king who has to reign over his land and possessions."}, {"sense": "to be the main feeling or quality in a situation", "level": "C2", "dict_examp": "Chaos reigned as angry protesters hammered on the doors.", "lear_examp": "Terror reigned during our singing courses."}]}]}, {"word": "reject", "poses": [{"pos": "verb", "senses": [{"sense": "to refuse to accept or agree with something", "level": "B2", "dict_examp": "The committee rejected the proposal.", "lear_examp": "She rejected the proposal for a long, long time, but she finally married the Crown Prince 6 years ago."}, {"sense": "to refuse to accept someone for a job, a place at a school or in a course, etc.", "level": "B2", "dict_examp": "She applied to Princeton University but was rejected.", "lear_examp": ""}, {"sense": "to not give someone the love or attention they were expecting", "level": "B2", "dict_examp": "These students  felt rejected by their teachers.", "lear_examp": "\"So you're Michael, the mis-understood artist, rejected by his family and friends,\" the man growled."}]}]}, {"word": "refrigerator", "poses": [{"pos": "noun", "senses": [{"sense": "a large container that uses electricity to keep food cold", "level": "A1", "dict_examp": "Put the eggs and butter in the refrigerator as soon as you get home.", "lear_examp": "I think I left my cell phone in the kitchen when I fell on the slippery floor. Search near the refrigerator, that's where it must be."}]}]}, {"word": "regular", "poses": [{"pos": "adjective", "senses": [{"sense": "usual or ordinary", "level": "A2", "dict_examp": "I couldn't see my regular dentist.", "lear_examp": "You can use a regular t-shirt and shorts."}, {"sense": "happening or doing something often, especially at the same time every week, year, etc.", "level": "B1", "dict_examp": "a regular customer", "lear_examp": "His girlfriend is a regular member of that new club which I have joined."}, {"sense": "following the usual rules or patterns in grammar", "level": "B1", "dict_examp": "\"Talk\" is a regular verb but \"go\" is not.", "lear_examp": ""}, {"sense": "being a standard size", "level": "B1", "dict_examp": "a burger and regular fries", "lear_examp": ""}, {"sense": "repeated with the same amount of time or space between one and the next", "level": "B2", "dict_examp": "I suggested that we meet on a regular basis.", "lear_examp": "I'm willing to take care of your telescopes and to carry out a service on them at regular intervals so that they will work perfectly for many years."}]}]}, {"word": "regime", "poses": [{"pos": "noun", "senses": [{"sense": "a system of government or other control, especially one that people do not approve of", "level": "C2", "dict_examp": "the former Communist regime", "lear_examp": "To my mind this film is highly recommendable to Germans who want to learn more about their history and to everybody who wants to learn about the consequences of a totalitarian political regime."}]}]}, {"word": "regardless", "poses": [{"pos": "adverb", "senses": [{"sense": "without being affected or influenced by anything else that happens or exists", "level": "C1", "dict_examp": "This job is open to all, regardless of previous experience.", "lear_examp": "People listen to music regardless of their age group or their social status."}, {"sense": "without being stopped or influenced by something", "level": "C2", "dict_examp": "Mr Redwood claimed he would carry on with his campaign regardless.", "lear_examp": ""}]}]}, {"word": "refuse", "poses": [{"pos": "verb", "senses": [{"sense": "to say that you will not do or accept something", "level": "B1", "dict_examp": "Cathy refuses to walk instead of riding her bike to school.", "lear_examp": "My grandmother needs someone to take her to have an exam at the hospital.  As I am the only person who is available to do that, I couldn't refuse."}]}]}, {"word": "reinforce", "poses": [{"pos": "verb", "senses": [{"sense": "to make an existing opinion, feeling or idea stronger", "level": "C1", "dict_examp": "His behaviour merely reinforced my dislike of him.", "lear_examp": "The first unfavourable impression was reinforced the moment we arrived at the hotel."}, {"sense": "to make something stronger", "level": "C2", "dict_examp": "a security door reinforced by/with steel bars", "lear_examp": "If it is not possible, could not we get some money to be able to protect ourselves better against this unbearable noise, by reinforcing our windows."}]}]}, {"word": "regulation", "poses": [{"pos": "noun", "senses": [{"sense": "an official rule that controls how something is done", "level": "B2", "dict_examp": "building/safety/traffic regulations", "lear_examp": "I would like the government to impose strict rules and regulations on capturing animals."}, {"sense": "when a process or activity is controlled", "level": "C1", "dict_examp": "government regulation of interest rates", "lear_examp": "Proper regulation of program contents, monitoring children's time watching television and using television as a media to promote other leisure activities are factors which could reduce but at the same time make more efficient the time spent in front of the television."}]}]}, {"word": "reform", "poses": [{"pos": "noun", "senses": [{"sense": "when changes are made to improve a system, organization, or law, or a change that is made", "level": "C2", "dict_examp": "economic/political reform", "lear_examp": "To sum up, it is obvious that a reform in the educational system is necessary and that the beliefs of what is or is not useful to learn must be reconsidered."}]}, {"pos": "verb", "senses": [{"sense": "to change a system, organization, or law in order to improve it", "level": "C2", "dict_examp": "efforts to reform the education system", "lear_examp": "Dag Hammarskjold made the work of the U N more efficient by reforming its structure."}]}]}, {"word": "refresh", "poses": [{"pos": "verb", "senses": [{"sense": "to make you feel less hot or tired", "level": "C1", "dict_examp": "A cool drink should refresh you.", "lear_examp": "The bar is open from 7 a.m. to 11 p.m. When you are in my house, refresh yourself, help yourself from the fridge, feel at your ease, and then call me by phone."}, {"sense": "to make something more up-to-date or to make it look newer or more attractive", "level": "C1", "dict_examp": "Old furniture can be refreshed with a coat of paint.", "lear_examp": "The magazine is totally up-to-date with extreme question papers in which the reader has the opportunity to test or refresh his/her knowledge."}]}]}, {"word": "refusal", "poses": [{"pos": "noun", "senses": [{"sense": "when someone refuses to do or accept something", "level": "C1", "dict_examp": "Her refusal to cooperate didn't help her case.", "lear_examp": "The refusal of students to use the college canteen led to a demonstration that was held at the main entrance."}]}]}, {"word": "refugee", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has been forced to leave their country, especially because of a war", "level": "B2", "dict_examp": "a refugee camp", "lear_examp": "Harry asked Martins to come to Vienna to write an article about the refugees there."}]}]}, {"word": "regard", "poses": [{"pos": "verb", "senses": [{"sense": "to think of someone or something in a particular way", "level": "B2", "dict_examp": "She is generally regarded as one of the greatest singers this century.", "lear_examp": "Certainly, riding a bicycle is regarded as a healthy way of traveling and I do agree with it."}]}, {"pos": "noun", "senses": [{"sense": "greetings", "level": "B1", "dict_examp": "Best regards", "lear_examp": "I hope this information helps you to make your decision. Best regards,"}, {"sense": "relating to something", "level": "B2", "dict_examp": "I am writing in regard to your letter of June 24th.", "lear_examp": "I am writing to you with regard to the International Arts Festival that was held recently."}]}]}, {"word": "refuge", "poses": [{"pos": "noun", "senses": [{"sense": "protection from danger or unpleasant conditions", "level": "C2", "dict_examp": "We took refuge from the storm in an old barn.", "lear_examp": "From the very moment when people from GDR started to take refuge in the BRD's embassy in Prague, my friend and I grew more and more excited."}]}]}, {"word": "refreshments", "poses": [{"pos": "noun", "senses": [{"sense": "food and drinks that are available at a meeting, event, on a trip, etc.", "level": "B1", "dict_examp": "Refreshments are available in the lobby.", "lear_examp": "During the show, we had some refreshments and popcorn."}]}]}, {"word": "regarding", "poses": [{"pos": "preposition", "senses": [{"sense": "about", "level": "B1", "dict_examp": "I have a question regarding your last statement.", "lear_examp": "I just got your letter regarding the exhibition you visited."}]}]}, {"word": "rejection", "poses": [{"pos": "noun", "senses": [{"sense": "when you refuse to accept or agree with something", "level": "C2", "dict_examp": "Their rejection of the peace plan is very disappointing for the government.", "lear_examp": "As a consequence, unemployment can lead to rejection of social and economic order and cause strikes, demonstrations and other forms of social dissatisfaction."}, {"sense": "a letter that says you have not been successful in getting a job, a place at college, etc", "level": "C2", "dict_examp": "I've sent off ten applications but I've only had rejections so far.", "lear_examp": ""}, {"sense": "when someone does not get the love, attention or success they were expecting", "level": "C2", "dict_examp": "a feeling of rejection", "lear_examp": "One would say she was a true Rapunzel, and oh, how he wanted to climb up to her; but fear of rejection made him completely motionless."}]}]}, {"word": "reluctant", "poses": [{"pos": "adjective", "senses": [{"sense": "not wanting to do something", "level": "C1", "dict_examp": "Many victims of crime are reluctant to go to the police.", "lear_examp": "However, Spanish husbands are very reluctant to share the housework."}]}]}, {"word": "religious", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to religion", "level": "B2", "dict_examp": "a religious holiday", "lear_examp": "Last but not least, I think people need religious and spiritual support and the family has to be protected and preserved."}, {"sense": "having a strong belief in a religion", "level": "B2", "dict_examp": "He's a very religious man.", "lear_examp": "If you are a religious person, you should get married in a church."}]}]}, {"word": "relentlessly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that never stops or never gets less extreme", "level": "C2", "dict_examp": "They pestered her relentlessly to take them to the seaside.", "lear_examp": "After the killing of the two sensible members of the group, namely Piggy and Simon, Ralph is relentlessly pursued by Jack."}]}]}, {"word": "relevant", "poses": [{"pos": "adjective", "senses": [{"sense": "related or useful to what is happening or being talked about", "level": "B2", "dict_examp": "relevant information", "lear_examp": "I had studied psychology but I couldn't find a job relevant to my studies."}]}]}, {"word": "reliance", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something depends on someone or something else", "level": "C2", "dict_examp": "our increasing reliance on computers", "lear_examp": "The fact that this heavy reliance on technology is often overlooked is a growing source of concern among experts."}]}]}, {"word": "release", "poses": [{"pos": "verb", "senses": [{"sense": "to allow a prisoner to be free", "level": "B2", "dict_examp": "Six hostages were released shortly before noon.", "lear_examp": "It all began when I was released from jail, after a two year conviction for jewel theft."}, {"sense": "to make a record or film available for people to buy or see", "level": "B2", "dict_examp": "The band's latest album will be released next week.", "lear_examp": "He has recently released a new CD on which he spent a lot of time and really made an effort."}]}, {"pos": "noun", "senses": [{"sense": "a musical recording which is made available for the public to buy", "level": "B2", "dict_examp": "Her latest release is a country-western song that she wrote herself.", "lear_examp": "This department store provides the latest cds and dvds, so you are always up to date and never miss new releases."}]}]}, {"word": "relative", "poses": [{"pos": "noun", "senses": [{"sense": "a member of your family", "level": "B1", "dict_examp": "All of these people are my relatives.", "lear_examp": "After that there'll be a big party with all your relatives and friends."}]}, {"pos": "adjective", "senses": [{"sense": "being judged or measured in comparison with something else", "level": "C1", "dict_examp": "the relative prosperity of the West", "lear_examp": "In order to make myself clear, let me tell you that as an individual I consider myself a dreamer and in the transition from my late teens to my relative maturity I've considered the words of Hesse in his novel \"Gertrude\": \"The difference between our youth and maturity is that in the first stage we are selfish in all our feelings and actions, while in maturity our top priority is everyone else but ourselves...\""}, {"sense": "when compared to something else", "level": "C2", "dict_examp": "The economy has been declining relative to other countries.", "lear_examp": "This seems true at first sight but when one takes into account the different sizes of population, it becomes clear that every country is more or less equally successful relative to its population."}]}]}, {"word": "religion", "poses": [{"pos": "noun", "senses": [{"sense": "the belief in a god or gods, or a particular system of belief in a god or gods", "level": "B1", "dict_examp": "the Christian/Muslim/Buddhist religion", "lear_examp": "I think it's quite interesting for me, because I like the history of religion."}]}]}, {"word": "relieved", "poses": [{"pos": "adjective", "senses": [{"sense": "happy that something unpleasant has not happened or has ended", "level": "B2", "dict_examp": "I'm just relieved that she's safe and well.", "lear_examp": "She actually felt extremely relieved."}]}]}, {"word": "reliability", "poses": [{"pos": "noun", "senses": [{"sense": "how reliable something is", "level": "C1", "dict_examp": "I can't vouch for the reliability of these figures.", "lear_examp": "Our customers appreciate in particular the reliability of our products and most of them are prepared to pay a premium price for a high-quality product."}]}]}, {"word": "relaxing", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel relaxed", "level": "B1", "dict_examp": "a relaxing bath", "lear_examp": "Yoga is a very relaxing activity but not boring at all!"}]}]}, {"word": "relax", "poses": [{"pos": "verb", "senses": [{"sense": "to become happy and comfortable because nothing is worrying you, or to make someone do this", "level": "B1", "dict_examp": "I find it difficult to relax.", "lear_examp": "If you want to relax, Buenos Aires is near a lot of beautiful beaches."}, {"sense": "If a part of your body relaxes, it becomes less stiff, and if you relax it, you make it become less stiff.", "level": "C1", "dict_examp": "Try these exercises to relax your neck muscles.", "lear_examp": ""}]}]}, {"word": "relocate", "poses": [{"pos": "verb", "senses": [{"sense": "to move to another place", "level": "C1", "dict_examp": "The company relocated to Tokyo.", "lear_examp": "Well, as you know I was looking for a new job and for that reason I had to relocate to London in November."}]}]}, {"word": "relatively", "poses": [{"pos": "adverb", "senses": [{"sense": "quite good/bad/cheap, etc. as compared with other similar things", "level": "B2", "dict_examp": "This stereo is relatively inexpensive.", "lear_examp": "The water temperature of the outdoor pool is relatively cold because it's filled with natural, mountain springwater."}]}]}, {"word": "relation", "poses": [{"pos": "noun", "senses": [{"sense": "someone who belongs to the same family as you", "level": "B1", "dict_examp": "On our trip, we visited friends and relations on both sides of the family.", "lear_examp": "I began to play against my relations and friends but I soon found that I could beat them without any difficulty."}, {"sense": "the way in which two people or groups of people feel and behave toward each other", "level": "B2", "dict_examp": "Relations between the parties are  strained and an end to negotiations isn't in sight.", "lear_examp": "The second film is \"Alice\" directed by the world's most respected man within the movie business - of course Woody Allen. Again the good old fellow is totally fascinated by people in general, human relations and reactions."}, {"sense": "a connection between two or more things", "level": "B2", "dict_examp": "There was little relation between the book and the movie.", "lear_examp": "Another drawback is the relation between space and time."}, {"sense": "when compared with something", "level": "B2", "dict_examp": "Salaries are low in relation to the cost of living.", "lear_examp": "I think television has several advantages but also disadvantages in relation to books."}, {"sense": "about or relating to something", "level": "B2", "dict_examp": "I'd like to ask you something in relation to what you said earlier.", "lear_examp": "In relation to last month's social program, the sightseeing tour of London was divine, although we didn't get to see the entire city."}]}]}, {"word": "relish", "poses": [{"pos": "verb", "senses": [{"sense": "to enjoy something", "level": "C2", "dict_examp": "I don't relish the thought of a twelve-hour flight.", "lear_examp": "But as we gradually grow up and turn into adults, the dependence lessens and we relish our freedom."}]}, {"pos": "noun", "senses": [{"sense": "enjoyment", "level": "C2", "dict_examp": "He had baked a cake which the children now ate with relish.", "lear_examp": "My expert knowledge of the latter subject was completely ignored, which left me with the former, the most dreaded of all subjects. This was discussed with relish and the operations were described in such vivid detail that I had to excuse myself and leave the room, because I started to feel faint."}, {"sense": "a sauce that you put on food to give it more taste", "level": "C2", "dict_examp": "I ate the burger with some relish.", "lear_examp": "There are trays of cut lettuce, leaf lettuce, cut tomato, diced tomato, all kinds of relishes, cheese with bacon spread, barbecue, or whatever you like."}]}]}, {"word": "relaxed", "poses": [{"pos": "adjective", "senses": [{"sense": "feeling happy and calm because nothing is worrying you", "level": "B1", "dict_examp": "She looked relaxed and happy walking along with her two boys.", "lear_examp": "It makes me more relaxed."}, {"sense": "A relaxed situation or place is comfortable and informal.", "level": "B2", "dict_examp": "There was a very relaxed atmosphere at the party.", "lear_examp": "I love this place because it has a relaxed atmosphere and all the staff are very friendly."}]}]}, {"word": "relieve", "poses": [{"pos": "verb", "senses": [{"sense": "to make pain or a bad feeling less severe", "level": "C2", "dict_examp": "Breathing exercises can help to relieve stress.", "lear_examp": "Now science gets the blame for being able to do so much, but not enough to relieve the psychological pain."}, {"sense": "to take something away from someone", "level": "C2", "dict_examp": "Let me relieve you of your luggage.", "lear_examp": "There is nothing they can do on the outside now and they are relieved of their responsibilities."}]}]}, {"word": "reliant", "poses": [{"pos": "adjective", "senses": [{"sense": "to depend on someone or something", "level": "C2", "dict_examp": "I don't want to be reliant on anybody.", "lear_examp": "To conclude one can say that the person should be able to operate on his own and be reliant on himself."}]}]}, {"word": "related", "poses": [{"pos": "adjective", "senses": [{"sense": "If people are related, they belong to the same family.", "level": "B2", "dict_examp": "Of course Elise and Linda are related to each other – they’re cousins.", "lear_examp": "Although they're related to each other, they have rather different characters."}, {"sense": "connected", "level": "B2", "dict_examp": "We discussed unemployment and related  issues.", "lear_examp": "It is also related to my research project."}]}]}, {"word": "relate", "poses": [{"pos": "verb", "senses": [{"sense": "to be connected, or to find or show the connection between two or more things", "level": "C2", "dict_examp": "How do the two proposals relate?", "lear_examp": "They relate in no way to what an actor contributes to a project."}, {"sense": "to tell a story or describe a series of events", "level": "C2", "dict_examp": "He related the story of their journey.", "lear_examp": "It relates the story of Clément Mathieu, who is a supply teacher."}, {"sense": "to be connected to, or to be about someone or something", "level": "C1", "dict_examp": "Please provide all information relating to the claim.", "lear_examp": "And, finally, relating to your concern about the costs of the changes, we think that opening the Centre to the public would surely provide the required funds without having to impose a fee on the students, which would probably result in a radical decrease of their use of the facilities."}, {"sense": "to understand how someone feels", "level": "C1", "dict_examp": "Most teenagers find it hard to relate to their parents.", "lear_examp": "A soap opera should always be dramatic and not produced too \"polished\" or \"clean\" because then people would see it more as a movie, and people never relate as much to a character in a movie as they do to a character played by a good, down-to-earth actor who is apparently struggling as much as everybody else."}]}]}, {"word": "relaxation", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling of being relaxed", "level": "B1", "dict_examp": "He plays the piano for relaxation.", "lear_examp": "In the countryside you can go walking and swimming in the blue sea.  That's very good for relaxation."}]}]}, {"word": "relentless", "poses": [{"pos": "adjective", "senses": [{"sense": "never stopping or getting any less extreme", "level": "C2", "dict_examp": "relentless criticism", "lear_examp": "We have come to the end of a millenium of accelerating and relentless destruction of the environment."}]}]}, {"word": "relevance", "poses": [{"pos": "noun", "senses": [{"sense": "the degree to which something is related or useful to what is happening or being talked about", "level": "C1", "dict_examp": "This point has no relevance to the discussion.", "lear_examp": "One may agree with what has been said or not, but nobody can deny the relevance of the issue, as our future society depends on our present educational system."}]}]}, {"word": "relief", "poses": [{"pos": "noun", "senses": [{"sense": "the good feeling that you have when something unpleasant stops or does not happen", "level": "B2", "dict_examp": "It'll be such a relief when these exams are over.", "lear_examp": "She heard an ambulance siren in the distance and with a sigh of relief, she lost consciousness."}, {"sense": "when something stops hurting you", "level": "C2", "dict_examp": "I'd been trying to sleep to find relief from the pain.", "lear_examp": ""}, {"sense": "money, food, or clothes that are given to people because they need help", "level": "C2", "dict_examp": "an international relief operation", "lear_examp": "In our opinion it is not necessary to practise low-flying because you should take into account that we all live in peace time and the money would be better spent on health or relief agencies."}]}]}, {"word": "relationship", "poses": [{"pos": "noun", "senses": [{"sense": "the way two people or groups feel about and behave toward each other", "level": "B1", "dict_examp": "He has a very good relationship with his father.", "lear_examp": "Then we studied some phrasal verbs and I was supposed to read a text about feelings and relationships."}, {"sense": "a romantic friendship", "level": "B1", "dict_examp": "Are you in a relationship at the moment?", "lear_examp": "He told me that he hopes that someday we could have a boyfriend-girlfriend relationship for real."}, {"sense": "the way in which two things are connected", "level": "B2", "dict_examp": "the relationship between sunburn and skin cancer", "lear_examp": "The relationship between mind and body has been proved by scientists."}]}]}, {"word": "reliable", "poses": [{"pos": "adjective", "senses": [{"sense": "able to be trusted or believed", "level": "B1", "dict_examp": "a  reliable car", "lear_examp": "I got a lot of prizes in school, so I consider myself a hardworking and reliable person."}]}]}, {"word": "rejection", "poses": [{"pos": "noun", "senses": [{"sense": "when you refuse to accept or agree with something", "level": "C2", "dict_examp": "Their rejection of the peace plan is very disappointing for the government.", "lear_examp": "As a consequence, unemployment can lead to rejection of social and economic order and cause strikes, demonstrations and other forms of social dissatisfaction."}, {"sense": "a letter that says you have not been successful in getting a job, a place at college, etc", "level": "C2", "dict_examp": "I've sent off ten applications but I've only had rejections so far.", "lear_examp": ""}, {"sense": "when someone does not get the love, attention or success they were expecting", "level": "C2", "dict_examp": "a feeling of rejection", "lear_examp": "One would say she was a true Rapunzel, and oh, how he wanted to climb up to her; but fear of rejection made him completely motionless."}]}]}, {"word": "renovation", "poses": [{"pos": "noun", "senses": [{"sense": "the act of repairing and decorating a building that is old and in bad condition", "level": "C1", "dict_examp": "They spent all their savings on the renovation of an old cottage.", "lear_examp": "Dear Principal, In response to your memo, I am writing to provide you with some suggestions concerning the renovation of theSports Centre, on behalf of the member of the student committee."}]}]}, {"word": "repay", "poses": [{"pos": "verb", "senses": [{"sense": "to pay back money that you have borrowed", "level": "B2", "dict_examp": "He had to sell his car to repay the loan.", "lear_examp": "We could make a deal, so that I could repay my debts."}, {"sense": "to do something kind for someone who has done something to help you", "level": "B2", "dict_examp": "What can I do to repay you for your kindness?", "lear_examp": "It's always a pleasure to see you and I hope I'll be able to repay your hospitality if you ever come to visit us in Cambridge."}]}]}, {"word": "rent", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of money that you pay to live in a building that someone else owns", "level": "A2", "dict_examp": "I pay a higher rent than the other tenants because my room is bigger.", "lear_examp": "I think I have left my wallet in your house. Please look for it and call me because I have to pay the rent tomorrow."}]}, {"pos": "verb", "senses": [{"sense": "to pay money to live in a building that someone else owns", "level": "A2", "dict_examp": "He'll be renting an apartment until he can find a house to buy.", "lear_examp": "I rent an apartment."}, {"sense": "to pay money to use something for a short time", "level": "A2", "dict_examp": "We could rent a car for the weekend.", "lear_examp": "If you want, you can rent a car."}, {"sense": "to allow someone to pay you money to live in your building", "level": "B1", "dict_examp": "I rented out my house and went travelling for a year.", "lear_examp": "My uncle is trying to rent his house."}]}]}, {"word": "reminder", "poses": [{"pos": "noun", "senses": [{"sense": "something that makes you remember something else", "level": "C1", "dict_examp": "If he forgot to pay his rent, his landlady would send him a reminder.", "lear_examp": "\"Time is precious\" is not interpreted as \"carpe diem\", but rather as a constant reminder of all our duties, that should be done in as little time as possible to prove ourselves effective."}]}]}, {"word": "repair", "poses": [{"pos": "verb", "senses": [{"sense": "to fix something that is broken or damaged", "level": "A2", "dict_examp": "They're repairing the holes in the road at last.", "lear_examp": "I had my car repaired."}, {"sense": "to improve a bad situation", "level": "C2", "dict_examp": "It will take a long time to repair relations between the two countries.", "lear_examp": "The German government was not able to repair the damage caused by the crisis."}]}, {"pos": "noun", "senses": [{"sense": "something that you do to fix something that is broken or damaged", "level": "B1", "dict_examp": "My car is in the garage for repairs.", "lear_examp": "My father sent it to the workshop for repair."}]}]}, {"word": "remote control", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of equipment that is used to control something such as a television or toy from a distance", "level": "B1", "dict_examp": "Have you seen the remote control anywhere?", "lear_examp": "TV - a powerful force that keeps us glued for endless hours every day, unable to press the \"Off\" button on the remote control."}]}]}, {"word": "reorganize", "poses": [{"pos": "verb", "senses": [{"sense": "to organize something again in order to improve it", "level": "C1", "dict_examp": "He's completely reorganized his schedule for the week.", "lear_examp": "I hope that my suggestions will be helpful to you in reorganizing this program."}]}]}, {"word": "repeatedly", "poses": [{"pos": "adverb", "senses": [{"sense": "many times", "level": "C1", "dict_examp": "He phoned the office repeatedly, hoping his package had been found.", "lear_examp": "Once you pick up the new words and learn something, you need to say it repeatedly otherwise you will easily forget it."}]}]}, {"word": "remorse", "poses": [{"pos": "noun", "senses": [{"sense": "the feeling that you are sorry for something bad that you have done", "level": "C2", "dict_examp": "He has shown no remorse for his actions.", "lear_examp": "At first she thought someone wanted her to feel remorse for not being with her husband when he needed her."}]}]}, {"word": "renew", "poses": [{"pos": "verb", "senses": [{"sense": "to arrange to continue an official agreement that was going to end soon", "level": "B2", "dict_examp": "I've decided not to renew my membership of the tennis club this year.", "lear_examp": "As I had never been abroad before, I hurriedly went to an office where we can apply for a passport or renew it."}]}]}, {"word": "remains", "poses": [{"pos": "noun", "senses": [{"sense": "pieces or parts of something that continue to exist when most of it has been used, destroyed, or taken away", "level": "B2", "dict_examp": "The remains of lunch were still on the table.", "lear_examp": "Friedrich II finished the town wall around Altenburg.  Its remains are a tourist attraction now."}]}]}, {"word": "reluctantly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a reluctant way", "level": "C1", "dict_examp": "She reluctantly agreed to step down as managing director.", "lear_examp": "Reluctantly I am forced to mention that my interpreter's fee should be at least doubled."}]}]}, {"word": "remove", "poses": [{"pos": "verb", "senses": [{"sense": "to take something away", "level": "B1", "dict_examp": "Club soda will remove that stain.", "lear_examp": "I want to make some changes in my room because I feel that I don't have enough space - maybe I will remove my desk, but I'm not sure yet."}, {"sense": "to take something off", "level": "B2", "dict_examp": "Liz removed her jacket and hung it on a chair.", "lear_examp": "After, I was drenched to the skin and I had to remove all my clothes before going into the restaurant, I let you imagine how ashamed I was when I went into the restaurant completely naked!"}]}]}, {"word": "render", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone a decision, opinion, help, etc", "level": "C1", "dict_examp": "payment for services rendered", "lear_examp": "Finally, the students have only a 5% discount for the services rendered by the arts centre in contrast to the fact that we agreed initially that a 10% discount would be more adequate."}, {"sense": "to cause something or someone to be in a particular state or condition", "level": "C2", "dict_examp": "The trees rendered the road as dark as a tunnel.", "lear_examp": "Inadequate medical care coupled with inevitable worsening of constitution, which is a usual concomitant of an elderly age, renders the old exposed to illnesses and injuries which may wreak havoc with their lives."}]}]}, {"word": "remedy", "poses": [{"pos": "noun", "senses": [{"sense": "something that makes you better when you are ill", "level": "B2", "dict_examp": "a cold remedy", "lear_examp": "But it is debatable whether animals are held to widen our human understanding and to create new remedies to cure people from illnesses or if they are kept just to amuse people."}, {"sense": "something that solves a problem", "level": "B2", "dict_examp": "The remedy for the traffic problem is to encourage people to use public transportation.", "lear_examp": "You should give your deputy more work, and have more free time, which I think is the best remedy in your case."}]}]}, {"word": "remind", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone remember something, or remember to do something", "level": "B1", "dict_examp": "Remind me to mail this package.", "lear_examp": "I am writing this e-mail to remind you about our meeting on Tuesday."}, {"sense": "to be similar to, or make you think of, something or someone else", "level": "B1", "dict_examp": "She reminds me of Elaine.", "lear_examp": "It's not an expensive scarf, but I like it because it reminds me of my sister; she gave me this scarf for my birthday some years ago."}]}]}, {"word": "remarkably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that makes you feel surprised", "level": "C1", "dict_examp": "She has remarkably good skin for her age.", "lear_examp": "As for your flight attendants, who are always friendly and remarkably helpful, it would be excellent if they were able to speak other languages apart from English."}]}]}, {"word": "renewal", "poses": [{"pos": "noun", "senses": [{"sense": "when you renew an agreement, contract, etc.", "level": "C1", "dict_examp": "Their licence is up for renewal.", "lear_examp": "I suggest we negotiate a new agreement next year, when the current agreement will be due for renewal."}, {"sense": "the process of repairing and improving something", "level": "C2", "dict_examp": "They have spent millions on the renewal of the rail system.", "lear_examp": "Like the farmer who carefully tends his plot of fertile land, we should make constructive use of our free time, so that we can reap the benefits of spiritual renewal and rejuvenation, and to fully enjoy the fruits of our labour."}]}]}, {"word": "remember", "poses": [{"pos": "verb", "senses": [{"sense": "If you remember a fact or something from the past, you keep it in your mind, or bring it back into your mind.", "level": "A1", "dict_examp": "I can't remember his name.", "lear_examp": "But do you remember? I am a vegetarian now."}, {"sense": "to not forget to do something", "level": "A2", "dict_examp": "Did you remember to call Linda?", "lear_examp": "Remember to write me a letter."}]}]}, {"word": "renovate", "poses": [{"pos": "verb", "senses": [{"sense": "to repair and decorate a building that is old and in bad condition", "level": "C1", "dict_examp": "He has a business renovating old buildings.", "lear_examp": "We should also renovate the library and extend the opening hours."}]}]}, {"word": "rely", "poses": [{"pos": "verb", "senses": [{"sense": "to need someone or something in order to be successful, work correctly, etc.", "level": "B2", "dict_examp": "The system relies too heavily on one person.", "lear_examp": "Another thing is that people rely on modern medicine more and more."}, {"sense": "to trust someone or something", "level": "B2", "dict_examp": "I know I can rely on you to help me.", "lear_examp": "People rely on me as I always keep my promises."}]}]}, {"word": "repetition", "poses": [{"pos": "noun", "senses": [{"sense": "when you keep doing or saying something over again", "level": "C2", "dict_examp": "It takes time, patience, and repetition to learn a language.", "lear_examp": "This could in fact lead to a repetition of the mistakes of the past, when the paralyzed United Nations were, due to the small number and influence of neutral countries, a mere bystander to the risky arms-race fought out between the two nuclear superpowers."}]}]}, {"word": "repeated", "poses": [{"pos": "adjective", "senses": [{"sense": "done or happening more than once", "level": "C2", "dict_examp": "He refused repeated requests for an interviewed.", "lear_examp": "There were so many people and so many repeated questions and so much noise at home."}]}]}, {"word": "renewable", "poses": [{"pos": "adjective", "senses": [{"sense": "A renewable form of energy can be produced as quickly as it is used.", "level": "C1", "dict_examp": "a renewable energy source such as wind power", "lear_examp": "But the use of renewable energy sources is always a challenge."}, {"sense": "A renewable official agreement is one that you can arrange to continue when the time limit is reached.", "level": "C2", "dict_examp": "a 6-month renewable contract", "lear_examp": "This seemed like a good enough alternative, but last week I was overwhelmed by the proposal from the company I worked for in London, of going back and working for another 6-month renewable contract, on a shift basis."}]}]}, {"word": "repeat", "poses": [{"pos": "verb", "senses": [{"sense": "to say or do something more than once", "level": "A2", "dict_examp": "He repeated the number.", "lear_examp": "I'd like to repeat that interesting visit."}, {"sense": "to tell someone something that someone else has told you", "level": "B1", "dict_examp": "Please don't repeat what I've just told you to anyone else.", "lear_examp": "He had written he was sorry, he should not have done it, he wished he had not repeated what I told him, he would never do something like that again..."}]}]}, {"word": "remarkable", "poses": [{"pos": "adjective", "senses": [{"sense": "very unusual or noticeable in a way that you admire", "level": "B2", "dict_examp": "He is a truly remarkable man.", "lear_examp": "It is a remarkable piece of literature, which portrays deep feelings of love and hate, depicts strong and unique characters, and reveals eternal concerns with good and bad, life and death."}]}]}, {"word": "remote", "poses": [{"pos": "adjective", "senses": [{"sense": "far away", "level": "B2", "dict_examp": "It was a remote mountain village that had no electricity.", "lear_examp": "She grew up in a remote area in the North East of Thailand."}]}]}, {"word": "renowned", "poses": [{"pos": "adjective", "senses": [{"sense": "famous", "level": "C2", "dict_examp": "The Lake District is renowned for its beauty.", "lear_examp": "Maria Sandoral is a talented young artist who, at the age of 23, has far more background than a lot of artists. ... She is renowned for her restless attitude, and for her deep interest in the field."}]}]}, {"word": "remaining", "poses": [{"pos": "adjective", "senses": [{"sense": "continuing to exist when other things or people have gone or been dealt with", "level": "B2", "dict_examp": "Use half the dough and keep the remaining half covered.", "lear_examp": "So I decided to do nothing for the remaining week. I stayed at the beach and spent time swimming, reading and relaxing."}]}]}, {"word": "remain", "poses": [{"pos": "verb", "senses": [{"sense": "to continue to be in the same state", "level": "B1", "dict_examp": "Despite the chaos around him, he remained calm.", "lear_examp": "I tried to remain calm but it was very difficult."}, {"sense": "to continue to be a secret/ mystery, etc.", "level": "B2", "dict_examp": "The exact date of the wedding remains a secret.", "lear_examp": "The tragic death of Pat Johnson was a fact..... Her secret remained a secret."}, {"sense": "to stay in the same place", "level": "B2", "dict_examp": "She will remain at her mother's until I return.", "lear_examp": "Max went with me while the others remained in the room."}, {"sense": "to continue to exist, especially after other things or people have gone", "level": "B2", "dict_examp": "Only a few hundred of these animals remain today.", "lear_examp": "Of course, India must have changed a lot since Jules Verne wrote his book, but I think that its charm remains."}]}]}, {"word": "remark", "poses": [{"pos": "verb", "senses": [{"sense": "to say something that shows your opinion or states a fact", "level": "B2", "dict_examp": "He remarked that he'd be home late.", "lear_examp": "Besides, as Chris remarked, this route may be very difficult."}]}, {"pos": "noun", "senses": [{"sense": "something that you say, showing your opinion about something or stating a fact", "level": "B2", "dict_examp": "He made a remark about the new carpet.", "lear_examp": "The man was surprised at her remark and double-checked it reluctantly."}]}]}, {"word": "repetitive", "poses": [{"pos": "adjective", "senses": [{"sense": "done or said in the same way several times, with nothing new added", "level": "C1", "dict_examp": "a repetitive job", "lear_examp": "Chapters have turned repetitive and uninteresting, as nothing new happens."}]}]}, {"word": "require", "poses": [{"pos": "verb", "senses": [{"sense": "to need or demand something", "level": "B1", "dict_examp": "If you require assistance with your bags, I’ll be glad to get someone to help you.", "lear_examp": "Weddings are very different in our country and require a lot of preparation."}, {"sense": "to officially demand that someone does something", "level": "B2", "dict_examp": "You are required by law to produce a valid passport.", "lear_examp": "It may occur in the future that they are required to possess knowledge of something they didn't study at school in order to get a job."}]}]}, {"word": "report card", "poses": [{"pos": "noun", "senses": [{"sense": "a teacher’s written statement about a student’s performance at school", "level": "A2", "dict_examp": "Sam got three As and a B on his report card.", "lear_examp": "Jone, I left my report card at your home. It is important to me because I have to show it to my parents."}]}]}, {"word": "reportedly", "poses": [{"pos": "adverb", "senses": [{"sense": "according to what people say about something", "level": "C2", "dict_examp": "New York is reportedly a very exciting place to live.", "lear_examp": "Some types of birds have reportedly become extinct in the area."}]}]}, {"word": "republic", "poses": [{"pos": "noun", "senses": [{"sense": "a country that is governed by elected representatives and an elected leader", "level": "C1", "dict_examp": "France is a republic.", "lear_examp": "Unfortunately in ancient Greece, although the notion of the republic and democracy were invented and quite successfully developed there, not being a noble citizen could be cruelly disappointing and painful."}]}]}, {"word": "report", "poses": [{"pos": "verb", "senses": [{"sense": "to describe a recent event or situation, especially on television, radio, or in a newspaper", "level": "B1", "dict_examp": "Jo Smith reports on recent developments.", "lear_examp": "You reported that other performers were second-rate."}, {"sense": "to tell someone in authority that something has happened, especially an accident or crime", "level": "B1", "dict_examp": "He should have reported the accident immediately.", "lear_examp": "Of course I reported it at the train station, but they couldn't find it when they searched the train."}]}, {"pos": "noun", "senses": [{"sense": "a description of an event or situation", "level": "B1", "dict_examp": "a news/weather report", "lear_examp": "I'll be handing you a report on Chapter 7 the next day."}]}]}, {"word": "reputation", "poses": [{"pos": "noun", "senses": [{"sense": "the opinion that people have about someone or something based on their behavior or character in the past", "level": "B2", "dict_examp": "The company has a worldwide reputation for quality.", "lear_examp": "My country has a great reputation for food."}]}]}, {"word": "representative", "poses": [{"pos": "noun", "senses": [{"sense": "someone who speaks or does something officially for another person or group of people", "level": "B2", "dict_examp": "The company has representatives throughout South America.", "lear_examp": "Dear Mr Robertson, My name is ... and I am a student representative."}]}]}, {"word": "request", "poses": [{"pos": "noun", "senses": [{"sense": "when you politely or officially ask for something", "level": "B1", "dict_examp": "They received hundreds of requests for more information.", "lear_examp": "I decided to reply to your request as soon as possible."}]}, {"pos": "verb", "senses": [{"sense": "to politely or officially ask for something", "level": "B1", "dict_examp": "We've requested two more computers.", "lear_examp": "I have to rent a car at the Hertz agency and request information about where the hotel is."}]}]}, {"word": "requirement", "poses": [{"pos": "noun", "senses": [{"sense": "something that you must do, or something you need", "level": "B2", "dict_examp": "A college degree is a minimum requirement for many jobs.", "lear_examp": "If you have any more requirements, please don't hesitate to contact me."}]}]}, {"word": "reschedule", "poses": [{"pos": "verb", "senses": [{"sense": "to change the time of an event or meeting", "level": "B2", "dict_examp": "I rescheduled my doctor’s appointment for later in the week.", "lear_examp": "He will come next Friday morning, if that does not suit you just call him and reschedule the appointment."}]}]}, {"word": "resent", "poses": [{"pos": "verb", "senses": [{"sense": "to feel angry and upset about a situation or about something that someone has done", "level": "C2", "dict_examp": "I resent having to work late.", "lear_examp": "More specifically, my cousin's husband and his family, neither of whom I knew very well, deeply resented this decision."}]}]}, {"word": "replacement", "poses": [{"pos": "noun", "senses": [{"sense": "the thing or person that replaces something or someone", "level": "B2", "dict_examp": "The agency sent a replacement for the secretary who resigned.", "lear_examp": "But the people responsible for the concert did their best to find a replacement."}, {"sense": "the process of replacing something with something else", "level": "C1", "dict_examp": "the replacement of existing computer equipment", "lear_examp": "But by using much larger desks, we will be able to use the equipment more efficiently and this will reduce the cost for the replacement of broken equipment."}]}]}, {"word": "replace", "poses": [{"pos": "verb", "senses": [{"sense": "to start using another thing or person instead of the one that you are using now", "level": "B1", "dict_examp": "We're thinking of replacing our old TV with a new one.", "lear_examp": "And I'm going to replace the desk, because I don't have enough space to put a computer onto it."}, {"sense": "to get something new because the one you had before has been lost or damaged", "level": "B1", "dict_examp": "We'll have to replace this carpet soon.", "lear_examp": "I'm very sorry about it but don't worry because I bought another one to replace it."}, {"sense": "to start to be used instead of the thing or person that is being used now", "level": "B2", "dict_examp": "This system will replace the old one.", "lear_examp": "We felt very disappointed when we discovered that Danny had been replaced by an unknown and really bad actor."}, {"sense": "to put something back in the place where it usually is", "level": "C2", "dict_examp": "She picked up the books and carefully replaced them on the shelf.", "lear_examp": "Jane jumped up and carefully replaced the photo on the desk."}]}]}, {"word": "represent", "poses": [{"pos": "verb", "senses": [{"sense": "to be equal to something", "level": "B2", "dict_examp": "In practice the figure represents a 10% pay cut.", "lear_examp": "It means recycling 90% of the office material that we usually use. This represents a profit to the company which would be given to the employees, so they are motivated."}, {"sense": "to be the person from a country, school, etc., who is in a competition", "level": "B2", "dict_examp": "He was chosen to represent France at the Olympics.", "lear_examp": "At the age of 18, I started playing for my country.  I mean, I represent Mauritius in international matches."}, {"sense": "to be a sign or symbol of something", "level": "B2", "dict_examp": "The knife-and-fork symbol on the map represents places serving food.", "lear_examp": "I think the sea represents life and the sacrifices we make."}, {"sense": "to officially speak or do something for someone else because they have asked you to", "level": "C2", "dict_examp": "The organization represents over professional basketball players.", "lear_examp": "We hereby inform you that we have subsequently commenced proceedings aimed at hiring a lawyer to represent our party in court, should such a step be necessary."}, {"sense": "to show or describe someone or something in a particular way", "level": "C2", "dict_examp": "He represented himself as an expert, but his facts were all wrong.", "lear_examp": "The innovative architecture would represent our everyday lives filled with work and technology."}]}]}, {"word": "reputable", "poses": [{"pos": "adjective", "senses": [{"sense": "known to be good and honest", "level": "C1", "dict_examp": "a reputable organization", "lear_examp": "I believe such a reputable company as yours will not refuse to accept the responsibilities and prompt action will be taken in due course."}]}]}, {"word": "resemble", "poses": [{"pos": "verb", "senses": [{"sense": "to look like or be like someone or something", "level": "C1", "dict_examp": "She resembles her father.", "lear_examp": "However, the most representative Romanian resorts resemble the ones in the Alps and maybe even exceed them in the respect of popularity among all walks of life and affordability."}]}]}, {"word": "reply", "poses": [{"pos": "verb", "senses": [{"sense": "to answer", "level": "B1", "dict_examp": "\"Where are you going?\" I asked. \"Home,\" he replied.", "lear_examp": "Please reply as soon as possible."}]}, {"pos": "noun", "senses": [{"sense": "an answer", "level": "B1", "dict_examp": "Her reply was short and unfriendly.", "lear_examp": "I'm waiting for your reply to tell me when you will come."}]}]}, {"word": "reproduce", "poses": [{"pos": "verb", "senses": [{"sense": "to make a copy of something", "level": "C1", "dict_examp": "The diagram is reproduced by permission of the original author.", "lear_examp": "MI5 operates two computers, one for word processing and another for scanning and reproducing prints, drawings and photos."}, {"sense": "to repeat something so that it is the same as before", "level": "C1", "dict_examp": "The new design unfortunately reproduced some of the problems of the earlier model.", "lear_examp": "I overcame this by listening to tapes and by trying to reproduce the native speaker's sounds and stresses."}, {"sense": "If people, animals, or plants reproduce, they produce babies or young animals or plants.", "level": "C2", "dict_examp": "These organisms reproduce by dividing.", "lear_examp": "Primitive man had a few aims in life like to be born, to reproduce and die, and among them there were two other important priorities, to hunt and to eat."}]}]}, {"word": "reptile", "poses": [{"pos": "noun", "senses": [{"sense": "an animal that produces eggs and uses the heat of the sun to keep its blood warm", "level": "C1", "dict_examp": "Tom liked the reptiles, especially the snakes and the lizards.", "lear_examp": "The mainland's variable coast offers wonderful protection for all sorts of fish, sea mammals or reptiles."}]}]}, {"word": "researcher", "poses": [{"pos": "noun", "senses": [{"sense": "someone who does research as a job", "level": "B2", "dict_examp": "Researchers uncovered new facts about his family.", "lear_examp": "As researchers find out more about animals, we learn more about them and because of this we learn more about the world."}]}]}, {"word": "representation", "poses": [{"pos": "noun", "senses": [{"sense": "the way someone or something is shown", "level": "C2", "dict_examp": "an accurate representation of country life", "lear_examp": "Mildred is an establishment pet, the representation of the current society they are living in."}, {"sense": "speaking or doing something officially for another person", "level": "C2", "dict_examp": "Can he afford legal representation?", "lear_examp": "An old politician whose name I do not recall once said \"Taxation without representation is tyranny\" - nowadays this concept might be extended to corruption itself."}]}]}, {"word": "reporter", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to discover information about news events and describe them on television, radio, the Internet, or in a newspaper", "level": "B1", "dict_examp": "He's a reporter for the local newspaper.", "lear_examp": "The reporters talked about her life, where she was born, and who her parents are."}]}]}, {"word": "reproach", "poses": [{"pos": "noun", "senses": [{"sense": "criticism of someone, especially for not being successful or not doing what is expected", "level": "C2", "dict_examp": "There was a hint of reproach in his voice.", "lear_examp": "Before they turned off the light, he saw disappointment and reproach in their eyes."}]}, {"pos": "verb", "senses": [{"sense": "to criticize someone for not being successful or not doing what is expected", "level": "C2", "dict_examp": "You've no reason to reproach yourself.", "lear_examp": "I know I shouldn't reproach myself for not giving her money."}]}]}, {"word": "resemblance", "poses": [{"pos": "noun", "senses": [{"sense": "a similarity between two people or things, especially in their appearance", "level": "C2", "dict_examp": "There's a striking resemblance between Diane and her mother.", "lear_examp": "I must admit that Dick has a strong resemblance to Neolithic Man, but everyone loves him because he is so cheerful and talkative."}, {"sense": "to be similar/not similar/somewhat similar, etc., to something or someone", "level": "C2", "dict_examp": "He bears   a resemblance to someone I used to know.", "lear_examp": "The concert bore no resemblance to any other I have been to, firstly due to the location, and secondly thanks to the spontaneity, yet impressive precision of the performance - the two factors which created the unique atmosphere of the event."}]}]}, {"word": "rescue", "poses": [{"pos": "verb", "senses": [{"sense": "to save someone from a dangerous or unpleasant situation", "level": "B1", "dict_examp": "Fifty passengers had to be rescued from a sinking ship.", "lear_examp": "A bomb had exploded and that boy rescued me from the accident."}]}, {"pos": "noun", "senses": [{"sense": "when someone is saved from a dangerous or unpleasant situation", "level": "B1", "dict_examp": "Lifeboats carry out many rescues every month.", "lear_examp": "Last Friday I saw one that was about two guys  who were lost in the jungle for nine days, and the rescue team found them alive."}, {"sense": "to help someone who is in a difficult situation", "level": "C2", "dict_examp": "I forgot my purse but Anna came to the rescue and lent me some money.", "lear_examp": ""}]}]}, {"word": "reproduction", "poses": [{"pos": "noun", "senses": [{"sense": "a copy of something, especially a painting", "level": "C1", "dict_examp": "The picture is a reproduction of a Manet.", "lear_examp": "It would be great if the park provided some flight simulators and a reproduction of a space shuttle (so that people get a feeling of how it is to be an astronaut)."}, {"sense": "the process of producing babies or young animals and plants", "level": "C2", "dict_examp": "We are learning about reproduction in biology.", "lear_examp": "What will happen if we live longer but we don't slow down the reproduction of our species?"}]}]}, {"word": "research", "poses": [{"pos": "noun", "senses": [{"sense": "the study of a subject in detail to find information or to gain a better understanding of it", "level": "B1", "dict_examp": "scientific/medical research", "lear_examp": "I have been doing research about how well people dress, and I think I dress with care."}]}, {"pos": "verb", "senses": [{"sense": "to study a subject in detail or to try to find information about a subject", "level": "B2", "dict_examp": "He spent several years researching a rare African dialect.", "lear_examp": "I had to write an article called Protect our Environment so I researched and studied a lot about it using the Internet and the library to find suitable details."}]}]}, {"word": "resolution", "poses": [{"pos": "noun", "senses": [{"sense": "the solution to a problem", "level": "C2", "dict_examp": "a successful resolution to the crisis", "lear_examp": "It might help us to find alternative conflict resolutions."}, {"sense": "an official decision that is made after a group or organization has voted", "level": "C2", "dict_examp": "Congress passed a resolution in support of the plan.", "lear_examp": "India declared that the UN resolution about the ban on nuclear weapons was unfair."}, {"sense": "a promise to yourself to do something", "level": "C2", "dict_examp": "My New Year's resolution is to do more exercise.", "lear_examp": "As a New Year's resolution I decided to save some money in a jar for my husband."}]}]}, {"word": "residential", "poses": [{"pos": "adjective", "senses": [{"sense": "A residential area has only houses and not offices or factories.", "level": "B2", "dict_examp": "It's a largely residential area with one or two small stores.", "lear_examp": "\"Varta\" is situated in a quiet residential area and could be called  \"a family restaurant.\""}]}]}, {"word": "respond", "poses": [{"pos": "verb", "senses": [{"sense": "to say or do something as a reaction to something that has been said or done", "level": "B2", "dict_examp": "To every question, he responded \"I don't know.\"", "lear_examp": "The two men didn't respond so David closed the door."}]}]}, {"word": "respective", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to each of the people or things that you have just talked about", "level": "C1", "dict_examp": "Barkley and Jordan are the two best players on their respective teams.", "lear_examp": "Relatives and friends of the respective families were very successful in being guides for some hours."}]}]}, {"word": "respect", "poses": [{"pos": "noun", "senses": [{"sense": "when you admire someone because of their knowledge, skill, or achievements", "level": "B1", "dict_examp": "She's an excellent teacher and I have the greatest respect for her.", "lear_examp": "I want to improve my English, and there the teachers are respected and listen to the pupils."}, {"sense": "when you are polite to someone, especially because they are older or more important than you", "level": "B1", "dict_examp": "You should show more respect for your parents.", "lear_examp": "As for people who attend weddings, it's important for them to wear formal clothes to show their respect for the new couple."}, {"sense": "in particular ways", "level": "B2", "dict_examp": "In some respects, I had to admit, I had behaved foolishly.", "lear_examp": "How's your friend Mike? He is in many respects better than a computer, isn't he? (Teasing you again, sorry)."}, {"sense": "relating to a particular thing", "level": "B2", "dict_examp": "Before we move on, are there any more questions with respect to the treasurer's report?", "lear_examp": "With respect to the ages of the members, they are between fifteen and twenty years old."}, {"sense": "used to politely disagree with or give a negative opinion about something", "level": "C1", "dict_examp": "I’ve been thinking about what you said and, with all due respect, I think you’re mistaken.", "lear_examp": "Finally we would like to point out two things that should be improved. The first one is entertainment, which, with all due respect, is very poor."}]}, {"pos": "verb", "senses": [{"sense": "to admire someone because of their knowledge, achievements, etc.", "level": "B1", "dict_examp": "I respect him for his honesty.", "lear_examp": "It's nice to have a friend who respects you and who you respect too."}, {"sense": "If you respect someone's rights, customs, wishes, etc. you accept their importance and are careful not to do anything they would not want.", "level": "B2", "dict_examp": "If you decide to do otherwise we will, of course, respect your wishes.", "lear_examp": "But the situation is getting worse because of the decisions of the European Union, which is trying to unify European education without respecting the wishes of the students, who are trying to stop this process."}]}]}, {"word": "resignation", "poses": [{"pos": "noun", "senses": [{"sense": "when someone tells their employer that they are leaving their job", "level": "C2", "dict_examp": "a letter of resignation", "lear_examp": "She had been so proud of herself no more than five minutes ago walking out of the editor's office after handing him her letter of resignation."}, {"sense": "when you accept something that you do not like because you cannot easily change it", "level": "C2", "dict_examp": "She accepted her illness with calm resignation.", "lear_examp": "He sighed with resignation and got up."}]}]}, {"word": "respectful", "poses": [{"pos": "adjective", "senses": [{"sense": "showing respect for someone or something", "level": "C1", "dict_examp": "They treated us in a very respectful manner.", "lear_examp": "Were I not respectful of your work, I would say that your reporter did not attend this event and just imagined it."}]}]}, {"word": "reservation", "poses": [{"pos": "noun", "senses": [{"sense": "an arrangement that you make to have a seat on an aircraft, a room in a hotel, etc.", "level": "B1", "dict_examp": "I made a reservation at the restaurant for 7 o’clock.", "lear_examp": "I can make a reservation if you want."}, {"sense": "a doubt or a feeling that you do not accept or agree with something completely", "level": "C2", "dict_examp": "I still have reservations about her ability to do the job.", "lear_examp": "Their families agreed to that, but with certain reservations, as they saw it quite soon to take such an important step."}]}]}, {"word": "respectively", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that relates to each of the people or things that you have just talked about", "level": "C1", "dict_examp": "They scored 10 and 17 points, respectively.", "lear_examp": "Not only did we reach our target figure but also, 85% of the revenue generated went to the hospital, and only 10% and 5% were for entertainment costs and administration costs, respectively."}]}]}, {"word": "respectfully", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that shows respect for someone or something", "level": "C2", "dict_examp": "He always spoke to them very respectfully.", "lear_examp": "I respectfully request you, as a store manager, to personally look into this situation, assist in investigating the problem with the faulty equipment as a matter of urgency by sending round a qualified engineer and, if found unfixable, arrange for a new unit to be supplied."}]}]}, {"word": "respectable", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving in a socially acceptable way or looking socially acceptable", "level": "B2", "dict_examp": "a respectable family", "lear_examp": "But no one could think of a respectable doctor poisoning two of his patients, which is what he actually did."}, {"sense": "large enough or good enough", "level": "C2", "dict_examp": "She earns a respectable salary.", "lear_examp": "So we had to wait until he could confidently say to his parents, \"Look, I am an adult now, and I'm working for a large company with a respectable job, and I am going to get married if I want to.\""}]}]}, {"word": "resentment", "poses": [{"pos": "noun", "senses": [{"sense": "a feeling of anger about a situation that you think is unfair", "level": "C2", "dict_examp": "If you treat your staff differently, it just causes resentment.", "lear_examp": "I was pleased by the variety of opinions presented; some of the writers expressed a blind faith that we can still learn from our previous mistakes, while others approached the subject with a surprising resentment of our past."}]}]}, {"word": "resilient", "poses": [{"pos": "adjective", "senses": [{"sense": "strong enough to get better quickly after damage, disappointment, illness, shock, etc.", "level": "C2", "dict_examp": "Growth figures show that the economy is still fairly resilient.", "lear_examp": "He could not stand the thought of staying away from Bill, he was not that resilient."}]}]}, {"word": "reserve", "poses": [{"pos": "verb", "senses": [{"sense": "to arrange to have a seat on an aircraft, a room in a hotel, etc.", "level": "B1", "dict_examp": "I’m sorry, this seat is reserved.", "lear_examp": "You can reserve the tickets."}, {"sense": "to not allow people to use something because it is only for a particular person or for a particular purpose", "level": "B1", "dict_examp": "This space is reserved for ambulances only.", "lear_examp": "You can also use streets reserved for walkers."}]}, {"pos": "noun", "senses": [{"sense": "ready to be used if or when you need it", "level": "C1", "dict_examp": "She keeps a little money in reserve.", "lear_examp": "It would be an idea to have some activity in reserve if you have to cancel something, such as the boat trip on the Thames."}, {"sense": "a supply of something that you keep until it is needed", "level": "C2", "dict_examp": "emergency cash reserves", "lear_examp": "The dependence on oil is a menace because oil reserves will disappear and because at this time we have no other invention to replace it."}]}]}, {"word": "resort", "poses": [{"pos": "noun", "senses": [{"sense": "a place where many people go on vacation or for an activity they enjoy", "level": "B1", "dict_examp": "a beach resort", "lear_examp": "We stayed one week in a chalet near the ski resort."}, {"sense": "something that you do because everything else has failed", "level": "C2", "dict_examp": "As a last resort, we could ask your mother to help.", "lear_examp": "As a last resort and a solution for those that don't admire books, I would recommend buying a comic in which you see more pictures than words."}]}, {"pos": "phrasal verb", "senses": [{"sense": "to do something in order to achieve what you want, because it is the only thing you can do to achieve it", "level": "C2", "dict_examp": "I had to resort to threats to get my money back.", "lear_examp": "This is caused by a person's basic need for food: If someone can't get enough to eat he might have to resort to stealing."}]}]}, {"word": "resistance", "poses": [{"pos": "noun", "senses": [{"sense": "when people disagree with a change, idea, etc. and refuse to accept it", "level": "C2", "dict_examp": "resistance to political change", "lear_examp": "The only resistance comes from Jack, an aggressive and impetuous boy who places facts higher than speeches."}, {"sense": "when someone fights against someone who is attacking them or competing against them", "level": "C2", "dict_examp": "She didn't put up much resistance.", "lear_examp": "Their knowledge helped Hitler to prolong his resistance against the overwhelming superiority of the Allies."}, {"sense": "an organization that secretly fights against an enemy that has taken control of its country", "level": "C2", "dict_examp": "She was active in the resistance.", "lear_examp": "Despite the fact that the Germans were many and much more powerful, they faced many difficulties from the Greek resistance."}, {"sense": "the ability of your body to not be affected by illnesses", "level": "C2", "dict_examp": "Cold weather may lower the body's resistance to infection.", "lear_examp": "His physical resistance is exceptional, he is young, in perfect condition, healthy."}]}]}, {"word": "resign", "poses": [{"pos": "verb", "senses": [{"sense": "to officially tell your employer that you are leaving your job", "level": "B2", "dict_examp": "He resigned as chairman of the committee.", "lear_examp": "So Laura stepped into her boss's office, wished him a Merry Christmas and resigned."}, {"sense": "to make yourself accept something that you do not like because you cannot easily change it", "level": "C2", "dict_examp": "He resigned himself to living alone.", "lear_examp": "Personally I wouldn't like to be at the age when you can't afford anything except bread and butter and you have to resign yourself to this miserable existence without any hope for a brighter future."}]}]}, {"word": "resolve", "poses": [{"pos": "verb", "senses": [{"sense": "to solve or end a problem or difficulty", "level": "C1", "dict_examp": "an attempt to resolve the dispute", "lear_examp": "I would very much like to suggest a meeting, in order to resolve some of the issues."}]}, {"pos": "noun", "senses": [{"sense": "when you are very determined to do something", "level": "C2", "dict_examp": "The training was tough, but his resolve never wavered.", "lear_examp": "Daniella's attention was focused on the scene and she was truly enjoying what was going on. This sight toughened Marco's resolve."}]}]}, {"word": "residence", "poses": [{"pos": "noun", "senses": [{"sense": "a building where someone lives", "level": "C2", "dict_examp": "That big building is the governor's official residence.", "lear_examp": "Just a short stroll away there is a former King’s residence, Wawel Castle."}]}]}, {"word": "reserved", "poses": [{"pos": "adjective", "senses": [{"sense": "describes people who keep their feelings or thoughts private rather than showing them", "level": "B2", "dict_examp": "Marcus is more reserved than his brother.", "lear_examp": "He was shy, reserved and a very closed person."}]}]}, {"word": "resident", "poses": [{"pos": "noun", "senses": [{"sense": "someone who lives in a particular place", "level": "B2", "dict_examp": "a resident of New York/the UK/Brazil", "lear_examp": "We will have less anxious residents in cities, who will not hurry to go to work or will not be late home or at the office."}]}]}, {"word": "respected", "poses": [{"pos": "adjective", "senses": [{"sense": "admired by people because of your knowledge, achievements, etc.", "level": "B2", "dict_examp": "a highly respected doctor/politician", "lear_examp": "Looking at Pele's life, we discover that he was a respected man who did his best to help others and his country."}]}]}, {"word": "response", "poses": [{"pos": "noun", "senses": [{"sense": "an answer or reaction to something that has been said or done", "level": "B2", "dict_examp": "Responses to our advertisement have been disappointing.", "lear_examp": "The telephone is an easy way to contact others, better than writing a letter and waiting for a response."}, {"sense": "as an answer or reaction to", "level": "B2", "dict_examp": "The law was passed by the town council in response to                     complaints from residents.", "lear_examp": "I am writing in response to your advertisement, which appeared in the newspaper on November the 23rd, looking for a person to work at weekends in your café."}]}]}, {"word": "resource", "poses": [{"pos": "noun", "senses": [{"sense": "something useful that a country, person, or organization has which they can use", "level": "B2", "dict_examp": "natural resources", "lear_examp": "With all the resources on the Net, I don't need to go to the library as often as I used to."}]}]}, {"word": "resourceful", "poses": [{"pos": "adjective", "senses": [{"sense": "good at finding ways to solve problems", "level": "C2", "dict_examp": "When we didn't have much money, we had to be more resourceful.", "lear_examp": "The tormentor was inventive, clever, resourceful and learned fast how to make the most ordinary objects (a moth, a crow) into a source of overwhelming fear for his victim."}]}]}, {"word": "resist", "poses": [{"pos": "verb", "senses": [{"sense": "to stop yourself from doing something that you want to do", "level": "B2", "dict_examp": "I can't resist chocolate.", "lear_examp": "How do we resist all these nice snacks, and stay slim?"}, {"sense": "to fight against something or someone that is attacking you", "level": "C1", "dict_examp": "Students want to discover the truth themselves, and they resist having conclusions forced on them.", "lear_examp": "The Turkish civilization was poorer than the Greek civilisation and that is one more reason why the Greeks had to resist and fight their enemies."}]}]}, {"word": "resilience", "poses": [{"pos": "noun", "senses": [{"sense": "the ability  improve quickly after being hurt or being ill", "level": "C2", "dict_examp": "She had the resilience to try again.", "lear_examp": "Their resilience had been pushed to the extreme and, but for their sheer longing for a child, they might have given up."}]}]}, {"word": "resume", "poses": [{"pos": "verb", "senses": [{"sense": "If an activity resumes, or if you resume it, it starts again after a pause.", "level": "C1", "dict_examp": "The talks are due to resume today.", "lear_examp": "I hope our two companies can resume their excellent cooperation in the future and I am looking forward to using one of your aircraft again."}]}]}, {"word": "responsible", "poses": [{"pos": "adjective", "senses": [{"sense": "to be the person whose duty is to deal with someone or something", "level": "B1", "dict_examp": "I'm responsible for looking after the children during the lunch break.", "lear_examp": "My parents went to Ireland for two weeks, and I was responsible for the house."}, {"sense": "to be the person who caused something to happen, especially something bad", "level": "B2", "dict_examp": "Who was responsible for the accident?", "lear_examp": "Sometimes walkers are also responsible for accidents, mainly when they are in a hurry."}, {"sense": "showing good judgment and able to be trusted", "level": "B2", "dict_examp": "a hardworking and responsible employee", "lear_examp": "I know it is a great responsibility looking after them but I think I am reliable and responsible."}, {"sense": "A responsible job is important because you have to make decisions that affect other people.", "level": "B2", "dict_examp": "It's a very responsible job, being a teacher.", "lear_examp": "The people who I admire in today's world are journalists. In my opinion, they have a very responsible job."}]}]}, {"word": "rethink", "poses": [{"pos": "verb", "senses": [{"sense": "to change what you think about something or what you plan to do", "level": "C1", "dict_examp": "We've had to rethink our strategy.", "lear_examp": "There are some points to be rethought, although the proposed plan was generally accepted."}]}]}, {"word": "rest", "poses": [{"pos": "verb", "senses": [{"sense": "to relax or sleep because you are tired after an activity or because you are ill", "level": "B1", "dict_examp": "The doctor told him that he should rest for a few days.", "lear_examp": "The weather was particularly sunny there, so we decided to eat an ice-cream and to rest a little."}, {"sense": "to stop using your eyes/feet/legs, etc. for a while because they are tired", "level": "B2", "dict_examp": "He looked away from the computer screen to rest his eyes.", "lear_examp": ""}, {"sense": "If something rests somewhere, or if you rest it somewhere, it is supported by something else.", "level": "C2", "dict_examp": "She rested her elbows on the table.", "lear_examp": "This masterpiece, painted in shocking colors on an enormous canvas, shows an Indian, completely out of proportion, sitting on the ground and resting his head on his arms."}]}, {"pos": "noun", "senses": [{"sense": "the part of something that remains, or the others that remain", "level": "A2", "dict_examp": "Two students are in the library and the rest are in the classroom.", "lear_examp": "Bring a pencil and some paper, the teacher will give us the rest of the material."}, {"sense": "a period of time when you relax or sleep", "level": "A2", "dict_examp": "Why don't you take a rest?", "lear_examp": "My doctor told me that I should get more rest."}]}]}, {"word": "retain", "poses": [{"pos": "verb", "senses": [{"sense": "to continue to keep something", "level": "C2", "dict_examp": "Francis retained control of the company.", "lear_examp": "But, one might claim, this could also be good, as people retain their local customs, lifestyle, etc. and do not have the anxiety or stress of living in cities."}]}]}, {"word": "retrieve", "poses": [{"pos": "verb", "senses": [{"sense": "to get  something after first finding it", "level": "C2", "dict_examp": "Important historic documents were retrieved from a from a storage room last week.", "lear_examp": "When I have to make a credit decision, I retrieve the relevant industry analysis report in order to obtain a better understanding of the industry of the borrower."}]}]}, {"word": "retailer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who sells products to the public", "level": "C2", "dict_examp": "Retailers claim the new sales tax will hurt business.", "lear_examp": "They claim that retailers and advertisers brainwash us into buying more than necessary."}]}]}, {"word": "retrace", "poses": [{"pos": "verb", "senses": [{"sense": "to go back somewhere the same way that you came", "level": "C2", "dict_examp": "I was lost so I retraced my steps.", "lear_examp": "Mentally retracing his steps of the morning, he remembered rushing out of his place at the last minute."}]}]}, {"word": "restless", "poses": [{"pos": "adjective", "senses": [{"sense": "unable to be still or relax because you are bored or nervous", "level": "C1", "dict_examp": "The audience was getting restless.", "lear_examp": "Children are restless and they like to play and want to have fun all the time, even when they are flying."}, {"sense": "not satisfied with what you are doing now and wanting something new", "level": "C2", "dict_examp": "The opposition parties provide no clear alternative for restless voters.", "lear_examp": "She yearned for something different from her day-to-day life and grew increasingly restless."}]}]}, {"word": "restore", "poses": [{"pos": "verb", "senses": [{"sense": "to repair and clean something old", "level": "B2", "dict_examp": "The badly neglected paintings have all been carefully restored.", "lear_examp": "For example, the old church could be restored, to be as beautiful as it used to be."}, {"sense": "to make something good exist again", "level": "C1", "dict_examp": "Three wins in a row helped restore the team's confidence.", "lear_examp": "It would also restore our confidence in our paper if the correct version of events were printed, together with your statement of apology."}]}]}, {"word": "retreat", "poses": [{"pos": "verb", "senses": [{"sense": "to go away to a place or situation that is safer or quieter", "level": "C2", "dict_examp": "She retreated to the garden for some peace and quiet.", "lear_examp": "Many unemployed retreat into family life and give up social contact."}, {"sense": "When soldiers retreat, they move away from the enemy, especially to avoid fighting.", "level": "C2", "dict_examp": "The army was forced to retreat.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "a move away, especially to a place or situation that is safer or quieter", "level": "C2", "dict_examp": "He saw the dog coming towards him and beat a hasty retreat.", "lear_examp": "So the best he could do was to beat a quick retreat and make for the nearest airport."}, {"sense": "a quiet place where you can go to rest or be alone", "level": "C2", "dict_examp": "a mountain retreat", "lear_examp": "The park is a retreat, a hiding place where asylum can be found, a place in which peace and harmony are interlinked."}]}]}, {"word": "restaurant", "poses": [{"pos": "noun", "senses": [{"sense": "a place where you can buy and eat a meal", "level": "A1", "dict_examp": "We had lunch at/in a                          restaurant near the station.", "lear_examp": "Sometimes I'm very tired because I work in a restaurant."}]}]}, {"word": "retired", "poses": [{"pos": "adjective", "senses": [{"sense": "having stopped working, often because you are old", "level": "B2", "dict_examp": "Both my parents are retired.", "lear_examp": "This person is a retired soldier who fought during World War II."}]}]}, {"word": "résumé", "poses": [{"pos": "noun", "senses": [{"sense": "a document that describes your education, qualifications and the jobs you have done, which you send to an employer who you want to work for", "level": "B1", "dict_examp": "If you wish to apply, please send your résumé and a cover letter.", "lear_examp": "As you will see from my enclosed resume, I graduated from Faculty of Education in the Chinese University of Hong Kong and I worked in a child care center for three years."}]}]}, {"word": "retail", "poses": [{"pos": "noun", "senses": [{"sense": "the sale of products to customers for their own use, usually in stores", "level": "C1", "dict_examp": "jobs in retail", "lear_examp": "I work in retail and I know how important it is to work with your team."}]}, {"pos": "adjective", "senses": [{"sense": "involving or related to the sale of products to customers for their own use", "level": "C1", "dict_examp": "Retail sales are rising.", "lear_examp": "It is important to have continuous retail sales for any economy to function."}]}]}, {"word": "restriction", "poses": [{"pos": "noun", "senses": [{"sense": "a situation or event that limits what people can do", "level": "C1", "dict_examp": "For the first time, I could do exactly what I wanted, without any restrictions.", "lear_examp": "When people travel on their own, they can do what they want, without restrictions or limitations from their family."}, {"sense": "a rule or law  that limits or controls what people can do", "level": "C2", "dict_examp": "speed/parking restrictions", "lear_examp": "Our world is becoming smaller and smaller: boundaries are erased from the maps, countries cooperate more intensively, and trade restrictions are falling away."}]}]}, {"word": "result", "poses": [{"pos": "noun", "senses": [{"sense": "something that happens or exists because something else has happened", "level": "B1", "dict_examp": "Most accidents are the result of human error.", "lear_examp": "As a result, I am a bit cold now."}, {"sense": "information that you get from something such as an exam, a scientific experiment, or a medical test", "level": "B1", "dict_examp": "She's waiting for the results of a blood test.", "lear_examp": "Tim was my manager and he had promised me to write as soon as he was able to find out the music quiz results."}, {"sense": "the score or number of votes at the end of a competition or election", "level": "B1", "dict_examp": "Election results are beginning  to come in.", "lear_examp": "They were all so surprised about the result of the game Germany against Saudi Arabia that they welcomed me in a very friendly way."}]}, {"pos": "verb", "senses": [{"sense": "to cause a particular situation to happen", "level": "B2", "dict_examp": "The fire resulted in damage to their property.", "lear_examp": "It has resulted in a lack of repair services."}]}]}, {"word": "responsibility", "poses": [{"pos": "noun", "senses": [{"sense": "something that it is your job or duty to deal with", "level": "B2", "dict_examp": "The head of the department has various additional responsibilities.", "lear_examp": "It is the country's responsibility to supply the schools with everything needed."}, {"sense": "to say that you have done something or caused something to happen, especially something bad", "level": "B2", "dict_examp": "The company took full responsibility for the accident.", "lear_examp": "Sometimes he just takes all the responsibility for the projects, which he should not do, at least not alone."}]}]}, {"word": "retirement", "poses": [{"pos": "noun", "senses": [{"sense": "when you leave your job and stop working, usually because you are old", "level": "B2", "dict_examp": "Many teachers over the age of 50 are taking early retirement.", "lear_examp": "Dear Pamela, I really like you and am happy about our sharing the same office but I'm afraid that, because of your way of life, you will never reach the age of retirement."}, {"sense": "the period of your life after you have stopped working", "level": "B2", "dict_examp": "We wish you a long and happy retirement.", "lear_examp": "Before my retirement, I spent some 11 years in the U.S., Germany and Switzerland where I learned a lot about the different cultures and people's customs and manners."}]}]}, {"word": "restrain", "poses": [{"pos": "verb", "senses": [{"sense": "to control the actions or behavior of someone, sometimes by using force", "level": "C1", "dict_examp": "He became violent and had to be physically restrained.", "lear_examp": "It is sadly true, that we, from time to time, find it difficult to restrain our vivacious spirits."}]}]}, {"word": "retention", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to keep or continue having something", "level": "C2", "dict_examp": "Officials are focusing on job creation, not job retention.", "lear_examp": "Additional audio and video inputs allows easier assimilation and retention of this information."}]}]}, {"word": "restrict", "poses": [{"pos": "verb", "senses": [{"sense": "to limit something", "level": "C1", "dict_examp": "The state legislature voted to restrict development in the area.", "lear_examp": "We must try to restrict the use of water in agriculture."}]}]}, {"word": "restricted", "poses": [{"pos": "adjective", "senses": [{"sense": "controlled or limited", "level": "C1", "dict_examp": "Many events are free, so families on restricted budgets can participate.", "lear_examp": "As for things I personally do not like is, first of all, the restricted hours of library availability."}]}]}, {"word": "return", "poses": [{"pos": "verb", "senses": [{"sense": "to go or come back to a place where you were before", "level": "A2", "dict_examp": "He returned to Nigeria in 2009.", "lear_examp": "She will return to Turkey next Friday."}, {"sense": "to give, send, or put something back where it came from", "level": "A2", "dict_examp": "I have to return the book by Friday.", "lear_examp": "Can you return it to me, please?"}, {"sense": "to start doing an activity again or talking about something again", "level": "B2", "dict_examp": "I returned to work three months after Susie was born.", "lear_examp": "In August I must return to school, so I can only go to California in July."}, {"sense": "to happen again  or start to exist again", "level": "B2", "dict_examp": "You should call the doctor if the pain returns.", "lear_examp": "This made her calm down all of a sudden, and her voice returned."}, {"sense": "to react to something that someone does or says by doing or saying the same", "level": "C1", "dict_examp": "I returned his smile.", "lear_examp": "After the meeting he told me that this was the reason why he likes to work with me - thereby he returned the motivation that I gave to him."}, {"sense": "to go back to the usual condition", "level": "C1", "dict_examp": "Life has begun to return to normal now that the holidays are over.", "lear_examp": "After exactly ten minutes the electricity was switched on again and our life returned to normal - what a relief!"}]}, {"pos": "noun", "senses": [{"sense": "when someone goes or comes back to a place where they were before", "level": "B1", "dict_examp": "The whole town came out to celebrate his return from the war.", "lear_examp": "But on the return from Zurich we had an accident and the car has been destroyed."}, {"sense": "a key on a computer keyboard that is used to make the computer accept information or to start a new line in a document", "level": "B1", "dict_examp": "Type in the password and press return.", "lear_examp": ""}, {"sense": "in exchange for something or as a reaction to something", "level": "B2", "dict_examp": "I'd like to give them something in return for everything they've done for us.", "lear_examp": "I had a great time and in return I'd love to invite you to live at my house, while you are in Poland."}]}]}, {"word": "retire", "poses": [{"pos": "verb", "senses": [{"sense": "to leave your job and stop working, usually because you are old", "level": "B1", "dict_examp": "She retired from the company in 1990.", "lear_examp": "Nowadays I'm free because I retired recently."}]}]}, {"word": "restructure", "poses": [{"pos": "verb", "senses": [{"sense": "to organize a system or organization in a new way", "level": "C2", "dict_examp": "They are restructuring the business.", "lear_examp": "Nowadays, the globalization and merging trends are creating industrial giants that regularly have to restructure in order to minimize their production costs."}]}]}, {"word": "restrictive", "poses": [{"pos": "adjective", "senses": [{"sense": "limiting activities too much", "level": "C2", "dict_examp": "restrictive practices", "lear_examp": "On the other hand, being too restrictive may result in making the children passive, causing them to take everything for granted and leaving them completely unprepared for the harsh reality of life."}]}]}, {"word": "restroom", "poses": [{"pos": "noun", "senses": [{"sense": "a room or small building in a public place in which there are several toilets", "level": "A2", "dict_examp": "Do you know where the restroom is?", "lear_examp": "They reached the airport at 8:45 p.m. The flight was to take off at 11:30 p.m. So Lucy's father went to use the restroom."}]}]}, {"word": "restart", "poses": [{"pos": "verb", "senses": [{"sense": "to start something again that had stopped", "level": "C1", "dict_examp": "They want to restart the talks.", "lear_examp": "On the other hand, according to our recent survey, the company is getting into a better situation than it was beginning of this year and wants to restart trading with us."}, {"sense": "If you restart a computer, you turn it off and then on again.", "level": "C1", "dict_examp": "Try restarting your computer.", "lear_examp": ""}]}]}, {"word": "retrospect", "poses": [{"pos": "noun", "senses": [{"sense": "thinking back to something that happened  before", "level": "C2", "dict_examp": "In retrospect, I should probably have told her.", "lear_examp": "To cut a long story short I decided to go, though half-heartedly as I still had doubts about it. In retrospect, it turned out to be an unforgettable experience."}]}]}, {"word": "restraint", "poses": [{"pos": "noun", "senses": [{"sense": "calm and controlled behavior", "level": "C2", "dict_examp": "He showed admirable restraint and refused to be provoked.", "lear_examp": "In his opinion, a really professional butler should possess \"dignity,\" which means that he should not expose his feelings and should always be capable of emotional restraint even if he is being provoked by something very surprising, alarming or vexing."}]}]}, {"word": "ribbon", "poses": [{"pos": "noun", "senses": [{"sense": "a long, narrow piece of cloth that is used for tying things or used for decoration", "level": "C2", "dict_examp": "Her hair was tied with a velvet ribbon.", "lear_examp": "Just a week before, the wedding family and close friends come together to decorate the tent with special hand-folded ribbons."}]}]}, {"word": "reveal", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone a piece of information that is surprising or that was previously secret", "level": "B2", "dict_examp": "He was jailed for revealing secrets to the Russians.", "lear_examp": "I immediately knew that something was wrong so I had a word with Pat. She denied having revealed my secret."}, {"sense": "to allow something to be seen that, until then, had been hidden", "level": "C2", "dict_examp": "X-rays revealed that my ribs had been cracked but not broken.", "lear_examp": "When she was walking down the street feeling elated by the success of the business meeting, a gorgeous thirtyish man wearing a beige polo neck swiftly approached and turned toward her and smiled, revealing strong white teeth."}]}]}, {"word": "revive", "poses": [{"pos": "verb", "senses": [{"sense": "to make something from the past exist again", "level": "C2", "dict_examp": "to revive memories", "lear_examp": "Why not revive the \"good old\" reading sessions we had in many town libraries in the 70s and 80s?"}]}]}, {"word": "revolt", "poses": [{"pos": "verb", "senses": [{"sense": "to try to change a government, often using violence, or to refuse to accept someone's authority", "level": "C2", "dict_examp": "Many were killed when nationalists revolted against the new government.", "lear_examp": "What often happens, if money is the substitute for love, is that children revolt against their parents."}, {"sense": "to think that something is extremely unpleasant", "level": "C2", "dict_examp": "They were revolted by conditions on the farm.", "lear_examp": "They are revolted by Olivia's decision which also shows the condescending opinion they have of the Nawab."}]}]}, {"word": "reversal", "poses": [{"pos": "noun", "senses": [{"sense": "a change to the opposite position, direction or order of something", "level": "C2", "dict_examp": "In a significant reversal of earlier trends, people are moving back to Salt Lake City.", "lear_examp": "As a result, more and more people will become aware of the existing situation and contribute to its reversal."}]}]}, {"word": "revert", "poses": [{"pos": "verb", "senses": [{"sense": "to go back to how something was before", "level": "C2", "dict_examp": "For a while I ate low-fat food but then I reverted to my old eating habits.", "lear_examp": "Piggy is one of the few boys who are conscious that they are reverting to savagery."}]}]}, {"word": "revenge", "poses": [{"pos": "noun", "senses": [{"sense": "something that you do to punish someone who has done something bad to you", "level": "B2", "dict_examp": "He's made life very difficult for me but I'll get/take my revenge.", "lear_examp": "Lew Kuan Yee had sworn revenge against Michael, the detective who had sent him behind bars."}]}]}, {"word": "rich", "poses": [{"pos": "adjective", "senses": [{"sense": "having much more money than most people, or owning things that could be sold for a lot of money", "level": "A2", "dict_examp": "She's from a very rich family.", "lear_examp": "I got many CDs, DVDs and clothes, but the best present was a 72\" Plasma television that I received from our rich friend, Richie Rich."}, {"sense": "Rich food has a lot of fat, oil or eggs in it.", "level": "B2", "dict_examp": "a rich sauce", "lear_examp": "The cooking is based on traditional recipes of Westfalian origin and it is tasty but often very rich!"}, {"sense": "containing a lot of something that is important or valuable", "level": "B2", "dict_examp": "The region is rich in minerals and coal deposits.", "lear_examp": "Their lessons are valuable, rich in knowledge and funny."}]}, {"pos": "noun", "senses": [{"sense": "people who are rich", "level": "C1", "dict_examp": "These ski resorts are for the rich.", "lear_examp": "What did the rich do all day?"}]}]}, {"word": "revival", "poses": [{"pos": "noun", "senses": [{"sense": "when something becomes more active or popular again", "level": "C2", "dict_examp": "a revival in folk music", "lear_examp": "In recent years the fear of society has led to a revival of conservative ideas that want to shift responsibility for this kind of education back to the family unit."}]}]}, {"word": "rewarding", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel satisfied that you have done something well or done something helpful", "level": "C1", "dict_examp": "a rewarding experience", "lear_examp": "I led a workshop with children, which was a very rewarding experience, and performed for people of all ages and backgrounds."}]}]}, {"word": "reversible", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is reversible, it can be changed back to what it was before.", "level": "C2", "dict_examp": "Most of the damage done to the cells is reversible.", "lear_examp": "The friendship that I thought was for life stopped somewhere and somehow in an unexpected way, which didn't allow us to make the situation reversible."}, {"sense": "Reversible clothes can be worn so that the inside is the outside.", "level": "C2", "dict_examp": "a reversible jacket", "lear_examp": ""}]}]}, {"word": "rice", "poses": [{"pos": "noun", "senses": [{"sense": "small grains from a plant that are cooked and eaten", "level": "A1", "dict_examp": "boiled/fried rice", "lear_examp": "I like rice and fish."}]}]}, {"word": "revolution", "poses": [{"pos": "noun", "senses": [{"sense": "a change in the way a country is governed, usually to a different political system and often involving violence or war", "level": "B2", "dict_examp": "The French Revolution changed France from a monarchy to a republic.", "lear_examp": "It's supposed to be read as a study of the Soviet dictatorship during the October revolution and beyond into the Cold War era."}, {"sense": "a very important change in the way that people do things", "level": "B2", "dict_examp": "a technological revolution", "lear_examp": "The technological revolution taking place today can be directly linked to the amazing evolution of our communication abilities throughout these last years."}]}]}, {"word": "revolutionary", "poses": [{"pos": "adjective", "senses": [{"sense": "completely different from what was done before", "level": "B2", "dict_examp": "The twentieth century brought about revolutionary changes in our lifestyles.", "lear_examp": "Maybe my ideas are too revolutionary but ... I think in this way Torino would be NICER!"}, {"sense": "involved in or relating to a revolution", "level": "B2", "dict_examp": "a revolutionary leader/movement", "lear_examp": ""}]}]}, {"word": "revise", "poses": [{"pos": "verb", "senses": [{"sense": "to change something so that it is more accurate or better than before", "level": "B2", "dict_examp": "His publishers made him revise his manuscript three times.", "lear_examp": "I advise you to revise your schedule."}]}]}, {"word": "rhythm", "poses": [{"pos": "noun", "senses": [{"sense": "a regular, repeating pattern of sound or movement", "level": "B2", "dict_examp": "He beat out a jazz rhythm on the drums.", "lear_examp": "From then on I have been suffering from high blood pressure and disturbances of the rhythm of the heart-beat."}]}]}, {"word": "reunion", "poses": [{"pos": "noun", "senses": [{"sense": "an occasion when people meet together again, often after a long time", "level": "C2", "dict_examp": "a family/school reunion", "lear_examp": "All the former students where left with a lot of good memories, which was clearly shown a few months ago when we organized a reunion of the old B class, the number of people present was double what was expected."}]}]}, {"word": "reward", "poses": [{"pos": "noun", "senses": [{"sense": "something good that you get or experience because you have worked hard, behaved well, etc.", "level": "B1", "dict_examp": "There'll be a reward for whoever finishes first.", "lear_examp": "A TV company chose our school for a program!  We won a contest with a surprise reward, and that was it!"}, {"sense": "an amount of money given to someone for helping to find something or for helping the police to return stolen property", "level": "B1", "dict_examp": "The police offered a reward for any information about the robbery.", "lear_examp": "And as a reward, my father took out RM500 and gave it to the bystander."}]}, {"pos": "verb", "senses": [{"sense": "to give someone a reward", "level": "B2", "dict_examp": "She was rewarded for her bravery.", "lear_examp": "She was so happy afterwards and was even rewarded with a medal."}]}]}, {"word": "rib", "poses": [{"pos": "noun", "senses": [{"sense": "one of the curved bones in the chest", "level": "B2", "dict_examp": "He cracked a rib in the accident.", "lear_examp": "I stayed there for 2 weeks with a broken leg, sore ribs and a couple of scars."}]}]}, {"word": "reverse", "poses": [{"pos": "verb", "senses": [{"sense": "to change a situation or change the order of things so that it becomes the opposite", "level": "C1", "dict_examp": "Now that you have a job and I don't, our situations are reversed.", "lear_examp": "This trend should be reversed in the near future."}]}, {"pos": "noun", "senses": [{"sense": "in the opposite order or way", "level": "C1", "dict_examp": "Now go through the steps in reverse to take the bookcase apart.", "lear_examp": "They want to see what they are not like, how they would not react and this, in reverse, helps them to find themselves."}, {"sense": "the method for driving a vehicle that makes it go backward", "level": "C2", "dict_examp": "Put the car in/into reverse.", "lear_examp": "I had a last good look around and then I returned to the car and put it into reverse."}]}]}, {"word": "revelation", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of information that is discovered although it was intended to be kept secret", "level": "C2", "dict_examp": "He resigned following revelations about his private life.", "lear_examp": "No, the mayor didn't know, but said he was looking forward to any more revelations about their heroic community member."}, {"sense": "to be an extremely pleasant surprise", "level": "C2", "dict_examp": "Anna's musical talent was a revelation.", "lear_examp": "Every word you said was a revelation to me."}]}]}, {"word": "return", "poses": [{"pos": "verb", "senses": [{"sense": "to go or come back to a place where you were before", "level": "A2", "dict_examp": "He returned to Nigeria in 2009.", "lear_examp": "She will return to Turkey next Friday."}, {"sense": "to give, send, or put something back where it came from", "level": "A2", "dict_examp": "I have to return the book by Friday.", "lear_examp": "Can you return it to me, please?"}, {"sense": "to start doing an activity again or talking about something again", "level": "B2", "dict_examp": "I returned to work three months after Susie was born.", "lear_examp": "In August I must return to school, so I can only go to California in July."}, {"sense": "to happen again  or start to exist again", "level": "B2", "dict_examp": "You should call the doctor if the pain returns.", "lear_examp": "This made her calm down all of a sudden, and her voice returned."}, {"sense": "to react to something that someone does or says by doing or saying the same", "level": "C1", "dict_examp": "I returned his smile.", "lear_examp": "After the meeting he told me that this was the reason why he likes to work with me - thereby he returned the motivation that I gave to him."}, {"sense": "to go back to the usual condition", "level": "C1", "dict_examp": "Life has begun to return to normal now that the holidays are over.", "lear_examp": "After exactly ten minutes the electricity was switched on again and our life returned to normal - what a relief!"}]}, {"pos": "noun", "senses": [{"sense": "when someone goes or comes back to a place where they were before", "level": "B1", "dict_examp": "The whole town came out to celebrate his return from the war.", "lear_examp": "But on the return from Zurich we had an accident and the car has been destroyed."}, {"sense": "a key on a computer keyboard that is used to make the computer accept information or to start a new line in a document", "level": "B1", "dict_examp": "Type in the password and press return.", "lear_examp": ""}, {"sense": "in exchange for something or as a reaction to something", "level": "B2", "dict_examp": "I'd like to give them something in return for everything they've done for us.", "lear_examp": "I had a great time and in return I'd love to invite you to live at my house, while you are in Poland."}]}]}, {"word": "revenue", "poses": [{"pos": "noun", "senses": [{"sense": "income received by a business or government or the amount of this income", "level": "C1", "dict_examp": "state/federal revenues", "lear_examp": "Both the coffee bar and the shop will generate revenue, be self-sufficient and, more importantly, create jobs for the college students."}]}]}, {"word": "rewrite", "poses": [{"pos": "verb", "senses": [{"sense": "to write something again in order to improve it", "level": "B2", "dict_examp": "I had to rewrite my essay.", "lear_examp": "I trust you will give this matter your immediate attention and rewrite your report using the information given."}]}]}, {"word": "review", "poses": [{"pos": "verb", "senses": [{"sense": "to study a subject before you take a test", "level": "B1", "dict_examp": "She spent half the night reviewing her notes for the French test.", "lear_examp": "What am I going to review for the exam?"}, {"sense": "to give your opinion in a report about a book, film, television program, etc.", "level": "B2", "dict_examp": "He reviews movies for the local paper.", "lear_examp": ""}, {"sense": "to consider something again in order to decide if changes should be made", "level": "C1", "dict_examp": "Officials have to review the text before it’s made public.", "lear_examp": "On the other hand I would like to ask you kindly to review my conditions of employment and to take in consideration my expenses, which I think would be more than correct."}]}, {"pos": "noun", "senses": [{"sense": "a report in a newspaper, magazine, or program that gives an opinion about a new book, film, etc.", "level": "B1", "dict_examp": "He writes movie/theater/book reviews for the newspapers.", "lear_examp": "I was thinking we should see \"Show Bar,\" the review is good!"}, {"sense": "the study you do to learn about a subject or before a test", "level": "B1", "dict_examp": "The teacher devoted the last week of the semester to  review", "lear_examp": "I'll be in an exam review on Tuesday at 11:00am, so I was thinking if we can change our meeting, the same day, just a little bit later, if you don't mind we could meet us at the Italian restaurant at 3:00pm."}, {"sense": "the process of considering something again in order to make changes to it", "level": "C2", "dict_examp": "a review of teachers' pay", "lear_examp": ""}]}]}, {"word": "rhyme", "poses": [{"pos": "verb", "senses": [{"sense": "If a word rhymes with another word, the end part of the words sound the same.", "level": "C2", "dict_examp": "\"Moon\" rhymes with \"June.\"", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "a short poem that has words ending in the same sound at the end of the lines", "level": "C2", "dict_examp": "The card contained a short rhyme.", "lear_examp": "It gives a child immense pleasure when her parent reads out a rhyme or a story to her."}, {"sense": "a style of writing or speaking that uses words that end with the same sound", "level": "C2", "dict_examp": "The story was written entirely in rhyme.", "lear_examp": "The poem had no rhyme and it had a free verse form."}]}]}, {"word": "rip", "poses": [{"pos": "verb", "senses": [{"sense": "to tear quickly and suddenly, or to tear something quickly and suddenly", "level": "B2", "dict_examp": "His new shorts ripped when he fell down.", "lear_examp": "While I was walking I stepped on my dress and ripped it."}, {"sense": "to remove something by pulling it away", "level": "C1", "dict_examp": "The previous owner ripped out the fireplace.", "lear_examp": "During the moving process two legs of my 100 year old dinning table were broken.  One leg was completely ripped off, while the other is just managing to hold on."}, {"sense": "to cheat someone by making them pay too much money for something", "level": "C2", "dict_examp": "We got ripped off when we bought our car.", "lear_examp": "Although I prefer wedding ceremonies the traditional way, I do feel that it's also a big market where brides-to-be get ripped off by the ridiculous prices of wedding gowns, venues and photographers."}]}]}, {"word": "rigid", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to change or be changed easily", "level": "C2", "dict_examp": "I found the rules a little too rigid.", "lear_examp": "They were all trying to do their best in the rigid framework of the existing system (one of them even succeeded in making the difference)."}]}]}, {"word": "riches", "poses": [{"pos": "noun", "senses": [{"sense": "a lot of money or valuable objects", "level": "C2", "dict_examp": "To her, $500 seemed like untold riches.", "lear_examp": "First, her career can be regarded as the typical rise from \"rags to riches.\""}]}]}, {"word": "right", "poses": [{"pos": "adjective", "senses": [{"sense": "correct or true", "level": "A1", "dict_examp": "He only got half the answers right.", "lear_examp": "You're right!"}, {"sense": "on or toward the side of your body that is to the east when you are facing north", "level": "A2", "dict_examp": "Most people write with their right hand.", "lear_examp": "He saw a man running away holding a gun in his right hand."}, {"sense": "suitable or best in a particular situation", "level": "B1", "dict_examp": "I'm not sure she's the right person for the job.", "lear_examp": "I know that you will make the right choice!"}, {"sense": "fair or morally acceptable", "level": "B2", "dict_examp": "It's not right to criticize him behind his back.", "lear_examp": "The Police arrived after one hour and Agatha decided to tell them everything, because it was the right thing."}, {"sense": "all the way", "level": "C2", "dict_examp": "Did you read it right through to the end?", "lear_examp": "As time passes by, Ralph learns about Piggy's value as he is the only one that stays with him right to the end."}]}, {"pos": "adverb", "senses": [{"sense": "to the side of your body that is to the east when you are facing north", "level": "A2", "dict_examp": "Turn/Go right  at the first traffic light.", "lear_examp": "We are going to walk along Main Street and turn right next to the library."}, {"sense": "used at the beginning of a sentence to get someone's attention or to show you have understood someone", "level": "A2", "dict_examp": "Right, whose turn is it to clean up?", "lear_examp": ""}, {"sense": "exactly in a place or time", "level": "B1", "dict_examp": "He's right here with me.", "lear_examp": "That's me, right here."}, {"sense": "immediately", "level": "B1", "dict_examp": "Do you want to start right away?", "lear_examp": "As soon as I saw the handwriting on the envelope I smiled.   I recognized it right away."}, {"sense": "correctly", "level": "B2", "dict_examp": "He guessed right most of the time.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the right side of your body, or the direction toward this side", "level": "A2", "dict_examp": "You'll find her in the second room on the right.", "lear_examp": "On the right there is a wardrobe and a table with a chair."}, {"sense": "morally correct behavior", "level": "B2", "dict_examp": "I've tried to teach them the difference between right and wrong.", "lear_examp": "He was raised not knowing the difference between right and wrong."}, {"sense": "something that the law allows you to do", "level": "B2", "dict_examp": "the right to free speech", "lear_examp": "To sum up, famous people are the same as we are, and we all have the right to lead a private life and no right to break into their privacy."}, {"sense": "to have, or not have, a good reason for something", "level": "C1", "dict_examp": "He has a right to be angry.", "lear_examp": "Finally, you have no right to say that we \"did not reach our target figure\" since the whole event was considered to be a success by many people."}, {"sense": "political groups which support limited economic controls, private ownership of property and wealth, and limited government", "level": "C2", "dict_examp": "The right campaigned against the president.", "lear_examp": ""}, {"sense": "in a way that does not rely on anything or anyone else", "level": "C2", "dict_examp": "I think this is a dialect, rather than a language in its own right.", "lear_examp": "Major international sports competitions can either be understood as a means to an end or an end in their own right."}]}, {"pos": "exclamation", "senses": [{"sense": "used to express agreement with someone", "level": "A2", "dict_examp": "\"Johnny, you climb up first.\"  \"Right!\"", "lear_examp": ""}]}]}, {"word": "riot", "poses": [{"pos": "noun", "senses": [{"sense": "angry, violent behavior by a crowd of people in a public place", "level": "C1", "dict_examp": "The march turned into a riot when the crowd found the way was blocked.", "lear_examp": "A riot started in the city but the police managed to stop it before anyone got seriously hurt."}, {"sense": "extremely colorful and bright", "level": "C2", "dict_examp": "Jim's rose garden is a riot of color.", "lear_examp": "I like the narrow streets, the smell of overripe fruit in the middle of the summer, the gardens, which are a riot of color in spring, small thatched cottages, which you can never see anywhere else in Russia."}]}, {"pos": "verb", "senses": [{"sense": "to take part in a riot", "level": "C2", "dict_examp": "People were rioting in the streets.", "lear_examp": "If there are a lot of frustrated individuals in an area, they may band together and begin rioting."}]}]}, {"word": "ride", "poses": [{"pos": "verb", "senses": [{"sense": "to travel by sitting on a horse, bicycle, or motorcycle and controlling it", "level": "A1", "dict_examp": "I learned to ride a bike when I was four.", "lear_examp": "I like riding my bike in Gloucester."}, {"sense": "to travel in a vehicle, such as a car, bus or train", "level": "A2", "dict_examp": "We rode the train from Sydney to Perth.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "a trip in a vehicle or train", "level": "B1", "dict_examp": "It's a short bus ride to the airport.", "lear_examp": "On the next day, I went swimming in the lake early in the morning and took a bus ride home after that."}, {"sense": "a trip you take by riding a bicycle, motorcycle, or horse", "level": "B1", "dict_examp": "He's gone out for a ride on his bike.", "lear_examp": "I swam in the sea, sunbathed on the golden beach and had a ride on a scooter."}, {"sense": "a machine at a fair  that moves people up and down, around in circles, etc., as they sit in it", "level": "B1", "dict_examp": "She wanted me to go on a ride with her.", "lear_examp": "I recommend visits to the beaches because there are different rides, boating and much more available."}]}]}, {"word": "ripe", "poses": [{"pos": "adjective", "senses": [{"sense": "developed enough and ready to be eaten", "level": "B2", "dict_examp": "ripe fruit", "lear_examp": "There were a lot of beautiful, ripe, red strawberries and I couldn't resist picking one of them."}, {"sense": "developed enough to be ready for something", "level": "C2", "dict_examp": "The country is ripe for change.", "lear_examp": "We can say that the time was ripe for his success."}]}]}, {"word": "rightly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a correct way", "level": "B2", "dict_examp": "He is rightly concerned about the situation.", "lear_examp": "If I remember rightly, there were over 5,000."}]}]}, {"word": "right-wing", "poses": [{"pos": "adjective", "senses": [{"sense": "supporting limited economic controls, private property and wealth, and limited government", "level": "C2", "dict_examp": "She's extremely right-wing.", "lear_examp": "Some of them even turn to right-wing extremism."}]}]}, {"word": "richness", "poses": [{"pos": "noun", "senses": [{"sense": "the interesting or impressive quality of something that shows how strong or varied it is", "level": "C1", "dict_examp": "I was amazed by  the richness of their traditions.", "lear_examp": "Cultures of Mexico: You will be able to discover the richness and variety of Mexican ancient cultures: - Mexica - Maya - Olmeca - Tolteca - Zapoteca - Chichimeca."}]}]}, {"word": "ring", "poses": [{"pos": "noun", "senses": [{"sense": "a round piece of jewelry that you wear on your finger", "level": "A2", "dict_examp": "a wedding ring", "lear_examp": "Sammy gave me a gold ring, Remi an orange sweater, Minny a bag and Dominique a red cap."}, {"sense": "something that is the shape of a circle", "level": "B2", "dict_examp": "The children sat in a ring around the teacher.", "lear_examp": "It is forced to jump into a ring of fire, if it does not want to do it, it will be hit."}, {"sense": "the sound a bell makes", "level": "B2", "dict_examp": "The ring of the doorbell woke him up.", "lear_examp": "Walking down the street, he heard a noise: just the ring of the clock tower."}]}, {"pos": "verb", "senses": [{"sense": "If something rings, it makes the sound of a bell, and if you ring a bell, you cause it to make a sound.", "level": "B1", "dict_examp": "The phone's ringing.", "lear_examp": "Me and a few of my friends were having a day off school so we went to a lovely beach by the Danube river, when my phone rang."}, {"sense": "If a word, especially a name, rings a bell, you think you have heard it before.", "level": "C2", "dict_examp": "Shane Watson? That name rings a bell.", "lear_examp": "Its name is Laser - I suppose it rings a bell?"}, {"sense": "If something someone says rings hollow, it does not sound true or sincere.", "level": "C2", "dict_examp": "He said he was pleased, but his words rang hollow.", "lear_examp": "Everything rang hollow to her, so she decided to follow him in order to understand what had happened and her fiancé became so friendly and understanding."}]}]}, {"word": "ridiculous", "poses": [{"pos": "adjective", "senses": [{"sense": "very silly", "level": "B2", "dict_examp": "I'd look ridiculous in a hat like that.", "lear_examp": "So, it is just ridiculous to hear that there were fewer than 2000 people there."}]}]}, {"word": "rich", "poses": [{"pos": "adjective", "senses": [{"sense": "having much more money than most people, or owning things that could be sold for a lot of money", "level": "A2", "dict_examp": "She's from a very rich family.", "lear_examp": "I got many CDs, DVDs and clothes, but the best present was a 72\" Plasma television that I received from our rich friend, Richie Rich."}, {"sense": "Rich food has a lot of fat, oil or eggs in it.", "level": "B2", "dict_examp": "a rich sauce", "lear_examp": "The cooking is based on traditional recipes of Westfalian origin and it is tasty but often very rich!"}, {"sense": "containing a lot of something that is important or valuable", "level": "B2", "dict_examp": "The region is rich in minerals and coal deposits.", "lear_examp": "Their lessons are valuable, rich in knowledge and funny."}]}, {"pos": "noun", "senses": [{"sense": "people who are rich", "level": "C1", "dict_examp": "These ski resorts are for the rich.", "lear_examp": "What did the rich do all day?"}]}]}, {"word": "right-hand", "poses": [{"pos": "adjective", "senses": [{"sense": "on or to the right of something", "level": "A2", "dict_examp": "On the right-hand side you'll see a sign.", "lear_examp": "You can see my house on the right-hand side."}]}]}, {"word": "rider", "poses": [{"pos": "noun", "senses": [{"sense": "someone who rides a horse, bicycle, or motorcycle", "level": "B1", "dict_examp": "One of the riders was thrown off his horse.", "lear_examp": "A lot of good riders will come with their horses to take part in a competition."}]}]}, {"word": "rid", "poses": [{"pos": "adjective", "senses": [{"sense": "to throw something away or give something to someone because you no longer want it", "level": "B1", "dict_examp": "We must get rid of some of those old books.", "lear_examp": "Do you think I'd better get rid of the sofa and place the bookshelf there?"}, {"sense": "to end something unpleasant", "level": "B2", "dict_examp": "I can't seem to get rid of this headache.", "lear_examp": "The first step is to get rid of smoking."}, {"sense": "to make someone leave", "level": "C1", "dict_examp": "We finally got rid of my little sister by telling her scary stories.", "lear_examp": "Improving your English on your own (or a self-guide on how to get rid of your English teacher!)"}]}]}, {"word": "robot", "poses": [{"pos": "noun", "senses": [{"sense": "a machine controlled by a computer, which can move and do other things that people can do", "level": "B1", "dict_examp": "They use robots to spray the cars.", "lear_examp": "I think there will be tall buildings and the population will rise a lot. I think there will be robots too."}]}]}, {"word": "rip-off", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is cheated by being made to pay too much for something", "level": "C1", "dict_examp": "The food there is a real rip-off.", "lear_examp": "What is more, I am sure students won't feel like it is a rip-off because prices are really reasonable."}]}]}, {"word": "ritual", "poses": [{"pos": "noun", "senses": [{"sense": "an activity or a set of actions that are always done in the same way or at the same time, sometimes as part of a religion", "level": "C2", "dict_examp": "Coffee and the paper are part of my morning ritual.", "lear_examp": "I want to be able to travel to another country (for example Jamaica), learn a new culture (like the Rastafarian culture) and their rites and rituals."}]}]}, {"word": "risk", "poses": [{"pos": "noun", "senses": [{"sense": "the possibility of something bad happening", "level": "B2", "dict_examp": "the risk of heart disease", "lear_examp": "Nowadays, everything is a risk, even at home we are in danger."}, {"sense": "being in a situation where something bad is likely to happen", "level": "B2", "dict_examp": "All houses on the lake front are at risk of flooding.", "lear_examp": "Lives are at risk!"}, {"sense": "to do something although something bad might happen because of it", "level": "B2", "dict_examp": "This time I'm not taking any risks - I'm going to back up my computer.", "lear_examp": "He had to take a risk if he wanted to save his love, Anne."}, {"sense": "something bad that might happen", "level": "C1", "dict_examp": "There are more health risks when older women get pregnant.", "lear_examp": "In general, I believe that the awareness of the pubic about the health risks is the most important milestone in this race."}, {"sense": "to do something although something bad might happen because of it", "level": "C2", "dict_examp": "I think I'll run the risk of hurting her feelings, and tell her the truth.", "lear_examp": "They constantly run the risk of losing their physical abilities."}, {"sense": "If you do something at your own risk, you are completely responsible for anything bad that might happen because of it.", "level": "C2", "dict_examp": "Customers may leave vehicles here at their own risk.", "lear_examp": "However, when a young man decides to go on a dangerous expedition, he should do so at his own risk and should not rely on help from anyone."}]}, {"pos": "verb", "senses": [{"sense": "If you risk something bad, you do something although that bad thing might happen.", "level": "B2", "dict_examp": "I'd like to help you, but I can't risk losing my job.", "lear_examp": "You shouldn't risk damaging your health."}, {"sense": "If you risk something important, you cause it to be in a dangerous situation where you might lose it.", "level": "B2", "dict_examp": "He risked his life to save me.", "lear_examp": "If she had gone home by taxi, she would have not risked her life."}]}]}, {"word": "roar", "poses": [{"pos": "verb", "senses": [{"sense": "to make a loud, deep sound", "level": "C2", "dict_examp": "We could hear a lion roaring on the other side of the zoo.", "lear_examp": "There are also unforgettable immediate responses that will make people roar with laughter."}, {"sense": "to say something in a very loud voice", "level": "C2", "dict_examp": "\"Stop that!\" he roared.", "lear_examp": "\"Stop clicking that picture box and help me with the cows,\" her father would roar and if it was not the cows, it was the pigs, and if it was not the pigs, it was the hens."}]}, {"pos": "noun", "senses": [{"sense": "a loud, deep sound", "level": "C2", "dict_examp": "a lion's roar", "lear_examp": "However, I will try to portray an accurate picture of what living under the constant roar of aircraft engines is about."}]}]}, {"word": "rocket", "poses": [{"pos": "noun", "senses": [{"sense": "a tube-shaped device containing fuel and an engine that pushes a vehicle into space", "level": "B2", "dict_examp": "They launched a rocket yesterday.", "lear_examp": "With computers, you can control machines or a rocket or a satellite."}, {"sense": "a tube-shaped weapon that carries a bomb", "level": "C2", "dict_examp": "Rockets were fired across the border.", "lear_examp": "Furthermore, nuclear rockets and missiles should be prohibited."}]}]}, {"word": "rise", "poses": [{"pos": "verb", "senses": [{"sense": "When the sun or moon rises, it appears in the sky.", "level": "B1", "dict_examp": "The sun rises in the east.", "lear_examp": "It was very beautiful, especially in the morning when the sun was rising."}, {"sense": "to move up", "level": "B1", "dict_examp": "The balloon rose up into the air.", "lear_examp": ""}, {"sense": "to increase in level", "level": "B2", "dict_examp": "rising temperatures", "lear_examp": "Also, due to global warming, sea levels might rise and the risk of flooding will also rise."}, {"sense": "to become important, successful, or rich", "level": "C2", "dict_examp": "He quickly rose to stardom.", "lear_examp": "He then joined the company he is now the managing director of; during 15 years, he steadily rose through the ranks to the top."}]}, {"pos": "noun", "senses": [{"sense": "an increase in the level of something", "level": "B2", "dict_examp": "a sudden rise in temperature", "lear_examp": "Scientifically speaking the number of people who visit doctors simply because they suffer from ulcers and similar diseases is on the rise."}, {"sense": "when someone becomes very famous or powerful", "level": "C2", "dict_examp": "The movie charts his rise to power.", "lear_examp": "He is one of these artists whom I respect immensely as his rise to celebrity was a long and painstaking journey, mainly because he was always faithful to the kind of music he wanted to play and to the ideals he wanted to convey through his lyrics, and also because he shows great modesty."}, {"sense": "to cause something", "level": "C2", "dict_examp": "International support has given rise to a new optimism within the company.", "lear_examp": "More often than not, however, such events will also give rise to all sorts of contradictions."}]}]}, {"word": "rock", "poses": [{"pos": "noun", "senses": [{"sense": "loud, modern music with a strong beat, often played with electric guitars and drums", "level": "A2", "dict_examp": "rock music", "lear_examp": "I like rock music."}, {"sense": "the hard, natural substance that forms part of the earth's surface, or an area of this substance sticking out of the sea or ground", "level": "B1", "dict_examp": "a layer of rock", "lear_examp": "There are many wonderful hills, mountains, lakes, caves and rocks."}]}, {"pos": "verb", "senses": [{"sense": "to move backward and forward or from side to side, or to make someone or something do this", "level": "C2", "dict_examp": "She rocked back and forth on her chair.", "lear_examp": "The violent storm was rocking the ship back and forth."}, {"sense": "to do or say something that changes a situation in a way that causes problems", "level": "C2", "dict_examp": "They seemed very happy and I didn't want to rock the boat.", "lear_examp": "But let's not rock the boat. Our preposterous cravings and wishes might become our downfall."}]}]}, {"word": "role model", "poses": [{"pos": "noun", "senses": [{"sense": "someone you try to behave like because you admire them", "level": "C1", "dict_examp": "Jane is such a good role model for her younger sister.", "lear_examp": "Pele was voted Athlete of the Century for his outstanding performance and for being such a positive role model for other athletes and youth in general."}]}]}, {"word": "rocky", "poses": [{"pos": "adjective", "senses": [{"sense": "with lots of rocks", "level": "C1", "dict_examp": "a rocky beach", "lear_examp": "The walk around the lake is an extraordinary experience - seeing the majesty of the rocky mountains around the blue surface, which reflects the lights as a mirror, is unforgettable."}, {"sense": "a rocky situation or relationship is difficult or uncertain", "level": "C2", "dict_examp": "Our basketball team's season got off to a rocky start with three straight losses.", "lear_examp": "Their marriage started to get a bit rocky due to the mother's devotion to finding Mary."}]}]}, {"word": "rival", "poses": [{"pos": "noun", "senses": [{"sense": "someone or something that is competing with another person or thing", "level": "C1", "dict_examp": "business/political rivals", "lear_examp": "Around 60% of our international rivals had their stands there, usually with 2-3 staff members always kept busy by the public."}]}, {"pos": "verb", "senses": [{"sense": "to be good enough to compete with someone or something else", "level": "C2", "dict_examp": "Australian wine can now rival the best from France.", "lear_examp": "His intimidating presence was rivalled only by that of his ferocious-looking dog."}]}]}, {"word": "robbery", "poses": [{"pos": "noun", "senses": [{"sense": "the crime of stealing from somewhere or someone", "level": "B2", "dict_examp": "a bank robbery", "lear_examp": "We were fed up with our lives and all the problems we had so one of us decided to organize a bank robbery. At first we laughed at him because it was such a silly idea but finally it was the only solution for us to become rich."}]}]}, {"word": "road", "poses": [{"pos": "noun", "senses": [{"sense": "a route between places, usually with a hard surface built for vehicles to drive on", "level": "A1", "dict_examp": "a dirt/gravel/paved road", "lear_examp": "On Wednesdays and Saturdays the road is very busy."}, {"sense": "used in the name of a road as part of an address", "level": "A1", "dict_examp": "142 Park Road", "lear_examp": "I go shopping on Ladypool Road."}, {"sense": "driving or traveling, usually over a long distance", "level": "C1", "dict_examp": "We'd been on the road for 4 hours so we stopped to stretch and have a snack.", "lear_examp": "I have experienced sitting behind a steering wheel on the road for many years."}]}]}, {"word": "roll", "poses": [{"pos": "verb", "senses": [{"sense": "to move somewhere by turning in a circular direction, or to make something move this way", "level": "B2", "dict_examp": "The ball rolled between his legs.", "lear_examp": "Paul broke his leg by rolling down the mountain."}, {"sense": "to turn something around itself to make the shape of a ball or tube", "level": "B2", "dict_examp": "He was rolling a cigarette.", "lear_examp": ""}, {"sense": "to move somewhere smoothly", "level": "B2", "dict_examp": "The driver rolled down his car window.", "lear_examp": "By this time, the rest of us were laughing so hard that tears were rolling down our cheeks."}, {"sense": "to move your eyes in a circle to show surprise or disapproval", "level": "C2", "dict_examp": "When I asked her when she thought the building work would be finished, she just rolled her eyes.", "lear_examp": "This attitude is obvious when, for instance, sales assistants show no patience for the slower reaction of elderly people; when nobody offers a seat to an older person in an overcrowded train; when we roll our eyes about older people's desire for quiet, etc."}, {"sense": "to make something begin or happen", "level": "C2", "dict_examp": "We have to get the ball rolling on this project soon.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "a small loaf of bread for one person", "level": "B1", "dict_examp": "I had a roll with my soup.", "lear_examp": "We eat ham, cheese, butter and paprika, with a roll or bread."}, {"sense": "a piece of plastic, paper, cloth, etc. that is rolled into the shape of a tube", "level": "B2", "dict_examp": "a roll of carpet", "lear_examp": ""}]}]}, {"word": "risky", "poses": [{"pos": "adjective", "senses": [{"sense": "dangerous because something bad might happen", "level": "B2", "dict_examp": "It's risky to buy a car without some good advice.", "lear_examp": "Cycling on this road is a bit risky and demanding so I would agree with Chris on that point."}]}]}, {"word": "rivalry", "poses": [{"pos": "noun", "senses": [{"sense": "a serious and often continuing competition", "level": "C2", "dict_examp": "There is intense rivalry between the two teams.", "lear_examp": "These major differences create a great rivalry between the two boys."}]}]}, {"word": "roast", "poses": [{"pos": "verb", "senses": [{"sense": "If you roast food, you cook it in an oven or over a fire, and if food roasts, it is cooked in an oven or over a fire.", "level": "A2", "dict_examp": "Roast the vegetables for 35 minutes.", "lear_examp": "After we have baby lamb which is roasted in the special oven with potatoes."}]}, {"pos": "adjective", "senses": [{"sense": "cooked in an oven or over a fire", "level": "A2", "dict_examp": "roast turkey", "lear_examp": "But the specialities in every celebration are roast pork and roast chicken."}]}]}, {"word": "rob", "poses": [{"pos": "verb", "senses": [{"sense": "to steal from someone or somewhere, often using violence", "level": "B1", "dict_examp": "The store was robbed last night.", "lear_examp": "About twenty tourists were robbed."}, {"sense": "to take something important away from someone", "level": "C2", "dict_examp": "Elderly people should not be robbed of their dignity.", "lear_examp": "The white man came and deprived the Africans of all their culture. They tried to make them worship a new, unfamiliar god and simply tried to rob them of their own identity."}]}]}, {"word": "role", "poses": [{"pos": "noun", "senses": [{"sense": "an actor's part in a film or play", "level": "B1", "dict_examp": "She's got a leading/supporting role in the school play.", "lear_examp": "My friend Susan got a role in the film."}, {"sense": "the job someone or something has in a particular situation", "level": "B2", "dict_examp": "What is his role in this project?", "lear_examp": "In fact, computers play an important role in the office."}]}]}, {"word": "river", "poses": [{"pos": "noun", "senses": [{"sense": "a long, natural area of water that flows across land and into the ocean, a lake, another river, etc.", "level": "A1", "dict_examp": "the River Thames", "lear_examp": "I like to walk by the river Exe."}, {"sense": "where a river goes into the sea", "level": "C1", "dict_examp": "It is a small village, by the mouth of a river.", "lear_examp": "The mouth of the river with a narrow exit to the sea, provided an extra excitement because of the pressure of the water when joining the sea."}]}]}, {"word": "royal", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to a queen or king and their family", "level": "B2", "dict_examp": "the royal family", "lear_examp": "Chris, Anne and I wanted to visit the royal palace."}]}]}, {"word": "roughly", "poses": [{"pos": "adverb", "senses": [{"sense": "approximately", "level": "B2", "dict_examp": "There has been an increase of roughly 2.25 million.", "lear_examp": "These are very special cases and roughly speaking, confined to one thing."}, {"sense": "forcefully or violently", "level": "C2", "dict_examp": "He pushed us roughly out of the door.", "lear_examp": "My mother treated me roughly and unkindly by thrashing or smacking me at any time possible."}, {"sense": "without taking a lot of care to make something perfect", "level": "C2", "dict_examp": "Roughly chop the tomatoes and add to the onions.", "lear_examp": "She glanced at the mirror, roughly brushed her hair with her fingers and went outside for her car."}]}]}, {"word": "rub", "poses": [{"pos": "verb", "senses": [{"sense": "to press your hand or a cloth on a surface and move it backward and forward", "level": "B2", "dict_examp": "She rubbed her hands together to warm them.", "lear_examp": "Paul suddenly saw something. A kind of shadow. He rubbed his eyes but there was nothing."}, {"sense": "to move a substance backward and forward over a surface so that it covers it and goes into it", "level": "B2", "dict_examp": "I rubbed some suntan oil on my arms.", "lear_examp": ""}, {"sense": "to upset someone by talking to them about something which you know they want to forget", "level": "C2", "dict_examp": "I know your grades were better than mine - you don't have to rub it in.", "lear_examp": "Indeed, I wouldn't want to rub it in but you have reached seventy or eighty. I don't think you can fend for yourself."}]}]}, {"word": "romance", "poses": [{"pos": "noun", "senses": [{"sense": "a close relationship between two people who are in love with each other", "level": "B1", "dict_examp": "Their three-year romance never went smoothly.", "lear_examp": "I like it very much because it has romance and action, and cats of course."}]}]}, {"word": "rosy", "poses": [{"pos": "adjective", "senses": [{"sense": "of a pale red or pink color", "level": "C2", "dict_examp": "rosy cheeks", "lear_examp": "Not a lot taller than a lot of us, with beautiful blue eyes and rosy cheeks, she used to called us \"Muffins.\""}, {"sense": "very positive and happy", "level": "C2", "dict_examp": "The future looks rosy.", "lear_examp": "In addition, I can see something in his eyes that says his life is not as rosy as it seems."}]}]}, {"word": "row", "poses": [{"pos": "noun", "senses": [{"sense": "a straight line of people or things", "level": "B1", "dict_examp": "a row of chairs/houses", "lear_examp": "Two rows of servants stood beside the path which was in front of him with a red carpet on it."}, {"sense": "a line of seats", "level": "B1", "dict_examp": "to sit in the back/front row", "lear_examp": "It is great in my class, there are so many people and they are all nice. I'm sitting in the first row next to Nicole."}, {"sense": "one after another without a break", "level": "B2", "dict_examp": "He's just won the tournament for the fifth year in a row.", "lear_examp": "Maradona was the captain of the team, and since he arrived, the team won three championships in a row."}]}, {"pos": "verb", "senses": [{"sense": "to move a boat or move someone in a boat through the water using oars", "level": "B2", "dict_examp": "We rowed to the other side of the lake.", "lear_examp": "In the end, they had to row all the way back to the beach and it was very late when they got home."}]}]}, {"word": "routine", "poses": [{"pos": "noun", "senses": [{"sense": "the things you regularly do and how and when you do them", "level": "B1", "dict_examp": "Getting coffee and a bagel was part of my daily routine.", "lear_examp": "Usually we speak about our daily routine, and our plans for the future."}]}, {"pos": "adjective", "senses": [{"sense": "boring and regularly done", "level": "C2", "dict_examp": "a routine check/task", "lear_examp": "Nevertheless, when a job becomes routine (and it usually always does), people seem to reminisce about their student years with a sense of disappointment."}]}]}, {"word": "rope", "poses": [{"pos": "noun", "senses": [{"sense": "very thick string made from twisted thread", "level": "B2", "dict_examp": "We tied the boat to a post with a length of rope.", "lear_examp": "A few moments later she took out a rope from her backpack."}, {"sense": "to learn/know how to do a job or activity", "level": "C2", "dict_examp": "I spent a month in the accounts department, learning the ropes.", "lear_examp": "Knowing the ropes, he did as usual, but one thing was left out."}]}]}, {"word": "room", "poses": [{"pos": "noun", "senses": [{"sense": "a part of the inside of a building that is separated from other parts by walls, floor and ceiling", "level": "A1", "dict_examp": "a hotel room", "lear_examp": "She has a lot of flowers in her room."}, {"sense": "space for things to fit into", "level": "B1", "dict_examp": "Is there enough room for me in the car?", "lear_examp": "In the wardrobe there is not enough room to put all my stuff away."}, {"sense": "If there is room for improvement, something can be made better.", "level": "C1", "dict_examp": "His work isn't bad but there's still some room for improvement.", "lear_examp": "She is Polish, aged 29 and can speak English pretty well, but there is still room for improvement, that's why she wants to spend a year in England, looking after children in an English-speaking family."}]}]}, {"word": "roof", "poses": [{"pos": "noun", "senses": [{"sense": "the surface that covers the top of a building or vehicle", "level": "A2", "dict_examp": "The house has a flat/shingled roof.", "lear_examp": "It's an old Charentese house, with white walls, a red roof and a small garden, close to the seaside."}, {"sense": "somewhere to live", "level": "C2", "dict_examp": "It is hard to keep a roof over your head and food in the fridge when you get paid $8.50 an hour.", "lear_examp": "As for the new homes for local people it seems to be that it will be of particular importance to homeless people, who will feel that they have a roof over their head without having to pay anything."}, {"sense": "If the level of something, especially a price, goes through the roof, it increases very quickly.", "level": "C2", "dict_examp": "The price of heating oil has gone through the roof.", "lear_examp": "Try extreme sports and feel your adrenaline levels going through the roof!"}, {"sense": "to become very angry and start shouting", "level": "C2", "dict_examp": "If I'm late again he'll hit the roof.", "lear_examp": "Be careful, if you make too much noise he'll hit the roof."}]}]}, {"word": "rot", "poses": [{"pos": "verb", "senses": [{"sense": "If vegetable or animal substances rot, they decay, and if something rots them, it makes them decay.", "level": "C2", "dict_examp": "Sugar rots your teeth.", "lear_examp": "He told me of how he had come to see it every day, and seen how all the meat had rotted away and stuff."}]}]}, {"word": "round", "poses": [{"pos": "adjective", "senses": [{"sense": "in the shape of a circle or ball", "level": "A2", "dict_examp": "a round hole/stone/table/window", "lear_examp": "It is on the round table in your room."}]}, {"pos": "noun", "senses": [{"sense": "the first/second/third/final, etc. stage in a competition", "level": "B2", "dict_examp": "He was beaten in the first round.", "lear_examp": "At five o'clock in the afternoon, the second round of the games will begin."}, {"sense": "when people clap", "level": "C2", "dict_examp": "The crowd gave him a huge round of applause.", "lear_examp": "It was unbelievable, there was a round of applause and some people couldn't help crying."}, {"sense": "drinks for all of the people in a group", "level": "C2", "dict_examp": "Would you like another round?", "lear_examp": "Rob (her husband) was so happy and in such a splendid mood that he decided to pay for a round of beer."}, {"sense": "a group of events that is part of a series", "level": "C2", "dict_examp": "a round of interviews", "lear_examp": "My life was an endless round of parties, and social events."}]}]}, {"word": "romantic", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to feelings of love and affection", "level": "B1", "dict_examp": "a romantic dinner for two", "lear_examp": "And the atmosphere in the evening is so romantic!"}, {"sense": "relating to a story about love", "level": "B1", "dict_examp": "romantic fiction", "lear_examp": "It is nice romantic comedy. The film starts at 8 o'clock on the evening."}, {"sense": "thinking that things are better than they really are, and that things are possible which are not", "level": "C2", "dict_examp": "a romantic view of the world", "lear_examp": ""}]}]}, {"word": "route", "poses": [{"pos": "noun", "senses": [{"sense": "the roads or paths you follow to get from one place to another place", "level": "B1", "dict_examp": "an escape route", "lear_examp": "Anyway, my father and I went alone but we joined a group that was following the same route."}, {"sense": "used as part of the name of numbered highways", "level": "B1", "dict_examp": "Route 9", "lear_examp": ""}, {"sense": "a method of achieving something", "level": "C2", "dict_examp": "A college degree is seen by many as the best route to a good job.", "lear_examp": "This means that only by presenting them with a great variety of opportunities can we be certain that our children will be shaped correctly. Thus, ...  it seems to be the only legitimate and most advantageous route to follow."}]}]}, {"word": "roll", "poses": [{"pos": "verb", "senses": [{"sense": "to move somewhere by turning in a circular direction, or to make something move this way", "level": "B2", "dict_examp": "The ball rolled between his legs.", "lear_examp": "Paul broke his leg by rolling down the mountain."}, {"sense": "to turn something around itself to make the shape of a ball or tube", "level": "B2", "dict_examp": "He was rolling a cigarette.", "lear_examp": ""}, {"sense": "to move somewhere smoothly", "level": "B2", "dict_examp": "The driver rolled down his car window.", "lear_examp": "By this time, the rest of us were laughing so hard that tears were rolling down our cheeks."}, {"sense": "to move your eyes in a circle to show surprise or disapproval", "level": "C2", "dict_examp": "When I asked her when she thought the building work would be finished, she just rolled her eyes.", "lear_examp": "This attitude is obvious when, for instance, sales assistants show no patience for the slower reaction of elderly people; when nobody offers a seat to an older person in an overcrowded train; when we roll our eyes about older people's desire for quiet, etc."}, {"sense": "to make something begin or happen", "level": "C2", "dict_examp": "We have to get the ball rolling on this project soon.", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "a small loaf of bread for one person", "level": "B1", "dict_examp": "I had a roll with my soup.", "lear_examp": "We eat ham, cheese, butter and paprika, with a roll or bread."}, {"sense": "a piece of plastic, paper, cloth, etc. that is rolled into the shape of a tube", "level": "B2", "dict_examp": "a roll of carpet", "lear_examp": ""}]}]}, {"word": "roommate", "poses": [{"pos": "noun", "senses": [{"sense": "someone who you share a room, apartment, etc. with", "level": "A2", "dict_examp": "We were roommates our freshman year in college.", "lear_examp": "Her name is Chiara, she is my roommate since one week ago."}]}]}, {"word": "rotten", "poses": [{"pos": "adjective", "senses": [{"sense": "Rotten vegetable or animal substances are decaying.", "level": "B2", "dict_examp": "rotten eggs/fruit", "lear_examp": "I'll tell you something - my freezer still smells of rotten fish."}]}]}, {"word": "rose", "poses": [{"pos": "noun", "senses": [{"sense": "a flower with a pleasant smell and thorns, that grows on a bush", "level": "B1", "dict_examp": "a rose bush", "lear_examp": "But what attracted my attention even more were the roses, which were lying next to the envelope."}]}]}, {"word": "rough", "poses": [{"pos": "adjective", "senses": [{"sense": "A rough surface is not smooth.", "level": "B1", "dict_examp": "rough ground", "lear_examp": "I went with some people I know from bike competitions, and I was impressed with how well they can ride a bike on rough terrain, while I had to go carefully in some tracks."}, {"sense": "approximate and not exact", "level": "B1", "dict_examp": "Write a rough copy first and check the grammar.", "lear_examp": "I lost my personal notepad where I used to write all my job tasks, my arrangements and the records of my students.  I have even written the rough copy of some personal letters there."}, {"sense": "If the sea or weather is rough, there is a lot of strong wind and sometimes rain.", "level": "B2", "dict_examp": "The boat sank in rough waters/seas off the coast of Maine.", "lear_examp": "I never saw a landscape similar to the Ring of Kerry before: breathtaking views, the rough sea to the right, peaceful gaps to the left - great!"}, {"sense": "difficult or unpleasant", "level": "B2", "dict_examp": "She's having a rough time at work.", "lear_examp": "He did the mountain-route last year and he says that even he had a rough time."}, {"sense": "dangerous or violent", "level": "C1", "dict_examp": "a rough part of town", "lear_examp": "If I were able to travel back in History, I would choose to go to France during the French Revolution. I think it would be very interesting to see how people can be really devoted and can fight when they see they are being cheated.  I know it was a very rough and dangerous time, but it must have been really exciting."}]}]}, {"word": "root", "poses": [{"pos": "noun", "senses": [{"sense": "the part of a plant that grows under the ground and gets water and food from the soil", "level": "B2", "dict_examp": "These plants have really deep roots.", "lear_examp": "I have gathered over three hundred species: flowers, roots, leaves and others."}, {"sense": "where someone or something originally comes from", "level": "B2", "dict_examp": "the roots of modern jazz", "lear_examp": "Turin finds its roots in the Roman Empire and many signs of the Roman architecture are visible still nowadays."}, {"sense": "the cause of something, usually something bad", "level": "C1", "dict_examp": "We must get to the root of  this problem.", "lear_examp": "Unfortunately none of us has ever tried to find the root of this problem but the influences that it has on the environment are obvious."}]}]}, {"word": "rude", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving in a way which is not polite and upsets other people", "level": "B1", "dict_examp": "a rude comment/remark", "lear_examp": "I thought he was such a rude man."}]}]}, {"word": "rugby", "poses": [{"pos": "noun", "senses": [{"sense": "a sport played by two teams with an oval ball and H-shaped goals", "level": "A2", "dict_examp": "He's a keen rugby fan.", "lear_examp": "I want to play some rugby and swim in the sea."}]}]}, {"word": "rub", "poses": [{"pos": "verb", "senses": [{"sense": "to press your hand or a cloth on a surface and move it backward and forward", "level": "B2", "dict_examp": "She rubbed her hands together to warm them.", "lear_examp": "Paul suddenly saw something. A kind of shadow. He rubbed his eyes but there was nothing."}, {"sense": "to move a substance backward and forward over a surface so that it covers it and goes into it", "level": "B2", "dict_examp": "I rubbed some suntan oil on my arms.", "lear_examp": ""}, {"sense": "to upset someone by talking to them about something which you know they want to forget", "level": "C2", "dict_examp": "I know your grades were better than mine - you don't have to rub it in.", "lear_examp": "Indeed, I wouldn't want to rub it in but you have reached seventy or eighty. I don't think you can fend for yourself."}]}]}, {"word": "ruin", "poses": [{"pos": "noun", "senses": [{"sense": "the broken remains that are left from an old building after it has been destroyed", "level": "B1", "dict_examp": "Thousands of tourists wander around these ancient ruins every year.", "lear_examp": "After that I'm going to travel to Luxor and see the ruins."}, {"sense": "to be in a very bad state", "level": "C1", "dict_examp": "The city lies in ruins.", "lear_examp": "When my grandparents were young, Germany lay in ruins."}, {"sense": "when someone loses everything such as all their money or their job", "level": "C2", "dict_examp": "The collapse of the bank has left many people in financial ruin.", "lear_examp": "He started his first business some time ago which led to financial ruin."}]}, {"pos": "verb", "senses": [{"sense": "to spoil or destroy something completely", "level": "B2", "dict_examp": "They were late and the dinner was ruined.", "lear_examp": "But she didn't keep her promise and she ruined my life."}]}]}, {"word": "rule", "poses": [{"pos": "noun", "senses": [{"sense": "an official instruction about what you must or must not do", "level": "B1", "dict_examp": "to break                           the rules", "lear_examp": "There're plenty of rules in my high school."}, {"sense": "a principle of a system, such as a language or science", "level": "B1", "dict_examp": "the rules of grammar", "lear_examp": "We did a little exam about tenses and grammar rules."}, {"sense": "the usual way something is", "level": "B2", "dict_examp": "an exception to the rule", "lear_examp": "As a rule, children who ride bikes change their bikes for cars when they are older and are prepared a little for how to behave on the road."}, {"sense": "a way of judging something that is not exact but which will help you to be correct enough", "level": "C1", "dict_examp": "As a rule of thumb, you need one egg for every 125g flour.", "lear_examp": "I think that I'm only one among many that have a diary as their most precious possession, but, as a rule of thumb, I would think that people value objects in terms of how replaceable they are."}, {"sense": "to allow someone to do something which is not usually allowed", "level": "C2", "dict_examp": "We don't usually let students take books home, but I'll bend the rules on this occasion.", "lear_examp": ""}, {"sense": "when someone is in control of a country", "level": "C2", "dict_examp": "military rule", "lear_examp": "A XXth century modernist, not only should he be paid honor for his artistry but also for his never ceasing battle against Franco's rule."}]}, {"pos": "verb", "senses": [{"sense": "to be in control of somewhere, usually a country", "level": "B2", "dict_examp": "They were ruled for many years by the prince.", "lear_examp": "In the late 60s when Greece was ruled by a military government, many young students fled abroad to escape its cruelty."}, {"sense": "to influence someone's thoughts or actions", "level": "B2", "dict_examp": "His life is ruled by the demands of his job.", "lear_examp": "Our Earth has grown overcrowded and every inch of our life is ruled by computers."}, {"sense": "to be in control of somewhere, usually a country", "level": "C1", "dict_examp": "They were ruled for many years by a dictator.", "lear_examp": "Cleopatra was the seventh queen of Egypt and ruled until 63 B.C. when she died."}, {"sense": "to decide or state that something is impossible or will not happen, or that something or someone is not suitable", "level": "C2", "dict_examp": "It’s unlikely that he’ll run for president, but you can never rule anything out.", "lear_examp": "Owning a house no longer seems to be a practical future plan and has to be ruled out, which meant that people lost their ultimate goal for working."}]}]}, {"word": "rubber", "poses": [{"pos": "noun", "senses": [{"sense": "a strong material that bends easily, originally produced from the juice of a tropical tree, and used to make tires, boots, etc.", "level": "B2", "dict_examp": "shoes with rubber soles", "lear_examp": "The future fashion for men I think will be suits but still made from recycled materials such as rubber and plastic."}]}]}, {"word": "run", "poses": [{"pos": "verb", "senses": [{"sense": "to move on your feet at a faster speed than walking", "level": "A1", "dict_examp": "He can run very fast.", "lear_examp": "Children can run everywhere."}, {"sense": "to organize or control something", "level": "B1", "dict_examp": "She ran her own restaurant for five years.", "lear_examp": "My aunt is always working. She runs her own business."}, {"sense": "If trains or buses are running, they are available to travel on.", "level": "B2", "dict_examp": "Trains are still running, despite the snow.", "lear_examp": "There is an easy way to get to the college: a service bus runs every 15 minutes, and the journey takes only 20 minutes."}, {"sense": "If liquid runs somewhere, it flows.", "level": "B2", "dict_examp": "Tears ran down her face.", "lear_examp": "Tears ran down my cold cheek as my numb fingers opened the envelope."}, {"sense": "If you run a computer program, you use it on your computer.", "level": "B2", "dict_examp": "Did you run a virus check this morning?", "lear_examp": "At this point the computer is unable to run any program."}, {"sense": "If a piece of equipment is running, it is switched on and working, and if you run it, you switch it on and make it work.", "level": "C1", "dict_examp": "She left the engine running while she went into the store.", "lear_examp": "The dish washer was delivered in time and installed as well, though we could not actually run the machine at that time."}, {"sense": "to publish something in a newspaper or magazine", "level": "C1", "dict_examp": "All the papers are running this story on the front page.", "lear_examp": "If we run a story on \"HIV Symptoms\" we could have a very successful first issue."}, {"sense": "to try to get elected", "level": "C2", "dict_examp": "Kutukas ran unsuccessfully for sheriff.", "lear_examp": "In addition, I would like to suggest that aspects of his life when he was running for mayor should be included in the form of a speech by himself."}, {"sense": "to move something along/over/through, etc., something else", "level": "C2", "dict_examp": "She ran her fingers through her hair.", "lear_examp": "The manly figure that had tried to stop her now kneeled before her body running his finger through her soft blond hair."}, {"sense": "to be at a particular level", "level": "C2", "dict_examp": "Inflation is now running at 5.8%.", "lear_examp": "According to the official data, unemployment is running at so high a level that it is even possible that the unemployed will rebel against the government."}, {"sense": "If something makes your blood run cold, it frightens you very much.", "level": "C2", "dict_examp": "I heard a tapping on the window which made my blood run cold.", "lear_examp": "This thought scared me and made my blood run cold."}, {"sense": "to do something although something bad might happen because of it", "level": "C2", "dict_examp": "I think I'll run the risk of hurting her feelings, and tell her the truth.", "lear_examp": "They constantly run the risk of losing their physical abilities."}, {"sense": "If someone, especially a child, runs wild, they behave as they want to and no one controls them.", "level": "C2", "dict_examp": "Their nine-year-old son is left to run wild.", "lear_examp": "My parents decided to move to a small village when I was just a kid. Shortly after we settled in, my parents decided that I was running wild and that it was time for me to receive some sort of education."}, {"sense": "If someone's imagination runs wild, they are not able to control their thoughts.", "level": "C2", "dict_examp": "It was getting dark and my imagination was starting to run wild.", "lear_examp": "Her imagination started to run wild and she began to think about the dark corridors, the secret passages and the obscure dungeons that the castle might hide."}, {"sense": "to be very busy doing a lot of different things", "level": "C2", "dict_examp": "I'm exhausted, I've been running around all morning.", "lear_examp": "Nowadays people are running around trying to save time wherever they can, when in reality time passes far quicker when we try to save it."}, {"sense": "to secretly leave a place because you are unhappy there", "level": "B2", "dict_examp": "She ran away from home at the age of 13.", "lear_examp": "At the age of fourteen, she ran away from home."}, {"sense": "to criticize someone or something, often unfairly", "level": "C1", "dict_examp": "Whatever the government do, the press will always run them down.", "lear_examp": "But it's not fair to run down my country's past achievements."}, {"sense": "to accidentally hit something while you are driving a vehicle", "level": "B2", "dict_examp": "He lost control of the car and ran into a tree.", "lear_examp": "I had tried to stop my car next to the road but I ran into a signpost."}, {"sense": "to meet someone that you know when you did not expect to meet them", "level": "B2", "dict_examp": "I ran into Harry on the train.", "lear_examp": "We ran into an old friend of mine and we decided to have a coffee together."}, {"sense": "If a machine runs on a supply of power, it uses that power to work.", "level": "C1", "dict_examp": "My laptop is running on battery power.", "lear_examp": "Public transport will be quick and free, and run on electric power, so there won't be car pollution."}, {"sense": "to finish, use or sell all of something, so that there is none left", "level": "B1", "dict_examp": "I've run out of money/ideas/patience.", "lear_examp": "Well, I have run out of time, so I have to stop writing."}, {"sense": "If a supply of something runs out, all of it has been used or it is completely finished.", "level": "B2", "dict_examp": "We've  run out of milk.", "lear_examp": "In addition, if you are at home and something you need has run out or broken, you can go to buy it at any time."}, {"sense": "to hit someone or something with a vehicle and drive over them, injuring or killing them", "level": "B2", "dict_examp": "He was run over by a bus.", "lear_examp": "After a while, his father vanished and a car ran over John and killed him."}, {"sense": "to repeat something in order to practice it or to make sure that it is correct", "level": "C2", "dict_examp": "I just need to run through my talk.", "lear_examp": ""}, {"sense": "If you run up against problems or difficulties, you begin to experience them.", "level": "C2", "dict_examp": "The plan for the park ran up against strong local opposition.", "lear_examp": "After running up against a lot of difficulties we managed to reach our hotel."}]}, {"pos": "noun", "senses": [{"sense": "when you move on your feet at a speed faster than walking, especially for exercise", "level": "B1", "dict_examp": "We go for a three-mile run every evening after work.", "lear_examp": "Walking is recognized as good exercise, or going for a run."}, {"sense": "in baseball or cricket, a single point", "level": "B2", "dict_examp": "They scored three runs in the ninth inning to win the game.", "lear_examp": "I liked the competition because both the teams played well and they scored good runs."}, {"sense": "at a time that is far away in the future", "level": "B2", "dict_examp": "It seems a lot of effort but I'm sure it's the best solution in the long run.", "lear_examp": "It costs a lot of money, but in the long run, it is worth it."}, {"sense": "to suddenly run fast in order to escape from somewhere", "level": "C2", "dict_examp": "When he saw the open door, he made a run for it.", "lear_examp": "Anna and Tom decided to make a run for it."}, {"sense": "when something happens several times without something different happening during that period", "level": "C2", "dict_examp": "a run of 10 games without a win", "lear_examp": "Strange though it may seem, he achieved success in every possible field not owing to a run of good luck, but thanks to his outstanding qualities."}]}]}, {"word": "rudely", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not polite", "level": "C1", "dict_examp": "He pushed past us rudely.", "lear_examp": "When I made an attempt to speak to the conductor, I was rudely told off and told to stay seated for the rest of the trip."}]}]}, {"word": "ruling", "poses": [{"pos": "noun", "senses": [{"sense": "an official legal decision, usually made by a judge", "level": "C2", "dict_examp": "The Supreme Court decided not to review the lower court’s ruling.", "lear_examp": "As you certainly will remember, the ruling of the High Court obliges you to keep the level of noise below a certain level depending on the distance of the airport."}]}]}, {"word": "ruler", "poses": [{"pos": "noun", "senses": [{"sense": "a flat, straight stick which is used to measure things", "level": "A2", "dict_examp": "Can I borrow your ruler?", "lear_examp": "We have to bring with us a pencil and a ruler for the first lesson."}, {"sense": "the leader of a country", "level": "C1", "dict_examp": "He was the ruler of the country for over 20 years.", "lear_examp": "Versailles in France and the time of Louis XIV as the ruler would be my place and time I would choose to visit."}]}]}, {"word": "rug", "poses": [{"pos": "noun", "senses": [{"sense": "a soft piece of material used to cover the floor", "level": "B1", "dict_examp": "My dog loves lying on the rug in front of the fire.", "lear_examp": "There is a green rug in the middle of the floor."}]}]}, {"word": "rudeness", "poses": [{"pos": "noun", "senses": [{"sense": "a manner and attitude that is impolite", "level": "C1", "dict_examp": "I was shocked by her rudeness.", "lear_examp": "Furthermore, a person who is focused only on his goals will try to show off all his/her abilities, they will try to demonstrate their intelligence and their power to the others sometimes with rudeness and intolerance."}]}]}, {"word": "rumor", "poses": [{"pos": "noun", "senses": [{"sense": "information that a lot of people are talking about although they do not know if it is true", "level": "B2", "dict_examp": "Rumors about teacher layoffs are circulating at school.", "lear_examp": "He owned an inn called Jamaica but nobody would go there anymore due to some strange rumors."}]}]}, {"word": "rut", "poses": [{"pos": "noun", "senses": [{"sense": "in a bad situation where you do the same things all the time, or where it is impossible to make progress", "level": "C2", "dict_examp": "He seems to be stuck in a rut at the moment.", "lear_examp": "Financial security, all the, let me call them, background benefits are important, but if you do not love what you do, soon you will become bitter, stuck in a rut or worse - you will suffer from depression."}]}]}, {"word": "running", "poses": [{"pos": "noun", "senses": [{"sense": "the sport of moving on your feet at a speed faster than walking", "level": "A2", "dict_examp": "I go running three times a week.", "lear_examp": "My hobbies are reading and running."}, {"sense": "the activity of controlling or looking after something", "level": "C2", "dict_examp": "The running of a large household is not easy.", "lear_examp": "Electricity is an essential requirement now in the day-to-day running of businesses and life in general compared to the early nineteenth century."}]}, {"pos": "adverb", "senses": [{"sense": "If something happens for the second/third, etc., day/week, etc., running, it happens on that number of regular occasions without changing.", "level": "C2", "dict_examp": "He's won the Championship for the fifth year running.", "lear_examp": "Fourteen days running of laziness and sleep without tight-scheduled meetings or rush-hour traffic jams lurking."}]}, {"pos": "adjective", "senses": [{"sense": "If a building has running water, water comes into  it through pipes.", "level": "C1", "dict_examp": "The summer homes on the island have no running water.", "lear_examp": "It is hilarious to think that at the same time people in the north of Europe were still living a primitive and uncivilized life not even able to invent an axe, the Romans managed to install running water in their huge houses."}]}]}, {"word": "rusty", "poses": [{"pos": "adjective", "senses": [{"sense": "Rusty metal has rust  on its surface.", "level": "B2", "dict_examp": "a rusty car/nail", "lear_examp": "It was very rusty but I repainted it and now it looks like a new bike."}, {"sense": "If a skill you had is now rusty, it is no longer good because you have forgotten it.", "level": "B2", "dict_examp": "My French is a bit rusty.", "lear_examp": "However, I am rather \"rusty\" at using the morse code as well as using the codes of communication."}]}]}, {"word": "runway", "poses": [{"pos": "noun", "senses": [{"sense": "a large road that aircraft use to land on or to start flying from", "level": "C1", "dict_examp": "The runway was covered with snow.", "lear_examp": "The problem hit the headlines when a small Soviet aircraft missed the runway and touched down on a road exploding in two pieces and damaging many cars and the people sitting inside."}]}]}, {"word": "ruthless", "poses": [{"pos": "adjective", "senses": [{"sense": "not caring if you hurt or upset other people when you try to get what you want", "level": "C2", "dict_examp": "ruthless ambition", "lear_examp": "As a result, the competition has become ruthless and severe."}]}]}, {"word": "run", "poses": [{"pos": "verb", "senses": [{"sense": "to move on your feet at a faster speed than walking", "level": "A1", "dict_examp": "He can run very fast.", "lear_examp": "Children can run everywhere."}, {"sense": "to organize or control something", "level": "B1", "dict_examp": "She ran her own restaurant for five years.", "lear_examp": "My aunt is always working. She runs her own business."}, {"sense": "If trains or buses are running, they are available to travel on.", "level": "B2", "dict_examp": "Trains are still running, despite the snow.", "lear_examp": "There is an easy way to get to the college: a service bus runs every 15 minutes, and the journey takes only 20 minutes."}, {"sense": "If liquid runs somewhere, it flows.", "level": "B2", "dict_examp": "Tears ran down her face.", "lear_examp": "Tears ran down my cold cheek as my numb fingers opened the envelope."}, {"sense": "If you run a computer program, you use it on your computer.", "level": "B2", "dict_examp": "Did you run a virus check this morning?", "lear_examp": "At this point the computer is unable to run any program."}, {"sense": "If a piece of equipment is running, it is switched on and working, and if you run it, you switch it on and make it work.", "level": "C1", "dict_examp": "She left the engine running while she went into the store.", "lear_examp": "The dish washer was delivered in time and installed as well, though we could not actually run the machine at that time."}, {"sense": "to publish something in a newspaper or magazine", "level": "C1", "dict_examp": "All the papers are running this story on the front page.", "lear_examp": "If we run a story on \"HIV Symptoms\" we could have a very successful first issue."}, {"sense": "to try to get elected", "level": "C2", "dict_examp": "Kutukas ran unsuccessfully for sheriff.", "lear_examp": "In addition, I would like to suggest that aspects of his life when he was running for mayor should be included in the form of a speech by himself."}, {"sense": "to move something along/over/through, etc., something else", "level": "C2", "dict_examp": "She ran her fingers through her hair.", "lear_examp": "The manly figure that had tried to stop her now kneeled before her body running his finger through her soft blond hair."}, {"sense": "to be at a particular level", "level": "C2", "dict_examp": "Inflation is now running at 5.8%.", "lear_examp": "According to the official data, unemployment is running at so high a level that it is even possible that the unemployed will rebel against the government."}, {"sense": "If something makes your blood run cold, it frightens you very much.", "level": "C2", "dict_examp": "I heard a tapping on the window which made my blood run cold.", "lear_examp": "This thought scared me and made my blood run cold."}, {"sense": "to do something although something bad might happen because of it", "level": "C2", "dict_examp": "I think I'll run the risk of hurting her feelings, and tell her the truth.", "lear_examp": "They constantly run the risk of losing their physical abilities."}, {"sense": "If someone, especially a child, runs wild, they behave as they want to and no one controls them.", "level": "C2", "dict_examp": "Their nine-year-old son is left to run wild.", "lear_examp": "My parents decided to move to a small village when I was just a kid. Shortly after we settled in, my parents decided that I was running wild and that it was time for me to receive some sort of education."}, {"sense": "If someone's imagination runs wild, they are not able to control their thoughts.", "level": "C2", "dict_examp": "It was getting dark and my imagination was starting to run wild.", "lear_examp": "Her imagination started to run wild and she began to think about the dark corridors, the secret passages and the obscure dungeons that the castle might hide."}, {"sense": "to be very busy doing a lot of different things", "level": "C2", "dict_examp": "I'm exhausted, I've been running around all morning.", "lear_examp": "Nowadays people are running around trying to save time wherever they can, when in reality time passes far quicker when we try to save it."}, {"sense": "to secretly leave a place because you are unhappy there", "level": "B2", "dict_examp": "She ran away from home at the age of 13.", "lear_examp": "At the age of fourteen, she ran away from home."}, {"sense": "to criticize someone or something, often unfairly", "level": "C1", "dict_examp": "Whatever the government do, the press will always run them down.", "lear_examp": "But it's not fair to run down my country's past achievements."}, {"sense": "to accidentally hit something while you are driving a vehicle", "level": "B2", "dict_examp": "He lost control of the car and ran into a tree.", "lear_examp": "I had tried to stop my car next to the road but I ran into a signpost."}, {"sense": "to meet someone that you know when you did not expect to meet them", "level": "B2", "dict_examp": "I ran into Harry on the train.", "lear_examp": "We ran into an old friend of mine and we decided to have a coffee together."}, {"sense": "If a machine runs on a supply of power, it uses that power to work.", "level": "C1", "dict_examp": "My laptop is running on battery power.", "lear_examp": "Public transport will be quick and free, and run on electric power, so there won't be car pollution."}, {"sense": "to finish, use or sell all of something, so that there is none left", "level": "B1", "dict_examp": "I've run out of money/ideas/patience.", "lear_examp": "Well, I have run out of time, so I have to stop writing."}, {"sense": "If a supply of something runs out, all of it has been used or it is completely finished.", "level": "B2", "dict_examp": "We've  run out of milk.", "lear_examp": "In addition, if you are at home and something you need has run out or broken, you can go to buy it at any time."}, {"sense": "to hit someone or something with a vehicle and drive over them, injuring or killing them", "level": "B2", "dict_examp": "He was run over by a bus.", "lear_examp": "After a while, his father vanished and a car ran over John and killed him."}, {"sense": "to repeat something in order to practice it or to make sure that it is correct", "level": "C2", "dict_examp": "I just need to run through my talk.", "lear_examp": ""}, {"sense": "If you run up against problems or difficulties, you begin to experience them.", "level": "C2", "dict_examp": "The plan for the park ran up against strong local opposition.", "lear_examp": "After running up against a lot of difficulties we managed to reach our hotel."}]}, {"pos": "noun", "senses": [{"sense": "when you move on your feet at a speed faster than walking, especially for exercise", "level": "B1", "dict_examp": "We go for a three-mile run every evening after work.", "lear_examp": "Walking is recognized as good exercise, or going for a run."}, {"sense": "in baseball or cricket, a single point", "level": "B2", "dict_examp": "They scored three runs in the ninth inning to win the game.", "lear_examp": "I liked the competition because both the teams played well and they scored good runs."}, {"sense": "at a time that is far away in the future", "level": "B2", "dict_examp": "It seems a lot of effort but I'm sure it's the best solution in the long run.", "lear_examp": "It costs a lot of money, but in the long run, it is worth it."}, {"sense": "to suddenly run fast in order to escape from somewhere", "level": "C2", "dict_examp": "When he saw the open door, he made a run for it.", "lear_examp": "Anna and Tom decided to make a run for it."}, {"sense": "when something happens several times without something different happening during that period", "level": "C2", "dict_examp": "a run of 10 games without a win", "lear_examp": "Strange though it may seem, he achieved success in every possible field not owing to a run of good luck, but thanks to his outstanding qualities."}]}]}, {"word": "rush hour", "poses": [{"pos": "noun", "senses": [{"sense": "the time when a lot of people are traveling to or from work and so roads and trains are very busy", "level": "B2", "dict_examp": "the morning/evening rush hour", "lear_examp": "During rush hours, you often see cars lined up with just one person inside, each car polluting the environment."}]}]}, {"word": "rush", "poses": [{"pos": "verb", "senses": [{"sense": "to hurry or move quickly somewhere, or to make someone or something hurry or move quickly somewhere", "level": "B2", "dict_examp": "We had to rush to catch the bus.", "lear_examp": "I rushed to Tom's house, and when I reached it, he received me with a weird smile on his face."}, {"sense": "to do something quickly and enthusiastically", "level": "B2", "dict_examp": "His friends rushed to congratulate him after the ceremony.", "lear_examp": "I was very happy and rushed to talk to them."}, {"sense": "to make someone do something more quickly than they want to do it", "level": "C1", "dict_examp": "I refuse to be rushed into making a decision.", "lear_examp": "It has always been very busy but these days people seem to have a harder time facing the fact that not everything can be rushed."}, {"sense": "to start doing something without thinking about it enough first", "level": "C1", "dict_examp": "I rushed into marriage when I was much too young.", "lear_examp": "I also have bad sides which are that I'm stubborn sometimes and rush into things."}]}, {"pos": "noun", "senses": [{"sense": "when you have to hurry or move somewhere quickly", "level": "B2", "dict_examp": "Slow down! What's the rush?", "lear_examp": "That's because we are always stressed and always in a rush."}, {"sense": "a lot of things happening or a lot of people trying to do something", "level": "C2", "dict_examp": "There was amad rush to get tickets for the concert.", "lear_examp": "She is that sort of a person who prefers to have more time on her hands so as to avoid the last-minute rush."}, {"sense": "when something suddenly moves somewhere quickly", "level": "C2", "dict_examp": "a rush of air", "lear_examp": "To conclude, I believe that sports activities, apart from providing us with a sense of freedom and a rush of adrenaline, make us accomplished human beings."}]}]}, {"word": "runner", "poses": [{"pos": "noun", "senses": [{"sense": "someone who runs, especially in competitions", "level": "A2", "dict_examp": "a long-distance runner", "lear_examp": "The former is the fastest man in the world, the latter is a very famous long-distance runner."}]}]}, {"word": "rural", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to the country and not to cities or towns", "level": "B2", "dict_examp": "The area is still very rural and undeveloped.", "lear_examp": "I live in a rural area far from any village, town, or city."}]}]}]