[{"word": "unaware", "poses": [{"pos": "adjective", "senses": [{"sense": "not knowing about something", "level": "B2", "dict_examp": "He was unaware that the police were watching him.", "lear_examp": "Although you may be an expert in one subject you can be unaware of some basics in others."}]}]}, {"word": "unavailable", "poses": [{"pos": "adjective", "senses": [{"sense": "impossible to buy or get", "level": "B2", "dict_examp": "The book is unavailable until January.", "lear_examp": "The third point was that the discounted tickets were unavailable."}, {"sense": "not able to talk to someone or meet them, especially because you are doing other things", "level": "C1", "dict_examp": "The manager was unavailable for comment.", "lear_examp": "Furthermore, a role-model for the younger generation could be the famous tennis player Joe Hill, who unfortunately is unavailable to give an interview."}]}]}, {"word": "umbrella", "poses": [{"pos": "noun", "senses": [{"sense": "a thing that you hold above your head to keep yourself dry when it is raining", "level": "A2", "dict_examp": "I felt a few spots of rain so I put my umbrella up.", "lear_examp": "I got some books, a bottle of wine and an umbrella."}]}]}, {"word": "unconventional", "poses": [{"pos": "adjective", "senses": [{"sense": "doing things in a way that is different from most people", "level": "C1", "dict_examp": "an unconventional lifestyle", "lear_examp": "CHILDREN'S STORIES This event was successful and satisfied the kids since the heroes were exhilarating, with amazingly unconventional behavior."}]}]}, {"word": "under", "poses": [{"pos": "preposition", "senses": [{"sense": "below something, or below the surface of something", "level": "A1", "dict_examp": "He hid under the bed.", "lear_examp": "I like my bedroom, because there is a table under the window, and some pictures on the wall."}, {"sense": "less than a number, amount, or age", "level": "A2", "dict_examp": "All items cost/are under a dollar.", "lear_examp": "I saw an advertisement in front of my house: the coffee bar is looking for some waiters aged under 23 years old."}, {"sense": "in a particular state or condition", "level": "B2", "dict_examp": "The President is under pressure to resign.", "lear_examp": "I am used to working under pressure."}, {"sense": "being affected by something at this time", "level": "B2", "dict_examp": "The base is once again under attack.", "lear_examp": "Everything was under control, the remote detonator had worked perfectly well."}, {"sense": "to think or understand a particular stated thing", "level": "B2", "dict_examp": "I was under the impression (that) you didn't get along very well.", "lear_examp": "I am under the impression that people generally exercise a little, but if they eat the wrong food every day, it won't help."}, {"sense": "If you say something under your breath, you say it very quietly so that other people cannot clearly hear it.", "level": "C2", "dict_examp": "\"It's time to go,\" she muttered under her breath.", "lear_examp": "\"We must have taken a wrong turn somewhere...\" he kept muttering under his breath."}, {"sense": "If something bad happens under your nose, it happens close to you but you do not notice it.", "level": "C2", "dict_examp": "They were stealing money from under my nose.", "lear_examp": "You will be surprised that there was something right under your nose that you could not live without."}, {"sense": "to be already happening", "level": "C2", "dict_examp": "Building work is already under way.", "lear_examp": "Sociologists are well-aware of the fact and experiments are under way to counterbalance these disadvantages."}]}]}, {"word": "uncover", "poses": [{"pos": "verb", "senses": [{"sense": "to discover something that had been secret or hidden", "level": "C1", "dict_examp": "The inspectors uncovered evidence of corruption.", "lear_examp": "Sitting in a restaurant and discussing provisions of the contract you will find much easier and feel happier than just sitting and looking at an enormous number of clauses, trying unsuccessfuly to uncover what your client really thought when he wrote this or that."}]}]}, {"word": "unavoidable", "poses": [{"pos": "adjective", "senses": [{"sense": "impossible to avoid or prevent", "level": "C1", "dict_examp": "an unavoidable delay", "lear_examp": "Being aware of the two proposals our local government is considering in order to solve the apparently unavoidable matter of traffic in our beloved city, I feel compelled to offer my views on such a delicate subject."}]}]}, {"word": "unattractive", "poses": [{"pos": "adjective", "senses": [{"sense": "not beautiful or pleasant to look at", "level": "B2", "dict_examp": "I felt old and unattractive.", "lear_examp": "This information is useful for a person who thinks his/her body is unattractive."}, {"sense": "not interesting or useful", "level": "C1", "dict_examp": "an unattractive proposition", "lear_examp": "In our opinion, despite the friendly atmosphere of our club's meetings we find them very unattractive and rather \"dull.\""}]}]}, {"word": "unanimous", "poses": [{"pos": "adjective", "senses": [{"sense": "agreed by everyone", "level": "C2", "dict_examp": "The jury was unanimous in finding him guilty.", "lear_examp": "Having spoken to neighbors, we reached a unanimous decision that the route of the aircraft should be changed immediately so that they no longer disrupt our lives."}]}]}, {"word": "unanimously", "poses": [{"pos": "adverb", "senses": [{"sense": "with agreement from everyone", "level": "C2", "dict_examp": "We agreed unanimously that he was the best candidate.", "lear_examp": "While it is true that there are quite a few opposing theories about losing weight, doctors unanimously agree that a hedonistic approach to eating can lead to unpleasant health issues like obesity."}]}]}, {"word": "ultimately", "poses": [{"pos": "adverb", "senses": [{"sense": "finally, after a series of things have happened", "level": "C1", "dict_examp": "Everything will ultimately depend on what is said at the meeting with the directors next week.", "lear_examp": "Ultimately, it leads to a lot of diseases and early death."}, {"sense": "used to emphasize the most important fact in a situation", "level": "C2", "dict_examp": "Ultimately, he'll have to decide.", "lear_examp": "Ultimately, that is why we are influenced by other people's personalities."}]}]}, {"word": "unaffordable", "poses": [{"pos": "adjective", "senses": [{"sense": "too expensive for people to be able to buy", "level": "C1", "dict_examp": "Such clothes are unaffordable for most people.", "lear_examp": "Regarding the gift shop, most of the students admit that there was most interesting technology in there, but on the other hand the things offered were unaffordable for us."}]}]}, {"word": "uncertain", "poses": [{"pos": "adjective", "senses": [{"sense": "not sure or not able to decide about something", "level": "B2", "dict_examp": "He's uncertain whether to go to graduate school or not.", "lear_examp": "There are things that I am uncertain about, and that I would be grateful if you could explain."}, {"sense": "not known or fixed, or not completely certain", "level": "B2", "dict_examp": "New arrivals face an uncertain future.", "lear_examp": "Please do not bother posting them since we do not have a zip code where I live, and they might get lost with our uncertain Post Service."}, {"sense": "in a direct and often angry way", "level": "C2", "dict_examp": "I told him to go away in no uncertain terms.", "lear_examp": "Intellectuals are used to saying in no uncertain terms that money represents the bad side of the sport."}]}]}, {"word": "unbelievable", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely bad or good and making you feel surprised", "level": "B1", "dict_examp": "It's unbelievable how lucky she's been.", "lear_examp": "The food is unbelievable and I'm sure you'll love it."}, {"sense": "not probable and difficult to believe", "level": "B2", "dict_examp": "I found most of the characters in the play totally unbelievable.", "lear_examp": "They made up unbelievable stories which almost made them cry in the end."}]}]}, {"word": "uncertainty", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being uncertain", "level": "C1", "dict_examp": "There was a lot of uncertainty about whether or not he would attend the event.", "lear_examp": "The shortages of almost everything we have to face and cope with have made our lives full of uncertainty and helplessness, but on the other hand they released in some Poles enormous energy, in the effort to support their families and provide them with food, clothing and fuel."}]}]}, {"word": "unconscious", "poses": [{"pos": "adjective", "senses": [{"sense": "in a state as though you are sleeping, for example because you have been hit on the head", "level": "B2", "dict_examp": "An explosion knocked him unconscious.", "lear_examp": "In the morning, Mrs Crozier went to visit Miss Appleford in number 42 only to find her lying on the floor unconscious."}, {"sense": "An unconscious thought or feeling is one that you are not aware that you have.", "level": "C2", "dict_examp": "an unconscious fear", "lear_examp": "Maybe it was her strict upbringing that had left her with an unconscious need to rebel, and that in turn caused her to be drawn to this rowdy young man."}]}]}, {"word": "undeniably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is almost certainly true", "level": "C2", "dict_examp": "He is undeniably the best student we have ever had.", "lear_examp": "Of course, it will undeniably involve some substantial initial expenditure for opening a cafeteria, but the final result will definitely offset this."}]}]}, {"word": "unacceptable", "poses": [{"pos": "adjective", "senses": [{"sense": "too bad to be allowed to continue", "level": "B2", "dict_examp": "The water contains unacceptable levels of pollution.", "lear_examp": "So I waited for 45 minutes until the show started. That is an unacceptable delay."}]}]}, {"word": "unconsciously", "poses": [{"pos": "adverb", "senses": [{"sense": "If you do something unconsciously, you do it without knowing that you are doing it.", "level": "C2", "dict_examp": "She was nodding her head, unconsciously urging him on.", "lear_examp": "This is so because every human unconsciously chooses clothes that correspond to their approach to life."}]}]}, {"word": "unclear", "poses": [{"pos": "adjective", "senses": [{"sense": "not easy to understand", "level": "B2", "dict_examp": "The situation at the moment is unclear.", "lear_examp": "If something is unclear please give me a call."}, {"sense": "If you are unclear about something, you are not certain about it.", "level": "B2", "dict_examp": "I'm unclear about a couple of points in your proposal - could you go over them again?", "lear_examp": ""}]}]}, {"word": "unconditional", "poses": [{"pos": "adjective", "senses": [{"sense": "done or given without any limits and without asking for anything for yourself", "level": "C2", "dict_examp": "unconditional love", "lear_examp": "But I am of the firm conviction that you cannot love a child too much, and this unconditional love does not include any rod, in both the literal and figurative sense of the word."}]}]}, {"word": "unaffected", "poses": [{"pos": "adjective", "senses": [{"sense": "not changed by something", "level": "C2", "dict_examp": "Smaller colleges will be unaffected by the new regulations.", "lear_examp": "Only a genius could stay unaffected by such idolatry."}]}]}, {"word": "unbearable", "poses": [{"pos": "adjective", "senses": [{"sense": "too painful or unpleasant for you to continue to experience", "level": "B2", "dict_examp": "The heat was almost unbearable.", "lear_examp": "Life can be very difficult, almost unbearable sometimes."}]}]}, {"word": "undeniable", "poses": [{"pos": "adjective", "senses": [{"sense": "certainly true", "level": "C1", "dict_examp": "an undeniable fact", "lear_examp": "It is undeniable that he has made a positive contribution to the history of my country."}]}]}, {"word": "ultimate", "poses": [{"pos": "adjective", "senses": [{"sense": "better, greater or worse than all similar things", "level": "B2", "dict_examp": "Climbing Mount Everest is the ultimate challenge.", "lear_examp": "Being on the road is always better than the arrival, so this journey would be the ultimate journey for me as well."}, {"sense": "final or most important", "level": "C1", "dict_examp": "the ultimate aim/goal", "lear_examp": "But, for me, the ultimate thrill would be the fact that people would use the software that I had made."}]}]}, {"word": "unavoidably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that could not be avoided or prevented", "level": "C2", "dict_examp": "She was unavoidably delayed.", "lear_examp": "Some people believe that thinking about poor consequences can unavoidably lead to them."}]}]}, {"word": "uncomfortable", "poses": [{"pos": "adjective", "senses": [{"sense": "not feeling comfortable and pleasant, or not making you feel comfortable and pleasant", "level": "B1", "dict_examp": "I've eaten so much, I'm really uncomfortable.", "lear_examp": "The things I most hate wearing are shirts, I think they're very uncomfortable."}, {"sense": "slightly embarrassed, or making you feel slightly embarrassed", "level": "C1", "dict_examp": "an uncomfortable silence", "lear_examp": "It is interesting how people get embarrassed and uncomfortable when they have to face an English speech."}]}]}, {"word": "uncommon", "poses": [{"pos": "adjective", "senses": [{"sense": "unusual", "level": "C1", "dict_examp": "It's not uncommon for people to become ill when they travel.", "lear_examp": "NEW TRENDS: Vegetarian food is not uncommon nowadays."}]}]}, {"word": "ugly", "poses": [{"pos": "adjective", "senses": [{"sense": "unpleasant to look at", "level": "B1", "dict_examp": "an ugly building/city", "lear_examp": "There are lots of trees and bushes, and lots of fresh air, but the city itself is quite ugly."}, {"sense": "An ugly situation is very unpleasant, usually because it involves violence.", "level": "C2", "dict_examp": "There were ugly scenes outside the stadium.", "lear_examp": "Just think about the ugly situation of being in a fully-booked hotel and then the staff goes on strike."}]}]}, {"word": "unbiased", "poses": [{"pos": "adjective", "senses": [{"sense": "able to judge fairly because you are not influenced by your own opinions", "level": "C2", "dict_examp": "He was able to give me some unbiased advice.", "lear_examp": "If you take into consideration only certain subjects, you are likely to end up despising other fields of knowledge, whereas the main point of education is to give an unbiased view of our own and foreign cultures."}]}]}, {"word": "unattainable", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to be achieved", "level": "C2", "dict_examp": "an unattainable ideal", "lear_examp": "The ability to permanently record thought opened new dimensions to fields like philosophy, poetry and literature, enabling them to reach a degree of complexity, creativity and longevity unattainable by previous technologies."}]}]}, {"word": "unable", "poses": [{"pos": "adjective", "senses": [{"sense": "to not be able to do something", "level": "B1", "dict_examp": "We were unable to contact him at the time.", "lear_examp": "I was just shocked, and unable to speak at all, or to breathe."}]}]}, {"word": "unbalanced", "poses": [{"pos": "adjective", "senses": [{"sense": "slightly mentally ill", "level": "C2", "dict_examp": "After his death, she became slightly unbalanced.", "lear_examp": "Many homeless people are mentally unbalanced, some are addicted to chemical substances."}, {"sense": "false and not fair", "level": "C2", "dict_examp": "He gave an unbalanced view of the situation.", "lear_examp": "I think that if a school measures a child solely by his or her academic success, it will be an unbalanced and narrow-minded method to measure a child and his or her ability as a whole person."}]}]}, {"word": "uncomfortably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not comfortable or pleasant", "level": "C1", "dict_examp": "I was warm but not uncomfortably so.", "lear_examp": "I saw faces I see every day, but in uncomfortably long dresses and with starched white collars, I saw their effort to look nice, attractive and not to disturb the rules set by the society of their time."}]}]}, {"word": "uncountable noun", "poses": [{"pos": "noun", "senses": [{"sense": "a noun that does not have a plural form and cannot be used with \"a\" or \"one\"", "level": "B1", "dict_examp": "\"Information\" and \"furniture\" are uncountable nouns.", "lear_examp": ""}]}]}, {"word": "unchanged", "poses": [{"pos": "adjective", "senses": [{"sense": "staying the same", "level": "B2", "dict_examp": "The area has remained virtually unchanged in fifty years.", "lear_examp": "All the big and small things which define people's personal environment will be left nearly unchanged - the furniture, the pictures on the wall.... I suppose our future homes will be a mix of new technologies and good old tradition."}]}]}, {"word": "uncle", "poses": [{"pos": "noun", "senses": [{"sense": "the brother of your mother or father, or the husband of your aunt", "level": "A2", "dict_examp": "I have an uncle who lives there.", "lear_examp": "My uncle gave me the best present."}]}]}, {"word": "undo", "poses": [{"pos": "verb", "senses": [{"sense": "to open something that is fastened or tied", "level": "B2", "dict_examp": "The buttons on her dress are hard to undo.", "lear_examp": ""}, {"sense": "to make a computer get rid of the last change you made to a document and make it the way it was before", "level": "B2", "dict_examp": "You need to undo that change.", "lear_examp": ""}]}]}, {"word": "underneath", "poses": [{"pos": "preposition", "senses": [{"sense": "under or below something", "level": "B1", "dict_examp": "The tunnel goes right underneath the bay.", "lear_examp": "She was dressed like a princess, after spending the whole day looking for an appropriate dress, which she finally managed to find underneath her bed."}]}, {"pos": "adverb", "senses": [{"sense": "under or below", "level": "B2", "dict_examp": "He was wearing a dark jacket with a red shirt underneath.", "lear_examp": "The rock was about 70m high and there was water underneath."}]}]}, {"word": "underline", "poses": [{"pos": "verb", "senses": [{"sense": "to draw a line under a word or sentence, especially in order to show its importance", "level": "B1", "dict_examp": "All the technical words have been underlined in red.", "lear_examp": "And, another disadvantage in my opinion is that is more difficult to underline or to write some notes if you study from the computer."}, {"sense": "to emphasize the truth or importance of something", "level": "B2", "dict_examp": "The report underlines the need for more teachers in schools.", "lear_examp": "It is true that museums do not show the past as well as they could, but we must underline that they are always good enough if we are really interested in knowing about our past."}]}]}, {"word": "understand", "poses": [{"pos": "verb", "senses": [{"sense": "to know the meaning of something that someone says", "level": "A1", "dict_examp": "She explained the whole idea again, but I still didn't understand.", "lear_examp": "My teacher helps me when I don't understand."}, {"sense": "to know why or how something happens or works, or how to do something", "level": "A2", "dict_examp": "We still don't fully understand how the brain works.", "lear_examp": "The teacher explained her plan for teaching and we understood how to plan our time."}, {"sense": "to know how someone feels or why they behave in a particular way", "level": "B1", "dict_examp": "I don't understand James sometimes.", "lear_examp": "Maybe now you can understand why I hate shopping. kisses,"}, {"sense": "used to say that you believe something is true because someone has told you it is", "level": "C1", "dict_examp": "I understand that the school is due to close next year.", "lear_examp": "I understand that the job entails entertaining people."}, {"sense": "to say something to someone in a way that they understand", "level": "C1", "dict_examp": "I had a little difficulty making myself understood.", "lear_examp": "(Find enclosed a paper slip on which I have written a destination, number of tickets, etc., in the German language - use it just in case you can't make yourselves understood.)"}]}]}, {"word": "underwater", "poses": [{"pos": "adjective", "senses": [{"sense": "under the surface of water", "level": "B2", "dict_examp": "an underwater camera", "lear_examp": "If you have diving equipment, you will spend a very good time underwater."}]}]}, {"word": "underpants", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of underwear that covers the area between your waist and the top of your legs", "level": "B1", "dict_examp": "I need some new underpants.", "lear_examp": "Was that woman me, standing there in those ugly-looking underpants, but with a smart sports bra, with everybody laughing around her?"}]}]}, {"word": "unethical", "poses": [{"pos": "adjective", "senses": [{"sense": "morally bad", "level": "C2", "dict_examp": "unethical business methods", "lear_examp": "Then, if you would like to perform an experiment, you cannot, because that would be unethical."}]}]}, {"word": "under", "poses": [{"pos": "preposition", "senses": [{"sense": "below something, or below the surface of something", "level": "A1", "dict_examp": "He hid under the bed.", "lear_examp": "I like my bedroom, because there is a table under the window, and some pictures on the wall."}, {"sense": "less than a number, amount, or age", "level": "A2", "dict_examp": "All items cost/are under a dollar.", "lear_examp": "I saw an advertisement in front of my house: the coffee bar is looking for some waiters aged under 23 years old."}, {"sense": "in a particular state or condition", "level": "B2", "dict_examp": "The President is under pressure to resign.", "lear_examp": "I am used to working under pressure."}, {"sense": "being affected by something at this time", "level": "B2", "dict_examp": "The base is once again under attack.", "lear_examp": "Everything was under control, the remote detonator had worked perfectly well."}, {"sense": "to think or understand a particular stated thing", "level": "B2", "dict_examp": "I was under the impression (that) you didn't get along very well.", "lear_examp": "I am under the impression that people generally exercise a little, but if they eat the wrong food every day, it won't help."}, {"sense": "If you say something under your breath, you say it very quietly so that other people cannot clearly hear it.", "level": "C2", "dict_examp": "\"It's time to go,\" she muttered under her breath.", "lear_examp": "\"We must have taken a wrong turn somewhere...\" he kept muttering under his breath."}, {"sense": "If something bad happens under your nose, it happens close to you but you do not notice it.", "level": "C2", "dict_examp": "They were stealing money from under my nose.", "lear_examp": "You will be surprised that there was something right under your nose that you could not live without."}, {"sense": "to be already happening", "level": "C2", "dict_examp": "Building work is already under way.", "lear_examp": "Sociologists are well-aware of the fact and experiments are under way to counterbalance these disadvantages."}]}]}, {"word": "underlying", "poses": [{"pos": "adjective", "senses": [{"sense": "An underlying reason or problem is the real reason or problem, although it is not obvious.", "level": "C2", "dict_examp": "We need to look at the underlying reasons for ill health.", "lear_examp": "The underlying reason is of course a lurking threat of death and decay, which keeps scientists investigating new methods to postpone the age of death."}]}]}, {"word": "undue", "poses": [{"pos": "adjective", "senses": [{"sense": "more than is necessary", "level": "C2", "dict_examp": "I don't want to cause undue alarm.", "lear_examp": "Moreover, not only do they save time, but also they do it without undue effort since it is not difficult or tiring any more to clean or cook"}]}]}, {"word": "underway", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is underway, it is happening.", "level": "C2", "dict_examp": "Economic recovery is already underway.", "lear_examp": "The weather was beautiful and the sun shone but as soon as I was underway, the weather turned on us and grew worse with every step."}, {"sense": "to begin", "level": "C2", "dict_examp": "The film festival gets underway on July 11th.", "lear_examp": ""}]}]}, {"word": "undertake", "poses": [{"pos": "verb", "senses": [{"sense": "to do or begin to do something, especially something that will take a long time or be difficult", "level": "C1", "dict_examp": "Students are required to undertake simple experiments.", "lear_examp": "To achieve it the above mentioned steps should be undertaken."}, {"sense": "to decide or agree to do something", "level": "C2", "dict_examp": "She undertook to organize the meeting.", "lear_examp": "In the last meeting of Our Neighborhood Club we discussed the actions you could undertake to make this situation more bearable."}]}]}, {"word": "understandably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is expected in a particular situation", "level": "C1", "dict_examp": "She's understandably upset.", "lear_examp": "Furthermore, the use of the computer system caused long waiting times because everyone wanted - understandably - to find out more about suitable working opportunities."}]}]}, {"word": "undress", "poses": [{"pos": "verb", "senses": [{"sense": "to remove your clothes or someone else's clothes", "level": "B1", "dict_examp": "She undressed the children and put them to bed.", "lear_examp": "The chair is for my clothes when I undress."}]}]}, {"word": "underdeveloped", "poses": [{"pos": "adjective", "senses": [{"sense": "not having an advanced level of technology or industry", "level": "C2", "dict_examp": "They are working in underdeveloped parts of the city.", "lear_examp": "A shift of focus in underdeveloped and developing states' economic and social policies is vital to overcoming the problems which cause homelessness."}]}]}, {"word": "underestimate", "poses": [{"pos": "verb", "senses": [{"sense": "to fail to understand how large, strong, or important something is", "level": "B2", "dict_examp": "Many people underestimate the cost of owning a car.", "lear_examp": "The report also seemed to underestimate the number of people that had attended."}, {"sense": "to not understand how powerful, smart, or skilled someone is", "level": "C1", "dict_examp": "I thought it would be an easy game but I had underestimated my opponent.", "lear_examp": "At the beginning she will ask you many questions about yourself. But don't underestimate Ms. Bates (that's her name)."}]}]}, {"word": "understandable", "poses": [{"pos": "adjective", "senses": [{"sense": "An  understandable feeling or action is one that you would expect in that particular situation.", "level": "B2", "dict_examp": "\"I still feel really angry about it.\" \"That's understandable.\"", "lear_examp": "I guess they wouldn't give me permission to stay at a female friend's home, but that's understandable."}]}]}, {"word": "undershirt", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of underwear that covers the upper part of the body and you wear under a shirt", "level": "C1", "dict_examp": "As a gift for the new baby she brought tiny undershirts in three sizes.", "lear_examp": ""}]}]}, {"word": "unemployed", "poses": [{"pos": "adjective", "senses": [{"sense": "not having a job that provides money", "level": "B1", "dict_examp": "He's been unemployed for over a year.", "lear_examp": "I have been unemployed for four months."}]}, {"pos": "noun", "senses": [{"sense": "people who are unemployed", "level": "C1", "dict_examp": "We want to get the unemployed back into work.", "lear_examp": "I am a lawyer and not so long ago I worked in Poznan Unemployment Office where I happened to use English - not talking to the unemployed of course."}]}]}, {"word": "undergo", "poses": [{"pos": "verb", "senses": [{"sense": "to experience something, especially a change or medical treatment", "level": "C1", "dict_examp": "The country is currently undergoing major political change.", "lear_examp": "Nowadays, my country is undergoing a very difficult financial and social situation."}]}]}, {"word": "understanding", "poses": [{"pos": "noun", "senses": [{"sense": "knowledge about a subject, situation, etc. or about how something works", "level": "B2", "dict_examp": "She doesn't have any understanding of politics.", "lear_examp": "It was my understanding that discounts were available on the tickets, as the advertisement showed, but there were no discounts."}, {"sense": "sympathy", "level": "B2", "dict_examp": "Thank you for your understanding - I do appreciate it.", "lear_examp": "Thank you for your understanding."}, {"sense": "an informal agreement between two people", "level": "C1", "dict_examp": "The two sides have come to/reached an understanding about the sale of the house.", "lear_examp": "I intend to express my dissatisfaction with your services through the present letter, and to reach an understanding from which I could be compensated."}]}, {"pos": "adjective", "senses": [{"sense": "showing sympathy for someone's problems", "level": "B2", "dict_examp": "Fortunately, my boss  is very understanding.", "lear_examp": "They are famous, but they need to be alone sometimes. I think the media must be more understanding."}]}]}, {"word": "underwear", "poses": [{"pos": "noun", "senses": [{"sense": "the clothes that you wear next to your skin, under your other clothes", "level": "B1", "dict_examp": "They sell a wide range of underwear.", "lear_examp": "If I see some nice underwear, I will buy it too."}]}]}, {"word": "undressed", "poses": [{"pos": "adjective", "senses": [{"sense": "not wearing any clothes", "level": "B2", "dict_examp": "I got undressed and went to bed.", "lear_examp": "We got undressed quicker than ever and ran into the waterfall."}]}]}, {"word": "undesirable", "poses": [{"pos": "adjective", "senses": [{"sense": "Something that is undesirable is not wanted because it is bad or unpleasant.", "level": "C2", "dict_examp": "an undesirable influence", "lear_examp": "In this day and age, man is inextricably interwoven with the undesirable environmental damage, and the problems as far as the environment is concerned have generated a great deal of heated debate."}]}]}, {"word": "unemployment", "poses": [{"pos": "noun", "senses": [{"sense": "the number of people who are unemployed", "level": "B1", "dict_examp": "a rise/fall in unemployment", "lear_examp": "Later, after a discussion about unemployment, we did reading, writing and listening."}]}]}, {"word": "undertaking", "poses": [{"pos": "noun", "senses": [{"sense": "a difficult or important piece of work, especially one that takes a long time", "level": "C2", "dict_examp": "Building your own house is a major undertaking.", "lear_examp": "While such an undertaking is most advisable, I should like to point out that there may be drawbacks."}]}]}, {"word": "underpaid", "poses": [{"pos": "adjective", "senses": [{"sense": "not earning enough for your work", "level": "C1", "dict_examp": "Her staff felt they were underpaid.", "lear_examp": "They claim that they are overworked and underpaid (it's the usual reason for striking, isn't it?)"}]}]}, {"word": "undoubtedly", "poses": [{"pos": "adverb", "senses": [{"sense": "used to emphasize that something is true", "level": "C1", "dict_examp": "Stress has undoubtedly contributed to her illness.", "lear_examp": "Indeed, children, regardless of what kind of family they grow up in, have the right to be taught to prepare themselves for dealing with the real world and the problems that come with it.  This is still undoubtedly every family's obligation whether wealthy or poor, and there are no exceptions."}]}]}, {"word": "undermine", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone less confident or make something weaker", "level": "C2", "dict_examp": "A series of scandals have undermined people's confidence in the government.", "lear_examp": "All this doesn't undermine the importance of charity workers and entertainers in our work for the greater good."}]}]}, {"word": "uneasy", "poses": [{"pos": "adjective", "senses": [{"sense": "worried because you think something bad might happen", "level": "B2", "dict_examp": "I feel a little uneasy about her traveling alone.", "lear_examp": "Anyway I was getting uneasy because of all that silence, so I began to sing."}]}]}, {"word": "undeveloped", "poses": [{"pos": "adjective", "senses": [{"sense": "Undeveloped land has no buildings on it and is not used for anything.", "level": "C2", "dict_examp": "The site is still undeveloped.", "lear_examp": "The Town Council decided to take measures in order to benefit our area, which has remained undeveloped for the last five years."}]}]}, {"word": "universally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that involves everyone in the world, or everyone in a particular group", "level": "C1", "dict_examp": "She is universally adored.", "lear_examp": "Furthermore fame can give people the feeling that they are universally loved."}]}]}, {"word": "unit", "poses": [{"pos": "noun", "senses": [{"sense": "a single thing or a separate part of something larger", "level": "B1", "dict_examp": "The first year of the course is divided into four units.", "lear_examp": "So, don't worry because I'll study the unit with my friend and he'll teach me anything I don't know."}, {"sense": "a group of people living or working together, especially for a particular purpose", "level": "C1", "dict_examp": "the family unit", "lear_examp": "This is very important because once they have grown up, they have to be together in the family unit with their own kids."}]}]}, {"word": "unfair", "poses": [{"pos": "adjective", "senses": [{"sense": "not treating people in a equal way", "level": "B1", "dict_examp": "an unfair system", "lear_examp": "He always gave me horrible marks and was very unfair."}, {"sense": "not true and morally wrong", "level": "B2", "dict_examp": "It's unfair to blame Roger for everything.", "lear_examp": "Furthermore, it's unfair to say that there is nothing to do in the evenings, because there is lots to do."}]}]}, {"word": "universe", "poses": [{"pos": "noun", "senses": [{"sense": "everything that exists,  including all the stars, space, etc.", "level": "B1", "dict_examp": "Is there intelligent life elsewhere in the universe?", "lear_examp": "I'm the last survivor of a great civilization that is now extinguished. I've been looking for a planet like yours for ages, to transmit the secret of my people. Take this box: this source of energy means strength, it is the most powerful item in the universe!"}]}]}, {"word": "unexpectedly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way or at a time that is not expected", "level": "B2", "dict_examp": "Retail sales unexpectedly fell last month.", "lear_examp": "He called me really unexpectedly at work, and told me to go to his office at once."}]}]}, {"word": "unity", "poses": [{"pos": "noun", "senses": [{"sense": "when everyone agrees with each other or wants to stay together", "level": "C1", "dict_examp": "national/party unity", "lear_examp": "I would conclude by saying that some healthy competition is good, but your main goal has to be to work together as a group and work towards the achievement of goals - as the saying goes, \"united we stand, divided we fall\" and unity is strength."}]}]}, {"word": "unkind", "poses": [{"pos": "adjective", "senses": [{"sense": "slightly cruel", "level": "B1", "dict_examp": "an unkind remark", "lear_examp": "Joss, the landlord of Jamaica Inn, is a rude person and he is unkind to his wife Patience."}]}]}, {"word": "unfairly", "poses": [{"pos": "adverb", "senses": [{"sense": "in an unfair way", "level": "B2", "dict_examp": "His employers treated him very unfairly.", "lear_examp": "Your report not only gave wrong information to your readers but also criticized a music festival unfairly."}]}]}, {"word": "unite", "poses": [{"pos": "verb", "senses": [{"sense": "to join together as a group, or to make people join together as a group", "level": "C1", "dict_examp": "We need a leader who can unite the party.", "lear_examp": "A barbecue would unite all members in a rarely seen way, because we would all be together for a day or an afternoon which would be enough to make some new friends and get to know the other members better."}]}]}, {"word": "unfit", "poses": [{"pos": "adjective", "senses": [{"sense": "not good enough or not having the qualities needed or expected for something", "level": "B2", "dict_examp": "The building was declared unfit for human habitation.", "lear_examp": "Cars also emit carbon monoxide and make the air unfit to breathe."}]}]}, {"word": "unique", "poses": [{"pos": "adjective", "senses": [{"sense": "different from everyone and everything else", "level": "B2", "dict_examp": "Everyone's fingerprints are unique.", "lear_examp": "Every book is unique because every writer is unique, with his own style and his own character."}, {"sense": "unusual and special", "level": "B2", "dict_examp": "Do not miss this unique opportunity to buy all six pans at half the recommended price.", "lear_examp": "First of all, I would like to tell you that I really enjoyed my stay and it was a unique experience for me."}, {"sense": "to exist in only one place, or be connected with only one person or thing", "level": "C1", "dict_examp": "It's a method of education that is unique to this school.", "lear_examp": "I strongly believe that every country needs its local shops with products that are unique to the particular country, not only because it is very good for local development but also because this way the world will stay colorful and interesting."}]}]}, {"word": "unfriendly", "poses": [{"pos": "adjective", "senses": [{"sense": "not friendly", "level": "B1", "dict_examp": "She was really unfriendly to me.", "lear_examp": "My last teacher was very unfriendly."}]}]}, {"word": "unfashionable", "poses": [{"pos": "adjective", "senses": [{"sense": "not fashionable or popular at a particular time", "level": "B2", "dict_examp": "This kind of cooking is very unfashionable now.", "lear_examp": "I think that museums became a little bit unfashionable as a way of knowing or showing something."}]}]}, {"word": "unfold", "poses": [{"pos": "verb", "senses": [{"sense": "to become open and flat, or to make something become open and flat", "level": "C1", "dict_examp": "I unfolded the map.", "lear_examp": "Well, you will be if you saw our slide show and talk - members can hardly forget that relaxing afternoon when we unfolded the sails on the lake and enjoyed the tranquility of the area."}, {"sense": "If a situation or story unfolds, it develops or becomes known.", "level": "C2", "dict_examp": "The nation watched on TV as the tragic events unfolded.", "lear_examp": "The plot unfolds in an exciting way and the film is fraught with lies, surprises and insinuations."}]}]}, {"word": "university", "poses": [{"pos": "noun", "senses": [{"sense": "a place where students study at a high level to get a degree", "level": "A1", "dict_examp": "the University of Cambridge", "lear_examp": "My friend is a student at the university in my town."}]}]}, {"word": "uneventful", "poses": [{"pos": "adjective", "senses": [{"sense": "without problems and without anything exciting happening", "level": "C2", "dict_examp": "The journey itself was fairly uneventful.", "lear_examp": "This rather quiet and uneventful life changed when we moved to the city."}]}]}, {"word": "unjustified", "poses": [{"pos": "adjective", "senses": [{"sense": "done without a reason and not deserved", "level": "C1", "dict_examp": "unjustified criticism", "lear_examp": "The location turned out to be far too small and the costs unjustified."}]}]}, {"word": "uneven", "poses": [{"pos": "adjective", "senses": [{"sense": "not level, smooth, or in equal amounts", "level": "C2", "dict_examp": "an uneven floor", "lear_examp": "At the same time we must solve the financial problems incurred by the uneven age distribution."}]}]}, {"word": "uniform", "poses": [{"pos": "noun", "senses": [{"sense": "a special set of clothes that are worn by people who do a particular job or go to a particular school", "level": "A2", "dict_examp": "a school uniform", "lear_examp": "I think I have left the skirt of my school uniform in your house."}]}]}, {"word": "unhappiness", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being unhappy", "level": "B2", "dict_examp": "Her unhappiness was obvious to everyone.", "lear_examp": "They feel very unhappy living in a zoo, since for them it is like a prison, and their unhappiness can bring about their death."}]}]}, {"word": "unfortunately", "poses": [{"pos": "adverb", "senses": [{"sense": "used to say that you wish something was not true or had not happened", "level": "A2", "dict_examp": "I'd love to come, but unfortunately, I have to work.", "lear_examp": "Unfortunately I lost my keys."}]}]}, {"word": "unimportant", "poses": [{"pos": "adjective", "senses": [{"sense": "not important", "level": "B1", "dict_examp": "Staffing is still a relatively unimportant issue compared to the other problems that we're facing.", "lear_examp": "Surely there were some little problems but I think they were unimportant."}]}]}, {"word": "unfavorable", "poses": [{"pos": "adjective", "senses": [{"sense": "negative and showing that you do not like something", "level": "C2", "dict_examp": "The play received generally unfavorable reviews.", "lear_examp": "He often gets into deep research of how to avoid unfavorable effects, which modern technology has on the environment."}, {"sense": "not good and likely to cause problems", "level": "C2", "dict_examp": "unfavorable weather conditions", "lear_examp": "We are talked too much about \"depressing industries\" and \"unfavorable market conditions.\""}]}]}, {"word": "united", "poses": [{"pos": "adjective", "senses": [{"sense": "joined together as one group, organization, etc.", "level": "B2", "dict_examp": "We as a country are united in sorrow for those we lost.", "lear_examp": "Despite all these advantages, I deeply miss the times when I had almost no technological facilities, but a very happy and united family."}, {"sense": "If people are united, they all agree about something.", "level": "B2", "dict_examp": "Democrats seemed united in favor of the resolution.", "lear_examp": "We have the authority to make changes, that is if we stand united."}]}]}, {"word": "union", "poses": [{"pos": "noun", "senses": [{"sense": "an organization that represents a group of people\n    who do a particular job or who have the same goals", "level": "B1", "dict_examp": "a teachers'/firefighters' union", "lear_examp": "I was the chairperson of the school student union."}, {"sense": "a single political unit that is made up of two or more\n    countries, states, etc.", "level": "B2", "dict_examp": "the former Soviet Union", "lear_examp": "I visited the Soviet Union and spent a couple of days in Lvov."}]}]}, {"word": "unforeseen", "poses": [{"pos": "adjective", "senses": [{"sense": "not expected", "level": "C1", "dict_examp": "The concert was cancelled due to unforeseen circumstances.", "lear_examp": "Finally, owing to unforeseen circumstances, the half-day visit to St Andrews was cancelled and I was told about it only in the late morning, which prevented me from doing what I had planned."}]}]}, {"word": "unforgettable", "poses": [{"pos": "adjective", "senses": [{"sense": "Something that is unforgettable is so good, interesting, etc. that you remember it for a long time.", "level": "B1", "dict_examp": "Seeing Niagara Falls was an unforgettable experience.", "lear_examp": "I've just arrived home and I'd like to thank you for the unforgettable weekend."}]}]}, {"word": "unhappy", "poses": [{"pos": "adjective", "senses": [{"sense": "sad", "level": "A2", "dict_examp": "an unhappy childhood/marriage", "lear_examp": "I was unhappy you couldn't come to my birthday party."}, {"sense": "not satisfied", "level": "B1", "dict_examp": "I'm unhappy about the situation.", "lear_examp": "I'm still unhappy about my present accommodation for the following reasons."}]}]}, {"word": "unexpected", "poses": [{"pos": "adjective", "senses": [{"sense": "not expected", "level": "B1", "dict_examp": "His death was completely unexpected.", "lear_examp": "Last week I had an unexpected visit from my best friend - Mark."}]}]}, {"word": "uninhabited", "poses": [{"pos": "adjective", "senses": [{"sense": "If a place is uninhabited, no one lives there.", "level": "C2", "dict_examp": "an uninhabited island", "lear_examp": "The house turned out to be uninhabited, as my brother had said."}]}]}, {"word": "uninterested", "poses": [{"pos": "adjective", "senses": [{"sense": "not interested", "level": "B1", "dict_examp": "He's completely uninterested in politics.", "lear_examp": "He is uninterested in his father's money."}]}]}, {"word": "unimaginable", "poses": [{"pos": "adjective", "senses": [{"sense": "Something that is unimaginable is difficult to imagine because it is so bad, good, big, etc.", "level": "C2", "dict_examp": "unimaginable pain/wealth", "lear_examp": "Later, at the age of 60, after he had suffered from a stroke that was a side effect of the open heart surgery he underwent, he was left speech-impaired, which can be considered an unimaginable handicap for an actor."}]}]}, {"word": "unfortunate", "poses": [{"pos": "adjective", "senses": [{"sense": "used to show that you wish something was not true or had not happened", "level": "B2", "dict_examp": "an unfortunate mistake", "lear_examp": "It is unfortunate that he couldn't inform you about the conference."}, {"sense": "unlucky", "level": "B2", "dict_examp": "One unfortunate person failed to see the hole and fell straight into it.", "lear_examp": "He was always an unfortunate person, because bad things happened to him all the time."}]}]}, {"word": "unhelpful", "poses": [{"pos": "adjective", "senses": [{"sense": "not wanting to help someone, in a way that seems unfriendly", "level": "B2", "dict_examp": "The taxi driver was rude and unhelpful.", "lear_examp": "However, The Taverna has no uniform and the waiters there are sometimes pushy and unhelpful."}, {"sense": "not improving a situation", "level": "C1", "dict_examp": "an unhelpful remark", "lear_examp": "Because of the unhelpful and useless solution from this company, called Energy Plus, I am looking for advice."}]}]}, {"word": "unfamiliar", "poses": [{"pos": "adjective", "senses": [{"sense": "not known to you", "level": "B2", "dict_examp": "I noticed several unfamiliar faces in the meeting room.", "lear_examp": "On the other hand, you may not like some dishes, because they may be unfamiliar to you."}, {"sense": "to not have any knowledge or experience of something", "level": "B2", "dict_examp": "A lot of people are unfamiliar with the system.", "lear_examp": ""}]}]}, {"word": "unhealthy", "poses": [{"pos": "adjective", "senses": [{"sense": "likely to become ill or likely to damage your health", "level": "B1", "dict_examp": "He has a very unhealthy lifestyle.", "lear_examp": "The city is unsafe and unhealthy because of the pollution and the violence."}]}]}, {"word": "universal", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to everyone in the world, or to everyone in a particular group", "level": "B2", "dict_examp": "a universal truth", "lear_examp": "I think the film Yasujino Ozo has something universal in relation to our daily life, a kind of feeling or emotion."}]}]}, {"word": "uninteresting", "poses": [{"pos": "adjective", "senses": [{"sense": "not interesting", "level": "B1", "dict_examp": "His later work is uninteresting in comparison with his first novel.", "lear_examp": "Magazines are only written about uninteresting things."}]}]}, {"word": "unnecessary", "poses": [{"pos": "adjective", "senses": [{"sense": "describes something that could be avoided or that is not needed", "level": "B1", "dict_examp": "You don't want to make any unnecessary car trips in this weather.", "lear_examp": "Don't waste too much time with unnecessary TV shows or computer games."}]}]}, {"word": "unsatisfactory", "poses": [{"pos": "adjective", "senses": [{"sense": "not good enough", "level": "B2", "dict_examp": "The excuse they gave was unsatisfactory.", "lear_examp": "It was a great idea, but I think I need to make some points about the things that I found unsatisfactory."}]}]}, {"word": "unlike", "poses": [{"pos": "preposition", "senses": [{"sense": "different from someone or something", "level": "B2", "dict_examp": "The furniture was unlike anything she had ever seen.", "lear_examp": "In fact the Hotel Astrid  is now closed so I had to stay at the Riverside Hotel, which offers great savings for students, unlike the Hotel Royal which is quite expensive."}, {"sense": "not typical of someone or something", "level": "C2", "dict_examp": "It's unlike her to be quiet - was there something wrong?", "lear_examp": "Over the weeks he was getting more and more exhausted and started reducing his hours of work. That was so unlike him."}]}]}, {"word": "unlock", "poses": [{"pos": "verb", "senses": [{"sense": "to open something that is locked  using a key or an electronic device", "level": "B2", "dict_examp": "They  haven't unlocked the computer room yet.", "lear_examp": "She unlocked the door and went in."}]}]}, {"word": "unsolved", "poses": [{"pos": "adjective", "senses": [{"sense": "having no answer or solution", "level": "C1", "dict_examp": "an unsolved mystery/murder/crime", "lear_examp": "Consequently, a lot of problems remained unsolved."}]}]}, {"word": "unspoiled", "poses": [{"pos": "adjective", "senses": [{"sense": "An unspoiled place is beautiful because it has not been changed or damaged by people.", "level": "C1", "dict_examp": "an island with clean, unspoiled beaches", "lear_examp": "I hope that one day this unfriendly place will become once more the peaceful, unspoiled and beautiful village that enchanted every passenger with its beauty."}]}]}, {"word": "unreliable", "poses": [{"pos": "adjective", "senses": [{"sense": "not able to be trusted or depended on", "level": "B2", "dict_examp": "The trains were noisy, dirty, and unreliable.", "lear_examp": "This article has 4 main errors which makes it unreliable and I am disappointed in it."}]}]}, {"word": "unnatural", "poses": [{"pos": "adjective", "senses": [{"sense": "not normal or right", "level": "B2", "dict_examp": "an unnatural silence", "lear_examp": "Animals live in unnatural conditions, and die early."}]}]}, {"word": "unpopular", "poses": [{"pos": "adjective", "senses": [{"sense": "disliked by most people", "level": "B2", "dict_examp": "The proposal is deeply unpopular with the public.", "lear_examp": "In addition, the outdoor swimming pool, supposedly unpopular, happens to be constantly full of people, since waterpolo classes are given for free and there is a bar just next to it."}]}]}, {"word": "unpack", "poses": [{"pos": "verb", "senses": [{"sense": "to remove things from a suitcase, bag or box", "level": "B1", "dict_examp": "I haven't even had time to unpack my suitcase/clothes/bag.", "lear_examp": "After I unpacked, I asked if I could have a guide to show me around the town."}]}]}, {"word": "unsafe", "poses": [{"pos": "adjective", "senses": [{"sense": "dangerous", "level": "C1", "dict_examp": "The building is unsafe.", "lear_examp": "It was extremely unsafe as the safety belts were broken."}, {"sense": "If you feel unsafe, you feel that you are in danger.", "level": "C1", "dict_examp": "Many women feel unsafe on the streets at night.", "lear_examp": "It was then that I began to feel unsafe; I thought, if something happens, this mob will become something truly hard to control, and this idea frightened me for some time."}]}]}, {"word": "untie", "poses": [{"pos": "verb", "senses": [{"sense": "to open a knot or something that has been tied with a knot", "level": "B2", "dict_examp": "I untied my shoelaces and kicked off my shoes.", "lear_examp": "She tried to untie the ropes but they were too strong."}]}]}, {"word": "unrest", "poses": [{"pos": "noun", "senses": [{"sense": "when a lot of people are angry about something and are likely to become violent", "level": "C2", "dict_examp": "political/social unrest", "lear_examp": "Unemployment is inherently a source of social unrest since it concerns the citizens of a given nation very directly."}]}]}, {"word": "unnoticed", "poses": [{"pos": "adjective", "senses": [{"sense": "without being seen or noticed", "level": "C1", "dict_examp": "We managed to slip away unnoticed.", "lear_examp": "But by the time we stop and look around us, it is usually too late to say goodbye to things that were with us, watched us grow and then disappeared, alone and unnoticed."}]}]}, {"word": "unlikely", "poses": [{"pos": "adjective", "senses": [{"sense": "not likely to happen", "level": "B1", "dict_examp": "It's unlikely that we'll see them again.", "lear_examp": "Unfortunately, it is very unlikely that I would be able to go and collect the keys at that time, because I have arranged an appointment with my doctor to see him about my leg."}, {"sense": "difficult to believe or probably not true", "level": "C2", "dict_examp": "an unlikely explanation/story", "lear_examp": "It's an unlikely tale in every sense: very different people from all around the world - with very different social situation - dropped into an unexpected turn of events."}]}]}, {"word": "unrealistic", "poses": [{"pos": "adjective", "senses": [{"sense": "not thinking about what is likely to happen or what you can really do", "level": "B2", "dict_examp": "I think these sales forecasts are unrealistic, considering how slow sales are right now.", "lear_examp": "But it is unrealistic to think that everyone can go to work by bicycle."}]}]}, {"word": "unpaid", "poses": [{"pos": "adjective", "senses": [{"sense": "An unpaid debt, tax, etc. has not been paid.", "level": "C1", "dict_examp": "They had nearly $20,000 in unpaid debts.", "lear_examp": "This amount was unpaid by the previous owner."}, {"sense": "working without getting any money", "level": "C1", "dict_examp": "unpaid work", "lear_examp": "At the time he was mostly doing unpaid work, living on a low budget and going to painting night-classes."}]}]}, {"word": "unreasonable", "poses": [{"pos": "adjective", "senses": [{"sense": "not fair or acceptable", "level": "B2", "dict_examp": "unreasonable behavior/demands", "lear_examp": "So it's unreasonable to think that a country can base its scholastic system only on the few things that students like."}]}]}, {"word": "unpleasant", "poses": [{"pos": "adjective", "senses": [{"sense": "not enjoyable or pleasant", "level": "B1", "dict_examp": "an unpleasant experience/smell", "lear_examp": "On top of that, if you stay in the countryside, you will avoid the smog and the noise of the city, which are very unpleasant!"}, {"sense": "difficult and not easy to like", "level": "C1", "dict_examp": "an unpleasant young man", "lear_examp": "Furthermore, the air-conditioning made the bus too cold, there were no toilets on-board, and the bus driver, a very unpleasant man, could not provide us with answers to our questions."}]}]}, {"word": "unsuccessfully", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not successful", "level": "C1", "dict_examp": "We tried unsuccessfully to climb the wall.", "lear_examp": "I tried to reach the company several times in the last two months, unsuccessfully."}]}]}, {"word": "unthinkable", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is unthinkable, it is so strange that you cannot imagine it will ever happen.", "level": "C1", "dict_examp": "Thirty years ago a no-smoking restaurant would have been unthinkable.", "lear_examp": "Nowadays it is simply unthinkable to live without a computer."}]}]}, {"word": "unreal", "poses": [{"pos": "adjective", "senses": [{"sense": "Something that is unreal seems so strange that it is difficult to believe.", "level": "C1", "dict_examp": "For a while I couldn't believe she was dead - it all seemed unreal.", "lear_examp": "To sum up, the reality of reality shows is that they want to simulate reality and therefore appear to be credible, a plausible opportunity for the audience to become participant and master at the same time: the most unreal situation of all."}]}]}, {"word": "unprecedented", "poses": [{"pos": "adjective", "senses": [{"sense": "never having happened before", "level": "C2", "dict_examp": "The Internet has given people unprecedented access to information.", "lear_examp": "Last but not least, accidents in nuclear factories and nuclear waste are likely to cause unprecedented environmental damage."}]}]}, {"word": "unproductive", "poses": [{"pos": "adjective", "senses": [{"sense": "not producing anything of value", "level": "C1", "dict_examp": "There were months of unproductive bureaucracy.", "lear_examp": "Especially if these graduates are unemployed and they can't find a job easily, they would feel unproductive by staying home."}]}]}, {"word": "unscrupulous", "poses": [{"pos": "adjective", "senses": [{"sense": "behaving in a way that is dishonest or unfair in order to get what you want", "level": "C2", "dict_examp": "an unscrupulous financial adviser", "lear_examp": "We are loyal readers of your newspaper and we ask you to raise your voice in defense of our community against the unscrupulous sharks of big business."}]}]}, {"word": "unsustainable", "poses": [{"pos": "adjective", "senses": [{"sense": "causing damage to the environment by using more of something than can be replaced naturally", "level": "C2", "dict_examp": "unsustainable fishing methods", "lear_examp": "Moreover, the unsustainable use of the earth's resources will deprive future generations of the means of their survival."}, {"sense": "Something that is unsustainable cannot continue at the same rate.", "level": "C2", "dict_examp": "The level of spending on health care is unsustainable.", "lear_examp": ""}]}]}, {"word": "unreasonably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not fair", "level": "C1", "dict_examp": "I thought the prices were unreasonably high.", "lear_examp": "To continue, the Gift Shop had unreasonably priced gifts and the students were unable to buy from it."}]}]}, {"word": "unsuccessful", "poses": [{"pos": "adjective", "senses": [{"sense": "not achieving what was wanted or intended", "level": "B2", "dict_examp": "They made several unsuccessful attempts to reach the men.", "lear_examp": "We tried very hard to score a second goal but all our efforts were unsuccessful."}]}]}, {"word": "unsuitable", "poses": [{"pos": "adjective", "senses": [{"sense": "not acceptable or right for someone or something", "level": "B2", "dict_examp": "The software blocks material that is unsuitable for children.", "lear_examp": "If the date of the meeting is unsuitable for you, just inform me."}]}]}, {"word": "unpredictable", "poses": [{"pos": "adjective", "senses": [{"sense": "changing so much that you do not know what will happen next", "level": "B2", "dict_examp": "The weather there can be a bit unpredictable - one minute it's blue skies and the next minute it's raining hard.", "lear_examp": "By that time I was nervous because there were too many unpredictable things happening."}]}]}, {"word": "unquestionably", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is obvious and causes no doubt", "level": "C1", "dict_examp": "She is unquestionably the best person for the job.", "lear_examp": "Although the content of the Conference was unquestionably well prepared, some organizational problems appeared."}]}]}, {"word": "unprofessional", "poses": [{"pos": "adjective", "senses": [{"sense": "not showing the standard of behavior or skills that are expected of a person in a skilled job", "level": "C1", "dict_examp": "an unprofessional attitude", "lear_examp": "Your reporter was so inattentive and unprofessional that he did not bother to check the figures and mixed up 35 and 45."}]}]}, {"word": "unmarried", "poses": [{"pos": "adjective", "senses": [{"sense": "not married", "level": "C1", "dict_examp": "She lives with her unmarried son.", "lear_examp": "It has even been proved by research carried out by a sociologist that the woman of today prefers to stay unmarried to keep her own identity."}]}]}, {"word": "unknown", "poses": [{"pos": "adjective", "senses": [{"sense": "not known or familiar", "level": "B1", "dict_examp": "The exact number of people carrying the virus is unknown.", "lear_examp": "We listened to demo-tapes from unknown bands in our surrounding area."}]}]}, {"word": "unlimited", "poses": [{"pos": "adjective", "senses": [{"sense": "without any limits", "level": "B2", "dict_examp": "a service that offers unlimited Internet access", "lear_examp": "Moreover, who has the freedom to buy whatever they need with an unlimited budget?"}]}]}, {"word": "unnecessarily", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not necessary", "level": "C1", "dict_examp": "Of course we don't want to alarm people unnecessarily, but they should be alerted to                         potential dangers.", "lear_examp": "The community should understand the reality of the effects of using private cars unnecessarily."}]}]}, {"word": "unless", "poses": [{"pos": "conjunction", "senses": [{"sense": "except if", "level": "B1", "dict_examp": "I won't call you unless there are any problems.", "lear_examp": "I never go shopping unless it's necessary."}]}]}, {"word": "unrelated", "poses": [{"pos": "adjective", "senses": [{"sense": "having no connection", "level": "C1", "dict_examp": "Police said his death was unrelated to the attack.", "lear_examp": "On top of that, and completely unrelated to these strikes, the medical services in the community broke down when the doctors and nurses went on a strike on their own."}]}]}, {"word": "unsure", "poses": [{"pos": "adjective", "senses": [{"sense": "not certain or having doubts", "level": "B2", "dict_examp": "I'm a little unsure about what to do.", "lear_examp": "As I have not been there before, I am rather unsure of what to wear."}, {"sense": "without confidence", "level": "C2", "dict_examp": "He has been unsure of himself ever since he failed to get that job.", "lear_examp": "On the other hand, Kingshaw, normally weaker than Cooper, very sensitive, unsure of himself, has his ups, too, and comes, though very seldom, to feel determined and superior; when he climbs the rocks he is definitely head and shoulders above Cooper who hasn't a head for heights."}]}]}, {"word": "unload", "poses": [{"pos": "verb", "senses": [{"sense": "If a ship, aircraft, etc. unloads, goods are taken off it.", "level": "C1", "dict_examp": "The ship unloaded in Marseilles.", "lear_examp": "Old fishing boats from everywhere unload their merchandise there."}, {"sense": "to remove things from a vehicle", "level": "C2", "dict_examp": "Can you help me unload the car?", "lear_examp": "We began to unload the car and showed the children around the house."}]}]}, {"word": "unqualified", "poses": [{"pos": "adjective", "senses": [{"sense": "without the qualifications or knowledge to do something", "level": "C1", "dict_examp": "She was totally unqualified to manage the business.", "lear_examp": "Polish schools lag behind the European ones. Moreover, the teachers are sometimes unqualified or unprepared."}]}]}, {"word": "unlucky", "poses": [{"pos": "adjective", "senses": [{"sense": "having or causing bad luck", "level": "B1", "dict_examp": "They played well and were unlucky to lose.", "lear_examp": "I'm going to tell you a story of an unlucky man."}]}]}, {"word": "upload", "poses": [{"pos": "verb", "senses": [{"sense": "to send a computer program or a document electronically from your computer, using the Internet", "level": "B1", "dict_examp": "All the files have been uploaded to the server.", "lear_examp": "You should upload it to the website."}]}]}, {"word": "upcoming", "poses": [{"pos": "adjective", "senses": [{"sense": "An upcoming event will happen soon.", "level": "C1", "dict_examp": "the upcoming elections", "lear_examp": "This is a good way to keep our members informed about upcoming events."}]}]}, {"word": "unusual", "poses": [{"pos": "adjective", "senses": [{"sense": "different and not ordinary, often in a way that is interesting or exciting", "level": "A2", "dict_examp": "an unusual situation/circumstance/occurrence", "lear_examp": "It is about a dragon who is very kind and unusual!"}]}]}, {"word": "unwillingness", "poses": [{"pos": "noun", "senses": [{"sense": "a state of not being willing to do something", "level": "C1", "dict_examp": "Both sides have shown unwillingness to negotiate.", "lear_examp": "In the 70s some women also began to wear short skirts, which might be seen as a way to express their unwillingness to obey certain dress codes or as a symbol of their independence."}]}]}, {"word": "upon", "poses": [{"pos": "preposition", "senses": [{"sense": "used at the beginning of a story to mean a long time ago", "level": "B1", "dict_examp": "Once upon a time there was a beautiful princess.", "lear_examp": "Once upon a time there was a very poor family."}, {"sense": "on", "level": "B2", "dict_examp": "Upon her head she wore a black velvet hat.", "lear_examp": "He answered with a smile upon his face, 'As I just told everybody else, you will have the results by the end of June.'"}]}]}, {"word": "uphold", "poses": [{"pos": "verb", "senses": [{"sense": "to agree with a decision, especially a legal one, and say it was correct", "level": "C2", "dict_examp": "The court upheld the ruling.", "lear_examp": "Last but not least, governments around the world should pass and uphold stricter laws concerning environmental issues."}, {"sense": "to support a decision, principle, or law", "level": "C2", "dict_examp": "Police officers are expected to uphold the law.", "lear_examp": "Additionally, some uphold the view that people living in the countryside face greater problems than those in towns."}]}]}, {"word": "upgrade", "poses": [{"pos": "verb", "senses": [{"sense": "to improve something so that it is of a higher quality or is a newer model", "level": "B2", "dict_examp": "to upgrade a computer", "lear_examp": "The computer has upgraded most existing inventions, and made them more efficient, faster and more user friendly."}]}, {"pos": "noun", "senses": [{"sense": "a piece of software or equipment that improves the quality, power or usefulness of a computer or machine", "level": "B2", "dict_examp": "a hardware upgrade", "lear_examp": ""}]}]}, {"word": "upkeep", "poses": [{"pos": "noun", "senses": [{"sense": "the process or cost of keeping something in good condition, or of keeping a person or animal healthy", "level": "C2", "dict_examp": "The upkeep of a building like that must be very high.", "lear_examp": "In point of fact, after our early morning meeting at the community center we decided to resort, if nothing else helps, to raising money for the upkeep of the hospital at the expense of our pension."}]}]}, {"word": "unwilling", "poses": [{"pos": "adjective", "senses": [{"sense": "not wanting to do something", "level": "B2", "dict_examp": "A lot of people are unwilling to accept change.", "lear_examp": "I was unwilling to face the truth and the reality that my best friend had already left me."}]}]}, {"word": "unwise", "poses": [{"pos": "adjective", "senses": [{"sense": "stupid and likely to cause problems", "level": "C2", "dict_examp": "an unwise decision", "lear_examp": "But we don't want to put too much pressure on them because this is unwise and the worst thing parents could do to their children."}]}]}, {"word": "uphill", "poses": [{"pos": "adjective", "senses": [{"sense": "something that is difficult to do and needs a lot of effort", "level": "C2", "dict_examp": "I can lose weight but it's a real uphill struggle.", "lear_examp": "When this is the case, the families caring for them are faced with an uphill struggle, as it is difficult to reconcile the need for earning a living with the care of their relatives."}]}, {"pos": "adverb", "senses": [{"sense": "toward the top of a hill", "level": "C2", "dict_examp": "We'd walked half a mile uphill.", "lear_examp": "It begins at the bottom where East Finchley station is, and stretches a bit of uphill, north and past the East Finchley library."}]}]}, {"word": "upbringing", "poses": [{"pos": "noun", "senses": [{"sense": "the way that your parents take care of you and the things that they teach you when you are growing up", "level": "B2", "dict_examp": "a strict religious/Catholic/Jewish upbringing", "lear_examp": "Now, as a grown-up person, I am trying to evaluate my upbringing objectively."}]}]}, {"word": "upper", "poses": [{"pos": "adjective", "senses": [{"sense": "at a higher position or level than something else", "level": "B1", "dict_examp": "the upper lip/body", "lear_examp": "I am doing the upper intermediate level and last summer I was in London for three months."}, {"sense": "to be in a stronger position than someone else so that you control a situation", "level": "C2", "dict_examp": "Government troops are gradually gaining the upper hand over the rebels.", "lear_examp": "Humans vs. machines - who has the upper hand?"}]}]}, {"word": "the upper class", "poses": [{"pos": "noun", "senses": [{"sense": "the social group consisting of the people of the highest social class, who are usually rich", "level": "C1", "dict_examp": "The upper class usually send their children to expensive private schools.", "lear_examp": "I've just chosen to travel south and back in time to be a Roman lady, belonging to the upper class of course, living an easy life full of pleasure."}]}]}, {"word": "unusually", "poses": [{"pos": "adverb", "senses": [{"sense": "bigger, stronger, better, etc., than is normal", "level": "B2", "dict_examp": "unusually warm weather", "lear_examp": "On your free afternoon I suggest you visit our local museum, which is unusually large for such a small town."}, {"sense": "in different way than is usual or expected", "level": "C2", "dict_examp": "He seemed unusually quiet the last time we was him.", "lear_examp": "She struck them both as being unusually dressed, even taking in account that this way of dressing was the rule rather than the exception."}]}]}, {"word": "unwind", "poses": [{"pos": "verb", "senses": [{"sense": "to relax, especially after working", "level": "C1", "dict_examp": "Music helps me to unwind.", "lear_examp": "The houses will be semi-detached to allow neighbors to chat and unwind."}, {"sense": "If you unwind something, or if something unwinds, it stops being curled up or twisted around something else and is made straight.", "level": "C2", "dict_examp": "He unwound the bandage.", "lear_examp": "Slowly, the doctor unwound the bandages revealing the two cotton patches covering her eyes."}]}]}, {"word": "up", "poses": [{"pos": "adverb", "senses": [{"sense": "vertical or as straight as possible", "level": "A1", "dict_examp": "He stood up.", "lear_examp": "The whole class stood up and sang \"Imagine\"."}, {"sense": "toward or in a higher place or position", "level": "A2", "dict_examp": "She looked up and smiled at me.", "lear_examp": "As the concert finished, I heard someone call my name. I looked up and I saw my friend on the other side of the concert hall."}, {"sense": "to walk directly toward someone or something until you are next to them", "level": "B1", "dict_examp": "He came straight up to me and introduced himself.", "lear_examp": "She came up to him to help him with the luggage."}, {"sense": "not in bed", "level": "B1", "dict_examp": "I stayed up all night finishing this report.", "lear_examp": "That night we were up until late talking and after a couple of days she left."}, {"sense": "If an action or decision is up to someone, they are responsible for doing or making it.", "level": "B1", "dict_examp": "I can't decide for you, Jack, it's up to you.", "lear_examp": "This is my opinion but it's up to you."}, {"sense": "to be doing or planning something", "level": "B1", "dict_examp": "What have you been up to?", "lear_examp": "What have you been up to?"}, {"sense": "to a greater degree, amount, volume, etc.", "level": "B2", "dict_examp": "Please speak up. I can't hear you.", "lear_examp": "Moreover the microphone suddenly wouldn't work anymore, and even though I desperately tried to speak up, people began to lose interest in both my speech and me and simply started to talk to each other instead."}, {"sense": "used to emphasize that an action or process is complete", "level": "B2", "dict_examp": "Come on, Maria, drink up your lemonade.", "lear_examp": "Anna, I broke one of your beautiful vases accidentally when I was trying to clean up the house one evening."}, {"sense": "rising and falling", "level": "B2", "dict_examp": "They were jumping up and down with impatience.", "lear_examp": "Well, you should be bouncing up and down with joy (just kidding)!"}]}, {"pos": "preposition", "senses": [{"sense": "to or in a higher place or position", "level": "A2", "dict_examp": "He ran up the steps.", "lear_examp": "We rode up the mountain on our bikes."}, {"sense": "along or further along the street/road, etc.", "level": "A2", "dict_examp": "They live just up the street.", "lear_examp": "Go up the street and turn left on the square."}, {"sense": "any amount or number under 10, 20, etc.", "level": "B1", "dict_examp": "We can invite up to 65 people.", "lear_examp": "A wedding can cost up to 10,000 SFr."}, {"sense": "until a particular time", "level": "B1", "dict_examp": "You can call me up until midnight.", "lear_examp": "The party  will be in my house up to 1:00 a.m., then we will go to Jean's house."}, {"sense": "from one end to the other and back again", "level": "B2", "dict_examp": "They were running up and down the hallway.", "lear_examp": "Only fifteen years ago, anyone who was seen walking alone down the street talking to himself was thought to be irrevocably mad, whereas nowadays we all stride up and down streets and corridors apparently muttering to the air."}, {"sense": "having all the most recent information about a subject or activity", "level": "C1", "dict_examp": "The course should bring you up to speed with the latest techniques.", "lear_examp": "Apart from this you can keep yourself up to speed with what's happening around the world on various fronts."}]}]}, {"word": "untouched", "poses": [{"pos": "adjective", "senses": [{"sense": "not changed or damaged in any way", "level": "C1", "dict_examp": "Most of the island remains untouched by tourism.", "lear_examp": "The starting point is in Lokken, an idyllic fishing village beside the North Sea, still untouched by tourism."}]}]}, {"word": "unwillingly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that shows that you do not want to do something", "level": "C1", "dict_examp": "He unwillingly agreed to take her home.", "lear_examp": "There is a clash between two different cultures and mentalities. Unwillingly though, they accept them, probably due to the fact they are satisfied with their son becoming a real adult."}]}]}, {"word": "untrue", "poses": [{"pos": "adjective", "senses": [{"sense": "false", "level": "C1", "dict_examp": "We knew the rumors were untrue.", "lear_examp": "They realized that almost everything mentioned in your advertisement appeared to be untrue."}]}]}, {"word": "update", "poses": [{"pos": "verb", "senses": [{"sense": "to add new information", "level": "B1", "dict_examp": "The website has just been updated.", "lear_examp": "Besides, I can also always update my knowledge by visiting the information and new technology websites on the Internet from time to time."}, {"sense": "to make something more modern", "level": "B2", "dict_examp": "They need to update their image.", "lear_examp": "On the other hand, the movies shown are updated regularly, I guess that part is under control."}]}, {"pos": "noun", "senses": [{"sense": "new information", "level": "B2", "dict_examp": "I'll need regular updates on your progress.", "lear_examp": "Television offers different programs, such as documentaries, programs on culture and updates on the news."}, {"sense": "a new form of something that existed at an earlier time", "level": "B2", "dict_examp": "a software update", "lear_examp": ""}]}]}, {"word": "until", "poses": [{"pos": "preposition", "senses": [{"sense": "continuing to happen before a particular time or event and then stopping", "level": "A1", "dict_examp": "I'm staying here until the end of June.", "lear_examp": "We have lessons from 1:30 pm until 3:15 pm."}, {"sense": "not before a particular time or event", "level": "B1", "dict_examp": "We didn't get home until past midnight.", "lear_examp": "Two weeks ago I received your letter but I couldn't answer you until now."}]}, {"pos": "conjunction", "senses": [{"sense": "continuing to happen before a particular time or event and then stopping", "level": "B1", "dict_examp": "We're going to stay until the job is done.", "lear_examp": "I had always wanted to travel by plane to another country but I didn't have the opportunity until I was eleven years old."}, {"sense": "as far as", "level": "B1", "dict_examp": "Go straight until you get to the four-way stop, then turn left.", "lear_examp": "On the second day, we cycled for approximately 4 hours until we reached a beautiful castle."}, {"sense": "not before a particular time or event", "level": "B1", "dict_examp": "We won't start the meeting until Jeanne is here.", "lear_examp": "We didn't stop laughing until the movie finished."}]}]}, {"word": "unwanted", "poses": [{"pos": "adjective", "senses": [{"sense": "not wanted", "level": "C1", "dict_examp": "an unwanted gift", "lear_examp": "Children feel alone, unwanted and become very often latch-key children who come back to a sad home where nobody is waiting for them."}]}]}, {"word": "unwell", "poses": [{"pos": "adjective", "senses": [{"sense": "ill", "level": "B1", "dict_examp": "to feel/look unwell", "lear_examp": "I won't be able to go to your English class tomorrow morning because my sister is unwell and I will have to stay with her."}]}]}, {"word": "us", "poses": [{"pos": "pronoun", "senses": [{"sense": "used after a verb or preposition to refer to the person who is speaking or writing and one or more other people", "level": "A1", "dict_examp": "She gave us all a present.", "lear_examp": "Our teacher talks to us and gives us some questions."}]}]}, {"word": "used", "poses": [{"pos": "adjective", "senses": [{"sense": "not new and owned by someone else  before you", "level": "B1", "dict_examp": "We're looking for a good used car.", "lear_examp": "I have not much money to spend and I buy always used cds."}]}]}, {"word": "upstairs", "poses": [{"pos": "adverb", "senses": [{"sense": "on or to a higher level of a building", "level": "A2", "dict_examp": "He ran upstairs to answer the phone.", "lear_examp": "If I forget something, I don't have to go upstairs."}]}, {"pos": "adjective", "senses": [{"sense": "on or at a higher level of a building", "level": "B1", "dict_examp": "an upstairs window", "lear_examp": "Suddenly, Robert and I heard a strange noise coming from an upstairs room but we kept on reading quietly."}]}]}, {"word": "usefulness", "poses": [{"pos": "noun", "senses": [{"sense": "the quality of being useful", "level": "C1", "dict_examp": "He explained the usefulness of having a Wi-Fi connection.", "lear_examp": "They came back yesterday and I have interviewed them to find out what they think about the usefulness of the program."}]}]}, {"word": "utmost", "poses": [{"pos": "adjective", "senses": [{"sense": "used to emphasize how important or serious something is", "level": "C1", "dict_examp": "a matter of the utmost importance", "lear_examp": "In my opinion, there are features of utmost importance that should be carefully checked."}]}, {"pos": "noun", "senses": [{"sense": "to try as hard as you can to do something", "level": "C1", "dict_examp": "We did our utmost to finish the project on time.", "lear_examp": "In addition, we live in a materialistic society where we all do our utmost in order to make ends meet, but we are never satisfied."}]}]}, {"word": "useful", "poses": [{"pos": "adjective", "senses": [{"sense": "helping you to do or achieve something", "level": "A2", "dict_examp": "useful information/advice", "lear_examp": "It has a camera and it is very useful."}]}]}, {"word": "upwards", "poses": [{"pos": "adverb", "senses": [{"sense": "more than a particular amount", "level": "C2", "dict_examp": "Rooms in this hotel cost upwards of $250 a night.", "lear_examp": "Once home to upwards of 50,000 people, Gaza was occupied by anti-government forces for over two years."}]}]}, {"word": "useless", "poses": [{"pos": "adjective", "senses": [{"sense": "If something is useless, it does not work well or it has no effect.", "level": "B1", "dict_examp": "This umbrella's useless - there's a big hole in it.", "lear_examp": "I started digging, but it was useless."}, {"sense": "having no skill in an activity", "level": "C2", "dict_examp": "She wanted help with the math but I'm just useless!", "lear_examp": "Every time I see her, she seems to be busy sewing, knitting, etc. In this I really envy her, I'm quite useless at making clothes, although I can certainly do adjustments on my clothes, make curtains and such things."}]}]}, {"word": "upside down", "poses": [{"pos": "adverb", "senses": [{"sense": "having the part that is usually at the top turned to be at the bottom", "level": "B2", "dict_examp": "Turn the jar upside down and shake it.", "lear_examp": "The furniture was upside down and neither money nor cash were left."}]}]}, {"word": "upward", "poses": [{"pos": "adjective", "senses": [{"sense": "moving toward a higher place or level", "level": "C1", "dict_examp": "an upward glance", "lear_examp": "The oldest group registers a steady upward movement in terms of attendance. (1802604; International English Language Testing System; Philippines; C1 EFFECTIVE OPERATIONAL PROFICIENCY; 2005; Tagalog; 7"}]}, {"pos": "adverb", "senses": [{"sense": "toward a higher position, level, or value", "level": "C1", "dict_examp": "The cost of completion has been revised upward again due to inflation.", "lear_examp": "The pattern begins to go upward from 2002 to present with only 35-49 groups and 50+ groups."}]}]}, {"word": "urban", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging or relating to a town or city", "level": "B2", "dict_examp": "urban areas", "lear_examp": "We are generally more interested in an urban lifestyle than living in the countryside."}]}]}, {"word": "upper-class", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging to or relating to the upper class", "level": "C1", "dict_examp": "The novel criticizes the upper-class way of life.", "lear_examp": "Talking about fashion, one always tends to think of glamorous designer dresses, catwalks in Paris, Rome or New York, and upper-class societies, able to spend huge amounts of money on luxurious clothing."}]}]}, {"word": "urge", "poses": [{"pos": "verb", "senses": [{"sense": "to try to persuade someone to do something", "level": "C1", "dict_examp": "His parents urged him to go to college.", "lear_examp": "I would also urge you to do something to improve the quality and variety of the food so that it would satisfy vegetarians as well."}, {"sense": "to strongly advise an action", "level": "C2", "dict_examp": "Financial experts are urging caution.", "lear_examp": ""}, {"sense": "to encourage someone to do or achieve something", "level": "C2", "dict_examp": "The crowd was cheering and urging her on.", "lear_examp": "Somewhat reluctantly we made to sit down when, full of enthusiasm, he urged us on to follow him further up the mountain."}]}, {"pos": "noun", "senses": [{"sense": "a strong wish or need", "level": "C2", "dict_examp": "I resisted the  urge to slap him.", "lear_examp": "He suddenly felt the urge to go home."}]}]}, {"word": "utter", "poses": [{"pos": "adjective", "senses": [{"sense": "used to emphasize something", "level": "C2", "dict_examp": "She dismissed the article as utter nonsense.", "lear_examp": "To act otherwise would be, in my opinion, utter nonsense."}]}, {"pos": "verb", "senses": [{"sense": "to say something", "level": "C2", "dict_examp": "She left without uttering a word.", "lear_examp": "After I had told him about it, he was in such despair that he was not able to utter a single word."}]}]}, {"word": "usage", "poses": [{"pos": "noun", "senses": [{"sense": "the way that words are used", "level": "C1", "dict_examp": "a guide to English grammar and usage", "lear_examp": "That is why I couldn't solve all my problems with English usage."}, {"sense": "the amount of something that is used, or the way that something is used", "level": "C1", "dict_examp": "restrictions on water usage", "lear_examp": "We have therefore decided that, at our company, we will try to keep our energy usage as low as possible."}]}]}, {"word": "upright", "poses": [{"pos": "adjective", "senses": [{"sense": "straight up or vertical", "level": "B2", "dict_examp": "Please return your seats to an upright position and fasten your seat belts.", "lear_examp": "Immediately the pilot informed the passengers that the weather conditions were not good and told us to fasten our seatbelt, put the seat upright and adopt the emergency position."}]}]}, {"word": "up-to-date", "poses": [{"pos": "adjective", "senses": [{"sense": "modern, recent, or containing the latest information", "level": "B1", "dict_examp": "Visit our website for up-to-date information on movie times.", "lear_examp": "I will write more later - I do need to give you up-to-date information on my love life!"}]}]}, {"word": "usual", "poses": [{"pos": "adjective", "senses": [{"sense": "in the way that happens most of the time", "level": "A2", "dict_examp": "As usual, James was the last to arrive.", "lear_examp": "As usual, I'll travel by plane."}, {"sense": "normal and happening most often", "level": "B1", "dict_examp": "I went to bed at my usual time.", "lear_examp": "We are going to meet at 5 pm at the station and then go for a pizza - you know where, the usual place \"Pizza Express\"."}]}]}, {"word": "urgent", "poses": [{"pos": "adjective", "senses": [{"sense": "very important and needing you to take action immediately", "level": "B1", "dict_examp": "an urgent message", "lear_examp": "He said that my school principal would like to see me that day and it was urgent."}]}]}, {"word": "use", "poses": [{"pos": "verb", "senses": [{"sense": "If you use something, you do something with it for a particular purpose.", "level": "A1", "dict_examp": "Can I use your pen, please?", "lear_examp": "She uses the Internet every day."}, {"sense": "to take an  amount from a supply of something", "level": "B1", "dict_examp": "Taking a shower uses less water than taking a bath.", "lear_examp": "The equipment in the kitchen is very old and uses a lot of electricity and gas."}, {"sense": "to say or write a particular word or phrase", "level": "B2", "dict_examp": "\"Autumn\" is used in British English, but \"fall\" is the usual word in American English.", "lear_examp": ""}, {"sense": "to treat someone badly in order to get what you want", "level": "C2", "dict_examp": "He was just using me to so he could meet the director.", "lear_examp": "What a horrible thing to do, just using people - especially him!"}, {"sense": "to finish a supply of something", "level": "B2", "dict_examp": "Don't use up all the milk - we need some for breakfast.", "lear_examp": "It saves time which would be used up by doing housework such as laundry, cleaning  and ironing."}]}, {"pos": "noun", "senses": [{"sense": "when you use something, or when something is being used", "level": "A2", "dict_examp": "an increase in the use of mobile phones", "lear_examp": "There's a very good book. It's called \"English grammar in use\"."}, {"sense": "a purpose for which something is used", "level": "B1", "dict_examp": "A food processor has a variety of uses in the kitchen.", "lear_examp": "We  need computers in many places, and for many uses today."}, {"sense": "one of the meanings of a word, or the way that a particular word is used", "level": "B1", "dict_examp": "Can you list all the uses of the word \"point\"?", "lear_examp": ""}, {"sense": "to be useful", "level": "B2", "dict_examp": "Is this bag of any use to you?", "lear_examp": "I hope my remarks will be of some use."}, {"sense": "to not be useful", "level": "B2", "dict_examp": "His advice turned out to be no use at all.", "lear_examp": "My mother came immediately, but it was no use because my brother isn't afraid of her, so she called my father."}, {"sense": "used to say that trying to do something has no effect", "level": "B2", "dict_examp": "It was no use talking to him - he just wouldn't listen.", "lear_examp": "It was no use trying to smoke cigarettes in this pub."}, {"sense": "to use something that is available", "level": "B2", "dict_examp": "We were encouraged to make use of all the facilities.", "lear_examp": "Finally, I think the designers will make use of the raw materials and create an innovative look for all of us."}, {"sense": "permission to use something, or the ability to use something", "level": "C2", "dict_examp": "Martin has offered me the use of his car.", "lear_examp": "One of my closest friends who lost the use of her legs five years ago in a tragic car accident took part in this trip."}]}]}, {"word": "upset", "poses": [{"pos": "adjective", "senses": [{"sense": "unhappy or worried because something unpleasant has happened", "level": "A2", "dict_examp": "They'd had an argument and she was still upset about it.", "lear_examp": "I was upset that you didn't come to my birthday party."}, {"sense": "an illness in the stomach", "level": "B2", "dict_examp": "I had an upset stomach last night.", "lear_examp": "I wasn't feeling well at all with an upset stomach and headache."}]}, {"pos": "verb", "senses": [{"sense": "to make someone feel unhappy or worried", "level": "B2", "dict_examp": "The phone call had clearly upset her.", "lear_examp": "This really upset me as no notice was given before the show."}]}]}, {"word": "used", "poses": [{"pos": "adjective", "senses": [{"sense": "to be familiar with something or someone", "level": "B1", "dict_examp": "We're used to tourists here - we get thousands every year.", "lear_examp": "When I'm working, I'm used to wearing something more conservative."}, {"sense": "to become familiar with something or someone", "level": "B1", "dict_examp": "You'll get used to Ted eventually.", "lear_examp": "In addition, I've got used to looking after them."}]}]}, {"word": "usually", "poses": [{"pos": "adverb", "senses": [{"sense": "in the way that most often happens", "level": "A2", "dict_examp": "He usually gets home about 6 o'clock.", "lear_examp": "Hungarian people usually eat breakfast at 6 or 7 o'clock."}]}]}, {"word": "urgently", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is urgent", "level": "B1", "dict_examp": "Help is urgently needed.", "lear_examp": "I have e-mailed you to tell you that I need your bicycle urgently."}]}]}, {"word": "used to", "poses": [{"pos": "modal verb", "senses": [{"sense": "If something used to happen or a situation used to exist, it happened regularly or in the past but it does not happen or exist now.", "level": "B1", "dict_examp": "She used to live in Detroit.", "lear_examp": "It's an American film about a girl that used to live in Africa."}]}]}, {"word": "user", "poses": [{"pos": "noun", "senses": [{"sense": "someone who uses a product, machine or service", "level": "B1", "dict_examp": "drug users", "lear_examp": "I would like to meet other experienced computer users in order to share programs as well as tips and tricks about programming."}]}]}, {"word": "utter", "poses": [{"pos": "adjective", "senses": [{"sense": "used to emphasize something", "level": "C2", "dict_examp": "She dismissed the article as utter nonsense.", "lear_examp": "To act otherwise would be, in my opinion, utter nonsense."}]}, {"pos": "verb", "senses": [{"sense": "to say something", "level": "C2", "dict_examp": "She left without uttering a word.", "lear_examp": "After I had told him about it, he was in such despair that he was not able to utter a single word."}]}]}, {"word": "utterly", "poses": [{"pos": "adverb", "senses": [{"sense": "completely", "level": "C1", "dict_examp": "It's utterly ridiculous.", "lear_examp": "The information provided in your report about the final goal was utterly wrong."}]}]}]