[{"word": "vandalism", "poses": [{"pos": "noun", "senses": [{"sense": "intentional damage to public or private property", "level": "C2", "dict_examp": "The mayor promised to crack down on vandalism.", "lear_examp": "Vandalism, for example, is very common, and who are the pretty criminals who do this? Teenagers.  This is clearly caused by boredom. Yes, vandalism stems from the lack of any other suitable activities."}]}]}, {"word": "vaccination", "poses": [{"pos": "noun", "senses": [{"sense": "an injection of a substance that protects you against a disease", "level": "C2", "dict_examp": "All the children are given a meningitis vaccination.", "lear_examp": "Thanks to vaccination, more and better medicines, and many more doctors, especially in the developing countries; people can now reach up to seventy years of life."}]}]}, {"word": "valley", "poses": [{"pos": "noun", "senses": [{"sense": "an area of low land between hills or mountains, often with a river running through it", "level": "B1", "dict_examp": "the Nile Valley", "lear_examp": "My home town is situated in a valley."}]}]}, {"word": "vegetable", "poses": [{"pos": "noun", "senses": [{"sense": "a plant that you eat, for example potatoes, onions, beans, etc.", "level": "A1", "dict_examp": "fresh/frozen vegetables", "lear_examp": "I like eating fish, vegetables, fruit and salad."}]}]}, {"word": "vaguely", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that is not clear or certain", "level": "C2", "dict_examp": "I vaguely remember meeting him at Lionel's house.", "lear_examp": "I can vaguely remember the decor, and if I tried harder maybe I could remember the taste of the ice-cream."}]}]}, {"word": "vacancy", "poses": [{"pos": "noun", "senses": [{"sense": "a job that is available for someone to do", "level": "C1", "dict_examp": "Tell me if you hear of any vacancies for secretaries.", "lear_examp": "We look forward to meeting you at your earliest convenience to discuss details, go over our salary and health package as well as any other questions you might have, before starting the procedure of finding suitable candidates for the job vacancies."}, {"sense": "a room that is available  in a hotel", "level": "C1", "dict_examp": "Do you have any vacancies?", "lear_examp": "The hotels have no vacancies, the tourists are everywhere."}]}]}, {"word": "vary", "poses": [{"pos": "verb", "senses": [{"sense": "If things of the same type vary, they are different from each other.", "level": "B2", "dict_examp": "Car prices vary greatly/widely from one state to another.", "lear_examp": "The price of the dishes varies."}, {"sense": "to change or to cause something to change", "level": "B2", "dict_examp": "Temperatures vary depending on/according to the time of year.", "lear_examp": "To vary the pictures of cultural events, I would recommend visiting the Wednesday market, which starts at 8 am."}]}]}, {"word": "various", "poses": [{"pos": "adjective", "senses": [{"sense": "many different", "level": "A2", "dict_examp": "I left London for various reasons.", "lear_examp": "We played various games and danced too."}]}]}, {"word": "vegetarian", "poses": [{"pos": "noun", "senses": [{"sense": "someone who does not eat meat or fish", "level": "B1", "dict_examp": "We feel a lot better since we became vegetarians.", "lear_examp": "I've heard that even the non-vegetarian food is good there, but I'm a vegetarian."}]}, {"pos": "adjective", "senses": [{"sense": "not eating, containing, or using meat or fish", "level": "B1", "dict_examp": "All her children are vegetarian.", "lear_examp": "Do you like vegetarian food?"}]}]}, {"word": "van", "poses": [{"pos": "noun", "senses": [{"sense": "a vehicle that is used for carrying things but that is smaller than a truck", "level": "B1", "dict_examp": "a delivery van", "lear_examp": "I looked in my mirror and saw a white van."}]}]}, {"word": "vanity", "poses": [{"pos": "noun", "senses": [{"sense": "when someone thinks they are very attractive and is too interested in their own appearance", "level": "C2", "dict_examp": "Her vanity is staggering.", "lear_examp": "The vanity of wearing the most fashionable clothes bores my other friend, Kate, to death."}]}]}, {"word": "vacation", "poses": [{"pos": "noun", "senses": [{"sense": "a period of time to relax or travel for pleasure instead of doing your usual work or school activities", "level": "A1", "dict_examp": "We're taking a vacation in June.", "lear_examp": "I am on vacation, so I don't have to work."}]}]}, {"word": "vain", "poses": [{"pos": "adjective", "senses": [{"sense": "without any success", "level": "C1", "dict_examp": "I tried in vain to start a conversation.", "lear_examp": "We looked in vain for the guide through three London parks."}, {"sense": "A vain attempt/effort, etc., does not result in what you want.", "level": "C2", "dict_examp": "I made a vain attempt to engage him in conversation.", "lear_examp": "Many flew to cities in the vain hope of earning money, thus increasing the number of the homeless ."}, {"sense": "too interested in your own appearance and thinking you are very attractive", "level": "C2", "dict_examp": "He's terribly vain.", "lear_examp": "Men are vain creatures who worry, maybe excessively, about beauty and keeping up with standards of beauty set by society."}]}]}, {"word": "valuable", "poses": [{"pos": "adjective", "senses": [{"sense": "Valuable objects are worth a lot of money.", "level": "B1", "dict_examp": "valuable paintings", "lear_examp": "So as you can imagine, not only is the ring valuable but it also means a lot to me since it makes me remember Brazil!"}, {"sense": "Valuable information, advice, etc. is very helpful or important.", "level": "B2", "dict_examp": "He was able to provide the police with some valuable information.", "lear_examp": "This trip will  allow me to gain valuable knowledge and experience."}]}]}, {"word": "vast", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely big", "level": "B2", "dict_examp": "a vast amount/sum of money", "lear_examp": "Among the vast choice of interesting buildings to photograph I can name the \"National Portrait Museum\", a huge building in renaissance style, and the old \"Castle of Sforza\", built in the eleventh century."}]}]}, {"word": "varied", "poses": [{"pos": "adjective", "senses": [{"sense": "consisting of many different things or types", "level": "B2", "dict_examp": "a varied diet", "lear_examp": "Remember you should always eat a varied diet."}]}]}, {"word": "vegetation", "poses": [{"pos": "noun", "senses": [{"sense": "the plants and trees that grow in a particular area", "level": "C1", "dict_examp": "They hacked a path through the dense vegetation.", "lear_examp": "I dream of being the first one to set foot on a white sandy beach, to admire a new kind of vegetation: cranberry bushes, sweet potatoes, wild turkeys, a different climate; how scary and exciting at the same time!"}]}]}, {"word": "variable", "poses": [{"pos": "adjective", "senses": [{"sense": "changing often", "level": "C1", "dict_examp": "The sound quality on the recording is variable.", "lear_examp": "By contrast the figure is more variable regarding the other topics."}]}, {"pos": "noun", "senses": [{"sense": "a number, amount, or situation which can change", "level": "C1", "dict_examp": "A patient's recovery time depends on so many variables, such as age, weight, and general health.", "lear_examp": "There are too many variables and happiness may also depend on the social background of a person."}]}]}, {"word": "vague", "poses": [{"pos": "adjective", "senses": [{"sense": "not clear or certain", "level": "C1", "dict_examp": "I have a vague idea of where the hotel is.", "lear_examp": "Do not misunderstand me: I greatly enjoyed the conference but it did not give me the satisfaction of having even a vague idea of what I would like to do..."}, {"sense": "showing that someone is not thinking clearly or does not understand", "level": "C2", "dict_examp": "a vague expression", "lear_examp": "If someone had asked him why, this person would have given a vague look, a dismissive shrug of two shoulders and a \"oh, just because\"."}]}]}, {"word": "variety", "poses": [{"pos": "noun", "senses": [{"sense": "many different types of things or people", "level": "A2", "dict_examp": "Ben has done a variety of jobs.", "lear_examp": "Hi Nick, I'd like a variety of music at the party."}, {"sense": "the quality of often changing or of being made of many different things", "level": "B1", "dict_examp": "Factory work often lacks variety.", "lear_examp": "You know, I like variety a lot and don't like my friends to see me with the same clothes."}]}]}, {"word": "vaccinate", "poses": [{"pos": "verb", "senses": [{"sense": "to give someone a special substance to prevent a disease", "level": "C2", "dict_examp": "Have you been vaccinated against polio?", "lear_examp": "Today, ... small kids are vaccinated against most lethal viruses, ... and old people are even vaccinated against the flu."}]}]}, {"word": "variation", "poses": [{"pos": "noun", "senses": [{"sense": "a difference in amount or quality", "level": "B2", "dict_examp": "variations in price/temperature", "lear_examp": "Apart from this, there is very little variation in temperature between day and night."}, {"sense": "something that is slightly different from the usual form", "level": "C2", "dict_examp": "It's a variation on the standard apple pie.", "lear_examp": "Big Brother's counterpart, \"Lost Story\", did really well the first time and a bit less the second time. Still, it is very popular and a variation on this theme, called \"Nine people\", still does very well today."}]}]}, {"word": "vase", "poses": [{"pos": "noun", "senses": [{"sense": "a container that you put flowers in", "level": "B1", "dict_examp": "a glass vase", "lear_examp": "Beside the bed there is a large vase with flowers."}]}]}, {"word": "vacant", "poses": [{"pos": "adjective", "senses": [{"sense": "Somewhere that is vacant is available because it is not being used.", "level": "B2", "dict_examp": "a vacant building", "lear_examp": "You see, we have plenty of vacant rooms so you would not cause any trouble."}, {"sense": "A vacant job is available for someone to do.", "level": "B2", "dict_examp": "The assistant marketing job is vacant - why don't you apply?", "lear_examp": "Therefore, I believe I am suitable for your vacant position."}]}]}, {"word": "vanish", "poses": [{"pos": "verb", "senses": [{"sense": "to disappear suddenly", "level": "B2", "dict_examp": "The sun vanished behind the clouds.", "lear_examp": "I went after the thief but he vanished into the crowd."}, {"sense": "to suddenly disappear in a mysterious way", "level": "C2", "dict_examp": "He was walking ahead of me on the path and then he just vanished into thin air.", "lear_examp": "The fact is that vacations are not problem-solving, and whatever one wants to leave behind does not vanish into thin air, it just lurks in the corner of your mind until the return date."}]}]}, {"word": "veil", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of material that a woman wears over her head or over her head and face", "level": "C1", "dict_examp": "The bride wore a veil of French lace.", "lear_examp": "Especially, a bride and a groom wear special hats and colorful make-up.  And most brides wear a long veil so grooms can't see their wife's face."}, {"sense": "something that \thides or prevents you from knowing something", "level": "C2", "dict_examp": "A veil of secrecy surrounded the appointment of the new college president.", "lear_examp": "Depending on the disposition of those elements within a person, one can turn out to be an angelic soul who radiates trust and happiness, a malevolent spirit hidden under a glamour of niceties; a golden entity, shrouded by a veil of coarseness and bluntness; or a purely evil fiend who exudes despair and malice."}]}]}, {"word": "valid", "poses": [{"pos": "adjective", "senses": [{"sense": "based on good reasons or facts that are true", "level": "B2", "dict_examp": "a valid excuse/reason", "lear_examp": "You could hardly think of Dr. Quimper as guilty, because every one of the Crackenthorpe family had a valid reason to kill."}, {"sense": "officially or legally acceptable", "level": "B2", "dict_examp": "The ticket is valid for three months.", "lear_examp": "Is this offer valid for the weekends, as well?"}]}]}, {"word": "value", "poses": [{"pos": "noun", "senses": [{"sense": "how much money something could be sold for", "level": "B1", "dict_examp": "The new road has affected the value of these houses.", "lear_examp": "\"Well, there was nothing of value in the suitcase,\" my mother remarked, but I was close to tears."}, {"sense": "If something is good value or is a good value, it is of good quality or you think the amount of money you spent on it was right.", "level": "B1", "dict_examp": "This car is a very good value for the money.", "lear_examp": "It's really good value for money, including all equipment, accommodation and food."}, {"sense": "how useful or important something is", "level": "B1", "dict_examp": "The documents are of great historical value.", "lear_examp": "I was really sad because these shoes had a lot of sentimental value for me, and they were made of genuine leather!"}, {"sense": "the beliefs people have about what is right and wrong and what is most important in life, which control their behavior", "level": "B2", "dict_examp": "family/moral/traditional values", "lear_examp": "A tragedy occurs which causes Andrew to rediscover his moral values."}, {"sense": "If you accept something at face value because of the way it first looks or seems, you do so without thinking carefully about it.", "level": "C1", "dict_examp": "You can't just accept everything you read in the newspapers at face value.", "lear_examp": "People are assessed at face value by the type of cars they drive."}]}, {"pos": "verb", "senses": [{"sense": "to consider something important", "level": "B2", "dict_examp": "I've always valued her advice.", "lear_examp": "I will learn how other people live and I will also learn to value the things I have."}, {"sense": "to judge how much money something could be sold for", "level": "C2", "dict_examp": "The ring was valued at $1000.", "lear_examp": "Paintings for example are valued by experts."}]}]}, {"word": "vaccine", "poses": [{"pos": "noun", "senses": [{"sense": "a substance that is given to people to stop them from getting a particular disease", "level": "C2", "dict_examp": "Doctors have run out of the flu vaccine.", "lear_examp": "An experiment was recently conducted by the same scientist group to verify if the vaccine works."}]}]}, {"word": "validity", "poses": [{"pos": "noun", "senses": [{"sense": "how true or reasonable something is", "level": "C2", "dict_examp": "We should question the validity of these statements.", "lear_examp": "This statement is so obvious we almost never question its validity."}]}]}, {"word": "vehicle", "poses": [{"pos": "noun", "senses": [{"sense": "something such as a car or bus that takes people from one place to another, especially using roads", "level": "B1", "dict_examp": "The driver lost control of the vehicle and hit a tree.", "lear_examp": "Sometimes I watch programs about cars and other vehicles."}]}]}, {"word": "vein", "poses": [{"pos": "noun", "senses": [{"sense": "one of the tubes in your body that carries blood to the heart", "level": "C1", "dict_examp": "the veins in the leg/neck", "lear_examp": "Do you love the sensation of your blood rushing in your veins, your knees trembling slightly and your hair standing at attention? Well, I do, and dangerous sports are the thing for me."}]}]}, {"word": "vice", "poses": [{"pos": "noun", "senses": [{"sense": "something bad that someone often does", "level": "C2", "dict_examp": "His virtues far outnumber his vices.", "lear_examp": "My children would always know that they are loved and accepted in spite of their vices and not only for their virtues but just because they are my children."}]}]}, {"word": "vest", "poses": [{"pos": "noun", "senses": [{"sense": "something you wear that is like a jacket with no sleeves", "level": "C2", "dict_examp": "My grandfather always wore his vest buttoned up.", "lear_examp": "And he has too show how much he earns: he only wears top brand watches, shirts and vests, with colors profoundly studied and well combined."}]}]}, {"word": "view", "poses": [{"pos": "noun", "senses": [{"sense": "the things that you can see from a place", "level": "A2", "dict_examp": "On a clear day, the view from the top of the mountain is amazing.", "lear_examp": "The view from the window of my room is the best one."}, {"sense": "your opinion", "level": "B1", "dict_examp": "We have different views about/on education.", "lear_examp": "Well, in my view, spending time in a city is more sensible."}, {"sense": "how well you can see something from a particular place", "level": "B2", "dict_examp": "We had a great view of the procession.", "lear_examp": "In a few seconds, he disappeared out of my view."}, {"sense": "because of", "level": "B2", "dict_examp": "In view of recent events, we have decided to cancel the meeting.", "lear_examp": "In view of what happened, I would advise you not to try to mislead people like this again."}, {"sense": "a position from which something can be seen", "level": "C2", "dict_examp": "The house was hidden from view behind a wall.", "lear_examp": "The animal disappeared as unexpectedly as it came into view."}, {"sense": "to disapprove of something", "level": "C2", "dict_examp": "Most bosses take a dim view of long lunches.", "lear_examp": "It's nearly impossible to see him strolling or strutting, in fact he is always striding; he is also one of the few men who still speaks with an accent, despite the fact that he perfectly knows that someone could take a dim view of him for this."}]}, {"pos": "verb", "senses": [{"sense": "to watch something", "level": "C2", "dict_examp": "They were able to view the city from a helicopter.", "lear_examp": "People sit in palatial cafes and restaurants to view the beauty of that \"lazy river.\""}, {"sense": "to have a particular opinion about someone or something", "level": "C2", "dict_examp": "The policy is so far viewed as a success.", "lear_examp": "There is of course the argument of many young people: that they live in a society that oppresses them, where they cannot express themselves freely and where, whatever they do or say, they are viewed as \"punks\" or \"idiots\" by adults."}]}]}, {"word": "verdict", "poses": [{"pos": "noun", "senses": [{"sense": "an opinion or decision based on the facts of a situation", "level": "C1", "dict_examp": "City planners think it’s a good idea to ban traffic from downtown streets, but the public’s verdict is that it’s a stupid idea.", "lear_examp": "Two or more articles are devoted to famous people and famous political events which took place in Greece, in order to offer a verdict to students."}, {"sense": "a decision made in a court of law or by a person in authority", "level": "C2", "dict_examp": "a guilty verdict", "lear_examp": "Three months later the verdict was official: he was going to be paralyzed from the waist down."}]}]}, {"word": "versus", "poses": [{"pos": "preposition", "senses": [{"sense": "used to say that one team or person is competing against another", "level": "C1", "dict_examp": "Tomorrow's game is Newcastle versus Arsenal.", "lear_examp": "In May, we held a students versus teachers football match and the great game ended up 2-2."}, {"sense": "used to compare two things or ideas, especially when you have to choose between them", "level": "C1", "dict_examp": "private education versus state education", "lear_examp": "Alien\" versus \"200 Warriors\" - I am not a professional critic, but here is my little review: The best film I have ever watched is most likely the \"Alien\" by Ridley Scott."}]}]}, {"word": "viable", "poses": [{"pos": "adjective", "senses": [{"sense": "effective and able to be successful", "level": "C2", "dict_examp": "a viable alternative to nuclear power", "lear_examp": "This is a question that demands reasonable answers and viable solutions."}]}]}, {"word": "video clip", "poses": [{"pos": "noun", "senses": [{"sense": "a short video recording that you can see on a website", "level": "B1", "dict_examp": "The website has several video clips of celebrity interviews.", "lear_examp": "It shows how a band or a singer do their video clips."}]}]}, {"word": "vicinity", "poses": [{"pos": "noun", "senses": [{"sense": "in the area near a place", "level": "C2", "dict_examp": "A number of buildings in the vicinity of the fire were damaged.", "lear_examp": "Just to briefly introduce myself, my name is Prashant Sharma and I live in the vicinity of the college campus."}]}]}, {"word": "velvet", "poses": [{"pos": "noun", "senses": [{"sense": "cloth that has a thick, soft surface on one side", "level": "C2", "dict_examp": "a black velvet jacket", "lear_examp": "She was wearing a long black velvet evening gown covered with a pattern of big red roses."}]}]}, {"word": "video", "poses": [{"pos": "noun", "senses": [{"sense": "a short film that can be watched on television, a computer, a camera, etc.", "level": "A2", "dict_examp": "music videos", "lear_examp": "I like it because it has a camera to make videos."}, {"sense": "a film, television program, etc. recorded on a long, narrow, magnetic strip, or the recorded strip itself that is inside a rectangular plastic container", "level": "A2", "dict_examp": "He just used to stay in and watch videos.", "lear_examp": "On that channel you have the chance to watch many videos of your favourite singer, and learn about their news."}]}]}, {"word": "vice versa", "poses": [{"pos": "adverb", "senses": [{"sense": "used for referring to the opposite of what you have just said", "level": "C1", "dict_examp": "Never use indoor lights outside and vice versa.", "lear_examp": "The piles of cash are not far away from any celebrity and we all know that time equals money and vice versa."}]}]}, {"word": "verify", "poses": [{"pos": "verb", "senses": [{"sense": "to prove that something is true, or do something to discover if it is true", "level": "C1", "dict_examp": "It was impossible to verify her statement.", "lear_examp": "The Canadian Patent Office Branch will be responsible for verifying if new inventions are truly new or have already been invented somewhere in the world."}]}]}, {"word": "victim", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has suffered the effects of violence, illness or bad luck", "level": "B2", "dict_examp": "victims of crime", "lear_examp": "His wife was his last victim."}]}]}, {"word": "veteran", "poses": [{"pos": "noun", "senses": [{"sense": "someone who has a lot of experience doing a job or activity", "level": "C2", "dict_examp": "She's a 20-year veteran of TV news broadcasting.", "lear_examp": "In the school where I work as an English teacher there are two veteran teachers of English."}, {"sense": "someone who was once a member of one of a country's military organizations", "level": "C2", "dict_examp": "a veteran of World War II", "lear_examp": "But even now I can recollect my unwillingness to get involved in parades, to join the veterans, military men, soldiers who were really proud of having a rare opportunity to feel a cog in a big wheel."}]}]}, {"word": "very", "poses": [{"pos": "adverb", "senses": [{"sense": "used emphasize an adjective or adverb", "level": "A1", "dict_examp": "Thank you very much.", "lear_examp": "My teacher is very nice."}, {"sense": "not good, tall, happy, etc.", "level": "A1", "dict_examp": "The film wasn't very good.", "lear_examp": "My college is not very big."}, {"sense": "to a large amount or degree", "level": "A1", "dict_examp": "Thank you very much for the flowers!", "lear_examp": "I like Bradford very much."}]}, {"pos": "adjective", "senses": [{"sense": "used to emphasize a noun", "level": "C2", "dict_examp": "This is the very book I've been looking for all month.", "lear_examp": "You cannot infringe individual liberties and ban the purchase of cars - it would go against the very fabric of modern society."}]}]}, {"word": "verb", "poses": [{"pos": "noun", "senses": [{"sense": "a word that is used to say that someone does something or that something happens. For example, the words \"arrive,\" \"make,\" \"be,\" and \"feel\" are verbs.", "level": "A2", "dict_examp": "a regular/irregular verb", "lear_examp": "This book will help you to learn basic English, it teaches you all the irregular verbs."}]}]}, {"word": "verbal", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to words or the use of words", "level": "C1", "dict_examp": "verbal ability/skills", "lear_examp": "I found the English lessons very helpful for my students to improve their verbal skills - though we might change the contents to make them more interesting for them."}, {"sense": "spoken and not written", "level": "C2", "dict_examp": "a verbal promise/agreement", "lear_examp": "I would expect to receive a reply from your end, either written or verbal, about my complaint."}]}]}, {"word": "vent", "poses": [{"pos": "verb", "senses": [{"sense": "to do or say something to show your anger or another strong, bad feeling", "level": "C2", "dict_examp": "Walking relieves a lot of tension and it’s a good way to vent frustration.", "lear_examp": "Every time I had to get something off of my chest, poor out my feelings or vent out my anger, writing in my diary was the most natural and harmless way to do so."}]}]}, {"word": "venue", "poses": [{"pos": "noun", "senses": [{"sense": "a place where a sports game, musical performance, or special event happens", "level": "B2", "dict_examp": "The hotel is an ideal venue for conferences and business meetings.", "lear_examp": "The Majestic Hotel as the party venue sounds really good but isn't it very expensive?"}]}]}, {"word": "victory", "poses": [{"pos": "noun", "senses": [{"sense": "when you win a game, competition, election, fight, war, etc.", "level": "B2", "dict_examp": "Phoenix managed a 135-114 victory over Denver.", "lear_examp": "They were all celebrating their victory with a gorgeous dinner."}]}]}, {"word": "vicious", "poses": [{"pos": "adjective", "senses": [{"sense": "violent and dangerous", "level": "C2", "dict_examp": "a vicious attack on a child", "lear_examp": "She was a real, vicious murderer."}, {"sense": "intended to upset someone", "level": "C2", "dict_examp": "a vicious rumor", "lear_examp": "One advantage with this school that rose above the others, was the fact that there was virtually no cruel bullying or vicious teasing."}, {"sense": "a continuing unpleasant situation, created when one problem causes another problem which then makes the first problem worse", "level": "C2", "dict_examp": "Many people get trapped in a vicious circle of dieting and weight gain.", "lear_examp": "So we could say that it becomes a vicious circle."}]}]}, {"word": "via", "poses": [{"pos": "preposition", "senses": [{"sense": "going through or stopping at a place on the way to another place", "level": "B1", "dict_examp": "The train to Philadelphia goes via Baltimore.", "lear_examp": "Two years ago I traveled to Canada via Italy."}, {"sense": "using a particular machine, system or person to send or recieve something", "level": "B1", "dict_examp": "Reports are coming in via satellite.", "lear_examp": "I hate shopping via the internet."}]}]}, {"word": "video game", "poses": [{"pos": "noun", "senses": [{"sense": "a game in which you make pictures move on a screen", "level": "A2", "dict_examp": "He plays a lot of video games.", "lear_examp": "We played cricket, and we also played video games."}]}]}, {"word": "vet", "poses": [{"pos": "noun", "senses": [{"sense": "someone whose job is to give medical care to animals that are ill or hurt", "level": "B1", "dict_examp": "Helen is training to become a vet.", "lear_examp": "Sorry Mr. Smith but I'll miss tomorrow's class as I have to go to the vet with my dog."}]}]}, {"word": "verge", "poses": [{"pos": "noun", "senses": [{"sense": "to be going to happen or to do something very soon", "level": "C2", "dict_examp": "a company on the verge of financial disaster", "lear_examp": "I was on the verge of depression, when I decided to take control of my own life."}]}]}, {"word": "venture", "poses": [{"pos": "noun", "senses": [{"sense": "a new activity or business that may involve some risk of failure", "level": "C2", "dict_examp": "a business venture", "lear_examp": "They even give vast amounts of people a means of living, and can become very lucrative business ventures."}]}, {"pos": "verb", "senses": [{"sense": "to leave a safe place and go somewhere that may involve risks", "level": "C2", "dict_examp": "If the snow stops, I might venture out.", "lear_examp": "After having visited some of the more frequented islands, we decided to venture out to the island of Fourni."}, {"sense": "to say or do something when you are likely to be wrong or to be criticized", "level": "C2", "dict_examp": "I wouldn’t venture an opinion about that.", "lear_examp": "The men and women who could have done something to cut short the chain of events which led to the Second World War had already suffered the First World War, and no one could venture they were in the position of foreseeing the development of a similar war."}]}]}, {"word": "version", "poses": [{"pos": "noun", "senses": [{"sense": "one form of something that is slightly different from other forms of the same thing", "level": "B2", "dict_examp": "An English-language version of the book is planned for the fall.", "lear_examp": "Who has never said that the original book was better than the film version?"}, {"sense": "someone's description of what has happened", "level": "C1", "dict_examp": "Her version of the accident was completely different from that given by the driver of the other car.", "lear_examp": "I do not know your source of information, but not only did he/she provided you with many untruthful details, the style of the article also shows a biased version of the event."}]}]}, {"word": "veil", "poses": [{"pos": "noun", "senses": [{"sense": "a piece of material that a woman wears over her head or over her head and face", "level": "C1", "dict_examp": "The bride wore a veil of French lace.", "lear_examp": "Especially, a bride and a groom wear special hats and colorful make-up.  And most brides wear a long veil so grooms can't see their wife's face."}, {"sense": "something that \thides or prevents you from knowing something", "level": "C2", "dict_examp": "A veil of secrecy surrounded the appointment of the new college president.", "lear_examp": "Depending on the disposition of those elements within a person, one can turn out to be an angelic soul who radiates trust and happiness, a malevolent spirit hidden under a glamour of niceties; a golden entity, shrouded by a veil of coarseness and bluntness; or a purely evil fiend who exudes despair and malice."}]}]}, {"word": "versatile", "poses": [{"pos": "adjective", "senses": [{"sense": "having many different skills", "level": "C2", "dict_examp": "a versatile player/performer", "lear_examp": "She is a very gregarious and versatile person whose scintillating and jocular personality makes everybody melt."}, {"sense": "useful for doing a lot of different things", "level": "C2", "dict_examp": "a versatile tool", "lear_examp": "The Internet today is the most versatile tool in so many ways."}]}]}, {"word": "vertical", "poses": [{"pos": "adjective", "senses": [{"sense": "pointing straight up from a surface", "level": "C1", "dict_examp": "a vertical line", "lear_examp": "The vertical axis indicates the different years while the horizontal axis illustrates the money spent in millions."}]}]}, {"word": "verse", "poses": [{"pos": "noun", "senses": [{"sense": "one of the parts that a song or poem is divided into", "level": "B2", "dict_examp": "I only know the first verse of the poem.", "lear_examp": "But I was so puzzled that when I tried to sing, I couldn't remember a word of the verse I had written."}]}]}, {"word": "visa", "poses": [{"pos": "noun", "senses": [{"sense": "an official mark in your passport that allows you to enter or leave a particular country", "level": "B1", "dict_examp": "We traveled to Argentina on a tourist visa.", "lear_examp": "Tomorrow I am not going to attend the class because I have to apply for my visa at 9.00."}]}]}, {"word": "violate", "poses": [{"pos": "verb", "senses": [{"sense": "to not obey a law, rule, or agreement", "level": "C2", "dict_examp": "Countries that violate international law will be dealt with in court.", "lear_examp": "All three points strongly violate the regulations and immediate action is required."}]}]}, {"word": "view", "poses": [{"pos": "noun", "senses": [{"sense": "the things that you can see from a place", "level": "A2", "dict_examp": "On a clear day, the view from the top of the mountain is amazing.", "lear_examp": "The view from the window of my room is the best one."}, {"sense": "your opinion", "level": "B1", "dict_examp": "We have different views about/on education.", "lear_examp": "Well, in my view, spending time in a city is more sensible."}, {"sense": "how well you can see something from a particular place", "level": "B2", "dict_examp": "We had a great view of the procession.", "lear_examp": "In a few seconds, he disappeared out of my view."}, {"sense": "because of", "level": "B2", "dict_examp": "In view of recent events, we have decided to cancel the meeting.", "lear_examp": "In view of what happened, I would advise you not to try to mislead people like this again."}, {"sense": "a position from which something can be seen", "level": "C2", "dict_examp": "The house was hidden from view behind a wall.", "lear_examp": "The animal disappeared as unexpectedly as it came into view."}, {"sense": "to disapprove of something", "level": "C2", "dict_examp": "Most bosses take a dim view of long lunches.", "lear_examp": "It's nearly impossible to see him strolling or strutting, in fact he is always striding; he is also one of the few men who still speaks with an accent, despite the fact that he perfectly knows that someone could take a dim view of him for this."}]}, {"pos": "verb", "senses": [{"sense": "to watch something", "level": "C2", "dict_examp": "They were able to view the city from a helicopter.", "lear_examp": "People sit in palatial cafes and restaurants to view the beauty of that \"lazy river.\""}, {"sense": "to have a particular opinion about someone or something", "level": "C2", "dict_examp": "The policy is so far viewed as a success.", "lear_examp": "There is of course the argument of many young people: that they live in a society that oppresses them, where they cannot express themselves freely and where, whatever they do or say, they are viewed as \"punks\" or \"idiots\" by adults."}]}]}, {"word": "violence", "poses": [{"pos": "noun", "senses": [{"sense": "when someone tries to hurt or kill someone else", "level": "B2", "dict_examp": "an act of violence", "lear_examp": "Today, it is important that children and teenagers do something with their free time and do not get in contact with criminality and violence."}, {"sense": "extreme force and energy, especially of something causing damage", "level": "C2", "dict_examp": "Such was the violence of the explosion that three buildings collapsed.", "lear_examp": ""}]}]}, {"word": "visitor", "poses": [{"pos": "noun", "senses": [{"sense": "someone who visits a person or place", "level": "A2", "dict_examp": "Ben, you have a  visitor here to see you.", "lear_examp": "I did a very good meal for all of my visitors."}]}]}, {"word": "vitality", "poses": [{"pos": "noun", "senses": [{"sense": "energy and strength", "level": "C2", "dict_examp": "At 48, he still projects an image of youth and vitality.", "lear_examp": "Full of joy and vitality, enjoying all the changes around her, Alice was as happy as she had never been before."}]}]}, {"word": "visibly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that can be seen", "level": "C2", "dict_examp": "He was visibly upset.", "lear_examp": "However, it is my firm conviction that if the authority reconsiders some of its regulations and take urgent steps, the number of unemployed people will be visibly reduced."}]}]}, {"word": "virtue", "poses": [{"pos": "noun", "senses": [{"sense": "because of something", "level": "C2", "dict_examp": "She succeeded by virtue of hard work.", "lear_examp": "However, you should take into consideration the expenses, which might be exorbitant by virtue of the fact that you intend to create places with a beautiful ambience and a wide range of comforts offered that will facilitate residents' lives."}, {"sense": "a good quality that someone has", "level": "C2", "dict_examp": "Patience is not among his virtues.", "lear_examp": "The saying \"patience is a virtue\" has been very over-used, but that does not make it any less true."}, {"sense": "an advantage or useful quality", "level": "C2", "dict_examp": "The great virtue of having a small car is that you can park it easily.", "lear_examp": "Finally it should be said that despite the negative attitudes towards the overcrowding of our good old Earth, longer life seems to have more virtues than drawbacks."}, {"sense": "behavior that is morally good", "level": "C2", "dict_examp": "She was a woman of great virtue.", "lear_examp": "Mother Theresa, she was a model of virtue."}]}]}, {"word": "vision", "poses": [{"pos": "noun", "senses": [{"sense": "an idea or image in your mind of what something could be like in the future", "level": "B2", "dict_examp": "a vision of a better society", "lear_examp": "All in all, I think you must write a new report to apologize for having been so pessimistic and having given such a bleak vision of this Festival."}, {"sense": "the ability to see", "level": "B2", "dict_examp": "He has poor vision in his left eye.", "lear_examp": "Her hands were sweating and her vision had become a blur because of the tension in the air."}, {"sense": "the ability to make plans for the future that are imaginative and wise", "level": "C1", "dict_examp": "As a leader, he lacked vision.", "lear_examp": "A man of vision, Eleftherios Venizelus played a significant role in the history of my country, as in his time it became, with few changes, what it is today."}]}]}, {"word": "virtual", "poses": [{"pos": "adjective", "senses": [{"sense": "using computer images and sounds that make you think an imagined situation is real", "level": "B2", "dict_examp": "a virtual art gallery online", "lear_examp": "However, I go far away from my family and other people and have virtual relationships."}, {"sense": "almost a particular thing or quality", "level": "C1", "dict_examp": "Ten years of  bad government had brought about the virtual collapse of the country's economy.", "lear_examp": "However the growth of our cities and townships coupled with an exponential increase in traffic and facilities have transformed these areas into virtual no-go zones"}]}]}, {"word": "visual", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to seeing", "level": "B2", "dict_examp": "The film has some powerful visual effects.", "lear_examp": "It also provides a clear idea of how people's lives were in a particular period by showing us the visual images of that time."}]}]}, {"word": "vitally", "poses": [{"pos": "adverb", "senses": [{"sense": "in a very important way", "level": "C2", "dict_examp": "Safety at work is vitally important.", "lear_examp": "Being able to use the computer and the Internet successfully is vitally important in today's society but it will be even more important in the future."}]}]}, {"word": "visit", "poses": [{"pos": "verb", "senses": [{"sense": "to go to someone's home and spend time with them", "level": "A1", "dict_examp": "Will you visit me when I'm in the hospital?", "lear_examp": "She visits her parents once a week."}, {"sense": "to go to a place and spend a short amount of  time there", "level": "A1", "dict_examp": "We visited a few galleries while we were in Chicago.", "lear_examp": "It's a very nice place with a lot of shops and museums to visit, like the \"Louvre\" for example."}, {"sense": "to look at a website", "level": "A2", "dict_examp": "There's the usual invitation to visit their website.", "lear_examp": "If you want more information or you want to see photos about the art class, visit our website: www.artclass.com."}]}, {"pos": "noun", "senses": [{"sense": "when you visit a place or a person", "level": "B1", "dict_examp": "the President's visit to Argentina", "lear_examp": "The problem is that my mother arranged a visit to the doctor, and after that to the dentist."}]}]}, {"word": "vital", "poses": [{"pos": "adjective", "senses": [{"sense": "necessary or extremely important", "level": "B2", "dict_examp": "Tourism is vital to the country's economy.", "lear_examp": "If you don't mind I would like to ask you some vital questions."}]}]}, {"word": "virus", "poses": [{"pos": "noun", "senses": [{"sense": "a program that is secretly put onto a computer in order to destroy the information that is stored on it", "level": "B1", "dict_examp": "My computer has been acting strangely, and I suspect it's a virus.", "lear_examp": "That document was a \"virus\" and erased all my documents on my computer."}, {"sense": "an infectious organism too small to be seen that causes disease, or an illness that it causes", "level": "B2", "dict_examp": "a flu virus", "lear_examp": "My \"friend\" Pat told everybody that my brother died and that he died because he got a virus - that's why I didn't have friends because all the people thought that I had the virus too."}]}]}, {"word": "virgin", "poses": [{"pos": "adjective", "senses": [{"sense": "Virgin land, forest, etc. has not been used or damaged by people.", "level": "C2", "dict_examp": "50 acres of virgin woodland", "lear_examp": "The balance of nature is threatened by the construction of luxurious hotels in the middle of virgin forests."}]}, {"pos": "noun", "senses": [{"sense": "someone who has never had sex", "level": "C2", "dict_examp": "She was a virgin at the time of her marriage.", "lear_examp": "This was Anne-Marie, 27 years old and fairly attractive.  But still a virgin."}]}]}, {"word": "vitamin", "poses": [{"pos": "noun", "senses": [{"sense": "one of a group of natural substances that you need to be healthy", "level": "B2", "dict_examp": "a vitamin pill", "lear_examp": "On the one hand, we eat a lot of sweet or fat food, which lacks vitamins."}]}]}, {"word": "vivid", "poses": [{"pos": "adjective", "senses": [{"sense": "Vivid descriptions or memories produce strong, clear images in your mind.", "level": "B2", "dict_examp": "He gave a very vivid account/description of life in Havana.", "lear_examp": "Each memory is still so vivid."}, {"sense": "A vivid color is very bright.", "level": "B2", "dict_examp": "She was wearing a vivid pink shirt.", "lear_examp": "Students would like to have some vivid colors or pictures on the walls but the best solution would be to repaint the walls."}]}]}, {"word": "viewpoint", "poses": [{"pos": "noun", "senses": [{"sense": "a way of thinking about a situation", "level": "C1", "dict_examp": "From his viewpoint the action seemed entirely justified.", "lear_examp": "As a student, I feel concerned about the traffic issue and I asked some people about their viewpoints on the two proposals."}]}]}, {"word": "violent", "poses": [{"pos": "adjective", "senses": [{"sense": "involving violence", "level": "B2", "dict_examp": "a violent crime", "lear_examp": "Some say that television can affect people in bad ways and sometimes causes violent incidents."}, {"sense": "using force to hurt or attack someone else", "level": "B2", "dict_examp": "a violent criminal", "lear_examp": "Now Mary knew what happened at Jamaica Inn and it was very dangerous for her because her uncle was a violent man."}, {"sense": "sudden and causing damage", "level": "C2", "dict_examp": "a violent explosion/storm", "lear_examp": "The violent storm was rocking the ship back and forth."}]}]}, {"word": "viewer", "poses": [{"pos": "noun", "senses": [{"sense": "someone who watches a  television program", "level": "B2", "dict_examp": "Millions of viewers will be watching the last show of the series.", "lear_examp": "He's an extraordinary person and TV viewers will love him because of his good sense of humor and his honesty."}]}]}, {"word": "vivacious", "poses": [{"pos": "adjective", "senses": [{"sense": "A vivacious person, especially a woman, is full of energy and enthusiasm.", "level": "C2", "dict_examp": "She is extremely vivacious.", "lear_examp": "Furthermore, there are a few qualities, which would attract me to someone, they are not essential, though: I would rather have someone as a friend who is vivacious and gregarious than someone who is withdrawn and retiring."}]}]}, {"word": "village", "poses": [{"pos": "noun", "senses": [{"sense": "a group of stores, houses, and other buildings that is smaller than a town", "level": "A1", "dict_examp": "a small fishing village", "lear_examp": "My grandmother lived in a village and I often went there."}]}]}, {"word": "vinegar", "poses": [{"pos": "noun", "senses": [{"sense": "a sour liquid that is used in cooking, often made from wine", "level": "B2", "dict_examp": "red wine vinegar", "lear_examp": ""}]}]}, {"word": "virtually", "poses": [{"pos": "adverb", "senses": [{"sense": "almost", "level": "B2", "dict_examp": "I've virtually finished.", "lear_examp": "Virtually everyone today can go out and buy their own personal computer."}, {"sense": "in a way that uses computer images and sounds that make you think an imagined situation is real", "level": "B2", "dict_examp": "Nowadays all these things can be experienced virtually.", "lear_examp": "I also have the possibility of making new friends: I can connect to a special site which will enable me to meet people virtually."}]}]}, {"word": "virtual reality", "poses": [{"pos": "noun", "senses": [{"sense": "when a computer produces images and sounds that make you think an imagined situation is real", "level": "B2", "dict_examp": "virtual reality games", "lear_examp": "Magnificent scientific projects are done by computers, as well as daily shopping, communication with people in other parts of the world, games, getting any kind of information and, soon, virtual reality!"}]}]}, {"word": "vine", "poses": [{"pos": "noun", "senses": [{"sense": "a plant with a twisted stem that climbs things or grows along the ground", "level": "C1", "dict_examp": "The wall was covered in vines.", "lear_examp": "After following the walking path through the vines at Canon-Fronsac you could climb the Canon Mountain to have a view all over the region."}]}]}, {"word": "violently", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that involves violence", "level": "B2", "dict_examp": "He often behaved violently and they were terrified of him.", "lear_examp": "Sometimes they behave violently because of their imprisonment."}]}]}, {"word": "visible", "poses": [{"pos": "adjective", "senses": [{"sense": "able to be seen", "level": "B2", "dict_examp": "You should wear something light-colored when you're cycling at night so that you're more visible.", "lear_examp": "He waited curiously for her to become visible through the fog which seemed to have gotten denser in the last few seconds."}, {"sense": "obvious or noticeable", "level": "C1", "dict_examp": "She is a highly visible environmental spokesperson.", "lear_examp": "After about three months I noticed a visible improvement."}]}]}, {"word": "violin", "poses": [{"pos": "noun", "senses": [{"sense": "a wooden musical instrument with four strings, which you hold against your  neck and play by moving a bow across the strings", "level": "A2", "dict_examp": "I've been learning the violin for the last four years.", "lear_examp": "My hobbies are reading and playing the violin."}]}]}, {"word": "voluntary", "poses": [{"pos": "adjective", "senses": [{"sense": "Voluntary work is done without being paid and usually involves helping people.", "level": "C1", "dict_examp": "She does voluntary work for Doctors Without Borders.", "lear_examp": "I did voluntary work for a whole year in 1998 in Britain."}]}]}, {"word": "vote", "poses": [{"pos": "verb", "senses": [{"sense": "to show your choice or opinion in an election or meeting by doing something such as writing a mark on an official piece of paper, using a special machine to record your choice, or putting your hand up", "level": "B1", "dict_examp": "Who did you vote for?", "lear_examp": "Then the audience and the judges voted which country was the best."}]}, {"pos": "noun", "senses": [{"sense": "when someone shows their choice or opinion in an election or meeting by doing something such as writing a mark on an official piece of paper, using a special machine to record their choice, or putting their hand up", "level": "B1", "dict_examp": "He lost the election by twenty votes.", "lear_examp": "The one who gets the most votes will get 1000 Baht as first prize."}, {"sense": "a way of making a decision by asking a group of people to vote", "level": "B2", "dict_examp": "We called a meeting in order to take a vote on the issue.", "lear_examp": ""}, {"sense": "when someone is officially allowed to vote", "level": "C1", "dict_examp": "In some countries women still don't have the vote.", "lear_examp": "Women acquired the vote only 70 years ago."}, {"sense": "to vote", "level": "C2", "dict_examp": "More than 30,000 citizens cast their votes in the last city election.", "lear_examp": "When the day of the General Elections came, no woman cast her vote for James and he lost his seat to a man from a minority party, not even the man representing the Labour Party."}]}]}, {"word": "vowel", "poses": [{"pos": "noun", "senses": [{"sense": "a speech sound that you make with your lips and teeth open, shown in English by the letters a, e, i, o, or u", "level": "B1", "dict_examp": "A short vowel is a short sound as in the word \"cup.\"", "lear_examp": "In the game, he let the students choose a vowel or consonant."}]}]}, {"word": "voyage", "poses": [{"pos": "noun", "senses": [{"sense": "a long journey, especially by ship, or in space", "level": "B2", "dict_examp": "Cook's voyage to Australia", "lear_examp": "Besides, I have a good command of French and I speak English fluently, which might be also useful during the voyage around the world."}]}]}, {"word": "volcano", "poses": [{"pos": "noun", "senses": [{"sense": "a mountain with a large hole at the top, which sometimes explodes and produces hot, melted rock and smoke", "level": "B2", "dict_examp": "an extinct/active volcano", "lear_examp": "Finally, I think that a good place to go is Santorini, a beautiful island which has a volcano."}]}]}, {"word": "vow", "poses": [{"pos": "verb", "senses": [{"sense": "to make a serious promise or decision", "level": "C2", "dict_examp": "They vowed (that) they would never forget her kindness.", "lear_examp": "Most definitely Yiannakis' plan had not worked out and after that episode he vowed that he would never set foot in a stadium again."}]}, {"pos": "noun", "senses": [{"sense": "a serious promise or decision", "level": "C2", "dict_examp": "marriage vows", "lear_examp": "The vows (and the rings) are exchanged after a short speech given by the priest."}]}]}, {"word": "vividly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a vivid way", "level": "B2", "dict_examp": "I vividly remember my first day at school.", "lear_examp": "She could vividly remember the last time he hurt her, only then it was with a razor."}]}]}, {"word": "voter", "poses": [{"pos": "noun", "senses": [{"sense": "a person who votes or who has a legal right to vote, especially in an election", "level": "C2", "dict_examp": "Of course, tax cuts are usually popular with the voters.", "lear_examp": "Low taxes seem to be the most important issue for this party and it's voters."}]}]}, {"word": "volume", "poses": [{"pos": "noun", "senses": [{"sense": "the level of sound produced by a television, radio, etc.", "level": "B1", "dict_examp": "Could you turn the volume up/down, please.", "lear_examp": "After we went to the disco and we danced together, but the volume of the music was too high to talk!"}, {"sense": "the number or amount of something, especially when it is large", "level": "B2", "dict_examp": "I was put off by the volume of work involved.", "lear_examp": "Nowadays, marketing volume is rapidly increased in Internet business, according to one of the major newspapers."}, {"sense": "a book, especially one of a set", "level": "C2", "dict_examp": "a new dictionary in two volumes", "lear_examp": "This book which I adored as a child, and as a matter of fact, one which I often come back to, comprises seven volumes, each giving a vivid account of the adventures that the Pevensie siblings, Lucy, Edmund, Susan and Peter, encounter in the magical land of Narnia."}, {"sense": "If something speaks volumes, it makes an opinion, characteristic or situation very clear without the use of words.", "level": "C2", "dict_examp": "She said very little, but her face spoke volumes.", "lear_examp": "It remains to be seen whether the effect of stem cells when applied to humans would be the same, but the achievements speak volumes about the fact that stem cells may one day turn a new page in many people's lives and let them get rid of that humiliating label of a \"disabled person.\""}]}]}, {"word": "voluntarily", "poses": [{"pos": "adverb", "senses": [{"sense": "If you do something voluntarily, nobody has forced you to do it.", "level": "C2", "dict_examp": "She left voluntarily.", "lear_examp": "After he had himself discharged voluntarily from the hospital, he drove up to the cliff, and left his car there."}]}]}, {"word": "vocation", "poses": [{"pos": "noun", "senses": [{"sense": "a strong feeling that you are right for a particular type of work, or a job that gives you this feeling", "level": "C2", "dict_examp": "He knew that teaching was his true vocation.", "lear_examp": "He was a teacher, seeing teaching as his vocation, and nothing could boost his confidence as much as excellent students and successful results."}]}]}, {"word": "volleyball", "poses": [{"pos": "noun", "senses": [{"sense": "a game in which two teams use their hands to hit a ball over a net without allowing it to touch the ground", "level": "A2", "dict_examp": "They played volleyball on the beach.", "lear_examp": "My hobbies are playing volleyball and watching TV."}]}]}, {"word": "volunteer", "poses": [{"pos": "noun", "senses": [{"sense": "a person who does something, especially helping other people, willingly and without being forced or paid to do it", "level": "B2", "dict_examp": "a Red Cross volunteer", "lear_examp": "Well the concert was Friday night and I went there with the Red Cross volunteers, did you know I'm one of them?"}]}, {"pos": "verb", "senses": [{"sense": "to offer to do something without being asked or told to do it", "level": "C1", "dict_examp": "Rob volunteered to look after the kids.", "lear_examp": "One of my classmates, Maria, has volunteered to talk about the different courses and summer activities that the school offers."}]}]}, {"word": "vomit", "poses": [{"pos": "verb", "senses": [{"sense": "If someone vomits, the food or liquid that was in their stomach comes up and out of their mouth.", "level": "C2", "dict_examp": "He felt sick all day and then he suddenly started to vomit.", "lear_examp": "Some people do feel headaches and vomit if they watch television for extensive number of time."}]}]}, {"word": "vocational", "poses": [{"pos": "adjective", "senses": [{"sense": "Vocational education and skills prepare you for a particular type of work.", "level": "C1", "dict_examp": "The school offers both vocational and academic courses.", "lear_examp": "Moreover, learners can choose a different path, for example a technical, vocational or academic one."}]}]}, {"word": "voice", "poses": [{"pos": "noun", "senses": [{"sense": "the sounds that are made when people speak or sing", "level": "B1", "dict_examp": "She has a very loud/quiet/soft voice.", "lear_examp": "Her voice is so clear and she has the nicest eyes which I've ever seen."}, {"sense": "to become unable to speak, often because of an illness", "level": "B2", "dict_examp": "She had a bad cold and was losing her voice.", "lear_examp": "I immediately became agitated and at the precise moment of my speech I lost my voice completely."}, {"sense": "to speak loudly and angrily to someone", "level": "C1", "dict_examp": "Even when he was angry with his children, he never raised his voice.", "lear_examp": "Not every au-pair family is pleasant. And believe me, mine was giving me hell on earth. ... After I returned home I took some time to learn not to freak out when someone raised his voice and eventually I started to see my time in Germany as a great lesson in life."}]}, {"pos": "verb", "senses": [{"sense": "to say what you think about a particular subject", "level": "C2", "dict_examp": "Opponents also voiced concern about potential traffic produced by the project.", "lear_examp": "And in the end they voiced their wishes to re-unify Germany."}]}]}, {"word": "vocabulary", "poses": [{"pos": "noun", "senses": [{"sense": "all the words you know in a particular language", "level": "A2", "dict_examp": "a large/big/limited vocabulary", "lear_examp": "I'm sure I will improve my vocabulary and English Grammar."}, {"sense": "all the words that exist in a language, or that are used when discussing a particular subject", "level": "C1", "dict_examp": "Computing has its own specialist vocabulary.", "lear_examp": "This is true because the several authors of the magazine use a significantly advanced vocabulary while writing in Greek, which is sometimes difficult even for a native Greek to understand."}]}]}, {"word": "vulnerable", "poses": [{"pos": "adjective", "senses": [{"sense": "easy to hurt or attack physically or emotionally", "level": "C2", "dict_examp": "She was a vulnerable sixteen-year-old.", "lear_examp": "Therefore they are vulnerable to being twisted by their environment, by events, or by more manipulative minds."}]}]}]