[{"word": "wardrobe", "poses": [{"pos": "noun", "senses": [{"sense": "the set of clothes that you own, or a set of clothes worn at a particular time or for a particular situation", "level": "B2", "dict_examp": "I'll need a new wardrobe for my new job!", "lear_examp": "Of course, jeans are always in a young person's wardrobe as they are always in fashion and now baggy trousers are becoming more and more popular."}]}]}, {"word": "wake", "poses": [{"pos": "verb", "senses": [{"sense": "to stop sleeping or to make someone else stop sleeping", "level": "A1", "dict_examp": "Did you wake up at all during the night?", "lear_examp": "I wake up at 8 o'clock."}]}]}, {"word": "warning", "poses": [{"pos": "noun", "senses": [{"sense": "something that tells or shows you that something bad may happen", "level": "B1", "dict_examp": "There's a health  warning on every pack of cigarettes.", "lear_examp": "Without any warning he pushed me."}]}]}, {"word": "warmly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a way that keeps you warm", "level": "B2", "dict_examp": "You're not dressed warmly enough - put a sweater on.", "lear_examp": ""}, {"sense": "in a friendly or loving way", "level": "B2", "dict_examp": "He shook my hand warmly.", "lear_examp": "He embraced me warmly and whispered 'You wouldn't have believed me.'"}]}]}, {"word": "wary", "poses": [{"pos": "adjective", "senses": [{"sense": "If you are wary of someone or something, you do not trust them completely.", "level": "C2", "dict_examp": "She's still wary of strangers.", "lear_examp": "Therefore, I strongly believe that consumers should be wary of \"pots of gold\" and promises made in vain. They should trust solely in what their doctors recommend for each specific case."}]}]}, {"word": "waist", "poses": [{"pos": "noun", "senses": [{"sense": "the part of the body above and slightly narrower than the hips", "level": "B2", "dict_examp": "a small/narrow/tiny/large waist", "lear_examp": "Chris was holding his arm tightly around Claire's waist."}]}]}, {"word": "wall", "poses": [{"pos": "noun", "senses": [{"sense": "a vertical structure, often made of stone or brick, that divides or surrounds something", "level": "A1", "dict_examp": "The walls in this apartment are so thin you can hear just about every word the neighbors say.", "lear_examp": "We will paint the wall orange."}]}]}, {"word": "warmth", "poses": [{"pos": "noun", "senses": [{"sense": "the heat that is produced by something", "level": "B2", "dict_examp": "the warmth of the sun", "lear_examp": "We lay down on the sand enjoying the warmth of the sun and listening to the birds."}, {"sense": "a friendly and loving quality in someone or something", "level": "B2", "dict_examp": "I still remember the warmth of their welcome.", "lear_examp": "They gave us so much when we were children, their love and their warmth, and now it is up to us to stay with them and give back the love we received."}]}]}, {"word": "ward", "poses": [{"pos": "noun", "senses": [{"sense": "a room or area in a hospital, where people receiving treatment stay", "level": "B2", "dict_examp": "She's in a ward on the fourth floor.", "lear_examp": "I spent two days alone in a ward in Biarritz's hospital."}]}]}, {"word": "warn", "poses": [{"pos": "verb", "senses": [{"sense": "to make someone realize a possible danger or problem, especially one in the future", "level": "B1", "dict_examp": "We were warned not to eat the fish.", "lear_examp": "I tried to warn him that there would be a lot of people looking at him."}]}]}, {"word": "warrior", "poses": [{"pos": "noun", "senses": [{"sense": "a person who has experience and skill in fighting in a war, especially in the past", "level": "C1", "dict_examp": "These warriors used spears made from iron.", "lear_examp": "It is true that the Vikings were warriors, some would say bloodthirsty as well, but that is something I will leave to you to judge."}]}]}, {"word": "wash", "poses": [{"pos": "verb", "senses": [{"sense": "to clean something using water", "level": "A1", "dict_examp": "wash your hands/hair", "lear_examp": "We can wash cars to earn some money for the necessary materials."}, {"sense": "to clean yourself, or a part of yourself, with water and usually soap, especially your hands before a meal", "level": "A1", "dict_examp": "Go wash up for dinner now.", "lear_examp": ""}]}]}, {"word": "warehouse", "poses": [{"pos": "noun", "senses": [{"sense": "a large building for storing goods that are going to be sold", "level": "C2", "dict_examp": "We have several thousand of the books in our warehouse.", "lear_examp": "But new businesses are flourishing in the old warehouses by the river. Manufacturing and engineering firms have sprung in recent years and are keeping unemployement at record low."}]}]}, {"word": "wage", "poses": [{"pos": "noun", "senses": [{"sense": "the amount of money a person regularly receives for a job, usually when paid for the number of hours worked", "level": "B1", "dict_examp": "The factory pays low/high/fair/decent wages.", "lear_examp": "I know it is not nice for my family but I earn a good wage for that."}]}]}, {"word": "war", "poses": [{"pos": "noun", "senses": [{"sense": "armed fighting between two or more countries or groups, or a particular example of this", "level": "A2", "dict_examp": "nuclear war", "lear_examp": "It was built by the British during the war."}, {"sense": "an attempt to stop something bad or illegal", "level": "C2", "dict_examp": "the war against crime/drugs", "lear_examp": "Some years ago, she had given an interview on a local channel, explaining why she chose to devote herself to the war against the destruction of the environment."}]}]}, {"word": "wait", "poses": [{"pos": "verb", "senses": [{"sense": "to stay in a place until someone or something arrives, or until someone or something is ready for you", "level": "A1", "dict_examp": "I waited for her in the corridor while she went in to see the doctor.", "lear_examp": "I don't like the college break times, because I must wait 15 minutes."}, {"sense": "used to say how excited you are about something that you are going to do", "level": "A2", "dict_examp": "I can't wait to see him.", "lear_examp": "I can't wait to see you!"}, {"sense": "to be late so that someone has to wait for you", "level": "B1", "dict_examp": "I'm sorry to have kept you waiting.", "lear_examp": "I'm sorry for keeping you waiting."}, {"sense": "said in order to interrupt someone, or to get their attention or when you have suddenly thought of something important", "level": "B1", "dict_examp": "Now, wait a minute - I don't agree with that.", "lear_examp": "Oh! Wait a minute..."}, {"sense": "to wait to discover what will happen", "level": "C1", "dict_examp": "We'll wait and see what she says.", "lear_examp": "We will just have to wait and see.  . . . ."}, {"sense": "to not do something until something else happens", "level": "C1", "dict_examp": "We'll wait till Jane gets here before we start eating.", "lear_examp": "The wedding will be at midday, but because Spanish people are the most unpunctual people in the world, maybe we'll have to wait until half past twelve to start the ceremony."}]}, {"pos": "noun", "senses": [{"sense": "when you stay in one place until someone or something arrives, or someone or something is ready for you", "level": "B2", "dict_examp": "a long wait", "lear_examp": ""}]}]}, {"word": "wander", "poses": [{"pos": "verb", "senses": [{"sense": "to walk around slowly in a relaxed way or without any clear purpose or direction", "level": "B2", "dict_examp": "We spent the morning wandering around the market.", "lear_examp": "If you can't afford it you can just wander around the city and enjoy meeting people."}, {"sense": "If someone's attention/mind, etc., wanders, they start thinking about one subject when they should be thinking about a different subject.", "level": "C2", "dict_examp": "I was bored and my thoughts started to wander.", "lear_examp": "His mind kept wandering off and he always found himself dreaming of her beautiful blue eyes, her long, dark eye-lashes and her soft, curled hair."}]}]}, {"word": "wallet", "poses": [{"pos": "noun", "senses": [{"sense": "a small folding case for carrying paper money and credit cards, used especially by men", "level": "A2", "dict_examp": "Have you seen my wallet anywhere?", "lear_examp": "I think I have left my wallet in your house."}]}]}, {"word": "walker", "poses": [{"pos": "noun", "senses": [{"sense": "someone who walks", "level": "C1", "dict_examp": "She is a very fast walker.", "lear_examp": "The next step is directly on the road. Here you have to learn to watch what different drivers, walkers, children, dogs, cats ... are doing and, the most important thing, to predict what they will do in the next seconds."}]}]}, {"word": "want", "poses": [{"pos": "verb", "senses": [{"sense": "to hope to have or do something, or to wish for something", "level": "A1", "dict_examp": "I want some chocolate.", "lear_examp": "I just wanted to write a letter to you."}]}]}, {"word": "waiter", "poses": [{"pos": "noun", "senses": [{"sense": "a man who works in a restaurant, bringing food to customers", "level": "A1", "dict_examp": "The waiter brought our drinks.", "lear_examp": "The waiter and waitress working there are kind and friendly."}]}]}, {"word": "washing machine", "poses": [{"pos": "noun", "senses": [{"sense": "a machine for washing clothes, sheets and other things made of cloth", "level": "A2", "dict_examp": "Could you empty/load the washing machine, please?", "lear_examp": "I want to sell my washing machine."}]}]}, {"word": "walking", "poses": [{"pos": "noun", "senses": [{"sense": "the activity of going for a walk", "level": "A2", "dict_examp": "Walking is good exercise.", "lear_examp": "In conclusion, I think walking is an ideal way of exercise as it combines healthy body and spirit."}]}]}, {"word": "waitress", "poses": [{"pos": "noun", "senses": [{"sense": "a woman who works in a restaurant, bringing food to customers", "level": "A1", "dict_examp": "She's working as a waitress right now.", "lear_examp": "She is a waitress and she likes this job."}]}]}, {"word": "walk", "poses": [{"pos": "verb", "senses": [{"sense": "to move forward by putting one foot in front of the other and then repeating the action", "level": "A1", "dict_examp": "I walked home.", "lear_examp": "I like to walk by the River Exe."}, {"sense": "to walk with someone in order to guide them or keep them safe", "level": "B1", "dict_examp": "He walked me to my house.", "lear_examp": "Then we went to the bar beside the restaurant to have a last drink and he walked me home."}, {"sense": "to walk with a dog to give the dog exercise", "level": "B1", "dict_examp": "I walk the dog twice a day.", "lear_examp": "Well, I suppose in my opinion you should walk the dog three times a day."}]}, {"pos": "noun", "senses": [{"sense": "a trip that you make by walking, often for enjoyment", "level": "A2", "dict_examp": "He had/went for/took a walk to get some air.", "lear_examp": "After dinner we watch television, and sometimes we go for a walk."}, {"sense": "a trip that takes a short time/ten minutes, etc., when you walk", "level": "B2", "dict_examp": "The post office is just a five-minute walk from the house.", "lear_examp": "A fifteen-minute walk was necessary to reach it and there were no neighbors around."}, {"sense": "a path or route where people can walk for enjoyment", "level": "C1", "dict_examp": "There are some lovely walks in the park.", "lear_examp": "The walk ends in Valli del Natisone, but from here there are 2 other different routes that can be chosen."}]}]}, {"word": "wasp", "poses": [{"pos": "noun", "senses": [{"sense": "a black and yellow flying insect that can sting you", "level": "B2", "dict_examp": "There's a wasps' nest in that old tree.", "lear_examp": "We were sitting in the garden and suddenly a wasp entered my T-shirt."}]}]}, {"word": "waste", "poses": [{"pos": "noun", "senses": [{"sense": "an unnecessary or wrong use of money, substances, time, energy, abilities, etc.", "level": "B1", "dict_examp": "That meeting achieved absolutely nothing - it was a complete waste of time.", "lear_examp": "I don't watch much television because I think it's a waste of time."}, {"sense": "unwanted matter or material of any type, often that which is left after useful substances or parts have been removed", "level": "B2", "dict_examp": "hazardous household waste, like leftover paint or insecticides", "lear_examp": "What I did to get it was send them an article based on some possible solutions to the problem of nuclear waste in my local area."}]}, {"pos": "adjective", "senses": [{"sense": "Waste material is no longer needed and can be gotten rid of.", "level": "B1", "dict_examp": "The Japanese recycle more than half of their waste paper.", "lear_examp": "I would really like to help you with picking up waste paper and glass from people's houses."}]}, {"pos": "verb", "senses": [{"sense": "to use too much of something or use something badly when there is a limited amount of it", "level": "B1", "dict_examp": "You waste a lot of water by taking a bath instead of a shower.", "lear_examp": "It's nice to hear that you want to go to Colombia and I'm really happy because I can tell you all the details so you won't waste time and money."}, {"sense": "to be of a type or quality that someone will not understand or enjoy", "level": "C2", "dict_examp": "Good coffee is wasted on Joe - he prefers instant.", "lear_examp": "Many older people can be heard grumbling that youth is wasted on the young, and I can see their point, though obviously I don't agree."}]}]}, {"word": "warm", "poses": [{"pos": "adjective", "senses": [{"sense": "having a temperature between cool and hot", "level": "A1", "dict_examp": "Are you warm enough or should I turn up the heat?", "lear_examp": "I like to go surfing there because the water is warm."}, {"sense": "describes clothes and covers made of a material that keeps you warm", "level": "A2", "dict_examp": "I don't have a warm winter coat.", "lear_examp": "Remember you should wear warm clothes."}, {"sense": "friendly and loving", "level": "B1", "dict_examp": "They're a very warm family.", "lear_examp": "He is warm and friendly."}]}, {"pos": "verb", "senses": [{"sense": "to become warm or make something become warm", "level": "B2", "dict_examp": "When the weather warms up, we'll go camping.", "lear_examp": "After they saved me, I put those gloves on to warm my hands."}]}]}, {"word": "wavelength", "poses": [{"pos": "noun", "senses": [{"sense": "If two people are on the same wavelength, they have the same way of thinking and it is easy for them to understand each other.", "level": "C2", "dict_examp": "We chatted occasionally, but I never really felt we were on the same wavelength.", "lear_examp": "We were on the same wavelength and we therefore started our own research."}]}]}, {"word": "water", "poses": [{"pos": "noun", "senses": [{"sense": "the clear liquid that falls from the sky as rain and is necessary for animal and plant life", "level": "A1", "dict_examp": "hot/cold water", "lear_examp": "You have to bring some food, and a lot of water."}, {"sense": "an area of water, such as the ocean, a lake, or a swimming pool", "level": "A2", "dict_examp": "The water's much warmer today - are you coming for a swim?", "lear_examp": "There are a lot of beautiful beaches with clean water."}, {"sense": "If a building has running water, water comes into  it through pipes.", "level": "C1", "dict_examp": "The summer homes on the island have no running water.", "lear_examp": "It is hilarious to think that at the same time people in the north of Europe were still living a primitive and uncivilized life not even able to invent an axe, the Romans managed to install running water in their huge houses."}, {"sense": "If criticisms, insults, etc., are like water off a duck's back to you, they do not affect you at all.", "level": "C2", "dict_examp": "She calls him lazy and useless, but it's like water off a duck's back.", "lear_examp": "The main lesson I have learned is by looking at some people who have lived alone for most of their life and faced with neither contradiction nor argument, they stay in their ivory tower, so sure of their opinions that whatever you say is like water off a duck's back."}, {"sense": "If you say that an argument doesn't hold water, you mean that it can't be true.", "level": "C2", "dict_examp": "The jury convicted her because her story just didn’t hold water.", "lear_examp": "It remains to us to prove that the opinions of some scientists are far-fetched and don't hold water."}, {"sense": "water from lakes, rivers, etc. that has no salt in it", "level": "C2", "dict_examp": "These fish live in fresh water.", "lear_examp": "You find stunning white beaches, clear, fresh water lakes, isolated tropic islands, reef, rainforests, buzzing cities, challenging mountain range, bush, outback - and the desert."}, {"sense": "to have just enough money to live or to continue a business", "level": "C2", "dict_examp": "With extra income from private sponsorship, the club is just about managing to keep its head above water.", "lear_examp": "I also started to realize how much she had on her plate, how very little help she had and how, at times, she had to struggle just like me to keep her head above water."}]}, {"pos": "verb", "senses": [{"sense": "to pour water on to plants or the soil that they are growing in", "level": "B2", "dict_examp": "I asked my neighbor to water the plants while I'm away.", "lear_examp": "I can spend a lot of time digging, pulling up weeds, watering my plants and pruning the bushes and so on."}, {"sense": "If food makes your mouth water, it makes you want to eat it, sometimes making your mouth produce liquid.", "level": "C2", "dict_examp": "The smells from the kitchen are making my mouth water.", "lear_examp": ""}]}]}, {"word": "waterproof", "poses": [{"pos": "adjective", "senses": [{"sense": "not allowing water to go through", "level": "B2", "dict_examp": "Canvas boots are all right but they're not as waterproof as leather.", "lear_examp": "Also deck shoes and a waterproof jacket for sailing; but besides that will I need any thing else?"}]}]}, {"word": "waterfall", "poses": [{"pos": "noun", "senses": [{"sense": "water, especially from a river or stream, dropping from a higher to a lower point, sometimes from a great height", "level": "B1", "dict_examp": "", "lear_examp": "We walked for an hour and arrived at the waterfall."}]}]}, {"word": "way", "poses": [{"pos": "noun", "senses": [{"sense": "how you do something", "level": "A2", "dict_examp": "There are many ways of solving the problem.", "lear_examp": "I think it's the best way to relax."}, {"sense": "the route you take to get from one place to another", "level": "A2", "dict_examp": "Do you know the way to the train station?", "lear_examp": "The shortest way to get there is going along Sarmiento Avenue."}, {"sense": "used when you say something new or on a different subject", "level": "A2", "dict_examp": "I think we've discussed everything we need to - by the way, what time is it?", "lear_examp": "By the way, I want to buy a raincoat for my brother."}, {"sense": "the direction in which something is facing or travels", "level": "B1", "dict_examp": "\"Which way does the room face?\" \"North.\"", "lear_examp": "Although he had told us he knew this address, he went the wrong way."}, {"sense": "a distance or a period of time", "level": "B1", "dict_examp": "We walked a long way yesterday.", "lear_examp": "I like this best because it is not a long way from home."}, {"sense": "used to tell someone that something is impossible", "level": "B1", "dict_examp": "I'm sorry, but there's no way we can help you.", "lear_examp": "Don't worry, there is no way I'm going to miss it!"}, {"sense": "the manner in which a person lives", "level": "B1", "dict_examp": "Sleeping in hotels three or four nights a week is not an ideal way of life.", "lear_examp": "He told me about his hobbies, his way of life and especially about his love of learning languages."}, {"sense": "used to talk about two possibilities where the result will be the same", "level": "B1", "dict_examp": "You can get there by train or bus - either way it'll take an hour.", "lear_examp": "If that doesn't work, you can ask them to talk to your friends' parents so you could all go together. Either way, I know you will have lots of fun this summer."}, {"sense": "in some way that is not stated", "level": "B2", "dict_examp": "One way or another these bills have to be paid.", "lear_examp": "All of them made a big difference to our personal life and have affected it one way or another."}, {"sense": "in any way that is possible", "level": "B2", "dict_examp": "We have to make a decision one way or the other about what needs to be done.", "lear_examp": "Even if we choose not to use computers personally, many of our transactions with society work through a computer system one way or the other."}, {"sense": "happening in the opposite way", "level": "B2", "dict_examp": "I thought the older people would be more offended than the young people, but it was the other way around.", "lear_examp": "They are controlling us and not the other way around."}, {"sense": "to get to a place", "level": "B2", "dict_examp": "We slowly made our way down the river.", "lear_examp": "She made her way slowly to the waiting room and patiently waited for the train to arrive."}, {"sense": "the complete distance", "level": "B2", "dict_examp": "They ran all the way to school.", "lear_examp": "I drove all the way to Bergen in only one day."}, {"sense": "used to say that you think something is partly true", "level": "B2", "dict_examp": "In a way, I would prefer it if they didn't come because it would mean extra work.", "lear_examp": "I think that many people would like stores to be open all the time, and it might be good in some ways."}, {"sense": "when one thing or feeling changes to a different one", "level": "B2", "dict_examp": "My excitement gave way to fear when I drove a car for the first time.", "lear_examp": "The feeling of anger they first had disappeared and gave way to a feeling of disappointment."}, {"sense": "the manner in which someone behaves or thinks, or in which something happens", "level": "C1", "dict_examp": "Don't be alarmed - it's just his way.", "lear_examp": "To my way of thinking, despite all the problems I have mentioned, this company will succeed."}, {"sense": "similarly", "level": "C1", "dict_examp": "In the same way, there are many citizens who feel unprotected by the police.", "lear_examp": "In the same way, grandmothers may be shocked when seeing their little children wearing extravagant clothes or really short skirts."}, {"sense": "not at all", "level": "C1", "dict_examp": "This is in no way your fault.", "lear_examp": "This magazine will be loved by students as it will help them learn English in the best way and in no way will students find it boring."}, {"sense": "as a type of something", "level": "C1", "dict_examp": "He sent me some flowers by way of apology.", "lear_examp": "The Academy however provided nothing whatsoever by way of entertainment, though with a group of interesting young people and a little imagination this should not be a problem."}, {"sense": "to get what you want, although it might upset other people", "level": "C1", "dict_examp": "She always gets her own way in the end.", "lear_examp": "They are provided with what they desire, and the majority of them are used to getting their own way."}, {"sense": "to do what is easiest in a difficult situation", "level": "C1", "dict_examp": "I know you don't approve of his working methods, but why not take the easy way out this time and agree to his request?", "lear_examp": "On the other hand you cannot survive without your pay-check and to be able to both make a career and have the time to be green, sometimes you just have to take the easy way out."}, {"sense": "the space needed for a particular movement or action", "level": "C2", "dict_examp": "\"Sorry, am I in your way? I'll move.\"", "lear_examp": "As Mark Twain once said \"Don't let school get in the way of your education.\""}, {"sense": "to be successful and make progress in your work", "level": "C2", "dict_examp": "He managed to make his way in the film industry.", "lear_examp": "For each one of the famous sportsmen we recognize on television or in the newspapers, there are thousands of hopeful youngsters trying to make their way to the top."}, {"sense": "to try very hard to do something pleasant for someone", "level": "C2", "dict_examp": "He went out of his way to make us feel welcome.", "lear_examp": ""}, {"sense": "to finish a task or to get rid of something unpleasant", "level": "C2", "dict_examp": "I'll go shopping when I've got this essay out of the way.", "lear_examp": "It was a joyful reunion and everybody was grateful to have all misunderstandings out of the way and to be one big family once more."}, {"sense": "used to say that someone or something does something to a large degree", "level": "C2", "dict_examp": "They celebrate birthdays in a big way.", "lear_examp": "Tourism helps Greece's national economy - which is not at its best - in a big way."}, {"sense": "to be already happening", "level": "C2", "dict_examp": "Building work is already under way.", "lear_examp": "Sociologists are well-aware of the fact and experiments are under way to counterbalance these disadvantages."}, {"sense": "If something gives way, it falls because it is not strong enough to support the weight on top of it.", "level": "C2", "dict_examp": "Suddenly the ground gave way under me.", "lear_examp": "Fred's voice trailed off as he felt his legs give way beneath him."}, {"sense": "to be replaced by someone or something", "level": "C2", "dict_examp": "They knocked down the old houses to make way for a new hotel.", "lear_examp": "Local markets are broken down to make way for shopping malls, which sell items for the brand conscious population of today."}, {"sense": "If something paves the way for something else, it makes the other thing possible.", "level": "C2", "dict_examp": "Scientists hope that data from the probe will pave the way for a more detailed exploration of Mars.", "lear_examp": "Many celebrities engage actively in UN projects and pave the way for others to contribute."}, {"sense": "to learn something by experiencing a lot of problems or difficulty", "level": "C2", "dict_examp": "He doesn’t want to take my advice, so I guess he’ll have to learn the hard way.", "lear_examp": "If you don't know the past, you're liable to live through it again as instead of deriving the lessons from someone else's experiences, you'll have to learn them the hard way, by trial and error."}, {"sense": "to move carefully through a crowded place, changing direction in order to avoid people or things", "level": "C2", "dict_examp": "She threaded her way through the crowd.", "lear_examp": "And if I thread my way through the crowd along the street, I can find almost all things I want to buy, from inexpensive souvenirs to internationally known brands of suits."}]}]}, {"word": "waste", "poses": [{"pos": "noun", "senses": [{"sense": "an unnecessary or wrong use of money, substances, time, energy, abilities, etc.", "level": "B1", "dict_examp": "That meeting achieved absolutely nothing - it was a complete waste of time.", "lear_examp": "I don't watch much television because I think it's a waste of time."}, {"sense": "unwanted matter or material of any type, often that which is left after useful substances or parts have been removed", "level": "B2", "dict_examp": "hazardous household waste, like leftover paint or insecticides", "lear_examp": "What I did to get it was send them an article based on some possible solutions to the problem of nuclear waste in my local area."}]}, {"pos": "adjective", "senses": [{"sense": "Waste material is no longer needed and can be gotten rid of.", "level": "B1", "dict_examp": "The Japanese recycle more than half of their waste paper.", "lear_examp": "I would really like to help you with picking up waste paper and glass from people's houses."}]}, {"pos": "verb", "senses": [{"sense": "to use too much of something or use something badly when there is a limited amount of it", "level": "B1", "dict_examp": "You waste a lot of water by taking a bath instead of a shower.", "lear_examp": "It's nice to hear that you want to go to Colombia and I'm really happy because I can tell you all the details so you won't waste time and money."}, {"sense": "to be of a type or quality that someone will not understand or enjoy", "level": "C2", "dict_examp": "Good coffee is wasted on Joe - he prefers instant.", "lear_examp": "Many older people can be heard grumbling that youth is wasted on the young, and I can see their point, though obviously I don't agree."}]}]}, {"word": "wastebasket", "poses": [{"pos": "noun", "senses": [{"sense": "a small container that stands on the floor and is used for putting pieces of waste materials in", "level": "A2", "dict_examp": "Toss that plastic wrapper  in the wastebasket.", "lear_examp": "I'm sure that whoever found the note pad threw it away into the wastebasket because it was so old and dirty."}]}]}, {"word": "wave", "poses": [{"pos": "verb", "senses": [{"sense": "to raise your hand and move it from side to side in order to attract someone's attention or to say goodbye", "level": "B1", "dict_examp": "I waved to/at him, and he waved back.", "lear_examp": "She waved at me and I smiled."}, {"sense": "to move from side to side in the air or make something move this way", "level": "C1", "dict_examp": "The long grass waved in the breeze.", "lear_examp": "I can picture myself standing in front of the \"Casa Prosada,\" waving my arms and cheering with all the other patriots."}]}, {"pos": "noun", "senses": [{"sense": "a line of higher water that moves across the surface of an area of water, especially the ocean", "level": "B1", "dict_examp": "At night, I listened to the sound of the waves breaking/crashing against the shore.", "lear_examp": "I already know you surf and the waves at Reserva will be huge this weekend so we will surely surf together."}, {"sense": "the pattern in which some types of energy, such as sound, light and heat, are spread or carried", "level": "B2", "dict_examp": "radio waves", "lear_examp": "Indeed, it is thought that using a mobile phone may cause brain damage owing to magnetic waves."}, {"sense": "a group of people or things that arrive or happen together or in a short period of time", "level": "C2", "dict_examp": "There has been a wave of robberies in the region.", "lear_examp": "These people, who belong mostly to the middle class, and some others like explorers ... or youngsters seeking some adventure, produce the big wave of tourists to different countries."}, {"sense": "when you suddenly feel an emotion", "level": "C2", "dict_examp": "She felt a sudden wave of sadness.", "lear_examp": "As he counted the money, a wave of shame and horror hit Berthold."}, {"sense": "to cause problems by asking difficult questions or criticizing", "level": "C2", "dict_examp": "He has earned a reputation for making waves during political campaigns.", "lear_examp": "If we don't want to regret anything, it is time we started to make waves by scrutinizing our history."}, {"sense": "when you raise your hand and move it from side to side in order to attract someone's attention or to say hello or goodbye", "level": "C2", "dict_examp": "She gave a little wave as the train left.", "lear_examp": ""}]}]}, {"word": "watch", "poses": [{"pos": "verb", "senses": [{"sense": "to look at something for a period of time", "level": "A1", "dict_examp": "I had dinner and watched TV for a couple of hours.", "lear_examp": "She works at the Glade and she watches television at night."}, {"sense": "to be careful about something", "level": "B2", "dict_examp": "I have to watch my weight now that I'm not exercising so much.", "lear_examp": "The odd glass of wine is fine but  watch what you eat."}, {"sense": "to be careful", "level": "B2", "dict_examp": "\"Watch out!\" he shouted, but it was too late - she had knocked over the lamp.", "lear_examp": "I definitely know that having a cat brings inconvenience, you have to watch out for your curtains, it can scratch your sofa or your hand, but these are so few problems in comparison with all the affection it can give you."}]}, {"pos": "noun", "senses": [{"sense": "a small clock that is worn on a strap around the wrist", "level": "A1", "dict_examp": "My watch seems to have stopped - it says 10:15 but I'm sure it must be later.", "lear_examp": "I got 2 watches, flowers and some dresses."}]}]}, {"word": "weary", "poses": [{"pos": "adjective", "senses": [{"sense": "very tired", "level": "C2", "dict_examp": "You look weary, my love.", "lear_examp": "On the other hand, if we choose to sleep, it means that we are willing to inject some power in our weary bodies and minds."}, {"sense": "bored with something or someone", "level": "C2", "dict_examp": "She grew weary of the children and their games.", "lear_examp": "The young man was getting weary of being rejected like this, but he was still hoping that she would open her heart to him some day."}]}]}, {"word": "wedding", "poses": [{"pos": "noun", "senses": [{"sense": "a marriage ceremony and any celebrations such as a meal or a party that follow it", "level": "B1", "dict_examp": "a wedding cake/dress/invitation/present/reception", "lear_examp": "Some couples prefer to have a traditional wedding in an old village."}]}]}, {"word": "weather", "poses": [{"pos": "noun", "senses": [{"sense": "the conditions in the air above the Earth such as wind, rain or temperature, especially at a particular time over a particular area", "level": "A1", "dict_examp": "bad/good/cold/dry/hot/stormy/warm/wet weather", "lear_examp": "I need it because the weather is cold."}, {"sense": "to feel ill", "level": "C2", "dict_examp": "I'm feeling a little under the weather this morning.", "lear_examp": "Why do we listen to music every time we are under the weather?  As far as I am concerned, music plays a key role in my life."}]}]}, {"word": "weapon", "poses": [{"pos": "noun", "senses": [{"sense": "any object used in fighting or war, such as a gun, bomb, sword, etc.", "level": "B2", "dict_examp": "chemical/nuclear/biological weapons", "lear_examp": "Technology is used to create new types of weapons."}]}]}, {"word": "weather forecast", "poses": [{"pos": "noun", "senses": [{"sense": "a description of what the weather will be like", "level": "B1", "dict_examp": "Have you heard the weather forecast for tomorrow?", "lear_examp": "The weather forecast is not so good for the next two days: rain and wind."}]}]}, {"word": "Web site", "poses": [{"pos": "noun", "senses": [{"sense": "a set of pages of information on the Internet about a particular subject that have been published by the same person or organization and that often contain color pictures, video, and sound", "level": "A1", "dict_examp": "For more information about other Cambridge titles, visit our Web site at www.cambridge.org.", "lear_examp": "So, don't wait more and phone Peter Morison, from Visualmarket Web site or ask for an interview with him at the following number 56.41.913024."}]}]}, {"word": "wealthy", "poses": [{"pos": "adjective", "senses": [{"sense": "rich", "level": "B2", "dict_examp": "He's a very wealthy man.", "lear_examp": "But how can anyone satisfy a wealthy woman like her without giving her an expensive present?"}]}]}, {"word": "weekday", "poses": [{"pos": "noun", "senses": [{"sense": "one of the five days from Monday to Friday when people usually go to work or school", "level": "A2", "dict_examp": "This road is very busy on weekdays.", "lear_examp": "I can write at the weekends, because I have no time on weekdays."}]}]}, {"word": "webcam", "poses": [{"pos": "noun", "senses": [{"sense": "a camera that records moving pictures and sounds and allows these to be shown on the Internet as they happen", "level": "B1", "dict_examp": "I see my grandchildren via the webcam.", "lear_examp": ""}]}]}, {"word": "weaken", "poses": [{"pos": "verb", "senses": [{"sense": "to become less strong or powerful, or to make someone or something less strong or powerful", "level": "C1", "dict_examp": "A number of factors have weakened the economy.", "lear_examp": "If we get rid of the factories to save the river, it is obvious that our economy will be weakened."}, {"sense": "to become less certain or determined about a decision, or to make someone less determined", "level": "C2", "dict_examp": "I told him I wouldn't give him any more money, but then I weakened.", "lear_examp": "I felt my resistance weaken and at the end of our conversation I said that she could come over for a night but just this night, as I tried to make it very clear to her."}]}]}, {"word": "Web page", "poses": [{"pos": "noun", "senses": [{"sense": "a part of a Web site that can be read on a computer screen", "level": "A2", "dict_examp": "There is a Web page with this information.", "lear_examp": "You can find the art class information on her web page."}]}]}, {"word": "way", "poses": [{"pos": "noun", "senses": [{"sense": "how you do something", "level": "A2", "dict_examp": "There are many ways of solving the problem.", "lear_examp": "I think it's the best way to relax."}, {"sense": "the route you take to get from one place to another", "level": "A2", "dict_examp": "Do you know the way to the train station?", "lear_examp": "The shortest way to get there is going along Sarmiento Avenue."}, {"sense": "used when you say something new or on a different subject", "level": "A2", "dict_examp": "I think we've discussed everything we need to - by the way, what time is it?", "lear_examp": "By the way, I want to buy a raincoat for my brother."}, {"sense": "the direction in which something is facing or travels", "level": "B1", "dict_examp": "\"Which way does the room face?\" \"North.\"", "lear_examp": "Although he had told us he knew this address, he went the wrong way."}, {"sense": "a distance or a period of time", "level": "B1", "dict_examp": "We walked a long way yesterday.", "lear_examp": "I like this best because it is not a long way from home."}, {"sense": "used to tell someone that something is impossible", "level": "B1", "dict_examp": "I'm sorry, but there's no way we can help you.", "lear_examp": "Don't worry, there is no way I'm going to miss it!"}, {"sense": "the manner in which a person lives", "level": "B1", "dict_examp": "Sleeping in hotels three or four nights a week is not an ideal way of life.", "lear_examp": "He told me about his hobbies, his way of life and especially about his love of learning languages."}, {"sense": "used to talk about two possibilities where the result will be the same", "level": "B1", "dict_examp": "You can get there by train or bus - either way it'll take an hour.", "lear_examp": "If that doesn't work, you can ask them to talk to your friends' parents so you could all go together. Either way, I know you will have lots of fun this summer."}, {"sense": "in some way that is not stated", "level": "B2", "dict_examp": "One way or another these bills have to be paid.", "lear_examp": "All of them made a big difference to our personal life and have affected it one way or another."}, {"sense": "in any way that is possible", "level": "B2", "dict_examp": "We have to make a decision one way or the other about what needs to be done.", "lear_examp": "Even if we choose not to use computers personally, many of our transactions with society work through a computer system one way or the other."}, {"sense": "happening in the opposite way", "level": "B2", "dict_examp": "I thought the older people would be more offended than the young people, but it was the other way around.", "lear_examp": "They are controlling us and not the other way around."}, {"sense": "to get to a place", "level": "B2", "dict_examp": "We slowly made our way down the river.", "lear_examp": "She made her way slowly to the waiting room and patiently waited for the train to arrive."}, {"sense": "the complete distance", "level": "B2", "dict_examp": "They ran all the way to school.", "lear_examp": "I drove all the way to Bergen in only one day."}, {"sense": "used to say that you think something is partly true", "level": "B2", "dict_examp": "In a way, I would prefer it if they didn't come because it would mean extra work.", "lear_examp": "I think that many people would like stores to be open all the time, and it might be good in some ways."}, {"sense": "when one thing or feeling changes to a different one", "level": "B2", "dict_examp": "My excitement gave way to fear when I drove a car for the first time.", "lear_examp": "The feeling of anger they first had disappeared and gave way to a feeling of disappointment."}, {"sense": "the manner in which someone behaves or thinks, or in which something happens", "level": "C1", "dict_examp": "Don't be alarmed - it's just his way.", "lear_examp": "To my way of thinking, despite all the problems I have mentioned, this company will succeed."}, {"sense": "similarly", "level": "C1", "dict_examp": "In the same way, there are many citizens who feel unprotected by the police.", "lear_examp": "In the same way, grandmothers may be shocked when seeing their little children wearing extravagant clothes or really short skirts."}, {"sense": "not at all", "level": "C1", "dict_examp": "This is in no way your fault.", "lear_examp": "This magazine will be loved by students as it will help them learn English in the best way and in no way will students find it boring."}, {"sense": "as a type of something", "level": "C1", "dict_examp": "He sent me some flowers by way of apology.", "lear_examp": "The Academy however provided nothing whatsoever by way of entertainment, though with a group of interesting young people and a little imagination this should not be a problem."}, {"sense": "to get what you want, although it might upset other people", "level": "C1", "dict_examp": "She always gets her own way in the end.", "lear_examp": "They are provided with what they desire, and the majority of them are used to getting their own way."}, {"sense": "to do what is easiest in a difficult situation", "level": "C1", "dict_examp": "I know you don't approve of his working methods, but why not take the easy way out this time and agree to his request?", "lear_examp": "On the other hand you cannot survive without your pay-check and to be able to both make a career and have the time to be green, sometimes you just have to take the easy way out."}, {"sense": "the space needed for a particular movement or action", "level": "C2", "dict_examp": "\"Sorry, am I in your way? I'll move.\"", "lear_examp": "As Mark Twain once said \"Don't let school get in the way of your education.\""}, {"sense": "to be successful and make progress in your work", "level": "C2", "dict_examp": "He managed to make his way in the film industry.", "lear_examp": "For each one of the famous sportsmen we recognize on television or in the newspapers, there are thousands of hopeful youngsters trying to make their way to the top."}, {"sense": "to try very hard to do something pleasant for someone", "level": "C2", "dict_examp": "He went out of his way to make us feel welcome.", "lear_examp": ""}, {"sense": "to finish a task or to get rid of something unpleasant", "level": "C2", "dict_examp": "I'll go shopping when I've got this essay out of the way.", "lear_examp": "It was a joyful reunion and everybody was grateful to have all misunderstandings out of the way and to be one big family once more."}, {"sense": "used to say that someone or something does something to a large degree", "level": "C2", "dict_examp": "They celebrate birthdays in a big way.", "lear_examp": "Tourism helps Greece's national economy - which is not at its best - in a big way."}, {"sense": "to be already happening", "level": "C2", "dict_examp": "Building work is already under way.", "lear_examp": "Sociologists are well-aware of the fact and experiments are under way to counterbalance these disadvantages."}, {"sense": "If something gives way, it falls because it is not strong enough to support the weight on top of it.", "level": "C2", "dict_examp": "Suddenly the ground gave way under me.", "lear_examp": "Fred's voice trailed off as he felt his legs give way beneath him."}, {"sense": "to be replaced by someone or something", "level": "C2", "dict_examp": "They knocked down the old houses to make way for a new hotel.", "lear_examp": "Local markets are broken down to make way for shopping malls, which sell items for the brand conscious population of today."}, {"sense": "If something paves the way for something else, it makes the other thing possible.", "level": "C2", "dict_examp": "Scientists hope that data from the probe will pave the way for a more detailed exploration of Mars.", "lear_examp": "Many celebrities engage actively in UN projects and pave the way for others to contribute."}, {"sense": "to learn something by experiencing a lot of problems or difficulty", "level": "C2", "dict_examp": "He doesn’t want to take my advice, so I guess he’ll have to learn the hard way.", "lear_examp": "If you don't know the past, you're liable to live through it again as instead of deriving the lessons from someone else's experiences, you'll have to learn them the hard way, by trial and error."}, {"sense": "to move carefully through a crowded place, changing direction in order to avoid people or things", "level": "C2", "dict_examp": "She threaded her way through the crowd.", "lear_examp": "And if I thread my way through the crowd along the street, I can find almost all things I want to buy, from inexpensive souvenirs to internationally known brands of suits."}]}]}, {"word": "web", "poses": [{"pos": "noun", "senses": [{"sense": "the  connected pages on the Internet, which you can search to find particular information", "level": "A2", "dict_examp": "Jane's been surfing the Web all morning.", "lear_examp": "I especially like surfing on the web."}, {"sense": "a type of net made by a spider to catch insects", "level": "B1", "dict_examp": "a spider's web", "lear_examp": "On the way coming back to the hotel I almost got lost because the underground was like a spider's web."}]}]}, {"word": "we", "poses": [{"pos": "pronoun", "senses": [{"sense": "used as the subject of the verb to refer to the speaker and at least one other person when considered together or as a group", "level": "A1", "dict_examp": "Can we all go to the swimming pool this afternoon?", "lear_examp": "After dinner we want to go shopping."}, {"sense": "used to refer to people generally", "level": "B1", "dict_examp": "The world in which we live today is very different.", "lear_examp": "Why can't we live without computers?"}]}]}, {"word": "Wednesday", "poses": [{"pos": "noun", "senses": [{"sense": "the day of the week after Tuesday and before Thursday", "level": "A1", "dict_examp": "Did you say the meeting is on Wednesday?", "lear_examp": "I come every Wednesday."}]}]}, {"word": "week", "poses": [{"pos": "noun", "senses": [{"sense": "a period of seven days", "level": "A1", "dict_examp": "last/this/next week", "lear_examp": "She visits her parents once a week."}, {"sense": "the five days from Monday to Friday when people usually go to work or school", "level": "A1", "dict_examp": "I don't go out much during the week.", "lear_examp": "My mother has to work during the week."}]}]}, {"word": "weak", "poses": [{"pos": "adjective", "senses": [{"sense": "not physically strong", "level": "B1", "dict_examp": "He was feeling weak after his cancer treatment.", "lear_examp": "I'm very worried because Boby isn't a big dog, and in this period he was very weak because he had some problems with a leg so I hope that he is fine!"}, {"sense": "not good at something", "level": "B1", "dict_examp": "She reads well, but her spelling is weak.", "lear_examp": "Listening is my weak point so I have to improve."}, {"sense": "not powerful, or not having a strong character", "level": "B2", "dict_examp": "a weak leader/government", "lear_examp": "At the beginning of the story, Mary seemed to be a weak person, but in the end she demonstrated that she could overcome her fears in order to protect someone."}, {"sense": "A weak reason, argument, or excuse is one that you do not have enough proof to support.", "level": "B2", "dict_examp": "He gave the weakest excuse for why he was late.", "lear_examp": ""}, {"sense": "not able to support heavy things", "level": "B2", "dict_examp": "a weak bridge", "lear_examp": ""}, {"sense": "containing little taste or alcohol", "level": "B2", "dict_examp": "weak coffee/beer", "lear_examp": ""}, {"sense": "difficult to see or hear", "level": "B2", "dict_examp": "He spoke in a weak voice.", "lear_examp": "I could hardly see with the weak light of the candle and I couldn't remember the last time I had used it."}, {"sense": "likely to fail", "level": "C1", "dict_examp": "a weak economy", "lear_examp": "A very difficult aspect currently is our weak economy, we could nearly speak of a recession."}]}]}, {"word": "wealth", "poses": [{"pos": "noun", "senses": [{"sense": "a large amount of money or valuable possessions that someone has", "level": "B2", "dict_examp": "During a successful business career, she accumulated a great amount of wealth.", "lear_examp": "On the other hand, having a mobile phone can also create social distinctions between people as it can be a sign of wealth."}, {"sense": "a large amount of something good", "level": "C2", "dict_examp": "a wealth of experience/information", "lear_examp": "One of the advantages often mentioned is that old people have a wealth of experience, gained throughout life."}]}]}, {"word": "weakness", "poses": [{"pos": "noun", "senses": [{"sense": "when someone or something is not strong or powerful", "level": "B2", "dict_examp": "Asking for help is not a sign of weakness.", "lear_examp": "I believe that I'll be able to cover my physical weakness with my experience and knowledge."}, {"sense": "a particular part or quality of someone or something that is not good or effective", "level": "B2", "dict_examp": "There are definite weaknesses in their security arrangements.", "lear_examp": "However, I have to complain about a few weaknesses in this festival."}, {"sense": "to like a particular thing or person very much", "level": "C2", "dict_examp": "She has a real weakness for ice cream.", "lear_examp": ""}]}]}, {"word": "weed", "poses": [{"pos": "noun", "senses": [{"sense": "a wild plant that you do not want to grow in your yard, garden, or field", "level": "C2", "dict_examp": "Dandelions are common weeds.", "lear_examp": "A loose shutter was tapping against the wall, he walked over to close it and from the window he saw the garden overgrown with weeds."}]}]}, {"word": "wear", "poses": [{"pos": "verb", "senses": [{"sense": "to have clothing, jewelery, etc. on your body", "level": "A1", "dict_examp": "Tracey is wearing a simple black dress.", "lear_examp": "She likes to wear new clothes."}, {"sense": "to arrange or grow your hair in a particular way", "level": "B2", "dict_examp": "She usually wears her hair in a ponytail.", "lear_examp": "I now wear my long hair loose and I dyed it black."}, {"sense": "to show a particular emotion on your face.", "level": "C2", "dict_examp": "He was wearing a smile/frown.", "lear_examp": "She was wearing a big smile on her face that reflected happiness."}, {"sense": "If a feeling or explanation starts to wear thin, it becomes weaker or harder to accept.", "level": "C2", "dict_examp": "I've warned you several times about being late and my patience is wearing thin.", "lear_examp": "Hardly could they fight against others, when their own convictions had started to wear thin."}, {"sense": "If a feeling or effect wears off, it gradually disappears.", "level": "B2", "dict_examp": "The injection the dentist gave me is starting to wear off.", "lear_examp": "And Jim, has his passion for you finally worn off?"}, {"sense": "to use something so much that it is damaged and cannot be used any more, or to become damaged in this way", "level": "B1", "dict_examp": "He's already worn out two pairs of shoes this year.", "lear_examp": "My shoes are worn out too! I have to get new ones."}, {"sense": "to make someone extremely tired", "level": "B2", "dict_examp": "Standing up all day is wearing me out.", "lear_examp": "This does not mean that we have to spend hours in the gym and get home worn out."}]}]}, {"word": "well-equipped", "poses": [{"pos": "adjective", "senses": [{"sense": "having plenty of good quality equipment", "level": "C1", "dict_examp": "He has a very well-equipped kitchen.", "lear_examp": "There is a well-equipped gym which is supervised by experienced staff."}]}]}, {"word": "well-built", "poses": [{"pos": "adjective", "senses": [{"sense": "having a large, strong body", "level": "B2", "dict_examp": "He was a well-built man, in his forties.", "lear_examp": "When I was twenty three years old, I was married to a handsome, well-built business man."}]}]}, {"word": "weird", "poses": [{"pos": "adjective", "senses": [{"sense": "very strange and unusual, unexpected or not natural", "level": "B2", "dict_examp": "Her boyfriend's a little weird, but she's all right.", "lear_examp": "She was hearing all sorts of weird noises."}]}]}, {"word": "well-qualified", "poses": [{"pos": "adjective", "senses": [{"sense": "having suitable experience or formal qualifications", "level": "C1", "dict_examp": "He seems well-qualified for the job.", "lear_examp": "That is why foreign employers look for well-qualified Polish specialists."}]}]}, {"word": "well-being", "poses": [{"pos": "noun", "senses": [{"sense": "when someone is healthy, happy, and comfortable", "level": "C1", "dict_examp": "I found that yoga increased my sense of well-being.", "lear_examp": "The beautiful countryside which surrounds the fields can generate a feeling of well-being and make exercise more pleasant."}]}]}, {"word": "well-paid", "poses": [{"pos": "adjective", "senses": [{"sense": "earning a lot of money", "level": "B2", "dict_examp": "a well-paid job", "lear_examp": "She had an interesting and well-paid job in Paris as a fashion model."}]}]}, {"word": "weep", "poses": [{"pos": "verb", "senses": [{"sense": "to cry, usually because you are sad", "level": "C2", "dict_examp": "She covered her face with her hands and wept.", "lear_examp": "Still weeping, Mary felt a tiny little hand on her arm and stared at it in astonishment."}]}]}, {"word": "welfare", "poses": [{"pos": "noun", "senses": [{"sense": "Someone's welfare is their health and happiness.", "level": "B2", "dict_examp": "We were concerned for our parents’ welfare when we heard about the storm in Florida.", "lear_examp": "To take care of the visitor's wishes must be a priority: his welfare has to be enforced by structural measures (facilities, services, activities) and cultural ones."}, {"sense": "help, especially money, given by the government to people who are poor or do not have jobs", "level": "C2", "dict_examp": "She works in child welfare.", "lear_examp": "The fact is, many people now are on welfare and that keep them quiet."}]}]}, {"word": "weekly", "poses": [{"pos": "adjective", "senses": [{"sense": "happening once a week or every week", "level": "A2", "dict_examp": "a weekly magazine/report", "lear_examp": "I also read magazines and newspapers to get information about daily and weekly events."}]}]}, {"word": "weekend", "poses": [{"pos": "noun", "senses": [{"sense": "Saturday and Sunday, or Friday evening until Sunday night; the part of the week when many people do not work", "level": "A1", "dict_examp": "Do you have anything planned for the weekend?", "lear_examp": "On weekends she goes to visit her uncle."}]}]}, {"word": "well-informed", "poses": [{"pos": "adjective", "senses": [{"sense": "knowing a lot of useful information", "level": "C1", "dict_examp": "A well-informed visitor to our museum brought this error to our attention.", "lear_examp": "They are people with a wide range of interests, thus we should try to keep them well-informed."}]}]}, {"word": "well-balanced", "poses": [{"pos": "adjective", "senses": [{"sense": "A well-balanced diet or meal  includes all the different types of food that the body needs to be healthy.", "level": "B2", "dict_examp": "I try to have a well-balanced diet.", "lear_examp": "So my advice for you would be to try and have some break times during the day, do  some sports and follow a well-balanced diet."}, {"sense": "Well-balanced people are calm and have good judgment.", "level": "C1", "dict_examp": "She's very well-balanced considering her past.", "lear_examp": "Linda has a good temper, is well-balanced and is able to cope with unforeseen or complicated situations."}]}]}, {"word": "weight", "poses": [{"pos": "noun", "senses": [{"sense": "the amount that something or someone weighs", "level": "B1", "dict_examp": "He's about average height and weight.", "lear_examp": "So let me describe Fabian: he has brown hair and his weight is about 75 kg."}, {"sense": "the quality of being heavy", "level": "B2", "dict_examp": "The shelf collapsed under the weight of the books.", "lear_examp": "The weight of the snow broke the branches of the trees."}, {"sense": "something that  is heavy", "level": "B2", "dict_examp": "Try not to lift heavy weights.", "lear_examp": "... my long training periods in lifting weights."}, {"sense": "to work as hard as other people in a group", "level": "C2", "dict_examp": "The rest of the team complained that Sarah wasn't pulling her weight.", "lear_examp": "For instance, before your kin get all nice and comfortable, you could ask them to pull their weight around the house by doing a few jobs."}, {"sense": "to be considered important and effective in influencing someone", "level": "C2", "dict_examp": "His opinions carry a lot of weight with the scientific community.", "lear_examp": "It has become increasingly important to strive for near perfection in every move they make, the pursuit of excellence therefore carrying more weight than ever and leading to strenuous training programs."}]}]}, {"word": "well-off", "poses": [{"pos": "adjective", "senses": [{"sense": "having a lot of money", "level": "C1", "dict_examp": "His well-off parents sent him to a very expensive school.", "lear_examp": "If you belong to a well-off family then you are considered lucky, but if you are not this, good luck to you."}]}]}, {"word": "weigh", "poses": [{"pos": "verb", "senses": [{"sense": "to have a heaviness of a stated amount, or to measure the heaviness of an object", "level": "B1", "dict_examp": "How much do you weigh?", "lear_examp": "You can see monkeys that weigh only 100g."}, {"sense": "to consider something carefully, especially in order to make a decision", "level": "B2", "dict_examp": "He needs to weigh  the pros and cons of going to college.", "lear_examp": "Having weighed the pros and cons, I thought you ought to be conscious of the fact that... you're working too hard."}]}]}, {"word": "well-dressed", "poses": [{"pos": "adjective", "senses": [{"sense": "wearing attractive, good-quality clothes", "level": "B1", "dict_examp": "She is a very well-dressed woman.", "lear_examp": "It is a party for the students who take part in the conference, so you do not need to be well-dressed."}]}]}, {"word": "well-known", "poses": [{"pos": "adjective", "senses": [{"sense": "famous", "level": "A2", "dict_examp": "a well-known actor/artist/film star/singer", "lear_examp": "I would like to suggest we invite some well-known artists to next year's festival."}]}]}, {"word": "well-educated", "poses": [{"pos": "adjective", "senses": [{"sense": "having had a good education", "level": "C1", "dict_examp": "We have some very well-educated employees in the department.", "lear_examp": "Increasing numbers of well-educated young people are compelled to stay at home."}]}]}, {"word": "well-organized", "poses": [{"pos": "adjective", "senses": [{"sense": "working in an effective and successful way because of good organization", "level": "B2", "dict_examp": "She's always extremely well-organized at work.", "lear_examp": "The events that I had attended were well-organized and were highly entertaining in many ways."}]}]}, {"word": "welcome", "poses": [{"pos": "exclamation", "senses": [{"sense": "said as a greeting to someone arriving at a place", "level": "A2", "dict_examp": "Welcome - please come in.", "lear_examp": "Wendy, welcome to my town."}]}, {"pos": "verb", "senses": [{"sense": "to greet someone who has arrived in a  place", "level": "B1", "dict_examp": "Both families were there to welcome us.", "lear_examp": "First, the president welcomed me and gave me my membership card."}, {"sense": "to be pleased about something and encourage or support it", "level": "B2", "dict_examp": "The decision has been widely welcomed.", "lear_examp": "The time will arrive when all of us will accept and welcome this \"beautiful machine\"! the computer"}]}, {"pos": "adjective", "senses": [{"sense": "said as a polite answer when someone thanks you for doing something", "level": "A2", "dict_examp": "\"It was very nice of you to help.\" \"You're welcome.\"", "lear_examp": ""}, {"sense": "If you are welcome, people are pleased that you are there.", "level": "B1", "dict_examp": "You will always be welcome here.", "lear_examp": "You know that you are very welcome in my country."}, {"sense": "used to tell someone that they can certainly do something, if they want to", "level": "B1", "dict_examp": "Anyone who is interested is welcome to come along.", "lear_examp": "You're very welcome to join too if you want."}, {"sense": "If something is welcome, people are pleased about it and want it to happen.", "level": "B2", "dict_examp": "a welcome change", "lear_examp": "And, since all these new things only make our life easier, technology is welcome."}]}, {"pos": "noun", "senses": [{"sense": "when someone is met and spoken to in a friendly way when they arrive in a place", "level": "B1", "dict_examp": "They were given a warm welcome.", "lear_examp": "Dear Bertha, Once again I want to thank you very much for your hospitality and the warm welcome you gave me."}, {"sense": "to stay somewhere too long so that people want you to leave", "level": "C2", "dict_examp": "I don't want to outstay my welcome.", "lear_examp": ""}]}]}, {"word": "well", "poses": [{"pos": "adverb", "senses": [{"sense": "in a successful or satisfactory way", "level": "A1", "dict_examp": "I thought the team played well.", "lear_examp": "I play guitar very well and I love rock!"}, {"sense": "in addition (to)", "level": "A1", "dict_examp": "Are you going to invite Steve as well?", "lear_examp": "Dylma goes to school every day and works as well."}, {"sense": "in a complete way or as much as possible", "level": "A2", "dict_examp": "Stir the mixture well.", "lear_examp": "I live in the capital city. ... I know it very well and it will be a pleasure to guide you around."}, {"sense": "used to say that something is likely to be true", "level": "B2", "dict_examp": "She might well be the best person to ask.", "lear_examp": "Laura could well imagine  that she would stand opposite the examiners and not answer any question in the right way."}, {"sense": "used to emphasize some adjectives", "level": "B2", "dict_examp": "The police are well aware of the situation.", "lear_examp": "Finally I would like to recommend a visit to Lampton Castle; in addition to the paintings and furniture there is now a new collection of musical instruments, which is well worth seeing."}, {"sense": "used to emphasize some prepositions", "level": "C1", "dict_examp": "The results are well above/below what we expected.", "lear_examp": "The hospital received well over 80% of the profits, and that as you can see is much more than just 60%."}, {"sense": "If you may/might as well do something, it will not spoil the situation if you do that thing.", "level": "C1", "dict_examp": "If we're not waiting for Karen, we might as well go now.", "lear_examp": "I might as well go with her and if you like, you can join us too."}, {"sense": "used to say that something is not a suitable or practical thing to do", "level": "C2", "dict_examp": "I couldn't very well tell her while he was there.", "lear_examp": "I couldn't very well tell her that without my diaries, I'd be lost and not know who I was."}, {"sense": "to intend to be helpful or kind but cause problems instead", "level": "C2", "dict_examp": "He means well, but he keeps trying to help with things he doesn't really understand.", "lear_examp": "Although these fans might mean well, in many cases they do not appear to realize that their \"heroes\" perhaps would like to be left alone."}]}, {"pos": "adjective", "senses": [{"sense": "healthy; not sick", "level": "A1", "dict_examp": "\"How are you?\" \"Very well, thanks.\"", "lear_examp": "How are you? I'm very well."}, {"sense": "everything is in a good or acceptable state", "level": "B1", "dict_examp": "I hope all is well with Jack.", "lear_examp": "I hope all's well."}, {"sense": "used to say it is good or useful that something happened in a particular way", "level": "C1", "dict_examp": "It's just as well we brought an umbrella.", "lear_examp": "All these things more than compensated for there not really being anything much to do in the evenings.  Maybe that was just as well, because both the travel costs and my own pocket money expenditure had exceed the amount of money I had intended to spend."}, {"sense": "used to show that you do not agree with something or that you are annoyed about something", "level": "C1", "dict_examp": "It's all very well for her to say everything's fine, she doesn't have to live here.", "lear_examp": "That's all very well for most of the people but according to my desires it's not enough."}]}, {"pos": "exclamation", "senses": [{"sense": "used at the beginning of a sentence to pause slightly or to express doubt or disagreement", "level": "A1", "dict_examp": "\"You'll go, won't you?\"  \"Well, I'm not sure.\"", "lear_examp": "Well, my friend, I have just seen this film but I can see it again."}, {"sense": "used to say that a situation cannot be changed although it might be disappointing", "level": "B1", "dict_examp": "Oh well, it doesn't matter; I can always buy another one.", "lear_examp": "I always dreamed of going sailing, but not even a little boat is left, some other people have already booked them!  Oh well."}]}]}, {"word": "wet", "poses": [{"pos": "adjective", "senses": [{"sense": "covered in water or another liquid", "level": "A2", "dict_examp": "a wet floor", "lear_examp": "Yesterday I was at the swimming pool and I got out with wet hair."}, {"sense": "describes weather or periods of time when rain falls", "level": "A2", "dict_examp": "We've had wet weather all week.", "lear_examp": "The last thing I bought was a jacket because of the cold and wet weather here."}, {"sense": "describes paint, ink, or a similar substance when it has not had time to dry and become hard", "level": "B1", "dict_examp": "The paint's still wet.", "lear_examp": ""}]}]}, {"word": "what", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to ask for information about something", "level": "A1", "dict_examp": "What did you wear?", "lear_examp": "What do you think about that?"}, {"sense": "used when suggesting or offering something to someone", "level": "A2", "dict_examp": "What about a trip to the zoo this afternoon?", "lear_examp": "I would love to see the film. What about Friday?"}, {"sense": "used to refer to something without naming it", "level": "B1", "dict_examp": "Do you know what I mean?", "lear_examp": "I don't know what to do now."}, {"sense": "used to ask for someone's opinion on a particular subject", "level": "B1", "dict_examp": "What  about Ava - is she nice?", "lear_examp": "I also enjoy shopping for shoes, what about you?"}, {"sense": "used to ask about something that could happen in the future, especially something bad", "level": "B1", "dict_examp": "What if the train's late?", "lear_examp": "What if the children were in trouble?"}, {"sense": "used to ask how things are with someone", "level": "B1", "dict_examp": "What's up? Nice to see you again.", "lear_examp": "Hi Teresa What's up? I am good."}, {"sense": "used to ask about the reason for something", "level": "B2", "dict_examp": "What are these tools for?", "lear_examp": "People love spending hours in their stuffy cars, getting stuck in traffic jams and breathing polluted air. What for?"}, {"sense": "used to add something surprising or interesting to what you have just said", "level": "B2", "dict_examp": "They turned up nearly an hour late, and what's more, they didn't bring anything!", "lear_examp": "What is more, I will have an opportunity to visit the most exotic countries."}, {"sense": "used to talk about the reasons for a particular situation, especially a bad or difficult situation", "level": "C2", "dict_examp": "I'm tired, what with traveling all day yesterday and sleeping badly.", "lear_examp": "The energy of a crowd like that is amazing, what with people jumping up and down, singing their lungs out and pushing each other around."}]}, {"pos": "determiner", "senses": [{"sense": "used to ask for information about something", "level": "A1", "dict_examp": "What time is it?", "lear_examp": "What time would you like to come?"}, {"sense": "used to give your opinion, especially when you have strong feelings about something", "level": "B1", "dict_examp": "What nonsense!", "lear_examp": "Last Saturday we decided to watch the film \"Pinocchio\" by Roberto Benigni. What a beautiful soundtrack!  What an interesting fable!"}]}]}, {"word": "whale", "poses": [{"pos": "noun", "senses": [{"sense": "a very large sea mammal that breathes air through a hole at the top of its head", "level": "B1", "dict_examp": "", "lear_examp": "You could also go to Cordoba which is a place similar to Tandil or to ... Patagonia to fish and see the whales."}]}]}, {"word": "whatever", "poses": [{"pos": "pronoun", "senses": [{"sense": "anything or everything", "level": "B1", "dict_examp": "The children are allowed to do whatever they want.", "lear_examp": "I think people should wear whatever they want to."}, {"sense": "used to say that what happens is not important because it does not change a situation", "level": "B2", "dict_examp": "Whatever happens, you know that I'll stand by you.", "lear_examp": "Whatever you decide, I hope you enjoy a wonderful summer."}, {"sense": "or other things of the same kind", "level": "B2", "dict_examp": "If you need to wash, or whatever, we can meet you later.", "lear_examp": ""}]}, {"pos": "determiner", "senses": [{"sense": "used to say that what happens is not important because it does not change a situation", "level": "B2", "dict_examp": "We'll go whatever the weather.", "lear_examp": "Whatever you decide, I hope you enjoy a wonderful summer."}]}]}, {"word": "wherever", "poses": [{"pos": "conjunction", "senses": [{"sense": "in or to any or every place", "level": "B1", "dict_examp": "You can sit wherever you like.", "lear_examp": "I will be able to take you wherever you want in a matter of minutes."}, {"sense": "every time it is possible", "level": "B2", "dict_examp": "Wherever possible I use honey instead of sugar.", "lear_examp": "We can work together in a number of ways, for example, we can plant trees wherever possible and we can place bins in the necessary areas which will help the public to dispose of waste items."}]}]}, {"word": "whether", "poses": [{"pos": "conjunction", "senses": [{"sense": "used especially in reporting questions and when expressing doubt to mean if", "level": "B1", "dict_examp": "I wasn't sure whether you'd like it.", "lear_examp": "It's very expensive and I'm so broke that I don't know whether I can afford to buy one."}, {"sense": "used to talk about a choice between two or more possibilities", "level": "B1", "dict_examp": "I'm going, whether she likes it or not.", "lear_examp": "I don't know whether to stay or to go."}]}]}, {"word": "wheelchair", "poses": [{"pos": "noun", "senses": [{"sense": "a chair with wheels used by someone who cannot walk", "level": "B1", "dict_examp": "My brother uses a wheelchair.", "lear_examp": "In the hospital, I was sentenced to be confined to a wheelchair for the rest of my life."}]}]}, {"word": "whatsoever", "poses": [{"pos": "adverb", "senses": [{"sense": "none at all", "level": "C1", "dict_examp": "There's no evidence whatsoever that she was involved.", "lear_examp": "Moreover, the hotel we were finally dumped in was situated miles from Edinburgh city center and there was no entertainment whatsoever arranged for the evening, even though all the travelers were more or less stuck there."}]}]}, {"word": "western", "poses": [{"pos": "adjective", "senses": [{"sense": "in or from the west part of an area", "level": "B1", "dict_examp": "western Europe", "lear_examp": "It is in the western part of Kyoto."}, {"sense": "relating to countries in the west part of the world, especially North America and countries in the west of Europe", "level": "B1", "dict_examp": "western opinion/culture", "lear_examp": "Nowadays, most young people would like to wear suits and dresses like Westerners because, they're more interested in western culture."}]}]}, {"word": "wheel", "poses": [{"pos": "noun", "senses": [{"sense": "a circular object fixed under a vehicle so that it moves smoothly over the ground", "level": "A2", "dict_examp": "My bike needs a new wheel.", "lear_examp": "I ride my bicycle every day, but now its front wheel is broken."}, {"sense": "a steering wheel", "level": "B2", "dict_examp": "You should keep both hands on the wheel when driving.", "lear_examp": "On the continent Barbara and I took turns at the wheel and early next morning we reached the Spanish border."}]}]}, {"word": "where", "poses": [{"pos": "adverb", "senses": [{"sense": "used to ask about the place or position of someone or something", "level": "A1", "dict_examp": "Where does he live?", "lear_examp": "Where is the college?"}, {"sense": "what someone thinks about you, how they expect you to behave, and how they are likely to behave", "level": "C2", "dict_examp": "He didn’t even send me a birthday card, so I guess I know where I stand.", "lear_examp": ""}, {"sense": "what your opinion is about something", "level": "C2", "dict_examp": "The Senator has made it clear where she stands on these issues.", "lear_examp": "From where I stand, some action must be taken urgently because the problems are constantly exacerbating."}]}, {"pos": "conjunction", "senses": [{"sense": "at, in or to a place or position", "level": "A2", "dict_examp": "I've been meaning to ask you where you get your hair cut.", "lear_examp": "I need to know where I can study French."}, {"sense": "used when referring to a particular stage in a process or activity", "level": "B2", "dict_examp": "You reach a point in any project where you just want to get the thing finished.", "lear_examp": "We've come to a point where we have forgotten how to read or talk to each other."}]}]}, {"word": "whereabouts", "poses": [{"pos": "adverb", "senses": [{"sense": "used to ask in what place or area someone or something is", "level": "C2", "dict_examp": "Whereabouts does he live?", "lear_examp": ""}]}, {"pos": "noun", "senses": [{"sense": "the place where someone or something is", "level": "C2", "dict_examp": "His whereabouts are unknown.", "lear_examp": "However, his whereabouts have been unknown for 6 years."}]}]}, {"word": "when", "poses": [{"pos": "adverb", "senses": [{"sense": "used to ask at what time something happened or will happen", "level": "A1", "dict_examp": "\"I did tell you about it.\" \"When? I don't remember.\"", "lear_examp": "When are you coming to my house?"}]}, {"pos": "conjunction", "senses": [{"sense": "used to say at what time something happened or will happen", "level": "A2", "dict_examp": "I found it when I was cleaning out the cupboards.", "lear_examp": "Anyway, when I finish my exam I can visit you or you visit me."}, {"sense": "used to say something that is surprising after what has already been said", "level": "B2", "dict_examp": "He says he doesn't have any money when in fact he has thousands of dollars in his account.", "lear_examp": "In your advertisement it was said that I would find stars and artists from around the world, when, in fact, they were from only six countries."}]}]}, {"word": "whenever", "poses": [{"pos": "conjunction", "senses": [{"sense": "every time or any time", "level": "B1", "dict_examp": "Whenever I go there they seem to be out.", "lear_examp": "I read whenever I can, specially at night."}, {"sense": "every time it is possible", "level": "B2", "dict_examp": "I try to use olive oil whenever possible.", "lear_examp": "My friends have always regarded me as a cheerful, active girl, who is glad to help out whenever possible."}]}, {"pos": "adverb", "senses": [{"sense": "every time or any time", "level": "C2", "dict_examp": "\"Will it be okay if I do it tomorrow?\" \"Sure, whenever.\"", "lear_examp": ""}]}]}, {"word": "whereby", "poses": [{"pos": "adverb", "senses": [{"sense": "by which", "level": "C2", "dict_examp": "They've introduced a system whereby people can pay back their loans slowly over time.", "lear_examp": "Those in favor of separating the genders quote studies whereby boys demonstrate better results in school without the distraction of having the fairer sex around."}]}]}, {"word": "west", "poses": [{"pos": "noun", "senses": [{"sense": "the direction that you face to see the sun go down", "level": "A2", "dict_examp": "The points of the compass are North, South, East and West.", "lear_examp": ""}, {"sense": "the part of an area that is further toward the west than the rest", "level": "A2", "dict_examp": "We live in the west of the city.", "lear_examp": "It is situated in the west of the town and it is near the sea."}, {"sense": "the countries of North America and western Europe", "level": "B2", "dict_examp": "There has been concern in/throughout the West about the effects of this measure.", "lear_examp": ""}]}, {"pos": "adjective", "senses": [{"sense": "in or forming the west part of something", "level": "A2", "dict_examp": "the west coast of Canada", "lear_examp": "I most enjoyed Bergen, which is on the west coast of Norway."}]}, {"pos": "adverb", "senses": [{"sense": "toward the west", "level": "A2", "dict_examp": "We traveled west.", "lear_examp": ""}]}]}, {"word": "wheat", "poses": [{"pos": "noun", "senses": [{"sense": "a plant whose yellowish brown grain is used for making flour, or the grain itself", "level": "B2", "dict_examp": "wheat fields", "lear_examp": "In the painting, a man and woman are sleeping in a wheat field."}]}]}, {"word": "whereas", "poses": [{"pos": "conjunction", "senses": [{"sense": "compared with the fact that", "level": "B2", "dict_examp": "He must be about sixty, whereas his wife looks about thirty.", "lear_examp": "For example, it takes two hours by plane from Switzerland to Spain, whereas it takes approximately one day by train."}]}]}, {"word": "whistle", "poses": [{"pos": "verb", "senses": [{"sense": "to make a sound by breathing air out through a small hole made with your lips, or through a whistle", "level": "B2", "dict_examp": "On the days when she wore a skirt the men on the building site would whistle at her.", "lear_examp": "I stood up and many of my companions clapped their hands, although some of them whistled in a very rude way."}]}, {"pos": "noun", "senses": [{"sense": "a small, simple instrument that makes a sound when you blow through it", "level": "B2", "dict_examp": "The referee blew his whistle to end the game.", "lear_examp": "I was so nervous and I was thinking about that scream and those whistles, so I decided to go outside to have a look."}]}]}, {"word": "whoever", "poses": [{"pos": "pronoun", "senses": [{"sense": "the person who", "level": "B2", "dict_examp": "Whoever broke the window will have to pay for it.", "lear_examp": "I have to admit that whoever invented cars  produced the best invention in the world."}, {"sense": "used to say that it is not important which person or group does something", "level": "B2", "dict_examp": "Can whoever leaves last please lock up?", "lear_examp": "The main advantage is obvious - you can communicate whenever you want with whoever you want and wherever you are."}]}]}, {"word": "white", "poses": [{"pos": "adjective", "senses": [{"sense": "being the color of snow or milk", "level": "A1", "dict_examp": "a white T-shirt", "lear_examp": "Do not wear white clothes!"}, {"sense": "White wine is a pale yellow color.", "level": "A2", "dict_examp": "Would you prefer red or white wine?", "lear_examp": "Please don't bring anything or if you want to, bring one bottle of white wine."}, {"sense": "Someone who is white has skin that is pale in color.", "level": "B1", "dict_examp": "He had a black mother and a white father.", "lear_examp": "He had just been beaten by a group of white men."}, {"sense": "having a pale face because you are ill or you are feeling shocked", "level": "C2", "dict_examp": "He was white with shock.", "lear_examp": "However, when she opened the door, her face went white."}, {"sense": "relating to white people", "level": "C2", "dict_examp": "the white community", "lear_examp": "As most British in those days, his private life lay in a small circle of the white community."}]}, {"pos": "noun", "senses": [{"sense": "the color  of snow or milk", "level": "A2", "dict_examp": "In some countries it is traditional for a bride to wear white.", "lear_examp": "Robbie, we will paint my bedroom in the color white."}]}]}, {"word": "why", "poses": [{"pos": "adverb", "senses": [{"sense": "used to ask about the reason for something", "level": "A1", "dict_examp": "\"I'm going home.\" \"Why?\"", "lear_examp": "Why couldn't you come?"}, {"sense": "used to make a suggestion", "level": "A2", "dict_examp": "Why don't you come with us?", "lear_examp": "Why don't we play tennis?"}, {"sense": "used to talk about the reason for something", "level": "B1", "dict_examp": "I don't know why she isn't here.", "lear_examp": "Also, you didn't say why the photography and painting courses were so popular."}, {"sense": "used to agree with something that someone has suggested", "level": "B1", "dict_examp": "\"Let's get some ice cream.\"  \"Sure, why not?\"", "lear_examp": "She said, I have two tickets for a new film with Tom Cruise - would you like to come with me? Well I said why not, so I went with her to see this film."}]}]}, {"word": "whom", "poses": [{"pos": "pronoun", "senses": [{"sense": "used instead of 'who' as the object of a verb or preposition", "level": "B2", "dict_examp": "I met a man with whom I used to work.", "lear_examp": "This is just to let you know with whom I worked."}]}]}, {"word": "wide", "poses": [{"pos": "adjective", "senses": [{"sense": "having a larger distance from one side to the other than is usual or expected", "level": "A2", "dict_examp": "a wide river/road", "lear_examp": "I'm going to stay here two weeks in a big hotel near a wide river."}, {"sense": "having a distance of 5 miles/10 feet, etc. from one side to the other", "level": "B1", "dict_examp": "The swimming pool is 20 feet wide.", "lear_examp": "From the two meters wide window I can overlook the city and the lake."}, {"sense": "a lot of different types of thing", "level": "B1", "dict_examp": "The library has a wide range of information.", "lear_examp": "There is a very wide choice of activities!"}]}, {"pos": "adverb", "senses": [{"sense": "farther than usual or as far as possible", "level": "B2", "dict_examp": "She ran toward me, her arms open wide.", "lear_examp": "She came into the living room and saw me standing on the stairs with my eyes opened wide."}, {"sense": "to be completely awake", "level": "C2", "dict_examp": "\"Is Oliver awake yet?\" \"Yes, he's wide  awake and running around his bedroom.\"", "lear_examp": "Sometimes, when I have put my children to bed, half an hour later an aircraft flies over and my two-year-old daughter is wide awake again."}]}]}, {"word": "whole", "poses": [{"pos": "adjective", "senses": [{"sense": "complete, including every part", "level": "A2", "dict_examp": "I spent the whole day cleaning.", "lear_examp": "Did you know that almost the whole class came to my party."}]}, {"pos": "noun", "senses": [{"sense": "generally", "level": "B1", "dict_examp": "We've had a few problems, but on the whole we're very happy.", "lear_examp": "On the whole I don't like watching television."}, {"sense": "when considered as a group and not in parts", "level": "B2", "dict_examp": "The population as a whole is getting healthier.", "lear_examp": "To sum up, I can say that the greatest ever invention is the invention of computers, that has affected both individuals and society as a whole."}]}, {"pos": "adverb", "senses": [{"sense": "as a single object and not in pieces", "level": "C2", "dict_examp": "The baby bird swallowed the worm whole.", "lear_examp": ""}]}]}, {"word": "wholeheartedly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a completely enthusiastic way", "level": "C2", "dict_examp": "I agreed wholeheartedly with what she said.", "lear_examp": "First of all, I have to say that I agree with you wholeheartedly."}]}]}, {"word": "which", "poses": [{"pos": "determiner", "senses": [{"sense": "used to ask or talk about a choice between two or more things", "level": "A1", "dict_examp": "Which jacket do you prefer?", "lear_examp": "Which car did he use, the McLaren or the Ferrari?"}]}, {"pos": "pronoun", "senses": [{"sense": "used to ask or talk about a choice between two or more things", "level": "A2", "dict_examp": "Which of these do you like best?", "lear_examp": "Which would you recommend and why?"}, {"sense": "used at the beginning of a relative clause to show what thing is being referred to", "level": "A2", "dict_examp": "These are problems which we all know about.", "lear_examp": "I like to wear clothes which are black or blue."}, {"sense": "used to give extra information about something", "level": "B1", "dict_examp": "The book, which includes a map, gives you all the information you need about Budapest.", "lear_examp": "Turning to the end-of-conference party, it is going to be held in a nearby buffet restaurant, Valentine's, which has good quality food and reasonable prices."}, {"sense": "used after a preposition to show what thing is being referred to", "level": "B2", "dict_examp": "Is that the film in which she sings?", "lear_examp": "According to your advertisement in a language magazine you have a vacancy in your campsites, in which I am very interested."}, {"sense": "used when you give an opinion or comment about what you have just said", "level": "B2", "dict_examp": "He showed me around the town, which I thought was very nice of him.", "lear_examp": "I am very interested in being able to help on such a project, which I think is a very good one."}]}]}, {"word": "whiskey", "poses": [{"pos": "noun", "senses": [{"sense": "a strong, pale brown alcoholic drink that is made from rye, barley, or corn", "level": "B2", "dict_examp": "Tennessee is famous for its bourbon whiskey.", "lear_examp": "We spent two nights at the inn and had the pleasure to taste all these different kinds of whiskey which have been produced in the area."}]}]}, {"word": "whichever", "poses": [{"pos": "determiner", "senses": [{"sense": "any of a group of similar things", "level": "B2", "dict_examp": "Let's go out on Thursday or Friday - you choose whichever day is best for you.", "lear_examp": "I'm very pleased, because in this way, I can buy whichever DVD I want!"}, {"sense": "used to say that what happens is not important because it does not change a situation", "level": "B2", "dict_examp": "It's going to be expensive whichever way you do it.", "lear_examp": "In Japan, there are two major styles of tea. One is Omote and the other is Ura. Both styles have only one top family. Whichever they are, the top family uses a special bowl made by the Raku family."}]}, {"pos": "pronoun", "senses": [{"sense": "any of a group of similar things", "level": "B2", "dict_examp": "We can go to the seven o'clock performance or the eight - whichever works best.", "lear_examp": "This job ... is in Central London, and you can choose part-time or full time, whichever you want."}]}]}, {"word": "whisper", "poses": [{"pos": "verb", "senses": [{"sense": "to speak extremely quietly so that other people cannot hear", "level": "B2", "dict_examp": "She leaned over and whispered something in his ear.", "lear_examp": "Around midnight, I woke up, because I heard some people whispering."}]}]}, {"word": "who", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to ask about someone's name or which person or group someone is talking about", "level": "A1", "dict_examp": "Who told you?", "lear_examp": "What did you do at the party? Who was there?"}, {"sense": "used at the beginning of a relative clause to show which person or group of people you are talking about", "level": "A2", "dict_examp": "That's the man who I saw in the bank.", "lear_examp": "It was my mother who gave it to me."}, {"sense": "used to give more information about someone", "level": "B1", "dict_examp": "My brother, who's 17, has passed his driving test.", "lear_examp": "The bad guys try to take over the world and the good guys, who are the heroes , try to stop them from doing so."}, {"sense": "used to emphasize that you do not think something is important", "level": "B2", "dict_examp": "\"Hey, I won again!\" \"Who cares?\"", "lear_examp": "\"Who cares?\" he answered."}]}]}, {"word": "while", "poses": [{"pos": "conjunction", "senses": [{"sense": "during the time that, or at the same time as", "level": "A2", "dict_examp": "I read it while you were drying your hair.", "lear_examp": "My mother gave it to me yesterday evening while I was playing a computer game."}, {"sense": "used to compare two different facts or situations", "level": "B1", "dict_examp": "He earns seventy thousand dollars a year while I earn only forty!", "lear_examp": "In Italy, weddings are very traditional! The girls wear a long, white dress, while the boys, normally, wear dark clothes."}, {"sense": "despite the fact that; although", "level": "B2", "dict_examp": "While I accept that he's not perfect in many respects, I do actually like the man.", "lear_examp": "While it is true that everyone should have a computer at home because it is useful, on the other hand hardly anybody can afford one."}]}, {"pos": "noun", "senses": [{"sense": "a length of time", "level": "B1", "dict_examp": "I only stayed for a short while.", "lear_examp": "After a while, a girl invited me to play darts with her and her friends."}, {"sense": "a long time", "level": "B1", "dict_examp": "I hadn’t seen Rebecca in quite a while.", "lear_examp": "But although I have what you could call \"simple\" tastes, it takes me quite a while to decide what to buy."}, {"sense": "sometimes but not often", "level": "B2", "dict_examp": "We do go to the beach once in a while.", "lear_examp": "She did not say very much except for \"oh\" and \"yes, yes\" every once in a while."}]}]}, {"word": "wholly", "poses": [{"pos": "adverb", "senses": [{"sense": "completely", "level": "C2", "dict_examp": "His behavior is wholly unacceptable.", "lear_examp": "As far as money is concerned, I think that people who only care about earning lots of money do not wholly understand the question."}]}]}, {"word": "wicked", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely bad and morally wrong", "level": "C2", "dict_examp": "a wicked man", "lear_examp": "They went to great pains to do so, as he was indeed a wicked and cunning man, but he had not counted on Caroline's and James' superior intelligence, and the documents were eventually found in an empty jar in the kitchen."}]}]}, {"word": "whose", "poses": [{"pos": "determiner", "senses": [{"sense": "used to ask who something belongs to or who someone or something is connected to", "level": "B1", "dict_examp": "Whose bag is this?", "lear_examp": "Whose fault is it?"}, {"sense": "used for adding information about a person or thing just mentioned", "level": "B1", "dict_examp": "We see patients whose families are unable to care for them.", "lear_examp": "My new friend, whose name is Mark, is my co-worker."}]}, {"pos": "pronoun", "senses": [{"sense": "used to ask who something belongs to or who someone or something is connected to", "level": "B1", "dict_examp": "Whose is this bag?", "lear_examp": ""}]}]}, {"word": "whim", "poses": [{"pos": "noun", "senses": [{"sense": "when you suddenly want to do something without having a reason", "level": "C2", "dict_examp": "We booked our beach vacation on a whim.", "lear_examp": "He brought her presents and indulged her every whim."}]}]}, {"word": "wind", "poses": [{"pos": "noun", "senses": [{"sense": "a natural, fast movement of air", "level": "A1", "dict_examp": "There isn't enough wind to fly a kite.", "lear_examp": "There are coconut trees near the sea and sometimes gentle winds blew through them."}, {"sense": "to take a risk", "level": "C2", "dict_examp": "I decided to throw caution to the wind and book a ticket to India.", "lear_examp": "They just threw caution to the wind, and did what they wanted."}]}]}, {"word": "wild", "poses": [{"pos": "adjective", "senses": [{"sense": "A wild animal or plant lives or grows in its natural environment and not where people live.", "level": "A2", "dict_examp": "a wild dog", "lear_examp": "You can see wild animals."}, {"sense": "describes land that is not used to grow crops and has few people living in it", "level": "B2", "dict_examp": "a wild mountainous region", "lear_examp": "This area is still wild."}, {"sense": "very energetic and not controlled", "level": "B2", "dict_examp": "a wild party", "lear_examp": "When Jorge went up on the stage to get his award, he sang the song and the crowd went wild!"}, {"sense": "If someone, especially a child, runs wild, they behave as they want to and no one controls them.", "level": "C2", "dict_examp": "Their nine-year-old son is left to run wild.", "lear_examp": "My parents decided to move to a small village when I was just a kid. Shortly after we settled in, my parents decided that I was running wild and that it was time for me to receive some sort of education."}, {"sense": "If someone's imagination runs wild, they are not able to control their thoughts.", "level": "C2", "dict_examp": "It was getting dark and my imagination was starting to run wild.", "lear_examp": "Her imagination started to run wild and she began to think about the dark corridors, the secret passages and the obscure dungeons that the castle might hide."}, {"sense": "something that you say which is not based on facts or careful thought", "level": "C2", "dict_examp": "I’ll make a wild guess but I don't really know.", "lear_examp": "And in regard to the future, I am afraid, we only can make wild guesses about what is waiting for us out there."}, {"sense": "with a lot of wind, rain, etc.", "level": "C2", "dict_examp": "a wild and stormy night", "lear_examp": "They played with the shadows of the night and danced with the sound of a wild wind."}, {"sense": "bigger or better than anything you could imagine or hope for", "level": "C2", "dict_examp": "The house was beyond my wildest dreams.", "lear_examp": "It was beyond my wildest dreams."}, {"sense": "used to say that something is better than anything you could imagine or hope for", "level": "C2", "dict_examp": "Never in my wildest dreams had I thought I would be offered a starring role in a Hollywood movie.", "lear_examp": "Not even in my wildest dreams could I have imagined that finding a diary was to have such fortunate consequences for me."}]}]}, {"word": "wield", "poses": [{"pos": "verb", "senses": [{"sense": "to hold a weapon or tool and look as if you are going to use it", "level": "C2", "dict_examp": "They were confronted by a man wielding a knife.", "lear_examp": "To start with, its special effects are superb, transporting the spectator into a new world of fascinating creatures, who wield mighty weapons to get citizens free from slavery and injustice."}, {"sense": "to have a lot of influence or power over other people", "level": "C2", "dict_examp": "People in his position wield a lot of power over our lives.", "lear_examp": "Fortunately, my parents do not wield authority over me and my siblings like dictators."}]}]}, {"word": "widespread", "poses": [{"pos": "adjective", "senses": [{"sense": "affecting or including a lot of places, people, etc.", "level": "C1", "dict_examp": "a widespread problem", "lear_examp": "It is because of widespread use of deep-freezing and preservatives."}]}]}, {"word": "wilderness", "poses": [{"pos": "noun", "senses": [{"sense": "a place that is in a completely natural state without houses, industry, roads, etc.", "level": "C2", "dict_examp": "a beautiful mountain wilderness", "lear_examp": "At 7 o'clock we left our tiny hotel to head for the wilderness."}]}]}, {"word": "winding", "poses": [{"pos": "adjective", "senses": [{"sense": "describes a path, road, river, etc. that repeatedly turns in different directions", "level": "B2", "dict_examp": "There's a very long, winding path leading up to the house.", "lear_examp": "Moreover, I agree with Chris when he thinks the route through the mountain may be very difficult: it is a winding and quite hazardous road."}]}]}, {"word": "wife", "poses": [{"pos": "noun", "senses": [{"sense": "the woman a man is married to", "level": "A1", "dict_examp": "I met Greg's wife for the first time.", "lear_examp": "How are you, and how are your wife and children?"}]}]}, {"word": "willpower", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to make yourself do difficult things or to stop yourself from doing enjoyable things that are bad for you", "level": "C2", "dict_examp": "It takes great willpower to lose weight.", "lear_examp": "In the end, I think, it all comes down to willpower and intelligence."}]}]}, {"word": "widen", "poses": [{"pos": "verb", "senses": [{"sense": "to become wider, or to make something wider", "level": "B2", "dict_examp": "They are widening the road.", "lear_examp": "So I suggest widening the main road."}, {"sense": "to increase or make something increase in number or degree", "level": "B2", "dict_examp": "Why not widen the discussion to include other points of view?", "lear_examp": "It could help me to widen my knowledge about stamps."}]}]}, {"word": "wildlife", "poses": [{"pos": "noun", "senses": [{"sense": "animals and plants that grow independently of people in their natural environment", "level": "B1", "dict_examp": "a documentary on Peruvian wildlife", "lear_examp": "The countryside will be the best place because we will be able to see the old castles,  mountains and natural areas with forests and wildlife."}]}]}, {"word": "widow", "poses": [{"pos": "noun", "senses": [{"sense": "a woman whose husband has died and who has not married again", "level": "B2", "dict_examp": "Many of her friends are also widows.", "lear_examp": "Roland was a rich man and now you are a rich widow."}]}]}, {"word": "wildly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a very energetic way and without control", "level": "B2", "dict_examp": "He was dancing wildly.", "lear_examp": "When I arrived at the party, I knew immediately that something was wrong ... people were sleeping on the floor, the house furniture was all torn apart, and people with beverages were dancing wildly."}, {"sense": "extremely", "level": "C2", "dict_examp": "It's a wildly popular video game.", "lear_examp": "Funding field trips would mean increased resources for our wildly successful guest appearances, as well as the budget needed to foster our skilled debaters."}]}]}, {"word": "wide", "poses": [{"pos": "adjective", "senses": [{"sense": "having a larger distance from one side to the other than is usual or expected", "level": "A2", "dict_examp": "a wide river/road", "lear_examp": "I'm going to stay here two weeks in a big hotel near a wide river."}, {"sense": "having a distance of 5 miles/10 feet, etc. from one side to the other", "level": "B1", "dict_examp": "The swimming pool is 20 feet wide.", "lear_examp": "From the two meters wide window I can overlook the city and the lake."}, {"sense": "a lot of different types of thing", "level": "B1", "dict_examp": "The library has a wide range of information.", "lear_examp": "There is a very wide choice of activities!"}]}, {"pos": "adverb", "senses": [{"sense": "farther than usual or as far as possible", "level": "B2", "dict_examp": "She ran toward me, her arms open wide.", "lear_examp": "She came into the living room and saw me standing on the stairs with my eyes opened wide."}, {"sense": "to be completely awake", "level": "C2", "dict_examp": "\"Is Oliver awake yet?\" \"Yes, he's wide  awake and running around his bedroom.\"", "lear_examp": "Sometimes, when I have put my children to bed, half an hour later an aircraft flies over and my two-year-old daughter is wide awake again."}]}]}, {"word": "willingness", "poses": [{"pos": "noun", "senses": [{"sense": "the state of being willing", "level": "B2", "dict_examp": "I was impressed by her willingness to listen.", "lear_examp": "Again I appreciated your sense of humor and willingness to keep an open home."}]}]}, {"word": "wind", "poses": [{"pos": "verb", "senses": [{"sense": "to turn or twist something long and thin around something else several times, or to turn or twist in this way", "level": "B2", "dict_examp": "She wound the rope around the tree.", "lear_examp": "The door opened and an enormous worm in the shape of a finger rushed toward them. It wound around them and pulled them out of the house."}, {"sense": "If a river, road, etc. winds somewhere, it bends a lot and is not straight.", "level": "B2", "dict_examp": "The path winds along the edge of the bay.", "lear_examp": "Following the route that surrounds Lake Frene and taking some small roads that wind through the forest, we would arrive at the Butterfly Farm, which is an old dairy farm where we can get some delicious cheese and fresh milk."}]}]}, {"word": "widely", "poses": [{"pos": "adverb", "senses": [{"sense": "including a lot of different places, people, subjects, etc.", "level": "B2", "dict_examp": "They have both traveled widely.", "lear_examp": "It is widely known that the Japanese and Chinese people are often very healthy."}, {"sense": "to be very different", "level": "B2", "dict_examp": "Prices vary widely from store to store.", "lear_examp": "People's opinions on the protection of the environment differ widely."}]}]}, {"word": "willing", "poses": [{"pos": "adjective", "senses": [{"sense": "to be happy to do something if it is needed", "level": "B1", "dict_examp": "If you're willing to fly at night, you can get a much cheaper ticket.", "lear_examp": "Would you be willing to go to the restaurant (where we were) and find my watch?"}, {"sense": "wanting to do something", "level": "C2", "dict_examp": "He is a very willing assistant.", "lear_examp": "It has also given them a willing slave, the machine, which will work as many hours as required without demanding overtime or rest time and without going on strike."}]}]}, {"word": "will", "poses": [{"pos": "modal verb", "senses": [{"sense": "used to talk about what someone or something is able or willing to do", "level": "A1", "dict_examp": "I'll give you a ride.", "lear_examp": "I'll cook for you."}, {"sense": "used to talk about what is going to happen in the future, especially things that you are certain about", "level": "A2", "dict_examp": "Ben will be five years old next month.", "lear_examp": "I will arrive at 8 o'clock."}, {"sense": "used to ask someone to do something", "level": "A2", "dict_examp": "Will you give me her address?", "lear_examp": "Will you help me to paint my bedroom?"}, {"sense": "used in conditional sentences that start with 'if' and use the present tense", "level": "A2", "dict_examp": "If he's late again, I'll be very angry.", "lear_examp": "If you want me to, I'll bring you some of my CDs."}, {"sense": "used to form the future perfect tense", "level": "B2", "dict_examp": "Next month, Gary will have been working here for 10 years.", "lear_examp": "For a start, if it is quite probable that scientific research will have found how to cure some of the more lethal diseases, e.g. cancer and AIDS, by 2050."}]}, {"pos": "noun", "senses": [{"sense": "the mental power used to control and direct your thoughts and actions, or a determination to do something, despite any difficulties or opposition", "level": "B2", "dict_examp": "From an early age she had a very strong will.", "lear_examp": "How would you find the will to look for another job?"}, {"sense": "what someone wants to happen", "level": "C1", "dict_examp": "Against their will, they were forced to hold a meeting.", "lear_examp": "But if you go and learn a language against your will, then it's better not to go at all."}, {"sense": "an official statement of what a person has decided should be done with their money and property after their death", "level": "C2", "dict_examp": "Have you made a will yet?", "lear_examp": "This uncle of mine, rich as he was, decided to make a will some years before his death."}]}]}, {"word": "width", "poses": [{"pos": "noun", "senses": [{"sense": "the distance across something from one side to the other", "level": "B2", "dict_examp": "It is 5 inches in width.", "lear_examp": "The width of a car hinders driving on the pavement, for instance."}]}]}, {"word": "win", "poses": [{"pos": "verb", "senses": [{"sense": "to get the most points in a competition or game", "level": "A2", "dict_examp": "Which team won the Superbowl last year?", "lear_examp": "Portugal is in Euro 2004 and I want Portugal to win this tournament."}, {"sense": "to get a prize in a game or competition", "level": "A2", "dict_examp": "He won $1,000 for his short story.", "lear_examp": "I was happy because I won a computer."}, {"sense": "to get the most votes in an election", "level": "B1", "dict_examp": "Who do you think will win the election?", "lear_examp": ""}, {"sense": "to be successful in a war, fight, or argument", "level": "B2", "dict_examp": "They won the war, but with heavy losses.", "lear_examp": "After a short battle on the floor I won the fight."}, {"sense": "to get approval/respect/support, etc. because of your skill and hard work", "level": "C2", "dict_examp": "Her plans have won the support of many local people.", "lear_examp": "In my book, they should be prepared to work hard to win their colleagues' respect before they start to earn real money."}]}, {"pos": "noun", "senses": [{"sense": "when someone wins a game, competition or election", "level": "C1", "dict_examp": "It was the team's sixth consecutive win this season.", "lear_examp": "As far as I am concerned, we are a perfect team and we would like to have more spare time as a prize for the consecutive easy wins we had."}]}]}, {"word": "willingly", "poses": [{"pos": "adverb", "senses": [{"sense": "in a willing way", "level": "B2", "dict_examp": "He would willingly risk his life for her.", "lear_examp": "Of course, I'll willingly help you, even though I'm going to stay there only for a couple of weeks."}]}]}, {"word": "window", "poses": [{"pos": "noun", "senses": [{"sense": "a space usually filled with glass in the wall of a building or in a vehicle, to allow light and air in and to allow people inside the building to see out", "level": "A1", "dict_examp": "Is it all right if I open/close the window?", "lear_examp": "Near the window there are some flowers."}, {"sense": "a separate area on a computer screen that shows information and that you can move around", "level": "B1", "dict_examp": "to minimize/maximize a window", "lear_examp": ""}]}]}, {"word": "wit", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to say things that are funny and clever", "level": "C1", "dict_examp": "a woman of great intelligence and wit", "lear_examp": "His wit and charm drew many people's attention to the topic and we gained a deeper insight into the tourist industry."}]}]}, {"word": "withdrawal", "poses": [{"pos": "noun", "senses": [{"sense": "when you take money out of a bank account", "level": "C2", "dict_examp": "The bank became suspicious after several large withdrawals were made from his account in a single week.", "lear_examp": ""}, {"sense": "when something is taken away so that it is no longer available, or when someone stops being involved in an activity", "level": "C2", "dict_examp": "Doctors demanded the withdrawal of the drug (from the market) after several cases involving dangerous side-effects were reported.", "lear_examp": ""}]}]}, {"word": "wine", "poses": [{"pos": "noun", "senses": [{"sense": "an alcoholic drink that is usually made from grapes, or sometimes from other fruit", "level": "A1", "dict_examp": "a wine cellar/glass", "lear_examp": "I like to drink wine or beer."}]}]}, {"word": "within", "poses": [{"pos": "preposition", "senses": [{"sense": "before a particular period of time has finished", "level": "B1", "dict_examp": "The ambulance arrived within 10 minutes.", "lear_examp": "I will return it to you within four days."}, {"sense": "less than a particular distance from something", "level": "B1", "dict_examp": "Two-thirds of Californians live within 15 miles of the coast.", "lear_examp": "By the way, the receptionist told me that the scenery around the lake is very beautiful and that the Butterfly Farm and the monument shown on your map are within easy reach."}, {"sense": "not outside the limits of something", "level": "B2", "dict_examp": "We came within five points of beating them.", "lear_examp": "Similarly the visitor has also shown responsibility to remain within the gross limits of the society he is moving in, so that he cannot cause any hurt or harm to local culture."}, {"sense": "inside an area, group, or system", "level": "C1", "dict_examp": "a dispute within the department", "lear_examp": "Dear Sir or Madam, I am writing to you, as requested, in order to ensure that the training - whose purpose is to help the staff improve its communications with the other departments within the company - is effective and not just a waste of time."}]}]}, {"word": "windy", "poses": [{"pos": "adjective", "senses": [{"sense": "with a lot of wind", "level": "A2", "dict_examp": "It was a windy night.", "lear_examp": "It was sunny and a little windy, so it wasn't too hot."}]}]}, {"word": "wish", "poses": [{"pos": "verb", "senses": [{"sense": "to want a situation that is different from the one that exists", "level": "B1", "dict_examp": "I wish that I was/were a bit taller.", "lear_examp": "I wish you were here, then you could see how nice it is."}, {"sense": "to say that you hope someone will be lucky, successful, etc.", "level": "B1", "dict_examp": "I wished him luck on his test.", "lear_examp": "I wish you good luck with your family!"}, {"sense": "to want to do something", "level": "B2", "dict_examp": "I wish to make a complaint.", "lear_examp": "I am writing to you as I wish to become a member of your golf association."}]}, {"pos": "noun", "senses": [{"sense": "something that you write at the end of a letter", "level": "A2", "dict_examp": "With best wishes, Anna", "lear_examp": "With best wishes,"}, {"sense": "what you want to do or what you want to happen", "level": "B2", "dict_examp": "Did he express any wish to see me?", "lear_examp": "It was always his dream to become a singer and he did everything to make his wish come true."}, {"sense": "something that you say secretly to yourself about what you want to have or happen", "level": "C2", "dict_examp": "She closed her eyes and made a wish.", "lear_examp": "I saw a star falling. I made a wish."}]}]}, {"word": "windshield", "poses": [{"pos": "noun", "senses": [{"sense": "the window at the front end of a car, bus, etc.", "level": "B1", "dict_examp": "A rock cracked my windshield as I was driving home.", "lear_examp": "Now you can see the drivers in their cars looking like zombies through the windshield and breathing smog and you realize how much the \"bicycling tour\" to work in the mornings is worth to you."}]}]}, {"word": "wipe", "poses": [{"pos": "verb", "senses": [{"sense": "to clean or dry something by moving a cloth across it", "level": "B2", "dict_examp": "She wiped her face with a towel.", "lear_examp": "If you accept my application, I can join any group you've made to help clean the street, and wipe the walls or doors of a public place."}, {"sense": "to remove dirt, water, a mark, etc. from something with a cloth or your hand", "level": "B2", "dict_examp": "He wiped a tear from his eye.", "lear_examp": "My father gave her a tissue and she wiped her tears away."}, {"sense": "to destroy something completely", "level": "C2", "dict_examp": "The earthquake wiped out many villages.", "lear_examp": "We are able to cure diseases that hundreds of years ago would wipe out thousands of people, as, for instance, the Black Plague did."}]}]}, {"word": "wisdom", "poses": [{"pos": "noun", "senses": [{"sense": "the ability to use your knowledge and experience to make good decisions and judgments", "level": "B2", "dict_examp": "As a coach, he says, he often gleans wisdom from his students.", "lear_examp": "However, these two subjects are vital for us to obtain the wisdom needed in later life."}, {"sense": "what most people believe", "level": "C1", "dict_examp": "These ideas about child care go against the conventional wisdom.", "lear_examp": "Thus, against conventional wisdom, I think that while a lot of adult problems are caused by money or the lack of it, it is really the ability to deal with money and to see money as a means rather than an end."}]}]}, {"word": "windsurfing", "poses": [{"pos": "noun", "senses": [{"sense": "a sport in which you sail across water by standing on a board and holding onto a large sail", "level": "B1", "dict_examp": "The channel is a popular area for windsurfing.", "lear_examp": "On Thursday if the weather is better we'll go windsurfing."}]}]}, {"word": "wise", "poses": [{"pos": "adjective", "senses": [{"sense": "having or showing the ability to make good judgments, based on a deep understanding and experience of life", "level": "B2", "dict_examp": "I think you made a wise choice.", "lear_examp": "So, you are coming to my country, that's a wise decision."}]}]}, {"word": "withdrawn", "poses": [{"pos": "adjective", "senses": [{"sense": "quiet and not talking to other people", "level": "C2", "dict_examp": "As winter dragged on, he seemed sadder and more withdrawn.", "lear_examp": "I should have been friendlier and more interested, rather than quiet and withdrawn."}]}]}, {"word": "winter", "poses": [{"pos": "noun", "senses": [{"sense": "the coldest season of the year, between fall and spring", "level": "A1", "dict_examp": "Last winter we went skiing.", "lear_examp": "I love my town because in winter I can go skiing."}]}]}, {"word": "witch", "poses": [{"pos": "noun", "senses": [{"sense": "in stories, a woman who has magical powers that she uses to help or harm people", "level": "C1", "dict_examp": "The story begins with an old witch living in the forest.", "lear_examp": "A famous actress and her friend, a librarian, get the \"elixir of eternal youth\" from the mysterious witch (Isabella Rossellini) and then their troubles begin..."}]}]}, {"word": "winner", "poses": [{"pos": "noun", "senses": [{"sense": "someone who wins a game or competition", "level": "A2", "dict_examp": "There'll be a prize for the winner.", "lear_examp": "The winners will get wonderful prizes."}]}]}, {"word": "with", "poses": [{"pos": "preposition", "senses": [{"sense": "used to say that people or things are in a place together or are doing something together", "level": "A1", "dict_examp": "I was with Sylvia at the time.", "lear_examp": "On Sunday afternoon, she goes with her husband and her son to the swimming pool."}, {"sense": "having or including something", "level": "A1", "dict_examp": "a house with a swimming pool", "lear_examp": "I want you to cook rice with fish and olives."}, {"sense": "using something", "level": "A2", "dict_examp": "She hit him over the head with a tennis racket.", "lear_examp": "I can print the advertisement and tickets with my computer."}, {"sense": "used to say what fills, covers, etc. something", "level": "B1", "dict_examp": "a bucket filled with water", "lear_examp": "It was like throwing her into a pool filled with ice."}, {"sense": "used to describe the way someone does something", "level": "B1", "dict_examp": "He plays with great skill.", "lear_examp": "People can do more things and with more energy when they are listening to music."}, {"sense": "because of something", "level": "B2", "dict_examp": "I was shaking with fear.", "lear_examp": "It was Tuesday the 13th and the fact that I was very superstitious made me tremble with fear."}, {"sense": "relating to something or someone", "level": "B2", "dict_examp": "There's something wrong with the car.", "lear_examp": "It's such a shame when people use computers badly, just for damaging and making things worse, because if there's something wrong with them, almost everything is wrong with us too."}, {"sense": "relating to a particular thing", "level": "B2", "dict_examp": "I am writing with respect to your letter of June 24.", "lear_examp": "With respect to the ages of the members, they are between fifteen and twenty years old."}, {"sense": "used to politely disagree with or give a negative opinion about something", "level": "C1", "dict_examp": "I’ve been thinking about what you said and, with all due respect, I think you’re mistaken.", "lear_examp": "Finally we would like to point out two things that should be improved. The first one is entertainment, which, with all due respect, is very poor."}, {"sense": "using something to help you", "level": "C1", "dict_examp": "She walks with the aid of a cane.", "lear_examp": "The newest computer can handle data that human brains cannot and therefore all scientific research is carried out with the aid of computers."}, {"sense": "with a very high score or with great success", "level": "C1", "dict_examp": "He passed the exam with flying colors.", "lear_examp": "Through this, he was able to get his college degree and graduated with flying colors."}, {"sense": "without using any type of tool or weapon when doing something that requires a lot of strength", "level": "C2", "dict_examp": "He wrestled the lion to the ground with his bare hands.", "lear_examp": "You could tell your grandchildren about the good old days when you hunted for mammoths and skinned them with your bare hands, just a few million years back (sigh: \"seems like yesterday\")."}, {"sense": "in an excited or anxious way", "level": "C2", "dict_examp": "I waited with bated breath as the results were read out.", "lear_examp": "Nevertheless, a huge number of scientists carrying out very useful research, and composers, actors, and artists making us watch their creations with bated breath, do not earn as much money as a lot of outstanding sportsmen do."}, {"sense": "If you do or say something with a heavy heart, you feel very sad or anxious", "level": "C2", "dict_examp": "It was with a heavy heart that he packed his bags and left his home of many years.", "lear_examp": "I started to clear the table with a heavy heart, and was still in the process of washing up when the bell rang and, on dashing to open the door - I was the only one that was still up - I was relieved to find that my friends had come to greet me, as is their wont."}, {"sense": "used by someone to express good wishes when they give you something free, for example in a restaurant", "level": "C2", "dict_examp": "Please accept this champagne with the compliments of the manager.", "lear_examp": "The guest can also choose from a selection of wonderful desserts such as mousse au chocolat with fresh raspberries before finishing his/her meal with a rose liqueur - with the compliments of the house (and the bill)."}]}]}, {"word": "wink", "poses": [{"pos": "verb", "senses": [{"sense": "to quickly close and then open one eye, in order to be friendly or to show that something is a joke", "level": "C2", "dict_examp": "She smiled and winked at me.", "lear_examp": "With her blue eyes she looks straight at me and because one eye is slightly closed I always feel that she winks at me."}]}, {"pos": "noun", "senses": [{"sense": "to not have any sleep", "level": "C2", "dict_examp": "I was so excited last night - I didn't sleep a wink.", "lear_examp": "Nevertheless, due to the fact that I hadn't slept a wink the previous night, I began to fall asleep."}]}]}, {"word": "wisely", "poses": [{"pos": "adverb", "senses": [{"sense": "in a wise way", "level": "C1", "dict_examp": "She wisely advised me to wait.", "lear_examp": "In my opinion, computer learning offers very interesting opportunities, especially to learn new languages, but such a powerful medium as the computer should be used wisely."}]}]}, {"word": "wire", "poses": [{"pos": "noun", "senses": [{"sense": "thin, metal thread used to fasten things or to make fences, cages, etc.", "level": "B2", "dict_examp": "a wire fence", "lear_examp": ""}, {"sense": "a long,  thin piece of metal thread, usually covered in plastic, that carries electricity, telephone signals, etc.", "level": "B2", "dict_examp": "Don't touch those wires whatever you do - they're live.", "lear_examp": "After carrying stuff like lights, microphones, wires and some other equipment for about three hours, I was exhausted."}]}]}, {"word": "withdraw", "poses": [{"pos": "verb", "senses": [{"sense": "to take money out of a bank account", "level": "C1", "dict_examp": "She withdrew $50.", "lear_examp": "Apart from this, without credit cards I would have to look for a bank to withdraw money, and this is not very easy for a student."}, {"sense": "to remove something, especially because of an official decision", "level": "C1", "dict_examp": "This product has been withdrawn from the store's shelves and will no longer be sold.", "lear_examp": "But the government stepped back, withdrew the proposal and fired three ministers."}, {"sense": "to decide that you will not now be in a race, competition, etc.", "level": "C2", "dict_examp": "Christie was forced to withdraw from the race because of injury.", "lear_examp": ""}]}]}, {"word": "wing", "poses": [{"pos": "noun", "senses": [{"sense": "one of the body parts that a bird or insect uses to fly", "level": "B1", "dict_examp": "The eagle took off, flapping its wings to gain height.", "lear_examp": "I enjoyed this place because there were a lot of trees and a lot of birds with colorful wings."}, {"sense": "one of the two long, flat parts at the sides of an aircraft that allow it to fly", "level": "B2", "dict_examp": "I could see the plane's wing out of the window.", "lear_examp": "Everything looked good but then, he made a wrong move and crashed into another plane with the wing."}, {"sense": "a group of people in an organization or political party who have the same beliefs", "level": "C2", "dict_examp": "the conservative/progressive wing of the party", "lear_examp": ""}]}]}, {"word": "woodland", "poses": [{"pos": "noun", "senses": [{"sense": "an area of land with a lot of trees", "level": "C2", "dict_examp": "A lot of the area is woodland.", "lear_examp": "Our house, which was quite spacious, was near a river and surrounded by beautiful rolling hills and extensive woodland."}]}]}, {"word": "wooden", "poses": [{"pos": "adjective", "senses": [{"sense": "made of wood", "level": "A2", "dict_examp": "The house was surrounded by a tall, wooden fence.", "lear_examp": "We will bring some big wooden tables and chairs."}]}]}, {"word": "woods", "poses": [{"pos": "noun", "senses": [{"sense": "an area of land covered with a thick growth of trees", "level": "A2", "dict_examp": "We went for a walk in the woods after lunch.", "lear_examp": "The three of us slept together in a small tent, which was located in the heart of the woods."}]}]}, {"word": "wonderful", "poses": [{"pos": "adjective", "senses": [{"sense": "extremely good", "level": "A2", "dict_examp": "He's a wonderful cook.", "lear_examp": "I hope you will have a wonderful time."}]}]}, {"word": "work", "poses": [{"pos": "noun", "senses": [{"sense": "the place where you go to do your job", "level": "A1", "dict_examp": "Do you have far to travel to work each day?", "lear_examp": "I will finish work at five o'clock."}, {"sense": "something you do as a job to earn money", "level": "A1", "dict_examp": "Has she gotten any work yet?", "lear_examp": "I like my work."}, {"sense": "the activities that you have to do at school, for your job, etc.", "level": "A2", "dict_examp": "I'll have to take this work home with me and finish it there.", "lear_examp": "I have a lot of work to do this week."}, {"sense": "when you use physical or mental effort to do something", "level": "B1", "dict_examp": "Carrying heavy loads around all day is hard work.", "lear_examp": "The lessons are very good but the teacher is going very quickly. It will be hard work."}, {"sense": "a painting, book, piece of music, etc.", "level": "B2", "dict_examp": "The museum has many works by Picasso as well as other modern painters.", "lear_examp": "We agreed that something had to be done to promote the popularity of local films, some of them being great works of art."}]}, {"pos": "verb", "senses": [{"sense": "to do a job, especially the job you do to earn money", "level": "A1", "dict_examp": "She worked as a cleaner at the hospital.", "lear_examp": "She works from Monday to Friday."}, {"sense": "If a machine or piece of equipment  works, it is not broken.", "level": "A2", "dict_examp": "Our telephone isn't working.", "lear_examp": "I tried to phone her house, but her phone wasn't working, so I decided to go to her house."}, {"sense": "If something works, it is effective or successful.", "level": "B1", "dict_examp": "Her plan to increase sales worked.", "lear_examp": "I changed cars several times to fool the police. It worked very well."}, {"sense": "to know how to use a machine or piece of equipment", "level": "C1", "dict_examp": "Do you know how to work the video camera?", "lear_examp": "At that time, I also learned how to work the lighting during the play."}, {"sense": "to try hard to achieve something", "level": "B2", "dict_examp": "You need to work at improving your writing.", "lear_examp": "In my opinion, this is the part our college has to improve and to work at."}, {"sense": "to spend time repairing or improving something", "level": "B2", "dict_examp": "Tim loves working on old cars.", "lear_examp": "I believe that it would be best to paint a picture of me in the garage working on my new car."}, {"sense": "to do a calculation to get an answer to a mathematical question", "level": "B2", "dict_examp": "We need to work out the total cost of the project.", "lear_examp": "I had to work out all my figures two times to make sure that my accounts were accurate."}, {"sense": "to exercise in order to improve the strength or appearance of your body", "level": "B1", "dict_examp": "Heidi works out in the gym two or three times a week.", "lear_examp": "At the time I used to work out and I saw that he was looking at me while I was doing my exercises."}, {"sense": "If a problem or a complicated situation works out, it ends in a successful way.", "level": "B2", "dict_examp": "We were worried that the event would be disorganized, but it all worked out in the end.", "lear_examp": "I hope you follow my instructions and you'll see how everything works out fine."}]}]}, {"word": "witty", "poses": [{"pos": "adjective", "senses": [{"sense": "using words in an intelligent and funny way", "level": "B2", "dict_examp": "a witty comment/remark", "lear_examp": "I have read it many times and the author's witty remarks and elegant style have always been a source of entertainment to me."}]}]}, {"word": "wool", "poses": [{"pos": "noun", "senses": [{"sense": "thick thread or material that is made from the hair of a sheep", "level": "A2", "dict_examp": "The blankets are made of wool and the sheets are cotton.", "lear_examp": "I got many presents: a camera, a wool sweater and other things."}]}]}, {"word": "word", "poses": [{"pos": "noun", "senses": [{"sense": "a group of letters or sounds that mean something, or a single letter or sound that means something", "level": "A1", "dict_examp": "What's the word for goat in French?", "lear_examp": "When I go to college, I like to learn more English words."}, {"sense": "to not believe/understand/hear/say, etc. anything", "level": "B1", "dict_examp": "I don't believe a word he says.", "lear_examp": "Peter took my hand and asked me to leave, so I said goodbye to Roger and his girlfriend - who never said a word."}, {"sense": "used to explain what something means in a different way", "level": "B2", "dict_examp": "He said he's too busy - in other words, he isn't interested.", "lear_examp": "They had had a great time before and had drunk too much alcohol. In other words, they were totally drunk."}, {"sense": "to promise someone something", "level": "C1", "dict_examp": "Paolo gave me his word that he wouldn't tell anyone.", "lear_examp": "I give you my word that it will never happen again."}, {"sense": "to believe what someone says without any proof", "level": "C1", "dict_examp": "Take my word for it - this curry is very hot!", "lear_examp": "You can take my word for it that she is absolutely capable of carrying out this job - fond of children, patient, good-natured and competent."}, {"sense": "to do what you said you would do", "level": "C1", "dict_examp": "He agreed to come and I'm sure he'll keep his word.", "lear_examp": "It turned out that the company that had been hired to organize it did not keep their word."}, {"sense": "to talk to someone for a short time", "level": "C2", "dict_examp": "If you have a minute, could I have a word?", "lear_examp": "Tom was not really in the mood to have a word with that annoying man."}, {"sense": "using the exact words that were originally used", "level": "C2", "dict_examp": "She repeated word for word what he had told her.", "lear_examp": "This is word for word the beginning of the story that Katrina handed to her French teacher."}, {"sense": "used when you repeat what someone said", "level": "C2", "dict_examp": "In the manager's words, the game was \"a total disaster.\"", "lear_examp": "In the immortal words of the bard \"... if music be the food of love....... play on!\""}, {"sense": "to be so surprised, angry or moved by something that you do not know what to say", "level": "C2", "dict_examp": "This prize is such an honor and so unexpected - I am lost for words.", "lear_examp": "I was so enraged that I was lost for words for quite a long time."}, {"sense": "not knowing what to say", "level": "C2", "dict_examp": "The question was unexpected and she was temporarily at a loss for words.", "lear_examp": "If it was James I would be at a loss for words, I didn't know what to tell him."}, {"sense": "by one person telling another telling you", "level": "C2", "dict_examp": "Students learned of the center by word of mouth.", "lear_examp": "In the past news traveled mostly by word of mouth and it took days and sometimes weeks before a person would become aware of an occurrence on the other end of the world."}]}]}, {"word": "woman", "poses": [{"pos": "noun", "senses": [{"sense": "an adult female person", "level": "A1", "dict_examp": "a 30-year-old woman", "lear_examp": "Your teacher will be a woman."}]}]}, {"word": "worker", "poses": [{"pos": "noun", "senses": [{"sense": "someone who works for a company or organization but does not have a powerful position", "level": "A2", "dict_examp": "factory workers", "lear_examp": "There is a man with a suitcase and he says: \"Hi, I'm a worker in the airport and I found this suitcase.\""}, {"sense": "someone who works quickly/slowly/well, etc.", "level": "B1", "dict_examp": "He's kind of a slow worker, but he is very thorough.", "lear_examp": "I'll recommend you as a hard worker and a very nice person."}]}]}, {"word": "within", "poses": [{"pos": "preposition", "senses": [{"sense": "before a particular period of time has finished", "level": "B1", "dict_examp": "The ambulance arrived within 10 minutes.", "lear_examp": "I will return it to you within four days."}, {"sense": "less than a particular distance from something", "level": "B1", "dict_examp": "Two-thirds of Californians live within 15 miles of the coast.", "lear_examp": "By the way, the receptionist told me that the scenery around the lake is very beautiful and that the Butterfly Farm and the monument shown on your map are within easy reach."}, {"sense": "not outside the limits of something", "level": "B2", "dict_examp": "We came within five points of beating them.", "lear_examp": "Similarly the visitor has also shown responsibility to remain within the gross limits of the society he is moving in, so that he cannot cause any hurt or harm to local culture."}, {"sense": "inside an area, group, or system", "level": "C1", "dict_examp": "a dispute within the department", "lear_examp": "Dear Sir or Madam, I am writing to you, as requested, in order to ensure that the training - whose purpose is to help the staff improve its communications with the other departments within the company - is effective and not just a waste of time."}]}]}, {"word": "withstand", "poses": [{"pos": "verb", "senses": [{"sense": "to not be harmed or broken by something", "level": "C2", "dict_examp": "a bridge designed to withstand earthquakes", "lear_examp": "In the past older or weaker organisms unable to withstand certain diseases had to die."}]}]}, {"word": "wolf", "poses": [{"pos": "noun", "senses": [{"sense": "a wild animal of the dog family", "level": "B2", "dict_examp": "Wolves hunt in groups known as packs.", "lear_examp": "Before we knew it, Nick leapt onto the wolf and they started to fight."}]}]}, {"word": "wonder", "poses": [{"pos": "verb", "senses": [{"sense": "to ask yourself questions or express a wish to know about something", "level": "B1", "dict_examp": "Shouldn't you call home? Your parents will be wondering where you are.", "lear_examp": "You might wonder why I decided to do so."}, {"sense": "used in phrases, at the beginning of a request, to make it more formal and polite", "level": "B1", "dict_examp": "I wonder - could you help me carry these books?", "lear_examp": "I wonder if there is a way that I would be able to cover the work I have missed?"}]}, {"pos": "noun", "senses": [{"sense": "it is not surprising", "level": "B2", "dict_examp": "No wonder the children are excited - this is the first time they've been abroad.", "lear_examp": "No wonder that people are more tired and are not interested in reading books as much as in the past."}]}]}, {"word": "wood", "poses": [{"pos": "noun", "senses": [{"sense": "the hard material that trees are made of", "level": "A2", "dict_examp": "He gathered some wood to build a fire.", "lear_examp": "It is long and it is made of wood."}]}]}, {"word": "witness", "poses": [{"pos": "noun", "senses": [{"sense": "a person who sees an event happening, especially a crime or an accident", "level": "B2", "dict_examp": "The police are appealing for witnesses to the accident to come forward.", "lear_examp": "Furthermore, the witness was assassinated."}]}, {"pos": "verb", "senses": [{"sense": "to see something happen, especially an accident or crime", "level": "B2", "dict_examp": "Did anyone witness the attack?", "lear_examp": "Finally, if you witness an accident you can inform the police quickly, which can save lives."}]}]}, {"word": "workbook", "poses": [{"pos": "noun", "senses": [{"sense": "a book with questions and spaces to write on, which is used by students for learning a subject", "level": "A2", "dict_examp": "I need to get the workbook for my French class.", "lear_examp": "I left my workbook in your house.  I really need it because I must finish my homework to show it to the teacher tomorrow!"}]}]}, {"word": "without", "poses": [{"pos": "preposition", "senses": [{"sense": "not having, using, or doing something", "level": "A2", "dict_examp": "I came out without my umbrella.", "lear_examp": "I have an exam tomorrow and I cannot study without the folder."}, {"sense": "when someone is not with someone else", "level": "A2", "dict_examp": "I couldn't have done it without you.", "lear_examp": "Majorca is wonderful, but I feel lonely without you."}, {"sense": "immediately", "level": "B1", "dict_examp": "This problem needs to be dealt with without delay.", "lear_examp": "Firstly, the programme began on time at midday without delay."}]}]}, {"word": "workaholic", "poses": [{"pos": "noun", "senses": [{"sense": "someone who works too much and does not have time to do anything else", "level": "C2", "dict_examp": "My husband's a workaholic who never gets home until late at night.", "lear_examp": "Unless you are a real \"workaholic,\" and there are some of them out there, working like a slave to get more money doesn't pay off."}]}]}, {"word": "worker", "poses": [{"pos": "noun", "senses": [{"sense": "someone who works for a company or organization but does not have a powerful position", "level": "A2", "dict_examp": "factory workers", "lear_examp": "There is a man with a suitcase and he says: \"Hi, I'm a worker in the airport and I found this suitcase.\""}, {"sense": "someone who works quickly/slowly/well, etc.", "level": "B1", "dict_examp": "He's kind of a slow worker, but he is very thorough.", "lear_examp": "I'll recommend you as a hard worker and a very nice person."}]}]}, {"word": "working-class", "poses": [{"pos": "adjective", "senses": [{"sense": "belonging to or relating to the working class", "level": "C1", "dict_examp": "Working-class families can't afford these prices.", "lear_examp": "And young people from working-class families in the suburbs of Paris will make a point of having the latest fashion shoes or trousers."}]}]}, {"word": "the working class", "poses": [{"pos": "noun", "senses": [{"sense": "the social group consisting of people who do usually physical work and who often do not get paid much money", "level": "C1", "dict_examp": "He sees the candidate's comments as an attack on the working class.", "lear_examp": "A member of the working class, for example, was not expected to wear something smart, as he didn't represent the company."}]}]}, {"word": "worst", "poses": [{"pos": "adjective", "senses": [{"sense": "(superlative of bad) the most unpleasant, difficult or severe", "level": "A2", "dict_examp": "That was the worst meal I've ever eaten.", "lear_examp": "And you, what is your worst gift?"}]}, {"pos": "noun", "senses": [{"sense": "the most unpleasant or difficult thing, person, or situation", "level": "B1", "dict_examp": "That was the worst I've seen him play in several years.", "lear_examp": "This situation was the worst I have lived through."}, {"sense": "used to emphasize the worst thing, situation, etc.", "level": "B2", "dict_examp": "We had no food or light, but worst of all, we had no water.", "lear_examp": "And worst of all, her mother had been always against that relationship and had given her advice many times."}, {"sense": "to worry that something very bad will happen or that something very bad has happened", "level": "C2", "dict_examp": "When there was no sign of the children, the rescuers feared the worst.", "lear_examp": "Her parents had been quarrelling constantly now for almost half a year, and she feared the worst."}]}, {"pos": "adverb", "senses": [{"sense": "(superlative of badly) the most badly", "level": "B2", "dict_examp": "Small businesses have been worst hit by the recession.", "lear_examp": ""}]}]}, {"word": "worthwhile", "poses": [{"pos": "adjective", "senses": [{"sense": "useful and enjoyable, despite needing a lot of effort", "level": "B2", "dict_examp": "She considers teaching a worthwhile career.", "lear_examp": "It's a worthwhile trip. You'll have the opportunity to visit beautiful places and learn lots of history."}]}]}, {"word": "worthless", "poses": [{"pos": "adjective", "senses": [{"sense": "not important or useful", "level": "C1", "dict_examp": "He made me feel stupid and worthless.", "lear_examp": "One important aspect is, of course, that they will feel worthless."}, {"sense": "having no value in money", "level": "C2", "dict_examp": "The painting's a fake - it's completely worthless.", "lear_examp": "But many people keep completely worthless things for sentimental reasons."}]}]}, {"word": "worrying", "poses": [{"pos": "adjective", "senses": [{"sense": "making you feel unhappy and afraid", "level": "B2", "dict_examp": "It's a very worrying situation.", "lear_examp": "But the most worrying thing about this matter is you."}]}]}, {"word": "workshop", "poses": [{"pos": "noun", "senses": [{"sense": "when a group of people meet to learn more about something by discussing it and doing practical exercises", "level": "C1", "dict_examp": "a workshop on crime prevention", "lear_examp": "All in all, I thoroughly enjoyed this event, but I think there ought to be more computers provided and the numbers of participants to a single workshop should be limited."}]}]}, {"word": "working", "poses": [{"pos": "adjective", "senses": [{"sense": "relating to your job", "level": "B1", "dict_examp": "working hours", "lear_examp": "But now because of my job, I always wear black or dark blue suits during working hours."}, {"sense": "knowledge about something that is good enough to be useful", "level": "B2", "dict_examp": "She has a working knowledge of German and Russian.", "lear_examp": "Furthermore, I have a working knowledge of English, Spanish, Catalan and Italian."}]}]}, {"word": "worried", "poses": [{"pos": "adjective", "senses": [{"sense": "anxious because you are thinking about problems or unpleasant things that might happen", "level": "A2", "dict_examp": "She's really worried about her son.", "lear_examp": "I'm worried about your health."}]}]}, {"word": "worldwide", "poses": [{"pos": "adjective", "senses": [{"sense": "existing or happening in all parts of the world", "level": "B2", "dict_examp": "a worldwide success", "lear_examp": "You can visit the main monuments of Paris, known worldwide, like Notre-Dame Cathedral or the Eiffel Tower, built in 1903."}]}]}, {"word": "workforce", "poses": [{"pos": "noun", "senses": [{"sense": "all the people who work for a company or organization", "level": "C1", "dict_examp": "We have a highly skilled workforce.", "lear_examp": "Before giving them rewards, companies need to train their workforce and identify their potential."}, {"sense": "all the people in a country who are able to do a job", "level": "C2", "dict_examp": "10% of the workforce are unemployed.", "lear_examp": "There is hardly a nation without representatives in Germany's workforce."}]}]}, {"word": "worth", "poses": [{"pos": "adjective", "senses": [{"sense": "to have a particular value in money", "level": "B1", "dict_examp": "Our house is worth about $400,000.", "lear_examp": ""}, {"sense": "to be important or interesting enough to receive a particular action or to cause you to do something", "level": "B1", "dict_examp": "When you're in Reykjavik, the National Museum is worth a visit.", "lear_examp": "It's really worth visiting."}, {"sense": "to be useful or enjoyable despite needing a lot of effort", "level": "B1", "dict_examp": "It was a long climb to the top of the hill, but it was worth it for the view.", "lear_examp": "There were a lot of hills in the park, and it was very tiring to go up riding a bike, but when you got to the top, and stared at the amazing view, it was worth it."}, {"sense": "If it is worth your while doing something, it is useful or enjoyable to do it.", "level": "C2", "dict_examp": "It's worth your while taking out travel insurance before you travel.", "lear_examp": "It would be worth your while to visit the country's capital Havana, and don't forget to go into the Folklore Museum and Library, the War Museum and the Archeological Museum."}]}]}, {"word": "world", "poses": [{"pos": "noun", "senses": [{"sense": "the Earth and all the people, places and things on it", "level": "A1", "dict_examp": "She's traveled all over the world.", "lear_examp": "I like traveling and discovering new places in the world."}, {"sense": "your life and experiences", "level": "A2", "dict_examp": "His whole world fell apart when she left.", "lear_examp": "I like this room because it's \"my world\" and because it is very big."}, {"sense": "the people and things that are involved in a particular activity or subject", "level": "B1", "dict_examp": "the entertainment world", "lear_examp": "Well, as you know, I'm not very interested in the fashion world, so I rarely spend much time shopping for clothes."}, {"sense": "to have the advantages of two different situations", "level": "C1", "dict_examp": "Living in the country and working in the city you have the best of both worlds.", "lear_examp": "Only those that can afford to live in the suburban areas can combine the best of both worlds and they tend to be rather affluent."}, {"sense": "to be of extremely good quality", "level": "C2", "dict_examp": "Their chocolate cake is just out of this world!", "lear_examp": "The dessert trays are out of this world."}, {"sense": "to make someone feel much happier or healthier", "level": "C2", "dict_examp": "That swim has done me a world of good.", "lear_examp": "I feel a year abroad would do her a world of good in letting her care for children, learn to speak English properly, and see life from different aspects."}, {"sense": "If something is not the end of the world, it will not cause very serious problems.", "level": "C2", "dict_examp": "It won't be the end of the world if I don't get this job.", "lear_examp": ""}, {"sense": "to be very happy", "level": "C2", "dict_examp": "I had just won a major tournament and I was feeling on top of the world.", "lear_examp": "I felt like I was on top of the world and nothing could take that happiness from me."}]}]}, {"word": "worry", "poses": [{"pos": "verb", "senses": [{"sense": "used to tell someone that they do not need to think about something or do anything about something", "level": "A1", "dict_examp": "Don't worry  -  she'll be all right.", "lear_examp": "Don't worry about dinner, because I eat everything."}, {"sense": "to think about problems or unpleasant things that might happen in a way that makes you feel anxious", "level": "A2", "dict_examp": "Try not to worry - there's nothing you can do to change the situation.", "lear_examp": "I'm worried about your health."}, {"sense": "to make someone feel anxious because of problems or unpleasant things that might happen", "level": "B2", "dict_examp": "It worries me that he hasn't called yet.", "lear_examp": "Unemployment is increasing too, and today, it worries every single citizen of the world, specially the ones who live in a third world country."}]}, {"pos": "noun", "senses": [{"sense": "a problem that makes you feel anxious", "level": "B1", "dict_examp": "health/financial worries", "lear_examp": "My worries proved to be wrong."}, {"sense": "when you are anxious about something", "level": "B2", "dict_examp": "She's been sick with worry.", "lear_examp": "You really need to spend a whole month without any kind of worry."}]}]}, {"word": "workout", "poses": [{"pos": "noun", "senses": [{"sense": "a period of physical exercise", "level": "B1", "dict_examp": "a light workout", "lear_examp": "He teaches me all the workouts every day."}]}]}, {"word": "worse", "poses": [{"pos": "adjective", "senses": [{"sense": "(comparative of bad) more unpleasant or difficult than something else that is also bad", "level": "A2", "dict_examp": "The test was worse than I expected.", "lear_examp": "It takes me more than one hour to get to work every day. In the evening it is even worse."}, {"sense": "to become more ill, unpleasant, difficult, severe, etc. than before", "level": "B1", "dict_examp": "My cold seems to be getting worse.", "lear_examp": "I thought, it couldn't get worse."}, {"sense": "used to emphasize how unpleasant, difficult, severe, etc. something is becoming", "level": "B2", "dict_examp": "The economic climate is getting worse and worse.", "lear_examp": "As we know because of the development of factories and businesses all over the world the air that we are using is getting worse and worse."}]}, {"pos": "noun", "senses": [{"sense": "something that is more unpleasant or difficult", "level": "C1", "dict_examp": "\"How was the movie?\" \"I’ve seen worse.\"", "lear_examp": "Going down the cliff was hard, but they had seen worse."}]}, {"pos": "adverb", "senses": [{"sense": "comparative of badly", "level": "B1", "dict_examp": "He did worse than he was expecting to on his driving test.", "lear_examp": ""}, {"sense": "to make a situation more difficult, unpleasant, etc.", "level": "B2", "dict_examp": "To make matters worse, our car broke down!", "lear_examp": "To make matters worse, the newspaper said they only played for thirty-five minutes."}]}]}, {"word": "worm", "poses": [{"pos": "noun", "senses": [{"sense": "a small creature with a long, thin, soft body and no legs", "level": "B2", "dict_examp": "Blackbirds eat worms, insects, and berries.", "lear_examp": "Fishing is my hobby and that's why I bought these plastic worms, that are not very good - it's better to use live worms!"}]}]}, {"word": "worship", "poses": [{"pos": "verb", "senses": [{"sense": "to pray to God or a god or to regularly attend religious ceremonies", "level": "C1", "dict_examp": "In the various regions of India, Hindus worship different gods and observe different religious festivals.", "lear_examp": "The Revolution was of such importance because Greece became a free country again and the people were free to talk, worship their God and have Greek schools."}, {"sense": "to love and admire someone or something very much", "level": "C1", "dict_examp": "She worshipped her mother.", "lear_examp": "Firstly, many famous people are considered as idols who are worshipped and imitated, which might make them believe they are important, especially when they have a certain media presence."}]}, {"pos": "noun", "senses": [{"sense": "the way a person prays or the religious ceremonies people attend", "level": "C2", "dict_examp": "The law would allow workers to take either Saturday or Sunday off as a day of worship.", "lear_examp": "There were Holy Masses celebrated by him in several cities and places of worship."}]}]}, {"word": "worthy", "poses": [{"pos": "adjective", "senses": [{"sense": "deserving respect, admiration or support", "level": "C1", "dict_examp": "He is unlikely to succeed in getting his bill through Congress, however worthy it is.", "lear_examp": "The performers are all neatly dressed and on the whole, they have all made a worthy effort."}, {"sense": "deserving to be given attention, noticed, etc.", "level": "C2", "dict_examp": "Two points in this report are especially worthy of notice.", "lear_examp": "Try as I might, getting good grades was always met more with a sense of mission accomplished - duly noted - than a feat worthy of congratulations."}]}]}, {"word": "worsen", "poses": [{"pos": "verb", "senses": [{"sense": "to become worse or to make something become worse", "level": "C1", "dict_examp": "His condition suddenly worsened last week.", "lear_examp": "This changed and worsened severely over the last twenty years."}]}]}, {"word": "workplace", "poses": [{"pos": "noun", "senses": [{"sense": "the place where you work", "level": "C1", "dict_examp": "We are trying to get rid of bullying in the workplace.", "lear_examp": "Nowadays, our jobs consume more and more of our time so a good atmosphere at the workplace is important."}]}]}, {"word": "wrinkle", "poses": [{"pos": "noun", "senses": [{"sense": "a small line on your face that you get when you grow old", "level": "C2", "dict_examp": "This cream reduces the appearance of wrinkles.", "lear_examp": "And so time goes by and old age is closing in. One morning you notice the wrinkles around your eyes and the gray hair that doesn't keep any of the old color."}]}]}, {"word": "wrist", "poses": [{"pos": "noun", "senses": [{"sense": "the part of the body between the hand and the arm", "level": "B2", "dict_examp": "I sprained my wrist playing squash.", "lear_examp": "I fell on some stairs and hurt my wrist."}]}]}, {"word": "written", "poses": [{"pos": "adjective", "senses": [{"sense": "expressed in writing, or involving writing", "level": "B1", "dict_examp": "written instructions", "lear_examp": "I would like you to tell me what subject you're teaching tomorrow and the pages of the homework, so I can do the written test in the next class."}]}]}, {"word": "writing", "poses": [{"pos": "noun", "senses": [{"sense": "the skill or activity of producing words on a surface", "level": "A1", "dict_examp": "Teachers  focus on speaking and writing in the afternoon classes.", "lear_examp": "In my lessons I learn reading, writing and English grammar."}, {"sense": "something that has been written or printed", "level": "A2", "dict_examp": "The writing on the label was too small to read.", "lear_examp": ""}, {"sense": "the way that someone writes", "level": "B1", "dict_examp": "Do you recognize the writing on the envelope?", "lear_examp": ""}, {"sense": "the activity of creating pieces of written work, such as books, stories, poems, etc., or the written work of one person or a group of people", "level": "B2", "dict_examp": "I took a course in creative writing.", "lear_examp": "Black humor is a distinguishable feature of his writing."}, {"sense": "An agreement that is in writing is official and is proof of that agreement.", "level": "B2", "dict_examp": "Please confirm your reservation in writing.", "lear_examp": "I am telling you in writing that I would like to help you."}]}]}, {"word": "would", "poses": [{"pos": "modal verb", "senses": [{"sense": "used to say politely that you want something", "level": "A1", "dict_examp": "I'd like a cup of coffee, please.", "lear_examp": "I'd like fish and chips (but not too fatty!)"}, {"sense": "used to ask someone if they want something", "level": "A1", "dict_examp": "Would you like a drink?", "lear_examp": "Would you like to come?"}, {"sense": "used to say that you would very much like something", "level": "A2", "dict_examp": "I'd love some chocolate right now!", "lear_examp": "I'd love some chops and beer."}, {"sense": "used to say that you would very much like to do something that someone has suggested", "level": "A2", "dict_examp": "\"Would you like to come to the concert with us?\" \"I'd love to.\"", "lear_examp": "Yes, I'd love to come with you."}, {"sense": "used to say what might happen if something else happens", "level": "B1", "dict_examp": "What would you do if you lost your job?", "lear_examp": "I was just wondering if you would ask me that, because if you didn't, I would - I just love shopping!"}, {"sense": "used as the past form of 'will' to talk about what someone said or thought", "level": "B1", "dict_examp": "Archie said he would see his brother tomorrow.", "lear_examp": "He said to me he would like to come back soon."}, {"sense": "used as the past form of 'will' to talk about what someone was willing to do or what something was able to do", "level": "B1", "dict_examp": "The car wouldn't start this morning.", "lear_examp": "My parents wouldn't let me stay in a hotel alone."}, {"sense": "used to talk about a situation that you can imagine happening", "level": "B1", "dict_examp": "It would be great to go to New York.", "lear_examp": "It would be great to join you and your friends in the mountains."}, {"sense": "used to request something politely", "level": "B1", "dict_examp": "Would you mind sharing a room?", "lear_examp": "Would you mind if I called you, to know what I've missed?"}, {"sense": "used to show that you prefer to have or do one thing more than another", "level": "B1", "dict_examp": "I'd rather have a beer.", "lear_examp": ""}, {"sense": "used to talk about things that happened often in the past", "level": "B2", "dict_examp": "He would always turn and wave at the end of the street.", "lear_examp": "Every day we would walk and swim very early."}, {"sense": "would prefer", "level": "C2", "dict_examp": "I'd sooner spend a bit more money than take chances with safety.", "lear_examp": "She had already told Peter Jennings from ABC news she would sooner stay at home!"}]}]}, {"word": "wrong", "poses": [{"pos": "adjective", "senses": [{"sense": "not correct", "level": "A1", "dict_examp": "Three of your answers were wrong.", "lear_examp": "We listen to a tape sometimes, and mark wrong letters."}, {"sense": "to think or say something that is not correct", "level": "A2", "dict_examp": "I was wrong about the time - the store closed at 7, not 8.", "lear_examp": "If I'm not wrong, it is in the living room."}, {"sense": "to produce an answer or result that is not correct, or to say or write something that is not correct", "level": "B1", "dict_examp": "I got most of the answers wrong.", "lear_examp": ""}, {"sense": "If something is wrong, there is a problem.", "level": "B1", "dict_examp": "You've been quiet all evening. Is there anything wrong?", "lear_examp": "I didn't know him, so I thought that there was something wrong."}, {"sense": "not considered morally acceptable by most people", "level": "B2", "dict_examp": "Children should be taught that violence is wrong.", "lear_examp": "To sum up, I think it is wrong to keep animals in zoos."}, {"sense": "not suitable or correct, or not as it should be", "level": "C1", "dict_examp": "She's the wrong person for the job.", "lear_examp": "Personally I prefer to think that you gave the job to the wrong person."}, {"sense": "to start a relationship or activity badly", "level": "C2", "dict_examp": "He got off on the wrong foot with my parents by arriving late.", "lear_examp": "One of the greatest pleasures of reading \"The Remains of the Day\" would be to see the gradual development of the relationship between Stevens and Miss Kenton. From the beginning, they get off on the wrong foot."}]}, {"pos": "adverb", "senses": [{"sense": "in a way that is not correct", "level": "A2", "dict_examp": "You spelled my name wrong.", "lear_examp": ""}, {"sense": "to develop problems", "level": "B1", "dict_examp": "Something's gone wrong with my computer.", "lear_examp": "Despite all that went wrong, there was something I really enjoyed. It was visiting the Diamond Cave."}, {"sense": "used when you do not want someone to think that you do not like someone or something", "level": "C2", "dict_examp": "Don't get me wrong, I like her, but she can be very annoying.", "lear_examp": "Don't get me wrong, I love my aunts, I really do, but not as houseguests."}]}]}, {"word": "wound", "poses": [{"pos": "noun", "senses": [{"sense": "an injury, especially one that is made with a knife or bullet", "level": "B2", "dict_examp": "a gunshot wound", "lear_examp": "Rollo discovered that his best friend was implicated in the penicillin racket: the racketeer would put sand into penicillin without worrying about the great suffering that they caused to people who needed penicillin for their wounds."}]}, {"pos": "verb", "senses": [{"sense": "to injure someone, especially with a knife or gun", "level": "B2", "dict_examp": "The police chief was badly wounded in the explosion.", "lear_examp": "Harry was wounded on his leg."}]}]}, {"word": "wrap", "poses": [{"pos": "verb", "senses": [{"sense": "to cover or surround something with paper, cloth or other material", "level": "B1", "dict_examp": "She wrapped the present and tied it with ribbon.", "lear_examp": ""}, {"sense": "to cover someone with material in order to protect them", "level": "B2", "dict_examp": "She wrapped the baby in a blanket.", "lear_examp": "After a few seconds I gathered my wits and wrapped the towel around myself again."}, {"sense": "to fold paper, cloth, etc. around something to cover it", "level": "B1", "dict_examp": "Have you wrapped up Jenny's present?", "lear_examp": "It was wrapped up in paper with a red ribbon."}]}]}, {"word": "wretched", "poses": [{"pos": "adjective", "senses": [{"sense": "very unhappy or ill", "level": "C2", "dict_examp": "I'd been feeling wretched all day so I went to bed early.", "lear_examp": "As a result, some people will realize they were unable to achieve their ends when they were younger and will feel wretched."}, {"sense": "very bad or of poor quality", "level": "C2", "dict_examp": "The refugees were living in wretched conditions.", "lear_examp": "Because working leads to self-esteem, that is most vital for people, especially when they are in wretched conditions."}]}]}, {"word": "worthy", "poses": [{"pos": "adjective", "senses": [{"sense": "deserving respect, admiration or support", "level": "C1", "dict_examp": "He is unlikely to succeed in getting his bill through Congress, however worthy it is.", "lear_examp": "The performers are all neatly dressed and on the whole, they have all made a worthy effort."}, {"sense": "deserving to be given attention, noticed, etc.", "level": "C2", "dict_examp": "Two points in this report are especially worthy of notice.", "lear_examp": "Try as I might, getting good grades was always met more with a sense of mission accomplished - duly noted - than a feat worthy of congratulations."}]}]}, {"word": "would-be", "poses": [{"pos": "adjective", "senses": [{"sense": "wanting or trying to be", "level": "C2", "dict_examp": "a would-be artist/politician", "lear_examp": "Her schoolmates were greatly surprised that a would-be lawyer with a promising career like her had made such a decision."}]}]}, {"word": "wreckage", "poses": [{"pos": "noun", "senses": [{"sense": "the parts that remain of a car, ship, or aircraft that has been destroyed", "level": "C2", "dict_examp": "Two survivors were pulled from the wreckage.", "lear_examp": "I learned from the diary that other passengers and the second pilot hadn't survived and that he had buried them near the wreckage."}]}]}, {"word": "write", "poses": [{"pos": "verb", "senses": [{"sense": "to produce letters, words or numbers on a surface or computer", "level": "A1", "dict_examp": "Write your name at the top of the page.", "lear_examp": "Every lesson I read and write loads of sentences."}, {"sense": "to send a letter or email to someone, giving them information or expressing your thoughts or feelings", "level": "A2", "dict_examp": "James hasn't written to me recently.", "lear_examp": "I can write my penfriend a letter twice a week."}, {"sense": "to create a book, story, article, etc. or a piece of music", "level": "B1", "dict_examp": "He's writing a book on Colombia.", "lear_examp": "Stephen King wrote this book."}]}, {"pos": "phrasal verb", "senses": [{"sense": "to write something on a piece of paper so that you do not forget it", "level": "B1", "dict_examp": "Did you write Jo's phone number down?", "lear_examp": "I wrote the address down and left the restaurant."}, {"sense": "to decide that someone or something is not useful or important", "level": "C2", "dict_examp": "They had written him off before they even met him.", "lear_examp": "She had written that man off."}, {"sense": "to write something on paper or on a computer in a complete or final form, often using notes you have made", "level": "C1", "dict_examp": "Have you written up that report yet?", "lear_examp": ""}]}]}, {"word": "writer", "poses": [{"pos": "noun", "senses": [{"sense": "a person who writes books or articles to be published", "level": "B1", "dict_examp": "a travel/sports/fiction/crime writer", "lear_examp": "The last book I read was a true story written by a young South-American writer."}]}]}, {"word": "wreck", "poses": [{"pos": "verb", "senses": [{"sense": "to destroy or badly damage something", "level": "C2", "dict_examp": "The explosion wrecked several cars and damaged nearby buildings.", "lear_examp": "In addition, they agree that the solution to the traffic is of utmost importance in a big city, because noise and pollution from car exhaust pipes wreck the nerves of city dwellers."}]}, {"pos": "noun", "senses": [{"sense": "a vehicle or ship that has been destroyed or badly damaged", "level": "C2", "dict_examp": "Divers exploring the wreck managed to salvage some coins and jewellery.", "lear_examp": "We turned around and saw fumes rising in the air from the wreck of the plane."}, {"sense": "someone who is in a bad physical or mental condition", "level": "C2", "dict_examp": "I was a complete wreck by the end of my exams.", "lear_examp": "So much of what I really appreciate in this life is connected to music and the events that surround it, so a loss of that would totally devastate me and turn me into a wreck!"}]}]}, {"word": "wrinkled", "poses": [{"pos": "adjective", "senses": [{"sense": "with a lot of wrinkles", "level": "C2", "dict_examp": "a wrinkled face", "lear_examp": "To this day, and for many years to come, this piece of music brings back the dirty wrinkled face of the loneliest person I've ever known."}]}]}, {"word": "wow", "poses": [{"pos": "exclamation", "senses": [{"sense": "used to show surprise, excitement, admiration, etc.", "level": "A2", "dict_examp": "Wow! Did you make that cake? It looks delicious!", "lear_examp": "Wow, this is very cool!"}]}]}, {"word": "wrongly", "poses": [{"pos": "adverb", "senses": [{"sense": "not correctly", "level": "B2", "dict_examp": "It has been said - wrongly - that Americans hate government.", "lear_examp": "Equally, the point about 'staying' is erroneous: we stayed at Riverside Hotel instead of Hotel Astrid, which closed last year, and Hotel Royal was wrongly  described as having 'special rates' for students."}, {"sense": "accused or punished unfairly or illegally", "level": "C1", "dict_examp": "She was wrongly convicted of smuggling.", "lear_examp": "You have also wrongly accused the organizers of spending too much money on organizing the event."}]}]}, {"word": "wrong", "poses": [{"pos": "adjective", "senses": [{"sense": "not correct", "level": "A1", "dict_examp": "Three of your answers were wrong.", "lear_examp": "We listen to a tape sometimes, and mark wrong letters."}, {"sense": "to think or say something that is not correct", "level": "A2", "dict_examp": "I was wrong about the time - the store closed at 7, not 8.", "lear_examp": "If I'm not wrong, it is in the living room."}, {"sense": "to produce an answer or result that is not correct, or to say or write something that is not correct", "level": "B1", "dict_examp": "I got most of the answers wrong.", "lear_examp": ""}, {"sense": "If something is wrong, there is a problem.", "level": "B1", "dict_examp": "You've been quiet all evening. Is there anything wrong?", "lear_examp": "I didn't know him, so I thought that there was something wrong."}, {"sense": "not considered morally acceptable by most people", "level": "B2", "dict_examp": "Children should be taught that violence is wrong.", "lear_examp": "To sum up, I think it is wrong to keep animals in zoos."}, {"sense": "not suitable or correct, or not as it should be", "level": "C1", "dict_examp": "She's the wrong person for the job.", "lear_examp": "Personally I prefer to think that you gave the job to the wrong person."}, {"sense": "to start a relationship or activity badly", "level": "C2", "dict_examp": "He got off on the wrong foot with my parents by arriving late.", "lear_examp": "One of the greatest pleasures of reading \"The Remains of the Day\" would be to see the gradual development of the relationship between Stevens and Miss Kenton. From the beginning, they get off on the wrong foot."}]}, {"pos": "adverb", "senses": [{"sense": "in a way that is not correct", "level": "A2", "dict_examp": "You spelled my name wrong.", "lear_examp": ""}, {"sense": "to develop problems", "level": "B1", "dict_examp": "Something's gone wrong with my computer.", "lear_examp": "Despite all that went wrong, there was something I really enjoyed. It was visiting the Diamond Cave."}, {"sense": "used when you do not want someone to think that you do not like someone or something", "level": "C2", "dict_examp": "Don't get me wrong, I like her, but she can be very annoying.", "lear_examp": "Don't get me wrong, I love my aunts, I really do, but not as houseguests."}]}]}]