[{"word": "your", "poses": [{"pos": "determiner", "senses": [{"sense": "belonging or relating to the person or group of people being spoken or written to", "level": "A1", "dict_examp": "Is this your bag?", "lear_examp": "I like your food."}, {"sense": "belonging or relating to people generally", "level": "B1", "dict_examp": "Of course you want the best for your children.", "lear_examp": "Riding a bicycle is a good way of maintaining personal fitness and doesn't harm your health either."}]}]}, {"word": "youngster", "poses": [{"pos": "noun", "senses": [{"sense": "a young person, especially an older child", "level": "C1", "dict_examp": "He talked to the youngsters about the dangers of drugs.", "lear_examp": "Like many other nations worldwide, with mastering much more knowledge and skills of information technology than the elder group of people, it is not surprising that Chinese youngsters learn more than their previous generations did about what is happening around the world."}]}]}, {"word": "yogurt", "poses": [{"pos": "noun", "senses": [{"sense": "a slightly sour, thick liquid made from milk with bacteria added to it, sometimes sweetened and with a fruit flavor added, and sometimes eaten plain", "level": "A2", "dict_examp": "natural/plain yogurt", "lear_examp": "Every day they eat milk, cheese, yogurt, and vegetables."}]}]}, {"word": "yourself", "poses": [{"pos": "pronoun", "senses": [{"sense": "the reflexive form of the pronoun \"you\"", "level": "A2", "dict_examp": "Be careful with that knife or you'll cut yourself!", "lear_examp": "After that you could choose a partner to talk about what you usually do in your free time and the last thing was to describe yourself in front of the class."}, {"sense": "alone or without anyone else's help", "level": "A2", "dict_examp": "We didn't mean to leave you all by yourself.", "lear_examp": "It is difficult to get there by yourself."}, {"sense": "used to give special emphasis to the subject of the sentence", "level": "B2", "dict_examp": "If you yourself ever need help, would you know where to get it?", "lear_examp": "If you are thinking of taking it up yourself always do a warm-up exercise before you run, don't go too fast at the beginning, and don't overdo it."}, {"sense": "used when both the subject and object of the verb are \"you,\" and \"you\" is also being used to refer to people generally", "level": "B2", "dict_examp": "You tell yourself everything's all right, but you know it really isn't.", "lear_examp": "You help yourself by doing some exercise."}]}]}, {"word": "year", "poses": [{"pos": "noun", "senses": [{"sense": "a period of twelve months, especially from January 1st to December 31st", "level": "A1", "dict_examp": "Elaine worked in Italy for two years.", "lear_examp": "She came from Pakistan two years ago."}, {"sense": "to be a particular age", "level": "A1", "dict_examp": "Her son is six years old.", "lear_examp": "He is 53 years old and he lives in Madeira."}, {"sense": "the part of the year, in a school or university, during which courses are taught", "level": "A2", "dict_examp": "the school/academic year", "lear_examp": "The class is every Friday until the end of the school year."}, {"sense": "for a long time", "level": "B1", "dict_examp": "Hannah and I have been friends for years.", "lear_examp": "I had not seen him for years."}]}]}, {"word": "yellow", "poses": [{"pos": "adjective", "senses": [{"sense": "being the same color as a lemon or the sun", "level": "A1", "dict_examp": "a bright yellow T-shirt", "lear_examp": "My friends gave me a new ring and my grandparents gave me some beautiful pink and yellow flowers."}]}, {"pos": "noun", "senses": [{"sense": "a yellow color", "level": "A2", "dict_examp": "You should wear more yellow - it looks good on you.", "lear_examp": "I wanna paint the room in blue and yellow."}]}]}, {"word": "yeah", "poses": [{"pos": "exclamation", "senses": [{"sense": "yes", "level": "A2", "dict_examp": "\"That store is a little expensive.\" \"Yeah, it is.\"", "lear_examp": "Yeah, try wearing black because we're gonna get dirty."}]}]}, {"word": "yawn", "poses": [{"pos": "verb", "senses": [{"sense": "to take a deep breath with your mouth wide open, because you are  tired or bored", "level": "B2", "dict_examp": "I can't stop yawning - I must be tired.", "lear_examp": "I am of the opinion that the morning English lessons with our teacher John are worth filming and showing for many reasons. Above all, they are enjoyable and interesting. All of us participate effectively. Nobody is yawning or feeling bored."}]}]}, {"word": "yield", "poses": [{"pos": "verb", "senses": [{"sense": "to stop in order to allow people or other vehicles to go past before you drive on or drive into another street", "level": "C1", "dict_examp": "Cars must yield to pedestrians in the crosswalk.", "lear_examp": "There are special traffic lights which prefer trams if they approach a certain switch, so cars have to yield then."}, {"sense": "to produce or provide something", "level": "C2", "dict_examp": "to yield a profit", "lear_examp": "It is to be hoped that my suggestion will be implemented and will yield immediate results."}]}]}, {"word": "yearn", "poses": [{"pos": "verb", "senses": [{"sense": "to want something very much with a feeling of sadness", "level": "C2", "dict_examp": "They yearned for peace.", "lear_examp": "I yearn to go there because I have never been to Africa before."}]}]}, {"word": "you", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to refer to the person or people you are talking to", "level": "A1", "dict_examp": "You look nice.", "lear_examp": "Thank you for your message."}, {"sense": "people in general", "level": "A2", "dict_examp": "You learn to accept these things as you get older.", "lear_examp": "You can get there by plane."}, {"sense": "said as a polite answer when someone thanks you for doing something", "level": "A2", "dict_examp": "\"It was very nice of you to help.\" \"You're welcome.\"", "lear_examp": ""}]}]}, {"word": "yacht", "poses": [{"pos": "noun", "senses": [{"sense": "a boat with sails and sometimes an engine, used for either racing or traveling on for pleasure", "level": "B2", "dict_examp": "a luxury yacht", "lear_examp": "The class of boat that best fits my physical condition is the one called Snipe, that seems to be available at your yacht club."}]}]}, {"word": "yet", "poses": [{"pos": "adverb", "senses": [{"sense": "up until now", "level": "A2", "dict_examp": "I haven't spoken to her yet.", "lear_examp": "I haven't seen this film yet."}, {"sense": "now or as early as this time", "level": "A2", "dict_examp": "I don't want to go home yet.", "lear_examp": "I don't need it yet because my parents gave me a new computer for my birthday."}, {"sense": "the best or worst, etc. until now", "level": "B2", "dict_examp": "Of all the songs I've heard tonight, that's the best yet.", "lear_examp": "And that was my worst experience yet."}, {"sense": "again after something has happened or been done many times before", "level": "C1", "dict_examp": "The bus was late yet again.", "lear_examp": "It's another new year and yet again the early year quietness is present... until I got these two games, Quake 3 Arena (Q3A for short) and Unreal Tournament (UT for short)."}, {"sense": "from now and for a particular period of time in the future", "level": "C1", "dict_examp": "She won't be back for a long time yet.", "lear_examp": "It's a fact that everybody knows that living in Poland is not easy now and it won't be for a long time yet."}, {"sense": "until and including this time", "level": "C1", "dict_examp": "I haven't heard as yet if their flight has arrived.", "lear_examp": "I would like to do something about it, but as I can't imagine building anything near my beautiful house (because I'm afraid it would destroy its wonderful harmony), I have no idea as yet how to solve this problem."}, {"sense": "used to show that you are surprised or annoyed that something is being repeated or increased", "level": "C2", "dict_examp": "He's given us yet more work to do.", "lear_examp": "The awe-inspiring view of the park must not be destroyed for yet another building."}, {"sense": "used to say there is still a possibility that something will happen", "level": "C2", "dict_examp": "He may win yet.", "lear_examp": "Weakened, the tunnel could yet crumble and fall at any time."}, {"sense": "to not have done something that was expected before this time", "level": "C2", "dict_examp": "They have yet to make a decision.", "lear_examp": "But she had yet to inform her fiancé."}]}, {"pos": "conjunction", "senses": [{"sense": "used to connect two words, phrases, or clauses when the second part adds something surprising to the first part", "level": "B1", "dict_examp": "a simple yet effective exercise", "lear_examp": "It was huge and yet gracious."}]}]}, {"word": "young", "poses": [{"pos": "adjective", "senses": [{"sense": "having lived or existed for only a short time and not old", "level": "A1", "dict_examp": "young people/adults/children", "lear_examp": "All young people who play football want go there in the future."}]}, {"pos": "noun", "senses": [{"sense": "young people generally", "level": "B2", "dict_examp": "His political ideas appeal  to the young.", "lear_examp": "In general, kids and teenagers are, at home, allowed to do almost anything they want, which sometimes puts parents in a very difficult position when trying to establish rules in order to limit the freedom of the young."}]}]}, {"word": "yes", "poses": [{"pos": "adverb", "senses": [{"sense": "used to agree with something, or to give a positive answer", "level": "A1", "dict_examp": "\"Would you like a glass of wine?\" \"Yes, please.\"", "lear_examp": "Yes, I can come tomorrow for dinner."}, {"sense": "used to show that you are listening to someone, or that you are ready to listen and to give them an answer or information", "level": "A1", "dict_examp": "\"Dad.\" \"Yes, what do you want, honey?\"", "lear_examp": ""}, {"sense": "used when you are disagreeing with a negative statement", "level": "A2", "dict_examp": "\"I'm not a very good cook, though.\" \"Yes, you are - you make wonderful food!\"", "lear_examp": ""}]}]}, {"word": "youth", "poses": [{"pos": "noun", "senses": [{"sense": "young people generally", "level": "B1", "dict_examp": "the youth of today", "lear_examp": "Finally I decided to join a new youth club in my town."}, {"sense": "the period of time when someone is young", "level": "B2", "dict_examp": "I was a fairly good football player in my youth.", "lear_examp": "I played several kinds of sports during my youth, but now I am not a member of any club."}]}]}, {"word": "yard", "poses": [{"pos": "noun", "senses": [{"sense": "a small area of land next to  a house that is usually covered with grass and may have a fence around it", "level": "A2", "dict_examp": "We have an oak tree in our back/front yard.", "lear_examp": "Can you check in the yard of your house under the chair."}, {"sense": "a unit of measurement equal to three feet or approximately 91.4 centimetres", "level": "B1", "dict_examp": "The garden is about 100 yards long.", "lear_examp": "I'm not a fitness maniac and I don't go to a shop which is 50 yards away from my house just to buy a newspaper, but if you go to school, why not go by bike?"}]}]}, {"word": "yell", "poses": [{"pos": "verb", "senses": [{"sense": "to shout something very loudly", "level": "B2", "dict_examp": "Our neighbors were yelling at each other this morning.", "lear_examp": "\"Cut,\" yelled the director."}]}, {"pos": "noun", "senses": [{"sense": "a loud shout", "level": "B2", "dict_examp": "Suddenly there was a loud yell from the bathroom.", "lear_examp": "Suddenly a big yell came out of my throat."}]}]}, {"word": "yesterday", "poses": [{"pos": "adverb", "senses": [{"sense": "on the day before today", "level": "A1", "dict_examp": "He called yesterday while you were out.", "lear_examp": "I got your letter yesterday."}]}]}, {"word": "yours", "poses": [{"pos": "pronoun", "senses": [{"sense": "used to show that something belongs to or is connected with the person or group of people being spoken or written to", "level": "A2", "dict_examp": "Is this pen yours?", "lear_examp": "My bicycle is broken. Can you lend me yours?"}, {"sense": "used at the end of formal letters when you know the name of the person you are writing to", "level": "B1", "dict_examp": "Yours sincerely, Maya Johnson", "lear_examp": "I'm going to ask Tom for the work I will miss. Yours sincerely,"}]}]}, {"word": "yoga", "poses": [{"pos": "noun", "senses": [{"sense": "a set of exercises for the mind and body, based on the Hindu religion", "level": "B1", "dict_examp": "She does yoga three times a week.", "lear_examp": "We do yoga in a heated room so we sweat a lot."}]}]}]