[{"word": "zucchini", "poses": [{"pos": "noun", "senses": [{"sense": "a long green vegetable that is white inside", "level": "B2", "dict_examp": "We had grilled zucchini, peppers, and mushrooms  with rice for dinner.", "lear_examp": "My favorite, it's one with the mushrooms and zucchini."}]}]}, {"word": "zone", "poses": [{"pos": "noun", "senses": [{"sense": "an area where a particular thing happens, that is used for a particular purpose, or where there are particular rules", "level": "B1", "dict_examp": "an earthquake zone", "lear_examp": "It is a very clean city with a lot of car-free zones."}]}]}, {"word": "zero", "poses": [{"pos": "number", "senses": [{"sense": "the number 0", "level": "A2", "dict_examp": "Five, four, three, two, one, zero.", "lear_examp": "Can you bring me my laptop, because I have to do some homework on it - if I don't do this I will get a zero."}, {"sense": "the temperature that is 32 degrees lower than the temperature at which water freezes in degrees Fahrenheit, or the temperature at which water freezes in degrees centigrade", "level": "B1", "dict_examp": "In the winter, the temperature can drop to 15 degrees below zero.", "lear_examp": "We have to learn that it is not natural for a lion to live in a country where, in winter, the temperature can fall below zero. (583941; First Certificate in English; Italy; B2 VANTAGE; 1993; Italian; Fail"}]}]}, {"word": "zebra", "poses": [{"pos": "noun", "senses": [{"sense": "an African animal like a horse with black and white lines", "level": "B2", "dict_examp": "We saw a zebra in the distance.", "lear_examp": "Otherwise there would be many children and grown-ups who had never seen an elephant, a tiger, a zebra etc."}]}]}, {"word": "zoo", "poses": [{"pos": "noun", "senses": [{"sense": "a place where  wild animals are kept so that people can go and look at them", "level": "A1", "dict_examp": "I love going  to the zoo.", "lear_examp": "So I went to see the animals in the zoo, my daughter the ducks, and I enjoyed when I saw my daughter very happy playing with the ducks."}]}]}, {"word": "zipper", "poses": [{"pos": "noun", "senses": [{"sense": "a thing for fastening clothes, bags, etc. consisting of two rows of very small parts that connect together", "level": "B2", "dict_examp": "The jeans had two buttons and a zipper in front.", "lear_examp": "In conclusion, I believe that common clothes in the future will be overalls without buttons or zippers, that you easily slip into, which also are very comfortable."}]}]}]